[
  {
    "id": 842,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者近14天出现持续性、阵发性加重的皮肤瘙痒，夜间明显，影响睡眠。自述抓挠后仅见散在抓痕与血痂，无原发性红斑、丘疹或水疱。否认近期更换药物、无海鲜摄入及蚊虫叮咬史。查体：皮肤干燥、轻度脱屑，可见线状抓痕，无渗出、结节或色素沉着；全身淋巴结未触及肿大，肝脾肋下未及。今日气温32 ℃，患者骑共享单车来院，出汗较多。实验室：总IgE 42 kU/L（正常），Eos 0.15×10⁹/L，ALT 28 U/L，Cr 0.9 mg/dL。患者焦虑地询问：‘医生，我这是不是艾滋病加重了？要不要换抗病毒药？’",
    "reference_rule": {
      "condition": "HIV/AIDS患者出现皮肤瘙痒而无原发性皮疹",
      "action": "1. 安抚保湿为主，如尿素乳膏；2. 选用含樟脑、薄荷脑等止痒药物软膏",
      "contraindication": "皮损有糜烂渗出者严禁使用膏剂外擦法",
      "evidence": "无原发皮损时以安抚保湿为主，如尿素乳膏，或可选用含樟脑、薄荷脑等止痒药物软膏。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景，作为果断的急诊/门诊医生，我关注快速建立鉴别诊断（重点排除危急重症如药物过敏、感染或系统性疾病进展），并基于直接线索给出治疗指令。Step 2: 临床解码 (Clinical Decoding): 患者为HIV/AIDS患者，主诉持续性阵发性皮肤瘙痒14天，夜间加重伴睡眠障碍；皮肤表现仅有继发性抓痕和血痂，无原发性皮疹（如红斑或丘疹），提示非炎症性瘙痒。查体示皮肤干燥、轻度脱屑，无渗出、结节或淋巴结肿大；实验室指标（总IgE正常、Eos计数正常、肝肾功能正常）排除了过敏反应或系统性疾病恶化。患者焦虑询问‘艾滋病加重’，但无发烧、体重减轻等HIV进展迹象。Step 3: 规则对齐与安全检查 (Alignment & Safety): 与指南Condition（‘HIV/AIDS患者出现皮肤瘙痒而无原发性皮疹’）完全匹配。指南Action为‘安抚保湿为主（如尿素乳膏）；选用含樟脑、薄荷脑等止痒药物软膏’。强制检查Contraindication（‘皮损有糜烂渗出者严禁使用膏剂外擦法’）：患者仅见抓痕与血痂，无糜烂渗出，因此膏剂安全适用，无禁忌。Step 4: 决策生成 (Decision Making): 基于指南Action，直接生成决策：优先外用保湿剂缓解皮肤干燥，辅以止痒膏剂控制症状，无需进一步检查或抗病毒药调整，因瘙痒与艾滋病进展无关。",
    "medical_order": "予外用10%尿素乳膏每日两次涂抹全身皮肤；必要时加用含樟脑、薄荷脑止痒软膏局部涂抹瘙痒部位。嘱保持皮肤清洁干燥，避免过度抓挠。",
    "patient_dialogue": "别担心，您这情况很常见，不是艾滋病加重的表现——我看您的检查结果都正常，没发现什么严重问题。这瘙痒多半是皮肤干燥引起的，尤其在天气热出汗多的时候容易发作，导致晚上睡不好。我建议您每天涂点保湿霜，比如尿素乳膏，它能滋润皮肤、减少痒感；如果特别痒，还可以加点止痒膏，比如含樟脑或薄荷的那种，涂上后会凉凉的、让您舒服些。记住别使劲抓，免得破皮感染。坚持用几天，应该就能缓解了。咱们一起把这小问题解决掉，好吗？"
  },
  {
    "id": 846,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者半年前开始无明显诱因出现全身皮肤瘙痒，夜间加重，抓至渗血方能稍缓解。既往确诊HIV-1感染10年，目前ART方案为TAF/FTC/DTG，CD4 320/μL，病毒载量<50 cp/mL。查体：皮肤干燥脱屑，双小腿伸侧及腰骶部可见苔藓样变伴抓痕、血痂，局部皮纹增厚呈“皮革”样；无活动性皮疹及渗出。舌质淡，苔薄白，脉细。患者自述“痒得睡不了，半夜得泡热水才能缓一缓”，并抱怨最近天气干燥，快递站夜班后症状更明显。无发热、体重下降、黄疸或药物过敏史；肝肾功能、血清IgE及胆汁酸均在正常范围。",
    "reference_rule": {
      "condition": "HIV相关性瘙痒血虚风燥证（慢性期）",
      "action": "1. 内服当归饮子加减（制首乌、生地黄、黄芪、当归等）；2. 中成药：润燥止痒胶囊/当归饮子丸；3. 皮损肥厚加秦艽/丹参",
      "contraindication": "实证热证禁用",
      "evidence": "血虚风燥证：治法：养血润燥，疏风止痒。方药：当归饮子加减（推荐强度B，证据等级II级）。组成: 制首乌、生地黄、黄芪、当归、鸡血藤、防风、荆芥、白芍、白蒺藜、甘草。皮损肥厚者，加秦艽、丹参、鸡血藤; 推荐中成药: 润燥止痒胶囊、当归饮子丸等。"
    },
    "thought": "本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我将快速建立鉴别诊断，排除危急重症（如感染、恶性肿瘤或药物过敏反应），并直接给出治疗方案。重点关注皮肤瘙痒的病因鉴别（例如排除脓疱病、淋巴瘤相关瘙痒），确保决策高效且针对核心问题。\n\n临床解码：患者为HIV-1感染稳定期（CD4 320/μL，病毒载量<50 cp/mL），ART方案规范。核心症状为慢性全身瘙痒（夜间加重，抓至渗血缓解），伴皮肤干燥脱屑、苔藓样变及皮纹增厚（双小腿伸侧及腰骶部），符合慢性皮肤炎症表现。隐式线索包括：夜间加重可能与神经源性瘙痒或睡眠环境相关；天气干燥及夜班工作（暗示压力或环境暴露）加重症状；舌质淡、苔薄白、脉细支持血虚风燥证；实验室检查（肝肾功能、IgE、胆汁酸正常）排除了其他系统性疾病（如胆汁淤积或特应性皮炎）。\n\n规则对齐与安全检查：患者表现与指南条件“HIV相关性瘙痒血虚风燥证（慢性期）”高度匹配（瘙痒、皮肤干燥、苔藓样变、中医体征）。强制检查禁忌症：实证热证禁用；患者无发热、舌红或黄苔等热证表现，故无禁忌。安全优先级确保方案无药物相互作用（ART方案TAF/FTC/DTG已知无显著中药相互作用）。\n\n决策生成：基于指南Action，生成直接诊疗方案：1. 内服当归饮子加减，针对皮损肥厚加秦艽/丹参；2. 辅以中成药润燥止痒胶囊；3. 强调皮肤护理教育以预防复发。",
    "medical_order": "1. 予口服中药汤剂：当归饮子加减（制首乌15g、生地黄15g、黄芪20g、当归10g、鸡血藤15g、防风10g、荆芥10g、白芍15g、白蒺藜15g、甘草6g）；皮损肥厚处加秦艽10g、丹参15g。每日一剂，水煎分两次服。\n2. 中成药：润燥止痒胶囊，每次4粒，每日3次口服。\n3. 皮肤护理指导：避免搔抓，使用保湿剂（如凡士林）bid；监测瘙痒程度及皮损变化。\n4. 随访：2周后复诊评估疗效，如无改善转诊皮肤科。",
    "patient_dialogue": "您好，我看到您因为皮肤瘙痒晚上都睡不好觉，还抓到渗血，这肯定特别难受。别担心，我会帮您缓解这个症状。首先，我会开一些中药汤剂和胶囊，它们能滋润皮肤、减轻瘙痒，就像给皮肤补点营养一样。另外，您提到天气干燥和夜班后更严重，我建议您平时多涂点保湿霜，尤其是下班后和睡前，这样能防止皮肤太干。还有，尽量别用手抓，如果实在痒得不行，可以用冷毛巾敷一敷，这比热水泡更安全，因为热水可能会让皮肤更干燥。咱们一起努力，两周后您再来复诊，看看情况有没有好转，好吗？"
  },
  {
    "id": 853,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者今日复诊时主诉“昨晚开始浑身刺痒，像被蚊子咬了一样，越抓越痒”。查体可见躯干、上臂散在0.3–1 cm淡红色斑疹及风团，部分融合，无渗出、无脓疱，指压褪色。体温36.7 ℃，血压118/76 mmHg，呼吸18次/分，SpO₂ 99%。实验室：CD4 420/μL（3个月前380），HIV-RNA <20 cp/mL；ALT 28 U/L、Cr 0.9 mg/dL、β-HCG阴性。患者自述近2周未新增药物、无海鲜或坚果摄入，近期未日晒，无宠物接触。既往：10年前确诊AIDS，曾患口腔念珠菌病；无慢性荨麻疹、湿疹或其他过敏史；无乙肝、结核。家族史无特应性疾病。患者为夜班出租车司机，昨夜工作时车内空调突然失效，闷热出汗后自觉瘙痒加剧，回宿舍用冷水冲洗后短暂缓解，今晨复发。目前仍坚持每日20:30定时服HAART，无漏服。患者担心“是不是抗病毒药过敏？要不要停药？”",
    "reference_rule": {
      "condition": "HAART引起的轻度药疹（麻疹样/荨麻疹样）",
      "action": "1. 继续HAART同时抗组胺药物；2. 非特异性抗过敏药物（维生素C/钙剂）",
      "contraindication": "无感染征象避免广谱抗生素",
      "evidence": "若轻度瘙痒，过敏较轻，可继续HAART疗程同时给予抗组胺药物使用，逐渐脱敏。其中轻型者如轻度麻疹样药疹、荨麻疹样药疹，可选择抗组胺药物和非特异性抗过敏药物如维生素C、钙剂等；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险评估，优先确保患者安全（安全 > 疗效）。考虑到患者有AIDS病史且正在接受HAART治疗，需全面扫描潜在风险，包括环境因素、药物过敏可能及免疫状态变化。\n\nStep 2: 临床解码 (Clinical Decoding)：患者主诉急性发作性瘙痒伴风团样皮疹（躯干、上臂散在淡红色斑疹及风团，指压褪色），符合急性荨麻疹特征；无系统症状（体温、血压、呼吸正常），无感染征象（无渗出、无脓疱）。实验室指标显示免疫状态稳定（CD4上升至420/μL，HIV-RNA<20 cp/mL），肝肾功能正常。隐式线索：环境诱因（车内闷热出汗后瘙痒加剧，冷水缓解后复发）提示物理性荨麻疹可能；HAART用药依从性好但患者疑为过敏源，需排除药疹；无新药、无过敏源暴露史，支持HAART相关性轻度反应。家族史无特应性疾病，降低遗传过敏风险。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南条件与患者表现匹配（HAART引起的轻度荨麻疹样药疹）。检查禁忌症：患者无感染征象（无发热、无脓疱、SpO₂正常），严格避免广谱抗生素使用。安全扫描：HAART药物（如核苷类逆转录酶抑制剂）与抗组胺药物无已知相互作用；AIDS背景但免疫控制良好（CD4 > 200/μL），无真菌或机会感染复发风险；无肝肾禁忌（ALT、Cr正常）。共病风险评估：职业因素（夜班司机）可能加剧物理刺激，但无直接合并症冲突。\n\nStep 4: 决策生成 (Decision Making)：基于指南Action，决定继续HAART维持病毒抑制；添加抗组胺药物控制瘙痒；辅以非特异性抗过敏药物（维生素C/钙剂）缓解症状。同时，建议避免环境触发因素（如过热），以预防复发。",
    "medical_order": "1. 继续当前HAART方案，定时服用，无调整。2. 予口服抗组胺药物（如氯雷他定10mg每日一次）。3. 予非特异性抗过敏药物（维生素C 0.1g tid，葡萄糖酸钙1g tid）。4. 建议避免高温环境及剧烈出汗，保持皮肤清洁干燥。5. 随访1周复诊评估皮疹变化及症状缓解情况，必要时行皮肤点刺试验排除其他过敏源。",
    "patient_dialogue": "王先生，您先别着急，听我慢慢说。您身上的这些痒疙瘩和红疹子，我们叫它荨麻疹，很可能是昨晚车里太热出汗引起的，或者是您吃的抗病毒药有一点点轻微反应——但不是大问题，不会伤害身体。所以呢，您的抗病毒药千万别停，它控制您的艾滋病效果很好，停了反而风险更大。我会给您开点止痒药，比如氯雷他定，每天吃一片，就能让您不那么痒了；再加点维生素C和钙片，帮助身体对抗这种小过敏。同时，开夜班时注意空调别坏了，尽量别让自己闷出一身汗，洗完澡穿宽松衣服。这样坚持一周，要是还没好或者更痒了，您随时来找我复查，咱们再细看。"
  },
  {
    "id": 863,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者今日由爱人用轮椅推入诊室，面部、躯干密布暗红色斑疹，部分融合成片，双手不停抓挠胸腹，指甲缝可见血痂。主诉‘像被火烤一样痒得睡不着’，昨夜体温最高39.4℃，伴寒战，今晨出现短暂答非所问。既往：CD4 110 cells/μL，基线HIV-RNA 4.8 log10 copies/mL；无药物过敏史。18天前启动TDF+3TC+DTG方案，依从性100%。查体：T 39.2℃，P 118次/分，BP 105/60 mmHg，SpO₂ 97%（RA）；神倦，对时间和地点回答迟钝；皮肤弥漫潮红，压之褪色，散在针尖样出血点；舌绛少苔，脉细数。实验室：Hb 108 g/L，WBC 3.6×10⁹/L，N 0.72，PLT 92×10⁹/L；ALT 68 U/L，Cr 91 μmol/L；C反应蛋白 42 mg/L。胸部CT未见机会性感染征象。今日问题：持续高热、皮疹加重伴神志改变，已排除常见机会感染和过敏性休克。患者爱人补充：患者近两日大便未解，腹胀明显。患者职业为网约车司机，担心再这样发热‘车份钱都交不起’。",
    "reference_rule": {
      "condition": "HAART药疹热毒入营证",
      "action": "1. 内服犀角地黄汤加味（水牛角、生地黄、黄连等）；2. 高热神昏配安宫牛黄丸；3. 便秘加大黄",
      "contraindication": "虚寒证禁用",
      "evidence": "热毒入营证: 治法: 清心、凉营、解毒。方药: 犀角地黄汤加味(推荐强度D，证据级别Ⅲ)。组成: 水牛角(先煎)、生地黄、生石膏、紫草、牡丹皮、黄连、麦冬、山药、玄参、土茯苓、鱼腥草、山栀子、甘草。大便秘结不通者，加大黄；中成药: 高热、神昏谵语者可配合安宫牛黄丸治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及HIV患者新启动HAART后出现急性多系统症状（高热、皮疹、神志改变、便秘）。作为专科专家，重点关注全网扫描：检查药物相互作用（如HAART与中药的肝毒性风险）、禁忌症（指南中的虚寒证禁用），并优先确保患者安全（如排除危及生命的IRIS或SJS）。Step 2: 临床解码 (Clinical Decoding) - 患者为HIV免疫抑制状态（CD4 110 cells/μL），启动HAART（TDF+3TC+DTG）18天后出现急性发热性皮疹综合征：体温39.2℃提示全身炎症反应；弥漫性潮红皮疹伴瘙痒及出血点，符合药物疹（如IRIS或DTG相关不良反应）；神志改变（答非所问、定向力迟钝）提示神经系统受累；便秘、腹胀提示肠蠕动障碍；实验室示炎症（CRP 42 mg/L）、轻度肝损（ALT 68 U/L）、血小板减少（PLT 92×10⁹/L），隐式线索包括HAART依从性好但可能诱发免疫重建综合征，经济压力或加重焦虑。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 病例与指南条件 'HAART药疹热毒入营证' 高度吻合：高热、神昏、舌绛少苔、脉细数为典型热毒入营证表现；检查禁忌症 '虚寒证禁用'：患者无虚寒证据（如畏寒、舌淡白），热象明显，安全可用。全网扫描风险：HAART药物（DTG）可能增肝毒性，但ALT仅轻度升高，犀角地黄汤中水牛角、黄连等与TDF无已知相互作用；便秘时加大黄合理，但需监测电解质。优先级：安全 > 疗效，排除SJS等危急重症后启动方案。Step 4: 决策生成 (Decision Making) - 基于指南Action，生成决策：内服犀角地黄汤加味（含大黄通便），高热神昏配安宫牛黄丸；补充支持治疗（如住院监测、补液）以管理低血压及神志风险。",
    "medical_order": "1. 予住院一级护理，持续监测生命体征（T、P、BP、SpO₂）及神志变化 q2h。2. 内服中药：犀角地黄汤加味（水牛角30g先煎、生地黄15g、黄连6g、牡丹皮10g、麦冬12g、玄参10g、土茯苓15g、鱼腥草15g、山栀子9g、甘草6g、大黄9g后下），每日1剂，分2次服。3. 高热神昏配安宫牛黄丸 1丸口服即刻（必要时q6h重复）。4. 静脉补液：生理盐水500ml + 维生素C 2g ivgtt st，纠正脱水及支持循环。5. 完善检查：血培养、HIV-RNA复查、肝功能及电解质监测 qd。6. 暂停HAART（TDF+3TC+DTG）至皮疹稳定，评估IRIS风险。",
    "patient_dialogue": "大哥，您现在这情况确实有点严重，但别太担心，我们会全力帮您。您身上这红疹子和高烧，可能是因为刚吃的抗HIV药引起的‘上火’反应，就像身体里着了火一样，所以痒得难受还睡不着。咱们得赶紧用些中药汤药来‘灭火’，里面有水牛角、生地黄这些凉血的药材，帮您降降温。您爱人说您两天没大便了，肚子胀得慌，我们在汤药里特意加了点大黄，通一通肠道，让您舒服些。另外，您刚才有点糊涂、答非所问，这是高烧闹的，得吃一种叫安宫牛黄丸的药丸，它能帮您清醒过来，像给脑子‘开个窗’透透气。现在得住院观察几天，挂点盐水补补水，防止血压太低。我知道您开网约车不容易，担心车份钱，但身体是革命的本钱啊！咱们先把烧退了、疹子消了，等稳定了再谈工作的事。您爱人在这儿陪着，我们一起加油，好吗？"
  },
  {
    "id": 850,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者因“双腋下及腰际反复瘙痒6周”再次就诊皮肤科。查体：双侧腋下可见融合性暗红斑片，表面覆有少量糠状鳞屑，边界不清，局部可见线状抓痕及点状血痂；腰部散在0.5-1 cm大小淡红丘疹，部分已结痂。患者自述夜间瘙痒明显，常于凌晨2-3点被痒醒，抓挠后短暂缓解但随即加重。既往：①HIV感染10年，TDF/3TC/DTG方案，CD4 210/μL，VL<50 cp/mL；②2型糖尿病5年，目前二甲双胍1 g bid，HbA1c 7.2%；③慢性肾病3期，eGFR 48 mL/min/1.73 m²，近期Scr 1.4 mg/dL；④甲癣病史，口服特比萘芬治疗中。实验室：嗜酸粒细胞0.6×10⁹/L（↑），总IgE 420 IU/mL（↑），真菌镜检（-），细菌培养未生长金葡菌。患者职业为夜班出租车司机，担心药膏油腻影响工作，希望“能快点止痒、别留印”。目前未合并带状疱疹、疥疮及药物皮疹证据。",
    "reference_rule": {
      "condition": "HIV相关性瘙痒亚急性皮损",
      "action": "1. 外用氧化锌糊剂；2. 糖皮质激素乳膏",
      "contraindication": "糜烂渗出明显时禁用膏剂",
      "evidence": "亚急性皮损一般渗出和皮肤干燥同时存在，建议外用氧化锌糊剂、糖皮质激素乳膏。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，确保安全优先于疗效。患者有HIV感染、2型糖尿病、慢性肾病和甲癣多病共存，需综合评估局部治疗的安全性。\n\nStep 2: 临床解码 (Clinical Decoding) - 关键信息包括：瘙痒症状夜间加重（提示神经性或免疫介导机制），皮损为亚急性（融合性暗红斑片伴糠状鳞屑、丘疹结痂，无糜烂渗出证据）；实验室显示嗜酸粒细胞和IgE升高（支持过敏或免疫反应）；合并HIV（CD4偏低但病毒控制良好）、糖尿病（HbA1c 7.2%，提示血糖控制尚可）、慢性肾病3期（eGFR 48 mL/min/1.73 m²，影响药物排泄）、口服特比萘芬（潜在药物相互作用风险）。隐式线索：职业（夜班司机）导致睡眠紊乱可能加剧瘙痒，且患者偏好非油腻剂型以方便工作；糖尿病和肾病可能延缓皮肤愈合，HIV免疫抑制增加感染风险。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 将病例与指南Condition（HIV相关性瘙痒亚急性皮损）匹配：症状符合亚急性皮损特征（干燥鳞屑为主，无渗出）。检查Contraindication（糜烂渗出明显时禁用膏剂）：病例中描述抓痕和血痂，但无糜烂渗出迹象，因此膏剂可安全使用。全网扫描风险：①药物相互作用：口服特比萘芬（抗真菌药）与外用糖皮质激素乳膏无直接冲突（局部吸收少）；但需注意肾病可能影响全身药物代谢，优先选择低效激素。②禁忌症：糖皮质激素在糖尿病和慢性肾病中需谨慎（避免强效剂型，以防局部皮肤萎缩或全身吸收）；氧化锌糊剂安全，但油腻性可能不符患者偏好。③共病风险：HIV免疫抑制需监测继发感染；糖尿病和肾病要求治疗温和，避免刺激皮肤。安全优先级下，优化方案以减少全身影响。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action（外用氧化锌糊剂和糖皮质激素乳膏），决策：①优先使用糖皮质激素乳膏（低效型）快速止痒，符合患者“快速止痒、少油腻”需求；②氧化锌糊剂用于夜间或非工作时间，以平衡疗效和油腻问题；③避免口服药物（如抗组胺药），因肾病需剂量调整且指南未推荐。最终方案确保安全：选择低风险剂型，并强调使用指导。",
    "medical_order": "1. 外用1%氢化可的松乳膏（低效糖皮质激素），每日两次涂于腋下及腰际皮损处，避开抓破区域；2. 外用氧化锌糊剂，每晚睡前涂一次，用于较干燥部位；3. 监测皮肤状况，每周复诊评估疗效及有无继发感染；4. 避免强效糖皮质激素或油腻基质制剂，以适配患者职业需求；5. 维持原抗逆转录病毒（TDF/3TC/DTG）及降糖方案（二甲双胍），暂停新增口服药物；6. 教育患者正确用药方法及皮肤护理。",
    "patient_dialogue": "王先生，您好！从您的情况看，这个瘙痒主要是因为您的免疫系统有点小问题引起的皮肤发炎，咱们得好好处理一下。我建议您用两种药膏：一个是止痒效果快的，叫氢化可的松乳膏，它不太油腻，您上班前涂在腋下和腰上就行，一天两次，这样不会影响您开出租车的工作。另一个是氧化锌糊剂，晚上睡前涂一次就行，它有点油性，但能保护皮肤，让您晚上睡得更安稳。记住，别抓破皮肤，不然容易感染——您有糖尿病和肾病，皮肤恢复比一般人慢点。咱们先这样用一周，下次来复诊时看看效果。如果痒得厉害，可以试试冷敷，别担心，这药很安全，不会和您现在吃的药冲突。咱们慢慢来，一定能解决这个问题！"
  },
  {
    "id": 854,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者3天前无明显诱因出现头面、躯干及四肢散在粟粒至硬币大红色斑片，伴密集针尖大丘疹、抓痕与点状糜烂，持续渗出血清样液体，夜间瘙痒VAS 9/10，已3夜未眠。否认新发药物、海鲜或虫咬史。既往：①HIV-1感染10年，维持上述ART，无耐药突变；②2型糖尿病5年，目前用二甲双胍0.5 g bid，近3月HbA1c 7.8%；③高血压2级，氨氯地平5 mg qd，本次诊室BP 146/92 mmHg；④慢性肾病3期，eGFR 48 mL·min⁻¹·1.73 m⁻²，Scr 1.4 mg/dL。实验室：ALT 38 U/L，ALB 32 g/L，空腹血糖9.1 mmol/L，血钾3.7 mmol/L。查体：双前臂屈侧、腰背及大腿可见大片湿润糜烂面，局部覆淡黄色痂，轻压即渗液；皮温略高，无脓性分泌物。患者焦虑反复询问：“渗液把睡衣都粘住了，能不能先给我止止痒？”护士在旁小声提醒：“渗液太多，普通炉甘石根本挂不住。”窗外暴雨，门诊空调温度22℃，患者仍满头汗，不停用纸巾蘸拭渗液。",
    "reference_rule": {
      "condition": "HIV相关性瘙痒急性皮损（大量渗出）",
      "action": "选择冷湿敷：1. 体积分数3%硼酸溶液；2. 体积分数0.1%盐酸小檗碱溶液；3. 体积分数0.1%依沙吖啶溶液",
      "contraindication": "皮肤干燥时避免湿敷",
      "evidence": "大量渗出时应选择冷湿敷，如体积分数3%硼酸溶液、体积分数0.1%盐酸小檗碱溶液、体积分数0.1%依沙吖啶溶液等；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为博学的专科专家，我的关注重点是全网扫描：全面检查患者的多种合并症（HIV感染、2型糖尿病、高血压和慢性肾病3期）可能带来的药物相互作用、治疗禁忌症及共病风险，确保治疗优先级为安全 > 疗效。Step 2: 临床解码 (Clinical Decoding) - 患者急性皮损表现为广泛红色斑片、丘疹、糜烂及大量血清样渗出，伴剧烈瘙痒（VAS 9/10）、失眠和焦虑；实验室显示低白蛋白血症（ALB 32 g/L）、糖尿病控制不佳（空腹血糖9.1 mmol/L，HbA1c 7.8%）和高血压未达标（BP 146/92 mmHg）；查体提示湿润糜烂面伴渗液，无脓性分泌物；隐式线索包括患者焦虑出汗（尽管环境凉爽）、渗液导致衣物粘连，以及护士反馈普通外用剂无效，这共同指向HIV相关急性渗出性皮炎。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件“HIV相关性瘙痒急性皮损（大量渗出）”与患者表现完全匹配；禁忌症“皮肤干燥时避免湿敷”不适用，因皮肤有明显渗出；全网扫描重点关注安全风险：硼酸溶液在慢性肾病3期（eGFR 48 mL·min⁻¹·1.73 m⁻²）患者中可能经皮吸收导致硼中毒，视为禁忌；盐酸小檗碱和依沙吖啶溶液局部使用风险低，无已知与ART、二甲双胍或氨氯地平的相互作用；同时，低白蛋白血症可能影响药物代谢，但湿敷为局部治疗，全身风险可控；糖尿病和高血压控制不佳需后续监测，但不影响当前湿敷决策。Step 4: 决策生成 (Decision Making) - 基于指南Action，优先选择冷湿敷以止痒和减少渗出；鉴于硼酸禁忌，安全决策为使用体积分数0.1%盐酸小檗碱溶液或体积分数0.1%依沙吖啶溶液，并监测共病状态。",
    "medical_order": "予冷湿敷治疗：选用体积分数0.1%盐酸小檗碱溶液或体积分数0.1%依沙吖啶溶液，每4-6小时更换一次纱布，持续至渗出减少。监测皮损变化、生命体征及瘙痒程度。评估血糖控制（空腹血糖9.1 mmol/L）和血压（BP 146/92 mmHg），建议内分泌科会诊调整二甲双胍方案；复查肾功能（eGFR 48 mL·min⁻¹·1.73 m⁻²）和白蛋白水平（ALB 32 g/L）。避免使用硼酸溶液。",
    "patient_dialogue": "您好，我看到您皮肤渗液很多，痒得厉害，还影响睡眠，这确实很难受。别担心，我们会先帮您止痒。我建议用冷药水湿布敷在发痒的地方，这能让皮肤凉快下来，减少渗液和痒感，也能防止感染。因为您皮肤现在很湿，这个方法正合适——如果皮肤干的时候用，反而会更糟。我们选的药水很安全，不会和您平时吃的药冲突。另外，您有糖尿病和高血压，这些控制得不太好，我会让其他医生一起看看，帮您调整药物。现在，护士会帮您敷上湿布，每几个小时换一次，您感觉怎么样？放松点，咱们一步步来，渗液问题很快会改善的。"
  },
  {
    "id": 839,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者进门时把连帽卫衣的帽子拉得很低，仍挡不住耳后、颈侧一片暗红色抓痕。主诉“这两周夜里痒得睡不着，越抓越红，还掉白屑”。查体：T 36.8℃，散在干燥性红斑、抓痕，无水疱、糜烂、渗出；双臂伸侧最明显，可见线状血痂。追问病史：3个月前确诊HIV阳性，CD4 210/μL，尚未启动ART；否认湿疹、荨麻疹史。近期无发热、腹泻。自述工作常熬夜赶稿，靠外卖和能量饮料续命，昨晚刚交稿，今天凌晨4点才睡。患者小声补一句：“医生，我听说皮肤痒和艾滋病有关，会不会是感染了别的怪东西？”诊室空调吹得他忍不住又挠了一下，指甲缝里带出细碎皮屑。",
    "reference_rule": {
      "condition": "HIV相关性瘙痒急性皮损（无水疱、糜烂、渗出）",
      "action": "1. 使用炉甘石洗剂；2. 糖皮质激素乳膏或凝胶",
      "contraindication": "皮肤干燥、肥厚等情况不宜使用洗剂外擦",
      "evidence": "急性皮损以红斑、丘疹、风团、糜烂渗出等为主。无水疱、糜烂、渗出时，建议使用炉甘石洗剂、糖皮质激素乳膏或凝胶；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（优先排除危急重症如严重感染或过敏反应），并基于指南给出直接、高效的治疗指令。\nStep 2: 临床解码 (Clinical Decoding) - 病例关键信息：患者主诉夜间瘙痒加剧伴脱屑（“掉白屑”），查体显示干燥性红斑、抓痕、线状血痂，无水疱、糜烂或渗出，双臂伸侧为主；隐式线索包括频繁抓挠（指甲缝带皮屑）、HIV阳性（CD4 210/μL，免疫抑制状态）、未启动ART、不健康生活方式（熬夜、外卖依赖）；医学术语：瘙痒性干燥性皮疹（pruritic xerotic eruption），可能与HIV相关皮肤病变或干燥性湿疹相关，需排除疥疮或真菌感染（但无水疱渗出减少可能性）。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition \"HIV相关性瘙痒急性皮损（无水疱、糜烂、渗出）\" 完全匹配患者皮损特征。但Contraindication \"皮肤干燥、肥厚等情况不宜使用洗剂外擦\" 需强制检查：患者有“干燥性红斑”和“掉白屑”，明确提示皮肤干燥，故炉甘石洗剂禁忌。Action中的糖皮质激素乳膏或凝胶无禁忌，可安全使用。\nStep 4: 决策生成 (Decision Making) - 基于指南Action调整：避免炉甘石洗剂，优先使用糖皮质激素乳膏或凝胶；添加保湿护理以缓解干燥；同时强调HIV管理（启动ART）和生活方式干预，以预防皮疹加重。",
    "medical_order": "予外用糖皮质激素乳膏（如0.1%氢化可的松乳膏）涂于患处，每日两次；建议使用保湿乳膏（如凡士林基制剂）全身涂抹，每日三次；计划启动抗逆转录病毒治疗（ART）；教育患者避免抓挠、保持皮肤清洁；建议改善生活方式（保证充足睡眠、均衡饮食）；随访一周评估皮疹变化。",
    "patient_dialogue": "别紧张，你的皮肤痒主要是干燥引起的，抓多了就出现这些红痕和皮屑，不是什么‘怪东西’感染。我们会给你开一种药膏，涂在痒的地方，能快速止痒和消炎。同时，记得每天多涂点保湿霜——就像给皮肤‘补水’，减少干燥感，这样就不会越抓越厉害了。另外，你的HIV治疗很重要，咱们得尽快开始吃药来控制病毒，这也能预防皮肤问题加重。对了，少熬夜、多吃新鲜蔬果，别老靠外卖和饮料，这些小事对皮肤恢复很关键。一周后咱再复查，看看情况如何。"
  },
  {
    "id": 855,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者近3周出现‘火烧一样’的全身瘙痒，夜间加重，已抓破胸背及双胫，形成大片血痂。自述无新发药物、无昆虫叮咬史。查体：体温36.8℃，血压118/70 mmHg，慢性湿疹样变伴抓痕、苔藓化，未见脓疱；口腔黏膜白斑稳定。实验室：Hb 112 g/L，ALT 34 U/L，Cr 77 μmol/L，总IgE 480 kU/L，外周嗜酸粒细胞0.62×10⁹/L；真菌镜检、疥螨检查阴性。目前服用TDF/FTC+DTG，依从性>95%。患者为夜班出租车司机，担心‘传染给家人’，情绪焦虑，反复询问是否需口服激素。今日皮肤科门诊，皮肤屏障明显受损，但一般状况尚可，可配合外用治疗。",
    "reference_rule": {
      "condition": "中药外治（剧烈瘙痒正气尚足）",
      "action": "1. 中药洗浴：苦参/蛇床子/地肤子等煎水熏洗；2. 洗毕及时保湿",
      "contraindication": "体虚易感冒者慎用，低温环境需保暖",
      "evidence": "中药洗浴法: 苦参、蛇床子、地肤子、白鲜皮、百部、川椒、艾叶等一味至数味煎水做全身熏洗，每日1剂。洗浴完毕应注意保湿，及时涂抹安抚保护剂。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，患者合并HIV感染（服用抗逆转录病毒药物TDF/FTC+DTG）和剧烈皮肤瘙痒（可能为过敏性皮炎或特应性湿疹），关注重点为全网扫描药物相互作用、禁忌症及共病风险，优先级确保安全第一。Step 2: 临床解码 (Clinical Decoding): 患者主诉为全身剧烈瘙痒（医学术语：泛发性瘙痒症），夜间加重，伴抓痕、血痂及苔藓化（提示慢性皮肤屏障损伤）；实验室显示总IgE升高（480 kU/L）和外周嗜酸粒细胞增多（0.62×10⁹/L），支持过敏性基础；口腔黏膜白斑稳定（可能与HIV相关免疫抑制有关）；Hb 112 g/L（轻度贫血，但无急性失血证据）；抗病毒治疗依从性高（>95%），无新发药物或感染源；社会因素：夜班工作可能加重压力，情绪焦虑（担心‘传染’，但无感染证据如疥螨阴性）。隐式线索：皮肤屏障受损易继发感染，需警惕免疫抑制状态下的并发症。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南针对‘剧烈瘙痒正气尚足’，条件匹配（患者一般状况尚可，无发热或虚弱表现）；行动为中药洗浴（苦参/蛇床子/地肤子等）。强制检查禁忌症：体虚易感冒者慎用——患者Hb轻度降低但无反复感冒史，一般状况可，非绝对禁忌；低温环境需保暖——患者为夜班司机，可能暴露冷环境，需强化保暖措施。全网扫描安全性：中药洗浴为外治，无全身吸收，与TDF/FTC+DTG无已知药物相互作用；HIV免疫抑制增加皮肤感染风险，但指南适用，优先安全（保湿可预防感染）。Step 4: 决策生成 (Decision Making): 根据指南Action，采用中药洗浴方案，使用苦参、蛇床子、地肤子等煎水熏洗，每日一剂；洗毕立即保湿以修复皮肤屏障。强调保暖和监测，避免禁忌风险。",
    "medical_order": "建议中药外治：苦参30g、蛇床子30g、地肤子30g水煎取液，熏洗全身，每日1剂。洗浴后立即涂抹保湿霜（如凡士林基制剂）。注意保暖，避免低温暴露。监测皮肤有无继发感染迹象，若有红肿、渗液及时复诊。",
    "patient_dialogue": "王师傅，您好！看您皮肤痒得这么厉害，晚上还加重，抓得都破了皮，肯定很难受吧？这不是传染病，不会传给家人的，别太担心。我们建议您试试中药洗浴：用苦参、蛇床子这些草药煮水洗澡，每天一次，能帮您止痒和修复皮肤。洗完澡后，千万记得马上涂保湿霜——就像给皮肤加层保护膜，让它好得快些。您开夜班车时，多穿点衣服保暖，别让冷风吹着了，不然容易感冒。如果皮肤发红或者更痒了，赶紧回来找我，咱们一起盯着。慢慢来，会好起来的！"
  },
  {
    "id": 849,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者小邵，男，28岁，自由插画师。主诉“全身像被蚊子咬了一样痒两周”，夜间加重，抓得睡不踏实。两周前开始自服氯雷他定片，无效。既往史：去年确诊HIV-1感染，已启动ART（TAF/FTC+DTG），CD4 320/μL，病毒载量<50 cp/mL。查体：躯干、四肢散在0.5-1 cm红色丘疹，部分顶端抓破结痂；右腰见3个小水疱，清亮，基底潮红，无脓头。体温36.4 ℃，余系统查体无殊。患者抱怨“地铁里空调一吹，皮肤像被针扎”，并随口提到“上周刚交完画稿通宵了3晚”。实验室：血常规嗜酸粒细胞8.1%（↑），肝肾功能正常。皮肤镜：丘疹边缘毛细血管扩张，中央点状出血。暂未见念珠菌或疱疹病毒皮损证据。",
    "reference_rule": {
      "condition": "HIV相关性瘙痒风热外袭证（早期）",
      "action": "1. 内服消风散加减（石膏、知母、防风等）；2. 中成药：疏风清热胶囊；3. 水疱渗出加萆薢/茵陈",
      "contraindication": "阳虚者慎用",
      "evidence": "风热外袭证: 治法: 疏风清热，辛凉解表。方药:消风散加减(推荐强度B，证据等级Ⅱ级)。组成: 石膏、知母、生地黄、牡丹皮、荆芥、防风、牛蒡子、金银花、苦参、蝉蜕、白鲜皮、甘草。水疱、渗出者，加萆薢、茵陈; 中成药: 疏风清热胶囊等。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如机会性感染、脓疱疮或严重过敏反应），并直接给出简洁、高效的诊疗指令，避免延误治疗。Step 2: 临床解码 (Clinical Decoding): 患者主诉全身瘙痒两周，伴夜间加重和抓破结痂，结合查体发现躯干四肢散在红色丘疹（0.5-1 cm）及右腰小水疱（基底潮红），提示炎症性皮肤病变。隐式线索包括：患者为插画师，近期通宵3晚（暗示压力或疲劳诱发病情）；空调刺激后出现针刺感（符合风热外袭证的风邪侵袭表现）；实验室嗜酸粒细胞升高（8.1%）支持过敏或炎症反应；HIV感染控制良好（CD4 320/μL，病毒载量<50），但需警惕HIV相关性皮肤病风险。皮肤镜显示毛细血管扩张和点状出血，排除念珠菌或疱疹病毒证据后，指向非感染性皮炎。Step 3: 规则对齐与安全检查 (Alignment & Safety): 病例特征（瘙痒、丘疹、水疱、环境因素加重）高度匹配指南Condition 'HIV相关性瘙痒风热外袭证（早期）'。强制检查Contraindication '阳虚者慎用'：患者年轻、体温正常、无畏寒或乏力等阳虚征象，故无禁忌症，方案安全。Step 4: 决策生成 (Decision Making): 基于指南Action，直接采用内服消风散加减（针对风热证）并添加萆薢/茵陈处理水疱渗出；辅以中成药疏风清热胶囊；同时考虑患者疲劳史，建议非药物干预（如避免熬夜）以预防复发。",
    "medical_order": "诊断：HIV相关性瘙痒风热外袭证（早期）。治疗：1. 内服消风散加减方（石膏30g、知母15g、防风12g、生地黄20g、牡丹皮10g、荆芥10g、牛蒡子10g、金银花15g、苦参10g、蝉蜕6g、白鲜皮15g、甘草6g），加萆薢15g、茵陈15g以处理水疱渗出；每日一剂，水煎分两次服。2. 予疏风清热胶囊口服，每次4粒，每日3次。3. 建议避免过度疲劳及睡眠不足。4. 随访：一周后复诊评估疗效；如瘙痒加重或出现新水疱，及时复诊。",
    "patient_dialogue": "小邵，你好！我看你全身痒得这么厉害，晚上都睡不好，还抓破了皮，这确实挺折磨人的。别担心，咱们一起来解决。你的症状像是皮肤对风热特别敏感，空调一吹就刺痛，再加上你最近熬夜赶稿太辛苦，身体抵抗力下降，就容易引发这种反应。我给你开两种中药：一个是汤药，帮你疏风清热，缓解瘙痒，里面专门加了成分处理你腰上那几个小水疱；另一个是胶囊，方便你平时服用。记住啊，千万别再通宵了！保证每晚7-8小时睡眠，让身体缓一缓，这样好的更快。按时吃药，一周后来复查，看看效果。如果中间更痒了或水疱变多，随时来找我，别硬扛着。"
  },
  {
    "id": 856,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者32岁，男性，网约车司机，今日由同伴搀扶步入诊室。主诉：‘全身像被蚂蚁咬，越挠越痒，夜里根本睡不着。’现病史：两周前无明显诱因出现散在红色丘疹，伴剧烈瘙痒，抓破后渗液结痂，夜间加重。近3天渗液增多，需每日更换2次贴身衣物。既往史：HIV抗体阳性，确诊2年，CD4 210/μL，病毒载量 45 000 copies/mL，规律服用TDF/3TC/DTG，依从性可。无其他慢病史。查体：T 37.4 ℃，BP 118/76 mmHg；躯干及四肢伸侧密集粟粒至黄豆大红色丘疹，部分融合成片，表面可见淡黄色渗液与抓痕，双侧肘窝潮湿；舌红，苔黄腻，脉滑数。实验室：血常规WBC 6.8×10⁹/L，Eos 0.52×10⁹/L↑；肝肾功能正常。患者抱怨：‘车里空调坏了，出汗后更痒，客人还嫌我抓挠不专心。’",
    "reference_rule": {
      "condition": "HIV相关性瘙痒湿热蕴结证（急性/亚急性）",
      "action": "1. 内服萆薢渗湿汤加减（薏苡仁、萆薢、黄柏等）；2. 中成药：龙胆泻肝胶囊；3. 渗液多加马齿苋/茵陈",
      "contraindication": "脾胃虚寒者慎用",
      "evidence": "湿热蕴结证: 治法: 清热利湿，疏风止痒。方药:萆薢渗湿汤加减(推荐强度B，证据级别Ⅲ)。组成:薏苡仁、萆薢、白术、苍术、黄柏、茯苓、苦参、山药、桑枝、车前草、滑石、泽泻。渗液多者，加马齿苋、绵茵陈; 中成药: 龙胆泻肝胶囊等。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规门诊诊疗场景，作为急诊/门诊医生，需快速排除危急重症（如感染性休克、药物超敏反应），聚焦直接治疗。重点关注：皮损特征与HIV免疫状态的关联性、瘙痒对职业功能的影响。\n\nStep 2: 临床解码 - ①皮损特点：粟粒至黄豆大红丘疹+渗液结痂+抓痕，符合急性湿疹样皮炎；②实验室：Eos升高提示过敏/炎症反应；③HIV背景：CD4 210/μL（中度免疫抑制）可能加重皮损；④诱因：职业性出汗（空调故障）与苔黄腻/脉滑数共同指向湿热环境加剧病情；⑤隐式风险：抓破皮肤易继发感染，病毒载量未完全抑制需关注ART方案调整。\n\nStep 3: 规则对齐与安全检查 - 指南条件'HIV相关性瘙痒湿热蕴结证'完全匹配：渗液多（日换衣2次）、舌红苔黄腻符合湿热证；禁忌症'脾胃虚寒'可排除（脉滑数为实热征象）。安全核查：TDF/3TC/DTG与中药无已知相互作用，肝肾功能正常支持用药。\n\nStep 4: 决策生成 - 采纳指南核心方案（萆薢渗湿汤+马齿苋/茵陈），补充职业干预：①加外用湿敷控制渗液；②要求暂停驾驶3天避免汗液刺激；③转诊感染科评估病毒载量问题。",
    "medical_order": "诊断：1. HIV相关性湿疹样皮炎（急性期，湿热蕴结证） 2. HIV感染（CD4 210/μL，病毒载量未抑制）\n处理：\n1. 中药内服：萆薢渗湿汤加减——薏苡仁30g，萆薢15g，黄柏10g，茯苓15g，泽泻10g，滑石10g（包煎），马齿苋20g，绵茵陈15g。×7剂，水煎400ml，分两次温服。\n2. 中成药：龙胆泻肝胶囊 0.25g×36粒，Sig：0.5g tid po（若汤剂接受度差时备用）。\n3. 局部处理：3%硼酸溶液湿敷渗液区 bid×15min/次，湿敷后外涂氧化锌软膏。\n4. 职业干预：建议暂停驾驶工作3日，修复车辆空调系统。\n5. 转诊：即刻转感染科复查病毒载量及ART方案调整。\n随访：3日后皮肤科复诊评估皮损。",
    "patient_dialogue": "王师傅，您这满身的红疙瘩和渗水，是典型的‘湿热皮炎’，就像衣服闷在塑料袋里捂出疹子——您车里空调坏了天天出汗，加上HIV让皮肤更敏感，才这么遭罪。咱们分三步解决：\n\n第一，给您开7天祛湿止痒的中药汤，每天早晚各喝一碗（稍有点苦），里面特意加了止渗水的草药；要是喝汤不方便，备用胶囊每天吃3次也行。\n\n第二，身上流黄水的地方，用纱布蘸药水冷敷（我教您操作），敷完涂层药膏保护。记住千万别硬挠！指甲带细菌，挠破了可能化脓。\n\n最要紧的是第三点：您得歇3天班，把空调修好。您想想——开车时汗流进疹子，就像往伤口上撒盐，药就白用了！这几天穿纯棉旧衣服，汗湿立刻换。\n\n另外您HIV的药虽然按时吃，但病毒数还有点高，我联系了感染科同事，您顺道去趟二楼，他们帮您调调药。坚持三天，痒得睡不着这问题就能缓过来！"
  },
  {
    "id": 858,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者近6周出现进行性加重的全身瘙痒，夜间为主，已影响睡眠。自述‘像蚂蚁在骨头里爬’，抓痕遍布四肢与躯干，部分继发血痂。外院曾连续口服氯雷他定、西替利嗪、依巴斯汀共4周无效，局部激素膏亦仅短暂缓解。无新发皮疹、无黄疸、无药物更换史。既往：2019年确诊HIV，2021年合并‘获得性肾小管病’，eGFR 55 mL/min/1.73 m²；2022年左前臂带状疱疹后遗神经痛，目前服用加巴喷丁300 mg tid。实验室回报（本院，昨日）：总胆红素12 μmol/L、ALT 28 U/L、ALP 78 U/L、BUN 8.9 mmol/L、Scr 112 μmol/L、Hb 105 g/L、IgE 68 kU/L（正常）、外周嗜酸粒细胞0.02。腹部超声：双肾大小正常，无胆管扩张。患者焦虑明显，昨夜仅睡2小时，今日白天亦因瘙痒无法专注工作（职业：地铁司机）。查体：体温36.7℃，BP 118/72 mmHg，皮肤干燥，广泛线状抓痕，无结节、无苔藓样变，甲周无湿疹样改变，口腔黏膜无白斑。患者迫切希望‘尽快止痒，否则无法上班’。",
    "reference_rule": {
      "condition": "HIV相关性瘙痒系统治疗（重度/抗组胺抵抗）",
      "action": "1. 短期糖皮质激素控制症状（严格掌握指征）；2. 联合三环类抗抑郁药（多塞平/阿米替林）；3. 复方甘草酸苷口服50～75mg每日3次或静脉160～240mg/d",
      "contraindication": "免疫抑制剂禁用；强效激素连续使用≤2周",
      "evidence": "⑤ 糖皮质激素：一般不主张常规使用。对于病因明确或症状严重者（如泛发性皮疹、红皮病型等），以及对抗组胺药物治疗抵抗者，为迅速控制症状也可以短期应用；⑥ 三环类抗抑郁药：临床上常联合抗组胺药使用；⑧ 其他：复方甘草酸苷，口服剂量推荐50～75mg，每天3次；静脉给药推荐160～240mg·d⁻¹。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。需全网扫描患者所有疾病状态（HIV、慢性肾病、带状疱疹后遗神经痛）、现有用药（加巴喷丁）及职业需求（地铁司机），确保治疗方案无冲突。\n\nStep 2: 临床解码 (Clinical Decoding): 患者为HIV感染者（2019年确诊），合并获得性肾小管病（eGFR 55 mL/min/1.73 m²，Scr 112 μmol/L提示中度肾功能不全），带状疱疹后遗神经痛（正服加巴喷丁300 mg tid）。瘙痒为进行性、夜间加重、抗组胺药抵抗，无皮疹或实验室异常（IgE正常、嗜酸粒细胞正常），排除过敏或肝胆疾病；隐式线索包括焦虑明显、睡眠剥夺（仅睡2小时/日）及职业风险（地铁司机需高度专注），提示瘙痒可能为HIV相关神经性或系统性疾病所致。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition 'HIV相关性瘙痒系统治疗（重度/抗组胺抵抗）'匹配（抗组胺药无效4周）。Contraindication检查：1. 免疫抑制剂禁用—指南明确禁止，方案中无免疫抑制剂；2. 强效激素连续使用≤2周—需严格执行。安全扫描：加巴喷丁与三环类抗抑郁药（如多塞平）可能叠加中枢抑制（镇静、头晕），增加跌倒或驾驶风险；肾功能不全（eGFR 55）需调整复方甘草酸苷剂量（避免钠潴留）；HIV状态禁止任何免疫抑制；职业要求避免镇静影响驾驶。无绝对禁忌，但起始剂量需保守。\n\nStep 4: 决策生成 (Decision Making): 基于指南Action：1. 短期糖皮质激素（泼尼松20mg qd，疗程≤7天控制急性症状）；2. 联合三环类抗抑郁药（多塞平25mg qn起始，低剂量减少镇静风险）；3. 复方甘草酸苷口服75mg tid（优先口服，避免静脉因肾损风险）。监测肾功能和副作用，一周随访评估。",
    "medical_order": "1. 予泼尼松20mg口服每日一次，疗程7天。2. 予多塞平25mg口服每晚一次。3. 予复方甘草酸苷75mg口服每日三次。4. 监测：血肌酐、电解质、血压每周一次；评估瘙痒程度（VAS评分）及睡眠质量。5. 避免驾驶交通工具。6. 一周后复诊调整方案。",
    "patient_dialogue": "医生，我完全理解您现在有多难受——那种‘蚂蚁在骨头里爬’的感觉，晚上痒得睡不了觉，白天连班都不能上，这肯定让您焦虑极了。别担心，我们一起来解决。首先，我会给您开三种药：一种是泼尼松，每天早上一片，它能快速压下那种剧烈的瘙痒和炎症，但因为它是一种激素，咱们只能用短短几天，时间长了可能对身体不太好。另一种叫多塞平，晚上睡前吃一小片，它能帮您止痒，还能改善睡眠，让您夜里不再抓得那么厉害。不过，您已经在吃加巴喷丁了，这两种药合起来可能会让您有点犯困或头晕，所以我先给了最低剂量，避免出问题。第三种是复方甘草酸苷，每天三顿，饭后吃，它能从内部调节一下身体，减轻过敏反应，保护您的肝脏。另外，您有慢性肾病，我们要定期查血看肾功能，确保一切安全。最要紧的是，您开地铁的，这些药可能影响反应速度，所以这几天千万别开车，请假在家休息，安全第一。一周后您再来复查，我们看效果调整药量。相信我，我们会一步步帮您缓过来的，您现在就能安心些了。"
  },
  {
    "id": 841,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "今日皮肤科门诊，患者主诉“全身痒到睡不了觉，越抓越厚”。查体：双小腿伸侧及腰骶部可见成片暗褐色斑块，表面粗糙呈苔藓化，散在黄豆大坚实结节，抓痕血痂交错；皮温正常，无渗出。患者自述近半年每晚必抓至出血，天气干燥时加重，曾自行涂“止痒牙膏”无效。既往无糖尿病、肝病，此次肝肾功能、空腹血糖均在参考范围内。患者职业为夜班出租车司机，担心药膏油腻影响握方向盘，暂未接受任何处方治疗。",
    "reference_rule": {
      "condition": "HIV相关性瘙痒慢性皮损（粗糙肥厚、结节）",
      "action": "1. 外用糖皮质激素软膏、硬膏、乳剂或酊剂；2. 合用保湿剂及角质松解剂（体积分数20%～40%尿素软膏、体积分数5%～10%水杨酸软膏）",
      "contraindication": "面部及皱褶部位避免强效激素长期使用",
      "evidence": "慢性皮损以粗糙肥厚、结节为主。建议外用糖皮质激素软膏、硬膏、乳剂或酊剂等，可合用保湿剂及角质松解剂，如体积分数20%～40%尿素软膏、体积分数5%～10%水杨酸软膏等。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为果断的门诊医生，我的关注重点是快速建立鉴别诊断以排除危急重症（如系统性疾病或感染），并给出直接、高效的治疗指令。Step 2: 临床解码 (Clinical Decoding): 患者主诉全身瘙痒伴睡眠障碍，查体显示双小腿伸侧及腰骶部暗褐色斑块伴苔藓化（lichenification）和坚实结节（nodules），结合抓痕血痂，提示慢性搔抓性皮损，常见于神经性皮炎（neurodermatitis）或结节性痒疹（prurigo nodularis）。隐式线索包括：职业（夜班出租车司机）可能带来的压力或睡眠紊乱加剧瘙痒，天气干燥加重症状（暗示皮肤屏障受损），自行使用无效的“止痒牙膏”显示既往管理不当。肝肾功能和空腹血糖正常，排除了糖尿病或肝病相关瘙痒，但HIV状态未知（指南指定HIV相关性，需警惕）。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition为‘HIV相关性瘙痒慢性皮损（粗糙肥厚、结节）’，患者皮损特征（粗糙肥厚、结节）匹配指南描述，但HIV状态未明，因此必须强制检查禁忌症：皮损部位（双小腿伸侧和腰骶部）非面部或皱褶部位（如腋窝、腹股沟），可安全使用指南建议的外用糖皮质激素；无系统禁忌症（如糖尿病或肝病已排除）。Step 4: 决策生成 (Decision Making): 鉴于快速排除危急重症（无感染或系统危象），优先根据指南Action生成直接指令：开具外用糖皮质激素（选用乳剂或酊剂以减少油腻感）联合保湿剂和角质松解剂；同时建议HIV筛查以确认病因（因指南针对HIV相关，但病例未提供信息）。",
    "medical_order": "诊断：慢性苔藓化性皮炎（chronic lichenified dermatitis），考虑神经性皮炎；建议排除HIV感染。治疗：1. 外用强效糖皮质激素（如倍他米松乳剂或酊剂）bid 于皮损处；2. 合用体积分数20%尿素软膏 qd 保湿；3. 外用体积分数5%水杨酸软膏 qd 角质松解。建议：避免搔抓，每日保湿；2周后复诊评估疗效；完善血清HIV抗体检测。",
    "patient_dialogue": "王先生，您这个皮肤痒得睡不着觉，是因为您长期抓挠，皮肤变得又厚又硬了，像老树皮一样。我给您开两种药膏：一种是消炎止痒的（像倍他米松），我用乳剂或酊剂，这样涂上去不油腻，不会影响您开车握方向盘；另一种是让皮肤变软的（如尿素霜和水杨酸膏），帮助您皮肤恢复光滑。记住，涂药后千万别再抓了，越抓皮肤会越厚。另外，天气干燥时要多涂保湿霜，就像给皮肤‘喝水’，防止干裂发痒。我还建议您抽个血查一下HIV，排除一下其他可能的原因。这样我们才能更准确地帮您控制住问题。您先用两周药，看看痒的情况有没有改善，然后再来复诊聊聊。"
  },
  {
    "id": 851,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者38岁，男性，确诊HIV感染8年，目前规律服用比克替拉韦/恩曲他滨/丙酚替诺福韦，CD4 312/μL，病毒载量<50 copies/mL。近4个月出现全身阵发性瘙痒，夜间加重，抓痕明显，伴脱屑，无原发皮疹。既往史：肺孢子菌肺炎（2年前）、轻度支气管哮喘、慢性浅表性胃炎。实验室：IgE 198 IU/mL（↑），嗜酸粒细胞0.62×10⁹/L（↑），肝肾功能正常。胸片未见活动性病变。皮肤科会诊排除疥疮及真菌感染。患者自述“痒得睡不着，空调一吹更厉害”，近两周因瘙痒自行加用氯雷他定效果差。今日复诊，望舌淡胖、边有齿痕，苔薄白，脉浮缓。患者职业为夜班网约车司机，担心再请假会被平台封号。",
    "reference_rule": {
      "condition": "HIV相关性瘙痒肺卫气虚证（反复发作）",
      "action": "1. 内服玉屏风散合桂枝汤加减（黄芪、白术、桂枝等）；2. 中成药：玉屏风颗粒/贞芪扶正颗粒",
      "contraindication": "湿热证禁用",
      "evidence": "肺卫气虚证: 治法: 扶正益气。方药: 玉屏风散合桂枝汤加减(推荐强度B，证据级别Ⅲ)。组成: 黄芪、白术、防风、当归、制首乌、苦参、桂枝、赤芍、白芍、白蒺藜、白鲜皮、生龙骨、生牡蛎。中成药: 玉屏风颗粒、贞芪扶正颗粒等。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为博学的专科专家，我将重点关注全网扫描药物相互作用、禁忌症及共病风险，优先确保安全（安全 > 疗效）。患者HIV感染合并瘙痒症状，涉及免疫抑制、过敏反应及中医证候，需综合考虑抗病毒治疗、共病（哮喘、胃炎）及职业因素带来的隐式风险。Step 2: 临床解码 (Clinical Decoding) - 患者为38岁男性，HIV感染控制良好（CD4 312/μL，病毒载量<50 copies/mL，规律服用比克替拉韦/恩曲他滨/丙酚替诺福韦）。主诉全身阵发性瘙痒4个月，夜间加重，伴抓痕和脱屑，无原发皮疹，实验室指标提示过敏或炎症状态（IgE升高至198 IU/mL，嗜酸粒细胞升高至0.62×10⁹/L）。皮肤科已排除疥疮和真菌感染。隐式线索包括：夜间瘙痒加重和空调刺激，表明环境因素可能诱发；职业为夜班网约车司机，暗示睡眠剥夺和生活压力，可能加剧症状和影响治疗依从性；既往肺孢子菌肺炎、哮喘、胃炎提示免疫脆弱和慢性炎症风险；中医体征（舌淡胖、边有齿痕、苔薄白、脉浮缓）支持肺卫气虚证，无热象。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 参考指南条件为“HIV相关性瘙痒肺卫气虚证（反复发作）”，患者症状和中医体征高度匹配。禁忌症“湿热证禁用”被强制检查：患者苔薄白、脉浮缓，无黄腻苔或热象，无禁忌。安全扫描：患者服用比克替拉韦（HIV整合酶抑制剂），其药物相互作用风险低（主要经CYP3A4代谢，无强诱导剂/抑制剂报告），中药成分（如黄芪、白术）未见显著相互作用或肝毒性（肝肾功能正常）。共病风险：哮喘和胃炎稳定，无急性发作，瘙痒非哮喘诱发；职业压力可能间接影响免疫，但无直接药物冲突。整体安全可控。Step 4: 决策生成 (Decision Making) - 基于指南Action（内服玉屏风散合桂枝汤加减、中成药玉屏风颗粒/贞芪扶正颗粒），制定方案：开具中药处方以扶正益气，缓解瘙痒，同时维持原抗病毒治疗。添加支持性建议（如保湿和避免刺激）以优化疗效，并安排随访以监测安全性和效果。",
    "medical_order": "诊断：HIV相关性瘙痒（肺卫气虚证）。治疗：1. 内服玉屏风散合桂枝汤加减方剂：黄芪30g、白术15g、防风10g、当归10g、制首乌10g、苦参6g、桂枝10g、赤芍10g、白芍10g、白蒺藜10g、白鲜皮10g、生龙骨15g（先煎）、生牡蛎15g（先煎），水煎服，每日1剂，分2次口服。2. 中成药：玉屏风颗粒 5g tid po 或贞芪扶正颗粒 1包 bid po（任选其一）。3. 继续原抗病毒方案：比克替拉韦/恩曲他滨/丙酚替诺福韦 每日1片口服。4. 支持治疗：外用保湿剂（如凡士林）bid，避免搔抓及冷风直吹。5. 随访：2周后复诊，评估瘙痒程度（VAS评分）、皮肤状况及药物耐受性；若症状无改善或加重，转诊皮肤科或免疫科。",
    "patient_dialogue": "您好，我理解您最近被这瘙痒折腾得够呛，尤其晚上痒得睡不好觉，空调一吹还更严重，这确实很影响生活和工作。别太担心，咱们一起想办法。这瘙痒啊，可能和您身体的抵抗力有关——HIV虽然控制得不错，但体质稍微弱了点，加上您开夜班车，休息不好，容易让皮肤更敏感。不是感染或什么大病，我们已经排除了这些可能。接下来，我会给您开些中药，这些药就像‘身体卫士’，帮您增强体质、减轻痒感。一种是煮好的汤药，每天喝两次；另一种是颗粒冲剂，更方便服用，您选一种就行。同时，您得继续吃现在的HIV药物，千万别停。生活中呢，多涂点保湿霜保护皮肤，少抓挠，免得留疤；空调别对着吹，出门穿件薄外套。我知道您担心工作请假，这方案不用特意请假，服药在家就能做。坚持一两周，痒应该能缓解，咱们两周后见面再看看效果。您工作辛苦，但身体要紧，尽量抽空睡好觉，好吗？"
  },
  {
    "id": 861,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者昨夜突发弥漫性红斑，晨起可见躯干、四肢散在张力性大疱，部分融合成湖，疱液清亮；双腋下、腹股沟可见大片表皮剥脱，露出湿润糜烂面，轻触即痛。体温39.4℃，心率112次/分，血压94/58 mmHg，呼吸24次/分。自述近7天新换用含“依非韦伦/拉米夫定/替诺福韦”复方制剂，第5天出现瘙痒，未停药。既往：CD4最低78/μL，目前320/μL，HIV-RNA<50 cp/mL；慢性乙型肝炎携带（HBsAg+，HBV-DNA<10 IU/mL）；2年前因“左基底节区脑梗死”遗留右侧肢体轻度无力。实验室：白细胞15.6×10⁹/L，嗜酸粒细胞2.1×10⁹/L，ALT 118 U/L，AST 92 U/L，总胆红素26 μmol/L，肌酐98 μmol/L，CRP 142 mg/L，PCT 0.38 ng/mL；疱液培养暂未回报。皮肤剥脱面积约占体表面积28%。患者痛苦面容，反复询问“是不是药又过敏了？会不会像上次那样脱皮到脸？”陪床的伴侣补充：患者职业为夜班出租车司机，最近两周连续跑长途，熬夜、饮水少；入院当日凌晨曾自行服用“布洛芬0.6 g”试图退热。",
    "reference_rule": {
      "condition": "HAART引起的危重药疹（大疱型/剥脱性皮炎型）",
      "action": "1. 大剂量激素（1.5～2.0mg/kg/d）或冲击疗法（250～500mg/d连续3天）；2. 免疫球蛋白5～20g/d静脉滴注3天；3. 水疱创面低位剪破引流",
      "contraindication": "免疫抑制剂禁用",
      "evidence": "若特别严重药疹如重度多形红斑型、剥脱性皮炎型、大疱型等，优先选择西医治疗，可大剂量使用皮质激素甚至冲击疗法或免疫球蛋白治疗；特别严重者可大剂量使用糖皮质激素每日1.5～2.0mg·kg⁻¹；必要时可使用冲击疗法，250～500mg·d⁻¹，连续3d；⑤ 免疫球蛋白：5～20g·d⁻¹，静脉滴注，连用3d；对有水疱的创面，应低位剪破水疱放液引流。"
    },
    "thought": "**Step 1: 场景定义** - 本案例属于复杂合并症治疗场景，涉及HIV感染、慢性乙型肝炎、脑血管后遗症及急性重症药疹的交叉管理。关注重点为全网扫描：优先检查药物相互作用（如HAART与布洛芬的肾毒性叠加）、禁忌症（激素在乙肝患者中的HBV再激活风险）及共病风险（低血压休克、脱水、肝功能异常），确保安全第一（安全 > 疗效）。\n\n**Step 2: 临床解码** - 关键信息解码：患者表现为急性起病的张力性大疱和表皮剥脱（体表28%），伴发热、心动过速、低血压，符合大疱型/剥脱性皮炎型药疹（Stevens-Johnson综合征或中毒性表皮坏死松解症类似）。实验室显示白细胞和嗜酸粒细胞升高（15.6×10⁹/L和2.1×10⁹/L，提示超敏反应）、肝酶升高（ALT 118 U/L、AST 92 U/L，可能药物性肝损伤）、炎症标志物升高（CRP 142 mg/L）。隐式线索：新换HAART（依非韦伦/拉米夫定/替诺福韦）后第5天瘙痒，未停药，提示药疹诱因；慢性乙肝携带（HBsAg+）增加免疫抑制治疗风险；脑血管病史（脑梗死遗留无力）需谨慎用高剂量激素；伴侣补充的脱水风险（熬夜、饮水少）及自行服用布洛芬（加重肾损伤，肌酐98 μmol/L临界升高）；疱液培养未回，需排除感染（PCT 0.38 ng/mL在正常上限）。\n\n**Step 3: 规则对齐与安全检查** - 与指南Condition“HAART引起的危重药疹”高度匹配：症状和用药史一致。强制检查Contraindication“免疫抑制剂禁用”：指南Action推荐激素和免疫球蛋白，但激素属免疫抑制剂，需评估禁忌。安全风险：乙肝携带者用激素可能激活HBV（HBV-DNA<10 IU/mL，但再激活风险高）；脑血管病史增加副作用；低血压（94/58 mmHg）提示休克前状态；布洛芬使用和脱水可能加重肾损伤；排除感染（PCT正常）。安全优先级：启动治疗前需补液稳定血压，并预防HBV再激活。\n\n**Step 4: 决策生成** - 基于指南Action：选用激素冲击疗法（250~500mg/d）和免疫球蛋白（20g/d）以快速控制炎症；结合安全调整：加用乙肝预防性抗病毒治疗；创面处理低位引流；停药和支持治疗。决策：立即停用嫌疑HAART，予甲泼尼龙500mg/d静脉注射×3天（冲击疗法上限），免疫球蛋白20g/d静脉滴注×3天，创面引流；并行补液、监测生命体征及预防HBV再激活。",
    "medical_order": "1. 立即停用依非韦伦/拉米夫定/替诺福韦复方制剂。2. 予甲泼尼龙500mg静脉注射每日一次，连续3天（激素冲击疗法）。3. 免疫球蛋白20g静脉滴注每日一次，连续3天。4. 皮肤科急会诊：水疱低位剪破引流，外用莫匹罗星软膏预防感染。5. 一级护理，心电监护，监测生命体征每小时。6. 静脉补液：生理盐水500mL快速输注，后续根据尿量调整，维持平均动脉压≥65 mmHg。7. 完善检查：血培养、疱液培养、肝肾功能每日、HBV-DNA定量、CD4计数及HIV-RNA复查。8. 预防性抗HBV治疗：恩替卡韦0.5mg口服每日一次。9. 避免非甾体抗炎药（如布洛芬），疼痛管理予曲马多50mg口服每6小时。10. 营养支持：高蛋白流质饮食。",
    "patient_dialogue": "张先生，您好。别担心，我们这就来处理您的症状。您身上的水泡和脱皮，很可能是您新换的那个抗HIV药物引起的严重过敏反应，就像您担心的‘药疹’那样。我们现在会马上停掉那个药，换成其他安全的药。然后，我们会通过输液给您用两种强力药物：一种叫激素，能快速消炎；另一种是免疫球蛋白，帮助您的身体修复。这些药需要连续用三天，我们会全程监测您的血压和心跳。另外，您有乙肝病史，所以我们会加一种药来预防它发作。您皮肤上的水泡，护士会小心剪开引流，避免感染——这可能会有点疼，但我们会用止痛药帮您缓解。您最近熬夜开车、喝水少，这会让身体更虚弱，所以请多休息，多喝些温水或汤水，别再自己吃止痛片了。我们会24小时守护您，您很快就会好转的。有什么问题随时问我，别害怕！"
  },
  {
    "id": 859,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者3天前出现四肢及躯干弥漫性红色丘疹，剧烈瘙痒夜间尤甚，抓破后渗液结痂。伴口苦口干、大便3日未行、小便黄赤。既往：HAART方案为TDF/FTC+DTG，CD4 420/μL，病毒载量<50 cp/mL；慢性乙肝携带（HBsAg+，HBV-DNA阴性）；无糖尿病、肾病。查体：T 37.6 ℃，BP 118/74 mmHg，BMI 22 kg/m²；四肢伸侧、背部分布对称性红斑、丘疹，部分融合成片，可见抓痕、点状渗出；舌质红、苔黄腻，脉滑数。实验室：ALT 48 U/L，AST 41 U/L，TBil 18 μmol/L，Cr 88 μmol/L，空腹血糖5.2 mmol/L，总IgE 385 kU/L。皮肤镜：毛细血管扩张伴黄色渗出。入院诊断：①HAART药疹（湿热侵淫证）；②HIV感染（A2）。护士提醒：患者自述昨夜瘙痒到无法入睡，自行加服1片氯雷他定效果差，今晨发现皮疹范围扩大至腹部。",
    "reference_rule": {
      "condition": "HAART药疹湿热侵淫证",
      "action": "1. 内服清热除湿汤加减（龙胆草、白茅根、金银花等）；2. 中成药：清开灵口服液；3. 便秘加大黄",
      "contraindication": "气血两虚者禁用",
      "evidence": "湿热侵淫证: 治法: 清热利湿，凉血解毒。方药: 清热除湿汤加减(推荐强度D，证据级别Ⅳ)。组成: 龙胆草、白茅根、生地黄、紫草、大青叶、金银花、黄芩、六一散(包煎)、车前草、太子参、山药。大便秘结者加大黄; 中成药: 清开灵口服液或清开灵软胶囊。"
    },
    "thought": "本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。首先，患者表现为HAART相关药疹（湿热侵淫证），基于皮疹对称性红斑丘疹伴瘙痒渗出、口苦口干、便秘、小便黄赤、舌红苔黄腻脉滑数，实验室显示IgE升高和轻度肝酶异常，符合急性炎症反应；隐式线索包括氯雷他定无效和皮疹扩展，提示病情进展及抗组胺治疗不足。其次，合并HIV控制良好（CD4 420/μL，VL<50 cp/mL）和慢性乙肝携带（HBsAg+，HBV-DNA-），无糖尿病或肾病风险。规则对齐显示指南条件匹配'HAART药疹湿热侵淫证'；禁忌症'气血两虚者禁用'不适用，因患者证候为实热证（无虚象如乏力或苍白）。安全检查：HAART药物（TDF/FTC + DTG）与清热除湿汤成分（如龙胆草、大黄）无已知重大相互作用，但需警惕苦寒药物可能加重肝损（ALT轻度升高），且DTG无明确草药冲突；乙肝携带状态稳定，TDF兼具抗HBV作用，应维持HAART；安全优先级要求添加瘙痒对症处理并监测肝功能。决策生成：遵循指南action，予清热除湿汤加减（含大黄）和清开灵口服液，同时针对瘙痒添加西医支持治疗，确保整体安全。",
    "medical_order": "1. 内服清热除湿汤加减：龙胆草10g、白茅根15g、生地黄12g、紫草9g、大青叶12g、金银花15g、黄芩9g、六一散包煎10g、车前草12g、太子参10g、山药15g、大黄6g后下，每日1剂，水煎分2次服。2. 予清开灵口服液10ml tid口服。3. 继续HAART方案（TDF/FTC + DTG）。4. 瘙痒对症处理：予西替利嗪10mg qd口服（替代氯雷他定），联合外用0.1%糠酸莫米松乳膏 bid涂抹患处。5. 监测：生命体征qd；复查肝功能（ALT/AST）、血常规3天后；每日评估皮疹范围及渗出情况。6. 护理：一级护理，嘱避免搔抓，保持皮肤清洁干燥。",
    "patient_dialogue": "您好，看到您皮肤这么痒，晚上都睡不好觉，肯定很难受吧？这皮疹可能是您吃的抗HIV药物引起的过敏反应，我们中医说这是体内湿热太重导致的，别担心，咱们一步步来治。我会给您开些中药汤剂喝，里面加了金银花、大黄这些成分，能清热去湿，减轻瘙痒，还能帮您通便——因为您说三天没大便了，这样身体里的'毒'排出来，皮肤就好得快些。另外再配个清开灵口服液，每天喝三次，辅助消炎。痒得厉害的话，之前那个氯雷他定效果不好，咱们换个更强点的抗过敏药西替利嗪，睡前吃一片，再给您药膏涂在红疹子上，涂上能马上止痒，避免抓破感染。您现在的抗HIV药千万别停，这对控制病毒很重要，我们会每天检查您的皮肤和体温，过两天再抽血看看肝功能，确保治疗安全。在家时，尽量别抓皮肤，用温水轻轻洗洗就行，衣服穿宽松点。放松心情，我们一起努力，您会好起来的！"
  },
  {
    "id": 845,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者近3周出现全身性瘙痒，夜间明显，无原发性皮疹，搔抓后可见散在抓痕与血痂。VAS评分4分，已影响睡眠。既往：脂肪肝、高脂血症，目前服用替诺福韦/恩曲他滨/多替拉韦+阿托伐他汀。实验室：ALT 52 U/L，Cr 89 μmol/L，总IgE 82 kU/L，嗜酸粒细胞0.42×10⁹/L，血糖5.1 mmol/L。否认新发药物、食物过敏，近期未更换洗护用品。患者为夜班出租车司机，自述“痒得没法专心开车”。查体：皮肤干燥，屈侧可见线性抓痕，无结节、苔藓化。已自行口服氯雷他定10 mg qd 1周，瘙痒无缓解。",
    "reference_rule": {
      "condition": "HIV相关性瘙痒系统治疗（轻度）",
      "action": "1. 首选抗组胺药（如地氯雷他定/非索非那定）；2. 无效时二联/三联不同种类抗组胺药（哌啶类+哌嗪类）；3. 急性发作加维生素C/葡萄糖酸钙；4. 抗组胺抵抗时加白三烯受体拮抗剂",
      "contraindication": "避免无指征使用糖皮质激素",
      "evidence": "系统治疗：① 抗组胺药：首选药物，根据患者情况选择适当抗组胺药止痒，近期的治疗原则提出地氯雷他定以及非索非那定可以用于6个月以上的儿童。应用一种抗组胺药疗效不显或者无效时，可考虑二联或三联用药，原则上联合用药时选用不同种类抗组胺药物（如哌啶类和哌嗪类联用）；③ 维生素C、葡萄糖酸钙：用于急性发作或瘙痒明显者；④ 白三烯受体拮抗剂：当足量应用H1抗组胺药不足以控制症状时，可选用白三烯受体拮抗剂治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为专科专家，重点关注患者既有疾病（脂肪肝、高脂血症）和当前用药（HIV抗逆转录病毒药物和阿托伐他汀），确保瘙痒治疗方案安全优先，全网扫描药物相互作用、禁忌症及共病风险，避免潜在肝损或药物毒性。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者表现为全身性瘙痒（夜间加重，VAS 4分），无原发性皮疹，属慢性瘙痒；实验室指标示总IgE升高（82 kU/L）和嗜酸粒细胞轻度升高（0.42×10⁹/L），提示免疫介导机制；肝酶ALT轻度升高（52 U/L）与脂肪肝病史相关；当前用药组合（替诺福韦/恩曲他滨/多替拉韦 + 阿托伐他汀）隐含HIV感染；职业因素（夜班司机）可加剧症状；已试氯雷他定（第二代H1抗组胺药）无效，符合抗组胺抵抗特征。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件为“HIV相关性瘙痒系统治疗（轻度）”，与患者HIV状态（从ART用药推断）和轻度瘙痒（VAS 4分）匹配。强制检查禁忌症：避免无指征糖皮质激素，当前无严重皮疹或炎症，故禁用。安全扫描：阿托伐他汀经CYP3A4代谢，多替拉韦可抑制CYP3A4，增加他汀类肌病风险；抗组胺药中，非索非那定/地氯雷他定（CYP相互作用低）较安全；嗜酸粒细胞升高需排除寄生虫感染，但患者否认暴露史；ALT升高提示监测肝功能必要。优先级：安全 > 疗效，确保新药不加重肝损或药物相互作用。\n\nStep 4: 决策生成 (Decision Making) - 根据指南action，氯雷他定无效触发step 2（二联抗组胺药）。选择低风险组合：地氯雷他定（哌啶类，非镇静） + 西替利嗪（哌嗪类，第二代，非镇静），避免影响驾驶；加维生素C/葡萄糖酸钙辅助（急性瘙痒）；如无效再升级白三烯受体拮抗剂。决策核心：二联抗组胺 + 辅助治疗，强化皮肤护理，监测肝功能。",
    "medical_order": "1. 诊断：HIV相关性瘙痒（轻度）。2. 治疗：予地氯雷他定 5 mg 口服 每日一次 + 西替利嗪 10 mg 口服 每日一次；加维生素C 1000 mg 口服 每日一次 + 葡萄糖酸钙 1g 口服 每日一次。3. 避免糖皮质激素使用。4. 皮肤护理：建议每日使用保湿剂（如含尿素软膏）。5. 监测：复查肝功能（ALT）及肾功能（Cr）2周后随访，评估瘙痒缓解及药物耐受性。6. 注意事项：观察阿托伐他汀相关肌痛症状，如无效转诊皮肤科。",
    "patient_dialogue": "王先生，您的瘙痒问题我们仔细看了，这很可能和您的HIV状况有关，不是什么严重的皮肤病，但确实挺折磨人的，尤其影响您睡觉和开车。咱们先试试新方案：给您开两种抗过敏药，一个叫地氯雷他定，另一个叫西替利嗪，都是普通药片，每天各吃一次。它们不会让您犯困，放心开夜班车。另外再加点维生素C和钙片，帮助缓解痒感。千万别随便用激素药膏，副作用大，咱们先避开这个。您皮肤有点干，这会更痒，记得每天抹保湿霜，就像擦护手霜那样简单。过一周咱们再看看效果，如果还不行，咱们再调整。您得注意休息，夜班辛苦，身体扛不住痒会更重，我相信这个方案能帮您轻松点儿，开车也安全些。"
  },
  {
    "id": 864,
    "file_name": "皮肤瘙痒-艾滋病皮肤瘙痒协同治疗专家共识.json",
    "case_input": "患者38岁，男性，因‘全身瘙痒伴灼痛4天，皮疹迅速扩散’今日被同伴搀扶入抗病毒门诊。4周前启动一线HAART（TDF+3TC+EFV），服药第24天出现手掌瘙痒，逐渐发展为躯干、四肢靶形红斑，部分融合成片，中央可见水疱；瘙痒VAS 9/10，夜间无法入睡。伴38.2 ℃低热、食欲下降及浓茶样尿。既往：确诊HIV-1感染2年，CD4最低92/μL，病毒载量基线185 000 copies/mL；慢性乙型肝炎携带（HBsAg+，HBV-DNA<20 IU/mL）；3个月前因社区获得性肺炎住院，胸片示双下肺纹理增粗。无药物过敏史，但吸烟10年，约15支/日。查体：急性病容，全身弥漫性靶形红斑，面积>30% BSA，尼氏征（-）；巩膜轻度黄染；双腋下淋巴结肿大1.5 cm、质韧、压痛（+）。实验室：ALT 236 U/L，AST 189 U/L，TBil 68 μmol/L，DBil 42 μmol/L，ALP 155 U/L，Scr 132 μmol/L，eGFR 56 mL/min；血嗜酸粒细胞0.9×10⁹/L；尿蛋白（++）。胸片未见新浸润。今日复诊目的：明确皮疹病因并控制瘙痒。患者焦虑表示‘再痒下去就想停药’，同时担心‘肝坏了是不是要住院’。门诊护士备注：天气闷热，患者候诊时反复抓挠导致表皮剥脱渗血。",
    "reference_rule": {
      "condition": "HAART引起的重度药疹（多形红斑型/伴肝肾功能损害）",
      "action": "1. 停用HAART并更改方案；2. 抗组胺治疗；3. 激素治疗（地塞米松5～10mg/d或甲强龙20～60mg/d）",
      "contraindication": "免疫抑制剂禁用；关注激素不良反应",
      "evidence": "若药疹较为严重，应首先停用HAART疗法，更改治疗方案；重度药疹如多形红斑型、麻疹样药疹泛发或伴有轻度肝肾功能损害等，可在抗组胺治疗同时给予激素治疗；④ 糖皮质激素：根据患者病情可选择地塞米松、氢化可的松、甲基强的松龙。一般地塞米松5～10mg·d⁻¹或甲强龙20～60mg·d⁻¹；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，涉及HIV感染、慢性乙型肝炎、药物性皮疹、肝肾功能损害及患者心理焦虑。作为专科专家，我的关注重点是全网扫描药物相互作用（如HAART与激素的交叉影响）、禁忌症（激素在免疫抑制患者中的风险）及共病风险（乙肝再激活、肾损伤加重），优先级为安全（避免致命并发症）大于疗效（控制皮疹和瘙痒）。\n\nStep 2: 临床解码 (Clinical Decoding): 患者38岁男性，HIV阳性（基线CD4 92/μL，病毒载量高），启动HAART（TDF+3TC+EFV）后24天出现进行性皮疹（弥漫性靶形红斑>30% BSA，伴水疱及表皮剥脱），瘙痒严重（VAS 9/10），伴低热、黄染及浓茶样尿，提示重度多形红斑型药疹。实验室显示药物性肝损伤（ALT 236 U/L, AST 189 U/L, TBil 68 μmol/L）和急性肾损伤（Scr 132 μmol/L, eGFR 56 mL/min, 尿蛋白++），同时嗜酸粒细胞升高（0.9×10⁹/L）支持过敏反应。合并慢性乙肝（HBsAg+, HBV-DNA低）、既往肺炎史及吸烟史，患者焦虑表达停药意愿和肝脏担忧，候诊时抓挠行为加重皮损。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 患者表现与指南condition（HAART引起的重度药疹伴肝肾功能损害）高度匹配。强制检查contraindication：免疫抑制剂禁用，但指南action允许激素治疗；需警惕激素不良反应（如感染风险加重HIV免疫抑制、乙肝再激活、血糖升高）。安全扫描：TDF有肾毒性、EFV易致皮疹，停用HAART可避免恶化；激素需选最低有效剂量（甲强龙40mg/d起始）并监测HBV-DNA（乙肝再激活风险）；慢性乙肝和肾损伤要求避免肾毒性药物（如NSAIDs），支持治疗优先。\n\nStep 4: 决策生成 (Decision Making): 根据指南action（停用HAART、抗组胺治疗、激素治疗），生成决策：1) 立即停用当前HAART方案（TDF+3TC+EFV）；2) 起始抗组胺治疗（西替利嗪口服）；3) 激素治疗（甲强龙40mg/d静脉注射）；4) 更改HAART方案（选用无交叉过敏药物如多替拉韦/替诺福韦艾拉酚胺）；5) 住院监测以管理肝肾功能及皮疹进展；6) 支持治疗包括保肝、水化和皮肤护理，同时评估戒烟干预。",
    "medical_order": "诊断：HAART相关重度药疹（多形红斑型）伴药物性肝损伤及急性肾损伤。\n处理：\n1. 立即停用HAART方案（TDF+3TC+EFV）。\n2. 予抗组胺治疗：西替利嗪10mg口服每日一次。\n3. 予激素治疗：甲泼尼龙40mg静脉注射每日一次。\n4. 监测生命体征、皮疹范围及渗出情况、每日肝功能（ALT、AST、TBil）、肾功能（Scr、eGFR）、尿常规。\n5. 完善检查：HBV-DNA定量、HIV病毒载量、CD4计数、肝功能系列、肾功能指标、尿蛋白定量。\n6. 建议住院治疗，予一级护理，皮肤科会诊评估皮损。\n7. 更改抗逆转录病毒方案：待皮疹稳定后，启用含多替拉韦50mg/替诺福韦艾拉酚胺25mg方案，咨询感染科专家。\n8. 支持治疗：予谷胱甘肽1.2g静脉注射每日一次保肝、生理盐水500mL静脉滴注每日一次水化，避免肾毒性药物。\n9. 皮肤护理：外用莫匹罗星软膏预防感染，避免抓挠。",
    "patient_dialogue": "您好，先生。我完全理解您现在的痛苦——全身痒得厉害，晚上睡不好觉，皮肤还发红起泡，尿液颜色也变深了，这肯定让您非常焦虑和难受。别担心，我们会一起帮您解决。\n\n首先，这些皮疹和不适很可能是您正在吃的HIV药物引起的过敏反应，它不光影响皮肤，还让肝脏和肾脏有点吃不消，所以您感觉‘肝坏了’是有道理的。为了安全起见，我们必须立即停掉您目前的HIV药，换成另一种不会引起过敏的药，等皮肤好转后就开始新方案。同时，我会给您开些止痒药和消炎药，帮助您缓解瘙痒和皮肤发炎，让您能好好睡一觉。\n\n考虑到您的肝脏和肾脏有些损伤，加上有乙肝病史，我们建议您住院观察几天。这样，我们就能随时监测情况，防止问题加重——比如检查尿液和血液，确保肝脏在恢复，乙肝病毒不会活跃起来。住院时，护士也会帮您护理皮肤，减少抓挠带来的感染风险。另外，天气热容易出汗，您抓破皮肤会更疼，我们会用些药膏保护它。\n\n最后，我注意到您抽烟多年，这会影响身体恢复和药物效果。如果您能考虑减少或戒烟，对肝脏和整体健康都大有好处。有什么问题或担心，随时告诉我，我们一起慢慢聊。"
  }
]