[
  {
    "condition": "具有结核中毒症状（低热、乏力、盗汗、食欲减退、体重减轻等），或伴呼吸道症状者（咳嗽、咳痰2周以上，或伴咯血、痰中带血），或通过健康体检发现的肺部阴影疑似肺结核者",
    "action": "1. 进一步完善相关检查明确是否为肺结核; 2. 在门诊日志标注疑似肺结核病例; 3. 按乙类传染病疫情报告要求进行网络直报; 4. 完整填写《肺结核病例登记报告卡》; 5. 填写《肺结核患者转诊单》并及时转诊至县级以上结核病防治所或有条件诊治结核病的综合医院",
    "contraindication": null,
    "evidence": "具有结核中毒症状（低热、乏力、盗汗、食欲减退、体重减轻等），或伴呼吸道症状者（咳嗽、咳痰2周以上，或伴咯血、痰中带血），或通过健康体检发现的肺部阴影疑似肺结核者，应考虑为肺结核可疑者，需进一步完善相关检查明确是否为肺结核。"
  },
  {
    "condition": "符合下列条件之一者：1. 有肺结核可疑症状的5岁以下儿童，同时伴有与痰涂片阳性肺结核患者密切接触史或TST强阳性或IGRA阳性；2. 仅胸部影像学检查结果显示有与活动性肺结核相符的病变",
    "action": "1. 按乙类传染病疫情报告要求进行网络直报; 2. 完整填写《肺结核病例登记报告卡》; 3. 填写《肺结核患者转诊单》并及时转诊至县级以上结核病防治所或有条件诊治结核病的综合医院",
    "contraindication": null,
    "evidence": "疑似病例：符合下列条件之一者为疑似病例：① 有肺结核可疑症状的5岁以下儿童，同时伴有与痰涂片阳性肺结核患者密切接触史或TST强阳性或IGRA阳性；② 仅胸部影像学检查结果显示有与活动性肺结核相符的病变。"
  },
  {
    "condition": "符合下列条件之一者：1. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且伴有咳嗽、咳痰、咯血等肺结核可疑症状；2. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且TST强阳性；3. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且结核抗体检查阳性；4. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且肺外组织病理检查证实为结核病变；5. 痰涂片3次阴性的疑似肺结核病例，经诊断性治疗或随访观察可排除其他肺部疾病者；6. 支气管镜检查符合气管、支气管结核改变；7. 单侧或双侧胸腔积液，胸水检查提示渗出液，胸水ADA明显升高，伴有TST阳性或IGRA阳性",
    "action": "1. 开始抗结核治疗; 2. 按乙类传染病疫情报告要求进行网络直报; 3. 完整填写《肺结核病例登记报告卡》; 4. 填写《肺结核患者转诊单》并及时转诊至结核病定点医疗机构",
    "contraindication": null,
    "evidence": "临床诊断病例：符合下列条件之一者为临床诊断病例：① 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且伴有咳嗽、咳痰、咯血等肺结核可疑症状；② 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且TST强阳性；③ 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且结核抗体检查阳性；④ 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且肺外组织病理检查证实为结核病变；⑤ 痰涂片3次阴性的疑似肺结核病例，经诊断性治疗或随访观察可排除其他肺部疾病者；⑥ 支气管镜检查符合气管、支气管结核改变；⑦ 单侧或双侧胸腔积液，胸水检查提示渗出液，胸水ADA明显升高，伴有TST阳性或IGRA阳性。"
  },
  {
    "condition": "符合下列条件之一者：1. 痰涂片阳性肺结核（2份痰标本直接涂片抗酸杆菌镜检阳性；或1份痰标本直接涂片抗酸杆菌镜检阳性+肺部影像学检查符合活动性肺结核影像学表现；或1份痰标本直接涂片抗酸杆菌镜检阳性+1份痰标本结核菌培养阳性）；2. 仅培养阳性肺结核（痰涂片阴性，肺部影像学检查符合活动性肺结核影像学表现+1份痰标本结核菌培养阳性）；3. 肺部影像学检查符合活动性肺结核影像学表现，分子生物学检测阳性（如PCR、Xpert MTB/RIF）；4. 肺或胸膜病变标本病理学诊断为结核病变者",
    "action": "1. 立即开始标准抗结核化学治疗; 2. 按乙类传染病疫情报告要求进行网络直报; 3. 完整填写《肺结核病例登记报告卡》; 4. 在结核病定点医疗机构进行门诊或住院治疗",
    "contraindication": null,
    "evidence": "确诊病例：符合下列条件之一者为确诊病例：① 痰涂片阳性肺结核。符合下列3项之一者：a. 2份痰标本直接涂片抗酸杆菌镜检阳性；b. 1份痰标本直接涂片抗酸杆菌镜检阳性+肺部影像学检查符合活动性肺结核影像学表现；c. 1份痰标本直接涂片抗酸杆菌镜检阳性+1份痰标本结核菌培养阳性；② 仅培养阳性肺结核。同时符合下列2项者：a. 痰涂片阴性；b. 肺部影像学检查符合活动性肺结核影像学表现+1份痰标本结核菌培养阳性；③ 肺部影像学检查符合活动性肺结核影像学表现，分子生物学检测阳性（如PCR、Xpert MTB/RIF）；④ 肺或胸膜病变标本病理学诊断为结核病变者。"
  },
  {
    "condition": "存在较严重的合并症或并发症：大气道狭窄有窒息风险者；短时间内出现呼吸、循环系统衰竭症状及体征者；发生大咯血、生命体征不稳定者；或治疗中出现严重不良反应和脏器功能衰竭：急性肝衰竭、急性肾衰竭、严重皮肤过敏反应、严重骨髓抑制或明显出血倾向等",
    "action": "1. 立即进行紧急抢救; 2. 转到县级以上医院的传染科或结核病科积极抢救; 3. 待病情稳定后及时转诊到县结核病防治所或结核病定点医院继续治疗管理",
    "contraindication": null,
    "evidence": "紧急转诊建议：(1) 存在较严重的合并症或并发症：大气道狭窄有窒息风险者；短时间内出现呼吸、循环系统衰竭症状及体征者；发生大咯血、生命体征不稳定者；(2) 治疗中出现严重不良反应和脏器功能衰竭：急性肝衰竭、急性肾衰竭、严重皮肤过敏反应、严重骨髓抑制或明显出血倾向等。"
  },
  {
    "condition": "临床疑似肺结核者；直接涂片抗酸杆菌镜检阳性者；肺结核治疗过程中出现明显不良反应者；抗肺结核治疗效果不佳者",
    "action": "1. 填写《肺结核患者转诊单》，及时将患者转诊至县级以上结核病防治所或有条件诊治结核病的综合医院进行确诊或治疗; 2. 在非结核病定点医疗机构确诊的肺结核患者，转诊到当地结核病定点医疗机构进行门诊或住院治疗; 3. 在定点医疗机构确诊的肺结核患者，可在确诊机构治疗，或将患者转诊到其居住地定点医疗机构继续治疗",
    "contraindication": null,
    "evidence": "普通转诊建议：(1) 临床疑似肺结核者；(2) 直接涂片抗酸杆菌镜检阳性者；(3) 肺结核治疗过程中出现明显不良反应者；(4) 抗肺结核治疗效果不佳者。"
  },
  {
    "condition": "诊断为活动性肺结核",
    "action": "1. 遵循早期、规律、全程、适量、联合的治疗原则; 2. 整个治疗方案分强化期和巩固期两个阶段; 3. 化学治疗的主要作用为杀菌和灭菌、防止耐药菌产生、减少结核菌的传播",
    "contraindication": null,
    "evidence": "结核病化学治疗的基本原则是早期、规律、全程、适量、联合。整个治疗方案分强化期和巩固期两个阶段。化学治疗的主要作用为杀菌和灭菌、防止耐药菌产生、减少结核菌的传播。"
  },
  {
    "condition": "初治活动性肺结核（含痰涂片阳性和阴性）",
    "action": "1. 使用2HRZE/4HR方案：强化期使用异烟肼、利福平、吡嗪酰胺、乙胺丁醇，1次/d，共2个月；巩固期使用异烟肼、利福平1次/d，共4个月; 2. 若强化期第2个月末痰涂片仍阳性，强化方案可延长1个月，总疗程6个月不变; 3. 对粟粒型肺结核或结核性胸膜炎，强化期为3个月，巩固期6~9个月，总疗程9~12个月; 4. 在异烟肼高耐药地区，可选择2HRZE/4HRE方案",
    "contraindication": null,
    "evidence": "初治活动性肺结核（含痰涂片阳性和阴性）：通常选用2HRZE/4HR方案，即强化期使用异烟肼、利福平、吡嗪酰胺、乙胺丁醇，1次/d，共2个月；巩固期使用异烟肼、利福平1次/d，共4个月。若强化期第2个月末痰涂片仍阳性，强化方案可延长1个月，总疗程6个月不变。对粟粒型肺结核或结核性胸膜炎上述疗程可适当延长，强化期为3个月，巩固期6~9个月，总疗程9~12个月。在异烟肼高耐药地区，可选择2HRZE/4HRE方案。"
  },
  {
    "condition": "复治活动性肺结核（含痰涂片阳性和阴性）",
    "action": "1. 使用常用方案为2HRZSE/6HRE，3HRZE/6HR，或2HRZSE/1HRZE/5HRE; 2. 进行药敏试验; 3. 对上述方案治疗无效的复治肺结核，参考耐多药结核可能，按耐药或耐多药结核治疗",
    "contraindication": null,
    "evidence": "复治活动性肺结核（含痰涂片阳性和阴性）：常用方案为2HRZSE/6HRE，3HRZE/6HR，2HRZSE/1HRZE/5HRE。复治结核应进行药敏试验，对上述方案治疗无效的复治肺结核应参考耐多药结核可能，需按耐药或耐多药结核治疗。"
  },
  {
    "condition": "耐药结核和耐多药结核（对至少包括异烟肼和利福平在内的2种以上药物产生耐药）",
    "action": "1. 强化期包含至少5种有效抗结核药物：包括吡嗪酰胺及4个核心二线抗结核药物（A组1个：氟喹诺酮类如高剂量左氧氟沙星≥750 mg/d、莫西沙星或加替沙星；B组1个：二线注射类药物如阿米卡星、卷曲霉素、卡那霉素或链霉素；C组2个：其他二线核心药物如乙硫异烟胺或丙硫异烟胺、环丝氨酸或特立齐酮、利奈唑胺和氯法齐明）; 2. 如果以上选择不能组成有效方案，加入1种D2组药物（贝达喹啉或德拉马尼），再从D3组选择其他有效药物（对氨基水杨酸、亚胺培南西司他丁、美罗培南、阿莫西林克拉维酸、氨硫脲）; 3. 组成含5种有效抗结核药物的方案",
    "contraindication": null,
    "evidence": "耐药结核和耐多药结核：对至少包括异烟肼和利福平在内的2种以上药物产生耐药的结核为耐多药结核（multi-drug resistance tuberculosis, MDR-TB）。WHO根据药物的有效性和安全性将治疗耐药结核的药物分为A、B、C、D 4组，其中A、B、C组为核心二线药物，D组为非核心的附加药物。A组：氟喹诺酮类，包括高剂量左氧氟沙星（≥750 mg/d）、莫西沙星及加替沙星；B组：二线注射类药物，包括阿米卡星、卷曲霉素、卡那霉素、链霉素；C组：其他二线核心药物，包括乙硫异烟胺（或丙硫异烟胺）、环丝氨酸（或特立齐酮）、利奈唑胺和氯法齐明；D组：可以添加的药物，但不能作为MDR-TB治疗的核心药物，分为3个亚类：D1组包括吡嗪酰胺、乙胺丁醇和高剂量异烟肼；D2组包括贝达喹啉和德拉马尼；D3组包括对氨基水杨酸、亚胺培南西司他丁、美罗培南、阿莫西林克拉维酸、氨硫脲。注：耐药结核治疗的强化期应包含至少5种有效抗结核药物，包括吡嗪酰胺及4个核心二线抗结核药物：A组1个，B组1个，C组2个。如果以上的选择仍不能组成有效方案，可以加入1种D2组药物，再从D3组选择其他有效药物，从而组成含5种有效抗结核药物的方案。"
  },
  {
    "condition": "药物治疗失败或威胁生命的单侧肺结核特别是局限性病变",
    "action": "1. 考虑外科治疗作为可选用的重要治疗方法",
    "contraindication": null,
    "evidence": "对于药物治疗失败或威胁生命的单侧肺结核特别是局限性病变，外科治疗是可选用的重要治疗方法。"
  },
  {
    "condition": "肺结核所致发热",
    "action": "1. 有效抗结核治疗后大多在1周内消退; 2. 少数发热不退者应用小剂量非类固醇类退热剂，如布洛芬; 3. 急性血行播散性肺结核或伴有高热等严重毒性症状或高热持续不退者，在抗结核药物治疗基础上使用类固醇糖皮质激素，一般每日20~30 mg泼尼松",
    "contraindication": "必须在充分有效抗结核药物的前提下使用糖皮质激素，否则可能禁忌",
    "evidence": "发热：有效抗结核治疗后肺结核所致的发热大多在1周内消退，少数发热不退者可应用小剂量非类固醇类退热剂，如布洛芬。急性血行播散性肺结核或伴有高热等严重毒性症状或高热持续不退者，可在抗结核药物治疗基础上使用类固醇糖皮质激素，一般每日20~30 mg泼尼松。糖皮质激素可能有助于改善症状，但必须在充分有效抗结核药物的前提下使用。"
  },
  {
    "condition": "肺结核所致咯血（少量或大咯血）",
    "action": "1. 少量咯血时以安慰和消除紧张情绪、卧床休息为主，可用氨基己酸、凝血酶、卡洛磺等药物止血; 2. 大咯血时迅速畅通气道，包括体位引流、负压吸引、气管插管; 3. 使用垂体后叶素8~10 U缓脉静脉推注（血压正常者可使用酚妥拉明10~20 mg加入生理盐水250 ml中缓慢静脉滴注）; 4. 对于药物难以控制的大咯血，在保证气道通畅的情况下紧急转诊至有条件的专科或综合医院进行手术治疗或支气管动脉栓塞术",
    "contraindication": null,
    "evidence": "咯血：少量咯血时多以安慰和消除紧张情绪、卧床休息为主，可用氨基己酸、凝血酶、卡洛磺等药物止血。大咯血可危及生命，应特别警惕和尽早发现窒息先兆征象。迅速畅通气道是抢救大咯血窒息的首要措施，包括体位引流、负压吸引、气管插管。大咯血者可使用垂体后叶素8~10 U缓脉静脉推注，血压正常者可使用酚妥拉明10~20 mg加入生理盐水250 ml中缓慢静脉滴注。对于药物难以控制的大咯血，在保证气道通畅的情况下应紧急转诊至有条件的专科或综合医院进行手术治疗或支气管动脉栓塞术。"
  },
  {
    "condition": "气管支气管结核导致叶及叶以上支气管明显狭窄，影响呼吸功能或导致呼吸衰竭",
    "action": "1. 在全身抗结核化学治疗基础上; 2. 同时给予冷冻、球囊扩张等气道介入治疗",
    "contraindication": null,
    "evidence": "气管支气管结核所致气道狭窄：气管支气管结核导致叶及叶以上支气管明显狭窄时常影响患者呼吸功能，严重者有呼吸衰竭，需在全身抗结核化学治疗基础上，同时给予冷冻、球囊扩张等气道介入治疗。"
  },
  {
    "condition": "肺结核患者完成治疗后",
    "action": "1. 根据疗效判断标准评估：治愈（痰涂片阳性肺结核患者完成规定疗程，连续2次痰涂片结果阴性，其中1次是治疗末）；完成疗程（痰涂片阴性肺结核患者完成规定的6个月标准疗程，疗程末痰涂片检查结果阴性或未痰检者；痰涂片阳性肺结核患者完成规定的6-12个月疗程，最近一次痰检结果阴性，完成疗程时无痰检结果）；结核死亡（活动性肺结核患者因病变进展或并发咯血、自发性气胸、肺心病、全身衰竭或肺外结核等原因死亡）；非结核死亡（结核病患者因结核病以外的原因死亡）；失败（痰涂片阳性肺结核患者治疗至第6个月末或疗程结束时痰涂片检查仍阳性）；丢失（肺结核患者在治疗过程中中断治疗超过2个月，或由结核病防治机构转出后，虽经医生努力追访，2个月内仍无信息或已在其他地区重新登记）",
    "contraindication": null,
    "evidence": "疗效判断标准如下：(1) 治愈：痰涂片阳性肺结核患者完成规定疗程，连续2次痰涂片结果阴性，其中1次是治疗末；(2) 完成疗程：痰涂片阴性肺结核患者完成规定的6个月标准疗程，疗程末痰涂片检查结果阴性或未痰检者；痰涂片阳性肺结核患者完成规定的6-12个月疗程，最近一次痰检结果阴性，完成疗程时无痰检结果；(3) 结核死亡：活动性肺结核患者因病变进展或并发咯血、自发性气胸、肺心病、全身衰竭或肺外结核等原因死亡；(4) 非结核死亡：结核病患者因结核病以外的原因死亡；(5) 失败：痰涂片阳性肺结核患者治疗至第6个月末或疗程结束时痰涂片检查仍阳性；(6) 丢失：肺结核患者在治疗过程中中断治疗超过2个月，或由结核病防治机构转出后，虽经医生努力追访，2个月内仍无信息或已在其他地区重新登记。"
  },
  {
    "condition": "高危人群：HIV感染者、痰涂片阳性肺结核的密切接触者、肺部硬结纤维病灶（无活动性）、矽肺、糖尿病、长期使用糖皮质激素或免疫抑制剂者、吸毒者、营养不良者、35岁以下结核菌素试验硬结直径≥15 mm者等",
    "action": "1. 使用预防性抗结核化学治疗; 2. 常用异烟肼300 mg/d，顿服6-8个月，儿童每日用量为4~8 mg/kg；或者利福平和异烟肼联用3个月，每日顿服或每周3次",
    "contraindication": null,
    "evidence": "高危人群使用预防性抗结核治疗可减少肺结核发病率。预防性化学治疗主要应用于受结核菌感染易发病的高危人群。包括HIV感染者、痰涂片阳性肺结核的密切接触者、肺部硬结纤维病灶（无活动性）、矽肺、糖尿病、长期使用糖皮质激素或免疫抑制剂者、吸毒者、营养不良者、35岁以下结核菌素试验硬结直径≥15 mm者等。常用异烟肼300 mg/d，顿服6-8个月，儿童每日用量为4~8 mg/kg；或者利福平和异烟肼联用3个月，每日顿服或每周3次。"
  },
  {
    "condition": "肺结核患者在治疗过程中",
    "action": "1. 每次用药都必须在医务人员的直接监督下进行; 2. 因故未用药时必须采取补救措施以保证按医嘱规律用药",
    "contraindication": null,
    "evidence": "直接面视下短程督导治疗：直接面视下短程督导治疗是指肺结核患者在治疗过程中，每次用药都必须在医务人员的直接监督下进行，因故未用药时必须采取补救措施以保证按医嘱规律用药。督导治疗可以提高治疗依从性，保证规律用药，从而显著提高治愈率，降低复发率和死亡率，同时降低结核病的患病率和多耐药发生率。"
  }
]