[
  {
    "id": 1570,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "58岁男性，既往高血压、2型糖尿病，因“发热6天、进行性呼吸困难2天”由120送至急诊。入院时T 38.9 ℃，SpO₂ 82%（鼻导管6 L/min），RR 34次/分，BP 148/92 mmHg，HR 122次/分。神志淡漠，唇绀，双肺叩诊浊音，听诊可及双下肺湿啰音。血气（FiO₂ 0.5）：pH 7.28，PaO₂ 56 mmHg，PaCO₂ 48 mmHg，Lac 3.4 mmol/L，BE –6.5 mmol/L。血常规：WBC 15.2×10⁹/L，NE% 89%，LY% 8%，Hb 132 g/L，PLT 188×10⁹/L；CRP 186 mg/L，PCT 1.8 ng/mL；IL-6 258 pg/mL。胸部CT：双肺多发磨玻璃影伴实变，累及>75%肺野，可见“白肺”趋势。新冠核酸阳性（ORF1ab 与 N 基因 Ct 值 18）。患者自述曾在菜市场工作，近两周市场出现聚集性发热病人。今日凌晨起尿量明显减少，色深。无胸痛、无下肢水肿，无咯血。家属焦急，反复询问“能不能先给点口服药回家观察”。",
    "reference_rule": {
      "condition": "危重型病例",
      "action": "应当尽早收入ICU治疗。",
      "contraindication": null,
      "evidence": "危重型病例应当尽早收入ICU治疗。"
    },
    "thought": "本案例属于常规急诊诊疗场景，重点关注快速识别危及生命的状况并给出直接治疗指令。Step 1: 场景定义 – 患者因急性呼吸衰竭就诊急诊，需优先排除并处理致命性病因（如重症肺炎、脓毒症）。Step 2: 临床解码 – 关键线索包括：① 低氧血症（SpO₂ 82%）、呼吸窘迫（RR 34次/分）和酸中毒（pH 7.28, Lac 3.4 mmol/L, BE –6.5 mmol/L）提示呼吸衰竭与组织灌注不足；② 炎症标志物升高（WBC 15.2×10⁹/L, CRP 186 mg/L, PCT 1.8 ng/mL, IL-6 258 pg/mL）和影像学‘白肺’（双肺>75%受累）支持重症病毒性肺炎（新冠核酸阳性）；③ 尿量减少伴色深暗示急性肾损伤风险；④ 菜市场暴露史强化新冠聚集传播诊断；⑤ 神志淡漠和生命体征不稳符合脓毒症标准。Step 3: 规则对齐与安全检查 – 解码结果完全匹配指南 Condition ‘危重型病例’（严重低氧、多器官功能障碍），无 Contraindication（指南标注 null），安全无冲突（如无药物过敏史）。Step 4: 决策生成 – 根据指南 Action ‘应当尽早收入ICU治疗’，决策为立即转ICU，启动呼吸支持、抗病毒及器官功能维护。",
    "medical_order": "1. 立即转ICU，予重症监护一级护理。2. 呼吸支持：升级氧疗至经鼻高流量湿化氧疗（HFNC，FiO₂ 0.6，流速 50 L/min），30分钟后复查血气；若PaO₂/FiO₂ <150 mmHg，准备无创通气。3. 抗感染治疗：静脉滴注瑞德西韦 200 mg 负荷量，后100 mg q24h ×5天（新冠重症标准方案）；暂不予抗生素，监测继发细菌感染证据。4. 循环支持：快速补液（生理盐水500 mL bolus），监测尿量；若MAP <65 mmHg，予去甲肾上腺素静脉泵入，起始剂量0.05 μg/kg/min。5. 监测：每小时记录生命体征、尿量；急查肾功能、肝酶、心肌酶、D-二聚体；床旁超声评估心功能及肺水肿。6. 基础病管理：继续原降压及降糖方案，监测血糖 q4h。7. 隔离措施：单间负压病房，标准防护。",
    "patient_dialogue": "大哥、家属，我是负责的医生。现在情况非常紧急，我得跟你们说实话：病人的肺损伤很重，片子显示大片变白，像被水淹了一样，自己呼吸非常困难，血氧很低，这样下去会有生命危险。菜市场那些发热的人很可能传染了新冠病毒，而且已经影响到肾脏，小便变少就是信号。我知道你们很着急，想带药回家，但这绝对不行——在家没设备救命，几分钟就可能恶化。我们现在必须送进重症监护室（ICU），那里有专门的机器帮助呼吸，24小时盯着心跳血压，还有特效药对抗病毒。别担心费用或手续，救命第一，我们团队会全力救治。请签字同意马上转ICU，有任何问题我随时解释，但一分钟都不能耽误！"
  },
  {
    "id": 1562,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者昨日突发高热39.4 ℃伴干咳，今晨出现活动后气短，自行步行至发热门诊。查体：SpO₂ 88%（未吸氧），RR 28次/分，双肺听诊可闻及散在湿啰音。既往高血压10年，否认糖尿病。胸部CT示双肺外周磨玻璃影，累及>50%肺野。咽拭子2019-nCoV核酸阳性。患者焦虑询问“是不是得住院”，同时抱怨“今天雾大，眼镜老起雾看不清路”。",
    "reference_rule": {
      "condition": "重型患者",
      "action": "应当接受鼻导管或面罩吸氧，并及时评估呼吸窘迫和（或）低氧血症是否缓解。",
      "contraindication": null,
      "evidence": "重型患者应当接受鼻导管或面罩吸氧，并及时评估呼吸窘迫和（或）低氧血症是否缓解。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规急诊/门诊诊疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如排除COVID-19相关急性呼吸窘迫综合征或其他危急重症），并基于临床证据给出最直接的治疗指令，避免延误。\nStep 2: 临床解码 (Clinical Decoding) - 关键信息包括：高热39.4 ℃和干咳提示急性呼吸道感染；SpO₂ 88%（未吸氧）和RR 28次/分表明严重低氧血症和呼吸窘迫；双肺湿啰音及胸部CT显示双肺外周磨玻璃影>50%肺野，结合2019-nCoV核酸阳性，确诊为COVID-19肺炎（重型）；活动后气短虽可自行步行但提示功能受限；隐式线索如既往高血压10年增加心血管并发症风险，患者焦虑和眼镜起雾抱怨反映其不适和心理状态，需在决策中兼顾安抚。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为'重型患者'，患者指标（SpO₂ <93%、呼吸急促、CT肺野受累>50%）完全匹配；Contraindication为null，无禁忌症，行动安全。\nStep 4: 决策生成 (Decision Making) - 根据指南Action，必须立即实施吸氧治疗以缓解低氧血症，并评估效果；鉴于病情严重，需住院管理，同时完善相关检查以监测进展。",
    "medical_order": "予一级护理，鼻导管吸氧（起始流量5L/min），持续监测SpO₂、呼吸频率及生命体征。完善血气分析、血常规、生化全项及C-反应蛋白检查。评估低氧血症缓解情况，必要时升级面罩吸氧。立即隔离并转住院病房，予抗病毒治疗（如奈玛特韦/利托那韦）及支持治疗。监测高血压控制，予降压药物维持。",
    "patient_dialogue": "王先生，您的情况我仔细看过了——您感染了新冠病毒，肺部有炎症，这导致了发烧和呼吸困难。现在血氧有点低，只有88%，这就像身体在说'我缺氧了'，所以得立马给您戴上氧气面罩，帮助您呼吸更轻松。我们会观察一会儿，看看效果如何。是的，您需要住院治疗，因为在家没法保证安全监测：万一呼吸变困难了，我们能第一时间处理。别担心，我们会全程陪护。至于眼镜起雾，这天气确实烦人，我让护士帮您擦擦，或者给您找个防雾喷雾。深呼吸，放松点，我们会帮您度过这一关的。"
  },
  {
    "id": 1551,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者38岁女性，超市收银员，昨日开始出现38.7 ℃发热、干咳，伴明显乏力，无呼吸困难。查体：咽部充血，双肺听诊未闻及干湿啰音；SpO₂ 97%（未吸氧）。血常规：WBC 5.2×10⁹/L，LY 0.9×10⁹/L，CRP 16 mg/L。胸片示右下肺外周淡薄斑片影。甲型/乙型流感抗原、肺炎支原体IgM、呼吸道合胞病毒核酸检测均阳性。追问流行病学史：其丈夫2周前确诊新冠肺炎，目前仍在定点医院治疗，患者一直居家陪护，期间仅佩戴一次性医用口罩。患者诉“最近天气忽冷忽热，可能受凉”，要求开普通抗生素和退烧药尽快返岗。",
    "reference_rule": {
      "condition": "与新型冠状病毒感染者有密切接触的患者，即便常见呼吸道病原检测阳性",
      "action": "建议及时进行新型冠状病毒病原学检测。",
      "contraindication": null,
      "evidence": "与新型冠状病毒感染者有密切接触的患者，即便常见呼吸道病原检测阳性，也建议及时进行新型冠状病毒病原学检测。"
    },
    "thought": {
      "step1": "本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我将快速建立鉴别诊断（优先排除危急重症如急性呼吸窘迫综合征或脓毒症），并给出直接指令以高效处理患者诉求。",
      "step2": "临床解码：患者38岁女性，出现急性呼吸道感染症状（发热38.7℃、干咳、乏力），胸片右下肺外周淡薄斑片影提示社区获得性肺炎可能；实验室检查显示淋巴细胞减少（LY 0.9×10⁹/L）和CRP轻度升高（16 mg/L），暗示炎症反应；多种常见呼吸道病原检测阳性（甲型/乙型流感、肺炎支原体IgM、呼吸道合胞病毒）提示混合感染风险；关键隐式线索：流行病学史中与新冠肺炎确诊丈夫密切接触（居家陪护14天，仅戴一次性口罩），暴露风险高；无呼吸困难、SpO₂正常（97%）排除急性呼吸衰竭。患者诉求返岗，但需警惕潜在新冠肺炎。",
      "step3": "规则对齐与安全检查：指南condition为'与新型冠状病毒感染者有密切接触的患者，即便常见呼吸道病原检测阳性'，与本例完全匹配（患者丈夫确诊新冠肺炎，密切接触史明确）；action要求'建议及时进行新型冠状病毒病原学检测'；contraindication为null，无禁忌症。强制检查确认：患者无药物过敏或基础疾病禁忌，可安全执行检测。",
      "step4": "决策生成：基于指南action，首要决策是立即安排新型冠状病毒病原学检测；同时，排除危急重症（生命体征稳定），给予对症支持治疗，并强调隔离以防止潜在传播。最终方案：核酸采样、对症处理、居家隔离指导。"
    },
    "medical_order": "1. 立即行新型冠状病毒核酸检测（RT-PCR）。2. 予对症治疗：布洛芬400mg口服q8h prn发热（体温≥38.5℃）；多饮水，监测体温及SpO₂ qid。3. 建议居家隔离14天，避免外出及接触他人。4. 完善血生化、肝肾功能检查；若症状加重（如呼吸困难、SpO₂<94%），急诊复诊评估。5. 暂不予抗生素，待病原学结果明确。",
    "patient_dialogue": "王女士，我看您有发烧、咳嗽，还觉得累，这些症状确实不舒服。检查发现您肺部有小片阴影，还有好几种常见的感冒病毒阳性。但关键是，您丈夫确诊了新冠肺炎，您在家照顾他时虽然戴了口罩，还是有很高感染风险。所以，我们必须先做个新冠检测——这是最要紧的，因为万一感染了，不及时处理可能传染给同事或家人。我会给您开点退烧药，比如布洛芬，发烧超过38度5时就吃一片，多喝水休息。但您绝对不能上班了，得在家隔离两周，别出门，也别接触其他人。这样既保护自己，也保护大家。如果感觉更难受了，比如喘不上气或指氧下降，马上来医院复查。咱们等检测结果出来再决定要不要用抗生素。"
  },
  {
    "id": 1559,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "42岁男性，建筑工人，因“发热4天、干咳2天、胸闷1天”由工地医务室送至急诊。体温38.9℃，呼吸24次/分，SpO₂ 92%（未吸氧），血压118/76 mmHg，心率102次/分。胸部CT示双肺外周磨玻璃影，呈多发斑片状。血常规：白细胞4.1×10⁹/L，淋巴细胞0.9×10⁹/L；CRP 28 mg/L。患者自述近一周乏力明显，食欲下降，昨日仅进食半碗粥，尿量略少、色深。既往体健，无慢性病史，不吸烟，偶饮酒。今日凌晨留观后，患者仍感活动后气短，需协助如厕。护士记录24 h入量1100 ml，尿量900 ml。夜班医生查房时，患者轻声询问能否自己下楼买饭。",
    "reference_rule": {
      "condition": "患者（一般治疗）",
      "action": "1. 卧床休息，加强支持治疗，保证充分热量；2. 注意水、电解质平衡，维持内环境稳定；3. 密切监测生命体征、指氧饱和度等。",
      "contraindication": null,
      "evidence": "卧床休息，加强支持治疗，保证充分热量；注意水、电解质平衡，维持内环境稳定；密切监测生命体征、指氧饱和度等。"
    },
    "thought": "本案例属于常规急诊诊疗场景（常规诊断与治疗），关注重点是快速建立鉴别诊断（如社区获得性肺炎、病毒性感染如COVID-19），排除危急重症（如呼吸衰竭），并给出直接治疗指令。临床解码：患者42岁男性，急性起病，表现为发热、干咳、胸闷，结合体征（体温升高、呼吸急促24次/分、SpO₂ 92%提示低氧血症、心动过速102次/分）和影像学（胸部CT双肺外周磨玻璃影，多发斑片状，符合病毒性肺炎特征）及实验室结果（白细胞正常偏低、淋巴细胞减少、CRP升高），提示病毒性感染可能性大（如COVID-19）。隐式线索包括脱水风险（24小时入量仅1100ml，尿量900ml色深，食欲下降）、活动耐力差（需协助如厕），需警惕低氧恶化。规则对齐与安全检查：指南Condition为“患者一般治疗”，Action包括卧床休息、支持治疗、水电解质平衡、监测生命体征，无Contraindication，完全对齐患者当前状态（虚弱、营养不足）。决策生成：基于指南Action，优先实施卧床休息、补液营养支持、氧疗和严密监测，同时完善必要检查以排除其他病因。",
    "medical_order": "1. 予一级护理，绝对卧床休息。2. 静脉补液：0.9%氯化钠注射液500ml静脉滴注，目标入量1500-2000ml/24h，监测出入量；营养支持：予肠内营养液或静脉营养，保证热量1500kcal/24h。3. 氧疗：鼻导管吸氧2-4L/min，目标SpO₂≥95%；密切监测生命体征：每1小时测体温、心率、呼吸、血压、SpO₂。4. 完善血生化（电解质、肝肾功能）、动脉血气分析、病毒检测（如SARS-CoV-2 PCR）及痰培养。",
    "patient_dialogue": "王先生，我理解您想自己下楼买饭，但现在您身体很虚弱，走路后气短明显，必须好好躺在床上休息。如果活动太多，可能会让呼吸更困难，加重病情。我们会给您输液补充水分和营养，帮助您恢复力气——您这两天吃得少，身体需要能量来对抗感染。同时，我们会给您吸点氧气，并在您手指上放个小夹子监测氧气水平，这样能确保您安全。有任何不舒服，随时按铃叫护士，千万别下床走动。"
  },
  {
    "id": 1574,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者第5天午后仍低热37.6℃，干咳无痰，SpO₂ 94%（鼻导管2 L/min）。既往每日胰岛素皮下注射，COPD稳定期吸入噻托溴铵。今晨查房时家属出示外院门诊病历：3天前因“预防细菌感染”予左氧氟沙星0.5 g qd + 头孢哌酮-舒巴坦3 g q8h联合静滴，已用2日。患者自述无咽痛、无黄脓痰，查体双肺仍可闻散在细湿啰音；血常规：WBC 7.8×10⁹/L，中性粒细胞百分比72%，CRP 18 mg/L，PCT 0.12 ng/mL；肝肾功能正常。家属追问：“抗生素要不要继续打满7天，免得转重症？”护士小声提醒“今天输液只剩最后一组头孢，药房说库存紧张”。窗外正下雪，病房空调故障导致室温偏低，患者裹了两层被子仍觉畏寒。",
    "reference_rule": {
      "condition": "患者（抗菌药物治疗）",
      "action": "避免盲目或不恰当使用抗菌药物，尤其是联合使用广谱抗菌药物。",
      "contraindication": null,
      "evidence": "避免盲目或不恰当使用抗菌药物，尤其是联合使用广谱抗菌药物。"
    },
    "thought": "本案例属于复杂合并症治疗场景，作为专科专家，我将重点关注全网扫描药物相互作用、禁忌症及共病风险，优先确保安全再考虑疗效。Step 1: 场景定义——患者有糖尿病（需胰岛素治疗）和COPD（稳定期使用噻托溴铵），当前出现呼吸道症状（低热、干咳、湿啰音），并已接受广谱抗菌药物联合治疗，这涉及多系统疾病交互，需评估药物安全性和共病影响。Step 2: 临床解码——关键信息包括：体温37.6℃示低热状态；SpO₂ 94%示轻度低氧血症；干咳无痰、无咽痛示非典型感染可能；双肺细湿啰音示肺部渗出；血常规WBC正常、中性粒细胞轻度升高、CRP轻度升高、PCT正常上限示炎症但无明确细菌感染证据；肝肾功能正常；外院予左氧氟沙星（氟喹诺酮类）和头孢哌酮-舒巴坦（β-内酰胺类）联合用于“预防”，属不恰当广谱覆盖，已用2日；环境低温可能加剧COPD症状。隐式线索：抗生素使用缺乏指征，增加耐药风险、抗生素相关腹泻或低血糖（糖尿病）；家属焦虑转重症；药房库存紧张提示资源限制。Step 3: 规则对齐与安全检查——指南Condition为‘避免盲目或不恰当使用抗菌药物，尤其是联合使用广谱抗菌药物’，患者情况完全匹配：联合广谱抗生素用于预防而非治疗，且无细菌感染证据（PCT<0.5 ng/mL、无脓痰）。Contraindication为null，但强制安全检查发现：左氧氟沙星与胰岛素无直接相互作用，但喹诺酮类可致QT延长；头孢哌酮-舒巴坦在COPD中可能增加呼吸道菌群失调风险；糖尿病增加药物代谢异常可能；环境低温可能触发COPD急性加重。Step 4: 决策生成——基于指南Action，立即停用不恰当抗菌药物，避免进一步风险；优先评估感染状态和症状管理，确保安全后考虑支持治疗。",
    "medical_order": "予停用左氧氟沙星及头孢哌酮-舒巴坦；监测体温、SpO₂、血压q4h；完善胸部X线检查评估肺部渗出；维持鼻导管氧疗2 L/min；加强环境温度管理，予保暖措施；教育患者及家属感染监测要点；若症状加重，予复查血常规、CRP、PCT。",
    "patient_dialogue": "您好，我理解您担心抗生素打满7天能预防转重症，但咱们先别急。目前检查显示，您的炎症指标没有明显细菌感染的证据，比如没有黄脓痰，血检结果也还好。继续用那两种抗生素反而可能带来副作用，比如肠胃不适或增加耐药风险，对您的糖尿病和肺病都不太安全。所以，我建议今天就停掉输液，咱们改用更安全的方法：我会让护士帮您保暖，毕竟这天冷，容易让您的肺不舒服；同时，咱们密切观察体温和呼吸，如果咳嗽加重或发烧了，再及时处理。别担心，我们会全程盯着，确保您没事的。"
  },
  {
    "id": 1573,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "58岁女性，因‘发热5天、干咳伴乏力’由社区转来。体温38.4℃，呼吸22次/分，SpO₂ 93%（未吸氧）。胸片示双肺外周磨玻璃影，血常规淋巴细胞0.8×10⁹/L，CRP 42 mg/L。2天前咽拭子2019-nCoV核酸阳性，按试行第五版已收入隔离病房。患者诉近2日水样便3次/日，无脓血；既往2型糖尿病史，平素服二甲双胍。查体：腹平软，肠鸣音活跃。今日查房，患者低声询问：‘医生，我拉肚子会不会把好的细菌都拉没了？’窗外暴雨，急诊广播正在呼叫120下一批待检患者。",
    "reference_rule": {
      "condition": "患者",
      "action": "可使用肠道微生态调节剂，维持肠道微生态平衡，预防继发细菌感染。",
      "contraindication": null,
      "evidence": "可使用肠道微生态调节剂，维持肠道微生态平衡，预防继发细菌感染；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，具体为急诊/门诊环境下的COVID-19管理。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（排除如脱水、电解质紊乱或继发感染等危急重症），并基于患者当前主诉（腹泻）给出最直接的治疗指令。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：58岁女性，COVID-19确诊（胸片磨玻璃影、淋巴细胞减少、CRP升高），新发急性腹泻（水样便3次/日，无脓血，肠鸣音活跃），可能为病毒性肠炎或二甲双胍副作用；隐式线索包括SpO₂ 93%提示轻度低氧但稳定，无脱水体征（腹平软），糖尿病史增加感染风险。解码为：COVID-19相关非炎症性腹泻，需预防微生态失衡和继发细菌感染。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为‘患者’，广泛覆盖此场景；Action建议使用肠道微生态调节剂。Contraindication为null，无绝对禁忌。强制安全检查：患者无过敏史、无免疫缺陷，糖尿病和二甲双胍使用不影响微生态调节剂安全性（无药物相互作用）。\n\nStep 4: 决策生成 (Decision Making) - 基于指南Action，生成核心决策：添加肠道微生态调节剂以维持微生态平衡，预防继发感染。同时，需监测腹泻进展和基础病管理，但重点在直接应对患者主诉。",
    "medical_order": "1. 予口服双歧杆菌三联活菌胶囊 420mg tid，维持肠道微生态平衡，预防继发细菌感染。2. 监测腹泻频率、大便性状及脱水征象（每日记录出入量）。3. 继续COVID-19隔离治疗及一级护理，监测体温、SpO₂。4. 维持二甲双胍 500mg bid 口服，监测血糖 q6h。5. 完善便常规及培养（若腹泻持续），必要时补液支持。",
    "patient_dialogue": "张阿姨，别担心拉肚子会把好细菌都拉没了——您这么想很细心！腹泻是病毒感染常见的症状，不是细菌都流失了，而是肠道里的好细菌暂时乱了。我们可以用益生菌帮您补回来，就像给花园添点好种子，这样能预防其他感染。您现在每天拉3次，不算太严重，但咱们得注意别脱水，多喝点温盐水或稀饭汤。另外，您的糖尿病药继续按时吃，我让护士帮您测血糖。外面雨大急诊忙，您安心休息，有任何不舒服随时叫我，好吗？"
  },
  {
    "id": 1582,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者52岁，建筑工人，昨日收工后突觉畏寒，自测体温38.7 ℃，夜间升至39.4 ℃，今晨仍波动于38.2–39.1 ℃之间，伴明显咳嗽，痰量不多、色黄黏稠，自觉胸口被重物压迫，稍走几步便喘不上气。两天未解大便，腹胀明显，按压时嗳气酸腐。无基础慢病史，否认吸烟饮酒。查体：T 38.9 ℃，RR 28 次/分，SpO₂ 92%（未吸氧），双肺叩诊浊音，右下肺闻及细湿啰音；心腹（-）。舌红、苔黄厚腻中部偏燥，脉滑数。胸部CT示双肺多发磨玻璃影伴局部实变，右下肺为著，呈「白肺」趋势。实验室：WBC 9.8×10⁹/L，LY% 18%，CRP 87 mg/L，IL-6 42 pg/mL，SARS-CoV-2 核酸阳性。患者焦急询问「是不是转成重症了？还能不能回家吃药？」",
    "reference_rule": {
      "condition": "临床治疗期中期：疫毒闭肺，临床表现：身热不退或往来寒热，咳嗽痰少，或有黄痰，腹胀便秘。胸闷气促，咳嗽喘憋，动则气喘。舌质红，苔黄腻或黄燥，脉滑数。",
      "action": "1. 推荐处方：杏仁10g、生石膏30g、瓜蒌30g、生大黄6g（后下）、生炙麻黄各6g、葶苈子10g、桃仁10g、草果6g、槟郎10g、苍术10g; 2. 推荐中成药：喜炎平注射剂，血必净注射剂。",
      "contraindication": null,
      "evidence": "（2）中期：疫毒闭肺\n    * 临床表现：身热不退或往来寒热，咳嗽痰少，或有黄痰，腹胀便秘。胸闷气促，咳嗽喘憋，动则气喘。舌质红，苔黄腻或黄燥，脉滑数。\n    * 推荐处方：杏仁10g、生石膏30g、瓜蒌30g、生大黄6g（后下）、生炙麻黄各6g、葶苈子10g、桃仁10g、草果6g、槟郎10g、苍术10g\n    * 推荐中成药：喜炎平注射剂，血必净注射剂"
    },
    "thought": "本案例属于常规急诊诊疗场景（Step 1: 场景定义）。作为急诊医生，我的关注重点是快速建立鉴别诊断（排除危急重症如呼吸衰竭或脓毒症）并给出直接治疗指令。患者表现为急性发热、咳嗽伴黄痰、气促（RR 28/min, SpO₂ 92%）、腹胀便秘，结合CT显示双肺多发磨玻璃影伴实变（‘白肺’趋势）和SARS-CoV-2核酸阳性，提示COVID-19相关肺炎（Step 2: 临床解码）。关键隐式线索包括：低氧血症（SpO₂ 92%未吸氧）提示呼吸窘迫风险；淋巴细胞减少（LY% 18%）和炎症标志物升高（CRP 87 mg/L, IL-6 42 pg/mL）支持重症倾向；舌脉（舌红苔黄厚腻，脉滑数）符合中医热证实证。对比指南condition‘疫毒闭肺’（身热不退、咳嗽黄痰、腹胀便秘、胸闷气促、舌红苔黄腻、脉滑数），患者症状高度匹配（Step 3: 规则对齐与安全检查）。指南无禁忌症（contraindication null），安全检查确认无药物过敏史或基础病冲突。基于指南action，决策为立即启动中药处方和中成药注射治疗，并加氧疗支持（Step 4: 决策生成）。",
    "medical_order": "诊断：COVID-19肺炎（重症倾向），中医证型：疫毒闭肺。予一级护理，心电监护；吸氧（目标SpO₂ >95%）；完善动脉血气分析、肝肾功能检查。治疗：1. 中药处方：杏仁10g、生石膏30g、瓜蒌30g、生大黄6g（后下）、生炙麻黄各6g、葶苈子10g、桃仁10g、草果6g、槟郎10g、苍术10g，水煎服，日一剂。2. 中成药：喜炎平注射剂 250mg 静脉滴注，日一次；血必净注射剂 100ml 静脉滴注，日一次。3. 对症支持：物理降温，鼓励多饮水；必要时补液。",
    "patient_dialogue": "张师傅，我看您挺担心的，咱们慢慢说。首先，您这情况是新冠病毒引起的肺炎，目前有点严重了，因为CT显示肺部有炎症，而且您喘气困难、体温高，血氧也偏低（正常是95%以上）。所以啊，今天不能回家吃药了，必须住院治疗几天——这能防止病情加重，也能更快帮您恢复。治疗方案呢，我们会给您吸氧来改善呼吸，同时用中药汤剂帮助清热解毒、化痰通便，还有两种注射剂来消炎。您别急，这些措施都是针对您的症状来的，比如中药里的生大黄能通大便、缓解腹胀，注射剂能快速控制炎症。住院期间，我们会随时监测您的体温和呼吸，您配合多喝水、尽量休息。有什么不舒服随时告诉我，咱们一起努力把病治好。"
  },
  {
    "id": 1580,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者10天前从武汉东西湖方舱医院出院，出院小结记载：体温连续5天<37.2 ℃，咳嗽VAS评分由8分降至2分，出院当日CT示双肺外周磨玻璃影吸收>50%，2次咽拭子核酸阴性（间隔24 h）。今日社区复诊：体温36.4 ℃，指脉氧97%（未吸氧），仅余偶咳、爬楼梯后轻微气促；复查血常规WBC 5.1×10⁹/L、LY 1.3×10⁹/L，CRP 4 mg/L，肝肾功能正常。患者职业为冷链物流司机，担心复阳影响复工，同时抱怨隔离点空调太冷导致夜间小腿抽筋。社区医生需判断：是否可解除隔离回家，还是继续留观或转呼吸科进一步评估肺纤维化可能。",
    "reference_rule": {
      "condition": "体温恢复正常3天以上、呼吸道症状明显好转，肺部影像学显示炎症明显吸收，连续两次呼吸道病原核酸检测阴性（采样时间间隔至少1天）",
      "action": "可解除隔离出院或根据病情转至相应科室治疗其他疾病。",
      "contraindication": null,
      "evidence": "体温恢复正常3天以上、呼吸道症状明显好转，肺部影像学显示炎症明显吸收，连续两次呼吸道病原核酸检测阴性（采样时间间隔至少1天），可解除隔离出院或根据病情转至相应科室治疗其他疾病。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于分级诊疗与随访场景。作为守门人 (Gatekeeper)，我的关注重点是严格对比患者当前状况与出院或解除隔离的达标标准，判断是否维持原状、触发转诊或升级治疗，以优化资源分配并确保患者安全。Step 2: 临床解码 (Clinical Decoding) - 出院时患者已满足新冠病毒肺炎出院标准：体温连续5天<37.2 ℃、咳嗽VAS评分从8分降至2分（提示呼吸道症状显著缓解）、CT示双肺磨玻璃影吸收>50%（表明炎症消退）、2次咽拭子核酸阴性（间隔24 h）。今日复诊数据：体温36.4 ℃（正常）、指脉氧97%（未吸氧，提示氧合良好）、偶咳伴爬楼梯后轻微气促（可能反映残余肺损伤或肺纤维化风险）、血常规WBC 5.1×10⁹/L（正常范围）、LY 1.3×10⁹/L（轻度淋巴细胞减少，提示免疫恢复不全）、CRP 4 mg/L（正常，无炎症活动）、肝肾功能正常。隐式线索：职业为冷链物流司机（暴露于冷环境，潜在工作相关健康风险）；抱怨隔离点空调太冷致夜间小腿抽筋（可能因低温诱发肌肉痉挛或电解质失衡）。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 参考指南条件：体温恢复正常3天以上（患者出院时已连续5天正常，今日正常）、呼吸道症状明显好转（出院时咳嗽改善，今日仅偶咳）、肺部影像学显示炎症明显吸收（出院CT示吸收>50%，今日无新影像但症状缓解）、连续两次呼吸道病原核酸检测阴性（间隔至少1天，出院时已满足）。患者现状完全匹配指南条件，无禁忌症（contraindication null）。安全检查：轻微气促和淋巴细胞减少提示潜在肺纤维化风险，但无急性安全威胁；小腿抽筋非直接禁忌，但需干预以防跌倒或不适。Step 4: 决策生成 (Decision Making) - 基于指南 action，患者符合解除隔离出院标准，无需继续留观。鉴于轻微气促和职业暴露风险，应触发转诊至呼吸科进一步评估肺纤维化可能性，而非升级治疗。处理小腿抽筋作为次要干预点。",
    "medical_order": "予解除隔离出院。建议转呼吸科门诊进一步评估肺功能及肺纤维化可能，完善肺功能测试和高分辨率CT复查。针对夜间小腿抽筋，建议每日补充钙剂500mg和维生素D 400IU，并保暖下肢。嘱社区随访1周，监测体温及呼吸道症状变化。",
    "patient_dialogue": "王师傅，好消息！您的检查结果都很好——体温正常、血氧充足、咳嗽也基本没了，核酸阴性说明病毒已经清除，完全符合出院回家的标准。今天您就可以解除隔离了，不用再担心影响复工。不过，您提到爬楼梯时有点气紧，这可能是肺部恢复过程中的一点小问题，不是大事，但为了保险起见，我建议您去呼吸科做个简单检查，看看肺功能情况，确保您开车时不会受影响。另外，空调太冷引起的腿抽筋，我建议晚上盖好被子或穿厚点袜子，再吃点钙片和维生素D，平时多喝点牛奶，这样能预防抽筋。您的身体恢复得不错，复工没问题，但先别太累，休息几天再去上班更安全。"
  },
  {
    "id": 1553,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者今晨出现38.7℃发热伴干咳，自测指脉氧92%，步行入急诊时轻微气促。胸部CT示双肺外周磨玻璃影，呈‘铺路石’样改变；血常规WBC 3.2×10⁹/L，LY 0.8×10⁹/L，CRP 42 mg/L。患者自述返京后一直居住在员工集体宿舍，同屋3人亦出现低热。护士为其测SpO₂时，患者因担心丢失工作，反复询问‘能不能不住院？’，同时抱怨昨夜宿舍空调滴水声吵得无法入睡。",
    "reference_rule": {
      "condition": "疑似及确诊病例",
      "action": "1. 在具备有效隔离条件和防护条件的定点医院隔离治疗; 2. 疑似病例应当单人单间隔离治疗; 3. 确诊病例可多人收治在同一病室。",
      "contraindication": null,
      "evidence": "疑似及确诊病例应当在具备有效隔离条件和防护条件的定点医院隔离治疗，疑似病例应当单人单间隔离治疗，确诊病例可多人收治在同一病室。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规急诊诊疗场景，作为急诊医生，我的关注重点是快速建立鉴别诊断（如病毒性肺炎 vs. 细菌性肺炎 vs. 其他呼吸道感染），排除危急重症（如急性呼吸窘迫综合征），并给出直接、果断的指令以确保患者安全和公共健康。Step 2: 临床解码 (Clinical Decoding)：从病例中提取关键信息——发热（38.7℃）、干咳、轻微气促和低氧血症（SpO2 92%）提示急性呼吸道感染；胸部CT显示双肺外周磨玻璃影（'铺路石'样改变）及血常规异常（WBC 3.2×10⁹/L、LY 0.8×10⁹/L、CRP 42 mg/L）符合病毒性肺炎特征，如COVID-19；流行病学史（返京集体宿舍、同屋3人低热）强烈支持传染性疾病集群爆发；隐式线索包括患者焦虑（工作担忧和睡眠障碍）可能影响治疗依从性，需在决策中安抚但坚持隔离。Step 3: 规则对齐与安全检查 (Alignment & Safety)：患者临床表现和暴露史与指南中的'疑似及确诊病例'条件高度匹配；指南无禁忌症（contraindication: null），但需强制检查安全风险——拒绝隔离可能加剧疫情传播，必须优先隔离治疗。Step 4: 决策生成 (Decision Making)：根据指南Action，立即安排患者至定点医院隔离治疗，作为疑似病例采用单人单间隔离；同时完善病原学检测以确认诊断，并启动公共健康追踪。",
    "medical_order": "患者符合疑似传染病（COVID-19可能性大）诊断，予收入定点医院隔离病房，单人单间隔离治疗。完善COVID-19核酸检测、呼吸道病原体筛查（如流感病毒）、动脉血气分析及连续SpO₂监测。予一级护理，密切观察呼吸状态；必要时予低流量氧疗支持。通知疾控中心追踪密切接触者（同宿舍人员）。",
    "patient_dialogue": "张先生，您先别急，我理解您担心工作和昨晚没睡好，空调滴水确实烦人。但您现在的症状——发烧、咳嗽，还有检查结果，都显示可能是传染性肺炎，比如新冠病毒。您宿舍的同事也有类似情况，这很危险。如果不及时住院隔离，不光您自己可能加重，还会传染给更多人，包括您单位的朋友。我们必须安排您去定点医院住几天，单人间，环境安静，不会吵到您。我们会尽快做检测，确定是什么病，并帮您治疗。这对保护您和大家都至关重要，请放心，我们会全力支持您。"
  },
  {
    "id": 1555,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者因‘间断低热、干咳4天’于1月28日来我院发热门诊。体温37.6 ℃，呼吸22次/分，SpO₂ 97%（未吸氧）。肺部听诊右下肺少许湿啰音。血常规：WBC 5.1×10⁹/L，淋巴细胞0.9×10⁹/L；CRP 16 mg/L；胸部CT示双肺外周磨玻璃影，右下肺明显。甲型/乙型流感抗原阴性。患者自述无基础病，但近3天加班熬夜，昨日出现腹泻2次。流行病学史：1月15日自武汉乘高铁返沪，车厢内多人咳嗽；同办公室2名同事已出现发热。目前已被收入单间隔离病房，等待第一次咽拭子新型冠状病毒核酸检测结果。",
    "reference_rule": {
      "condition": "疑似病例（湖北以外省份）",
      "action": "连续两次呼吸道病原核酸检测阴性（采样时间至少间隔1天），方可排除。",
      "contraindication": null,
      "evidence": "疑似病例连续两次呼吸道病原核酸检测阴性（采样时间至少间隔1天），方可排除。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景，具体是急诊门诊处理疑似传染病病例。作为急诊医生，我的关注重点是快速建立鉴别诊断（如排除COVID-19、流感或其他病毒性肺炎），优先排除危急重症（如急性呼吸衰竭），并基于指南给出直接指令。Step 2: 临床解码 (Clinical Decoding): 患者关键信息包括：低热（37.6°C）、干咳和腹泻提示病毒感染；呼吸22次/分（正常上限）和右下肺湿啰音结合胸部CT磨玻璃影（典型COVID-19影像特征），指向病毒性肺炎；血常规示淋巴细胞减少（0.9×10⁹/L）和CRP轻度升高（16 mg/L），支持炎症反应；流行病学史（武汉旅居史、同事发热）为高风险暴露隐式线索；无基础病，但近期疲劳（加班熬夜）可能加重免疫抑制。整体评估为COVID-19高度疑似。Step 3: 规则对齐与安全检查 (Alignment & Safety): 患者符合指南中‘疑似病例（湖北以外省份）’条件（来自武汉但就诊于上海）。指南Contraindication为null，无禁忌；安全检查：SpO₂ 97%正常，无呼吸困难或低氧急症，隔离状态安全。Step 4: 决策生成 (Decision Making): 根据指南Action，需连续两次呼吸道病原核酸检测阴性（间隔≥24小时）才能排除COVID-19。因此，决策为维持当前隔离，安排第二次检测，同时提供对症支持治疗。",
    "medical_order": "予单间隔离，一级护理；监测体温、呼吸、SpO₂ q4h；完善第二次咽拭子新型冠状病毒核酸检测，采样时间与首次间隔≥24小时；对症处理：鼓励口服补液，必要时予退热药（如布洛芬）；观察腹泻情况，予蒙脱石散 prn；暂不予抗生素；待核酸检测结果回报，如阳性转感染科，如阴性重复检测排除。",
    "patient_dialogue": "您好，您的症状像咳嗽、低烧和腹泻，加上最近的旅行史，让我们担心可能是一种病毒感染，比如新冠病毒。为了保护您和他人，您需要暂时住在这个隔离病房。我们会再做一次鼻咽拭子检测，需要两次结果都是阴性才能完全排除感染——这是为了确保准确性，因为病毒可能一下子没检测出来。现在请您多休息，尽量多喝水，吃点清淡的食物，这对恢复很重要。如果您觉得发烧加重或呼吸不舒服，马上按铃叫护士，我会随时过来看您。别太担心，我们会一起帮您度过这个阶段。"
  },
  {
    "id": 1575,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者42岁女性，社区超市收银员，昨日出现明显乏力伴38.7 ℃发热，无寒战。自诉‘浑身像被抽了筋’，但仍能步行来院。伴轻度干咳，无痰血；无胸闷、气促。既往体健，无慢病史，末次月经一周前结束。查体：T 38.9 ℃，P 96次/分，R 20次/分，SpO₂ 97%（RA），咽部轻度充血，双肺听诊呼吸音清。血常规：WBC 5.1×10⁹/L，LY% 32%，CRP 8 mg/L；胸部CT未见明显渗出。患者因近期同事确诊新冠，担心被感染，主动前来筛查。今日气温骤降，候诊区患者普遍反映‘手脚冰凉’。",
    "reference_rule": {
      "condition": "医学观察期：乏力伴发热",
      "action": "推荐中成药：金花清感颗粒、连花清瘟胶囊（颗粒）、疏风解毒胶囊（颗粒）、防风通圣丸（颗粒）。",
      "contraindication": null,
      "evidence": "临床表现 2：乏力伴发热\n推荐中成药：金花清感颗粒、连花清瘟胶囊（颗粒）、疏风解毒胶囊（颗粒）、防风通圣丸（颗粒）"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规急诊/门诊诊疗场景，关注重点是快速建立鉴别诊断以排除危急重症（如肺炎、脓毒症），并根据症状和指南直接给出治疗建议，无需复杂转诊或专科介入。\nStep 2: 临床解码 (Clinical Decoding) - 患者急性起病，乏力伴发热38.9℃，轻度干咳，无下呼吸道症状（无胸闷、气促），结合查体咽部充血、双肺呼吸音清及SpO₂正常，提示上呼吸道感染。血常规WBC正常、LY%略低、CRP轻度升高，胸部CT无渗出，进一步支持病毒感染（如流感或COVID-19）。隐式线索包括COVID-19暴露史（同事确诊）和气温骤降（可能加重症状），但无危急指征（如SpO₂下降、呼吸困难）。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南规则条件为‘医学观察期：乏力伴发热’，患者症状完全匹配；行动推荐金花清感颗粒等中成药，无禁忌症（contraindication为null）。患者既往体健、无慢性病史、无药物过敏史（病例未提示），且CRP轻度升高不构成禁忌，安全使用中成药。\nStep 4: 决策生成 (Decision Making) - 基于指南行动，选择金花清感颗粒为首选治疗；鉴于COVID-19暴露史，需完善核酸检测以排除感染，并建议居家观察。",
    "medical_order": "诊断：急性上呼吸道感染（病毒性），待排COVID-19。予一级护理；完善SARS-CoV-2核酸检测。口服金花清感颗粒 1包 每日三次；或可选连花清瘟胶囊 4粒 每日三次。监测体温、呼吸症状变化；如出现气促、高热不退或SpO₂<95%，立即复诊。嘱居家休息，多饮水。",
    "patient_dialogue": "您好，看到您今天来是因为浑身没力气、发烧，还有一点干咳，对吧？别担心，这些症状听起来像是感冒或流感，可能是天气突然变冷，加上您工作接触人多，容易被感染。我建议您先做个新冠测试，因为您同事确诊了，这能帮我们确定是不是新冠，也好保护您家里人。同时，可以吃金花清感颗粒这类药，它能帮您退烧、缓解疲劳，每天三次，坚持用几天就行。在家多休息，多喝温水，注意保暖。如果发烧没退或者开始喘不上气，一定要马上回来找我，咱们早点处理。"
  },
  {
    "id": 1563,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者42岁，厨师，昨日开始寒战、高热39.4℃，伴干咳、乏力，无鼻塞流涕。自述过去三天在菜市场砧板区连续作业12小时/日，环境潮湿且顾客密集。查体：T 39.1℃，HR 112次/分，RR 24次/分，SpO₂ 93%（未吸氧），右下肺叩诊浊音、可闻及细湿啰音。血常规：WBC 3.8×10⁹/L，淋巴细胞百分比 18%；CRP 78 mg/L；胸片示右下肺外带斑片状磨玻璃影，双肺纹理增粗。患者坚持认为只是“普通感冒”，要求开退烧药后回岗位继续上班，并反复询问“能不能先不打针，我得回去准备明天的年夜饭订单”。",
    "reference_rule": {
      "condition": "根据病情",
      "action": "监测血常规、尿常规、CRP、生化指标（肝酶、心肌酶、肾功能等）、凝血功能、动脉血气分析、胸部影像学等；有条件者可行细胞因子检测。",
      "contraindication": null,
      "evidence": "根据病情监测血常规、尿常规、CRP、生化指标（肝酶、心肌酶、肾功能等）、凝血功能、动脉血气分析、胸部影像学等。有条件者可行细胞因子检测。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景，具体为急诊诊疗环境。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如社区获得性肺炎 vs. 病毒性肺炎 vs. 其他急性感染），优先排除危急重症（如呼吸衰竭、脓毒症），并给出直接、高效的诊疗指令，以避免病情恶化。\n\nStep 2: 临床解码 (Clinical Decoding)：患者急性起病，表现为高热（T 39.1℃）、寒战、干咳、乏力，结合心动过速（HR 112次/分）、呼吸急促（RR 24次/分）、低氧血症（SpO₂ 93%未吸氧），以及右下肺叩诊浊音和细湿啰音，提示右下肺实变和感染性病变。实验室显示白细胞计数降低（WBC 3.8×10⁹/L）伴淋巴细胞减少（18%）、CRP显著升高（78 mg/L），胸片示右下肺斑片状磨玻璃影及双肺纹理增粗，强烈支持社区获得性肺炎（CAP），可能为细菌性或病毒性（如流感、COVID-19）。职业暴露（潮湿密集菜市场工作）增加呼吸道感染风险。患者否认鼻塞流涕，排除普通上呼吸道感染，其坚持“普通感冒”认知为认知偏差，可能延误治疗。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南 Condition 要求基于病情监测相关指标，本例患者病情（高热、低氧、肺部体征、炎症标志物异常）完全符合监测标准。Contraindication 为 null，无禁忌情况。安全检查：SpO₂ 93% 提示低氧风险，需优先稳定氧合；无立即危及生命指征（如呼吸衰竭或休克），但需警惕进展为重症肺炎。\n\nStep 4: 决策生成 (Decision Making)：基于指南 Action，决策为立即启动监测和初始治疗，包括经验性抗生素覆盖社区获得性肺炎、氧疗支持、完善所有建议检查（血常规、尿常规、CRP、生化指标、凝血功能、动脉血气分析、胸部影像学），有条件时加做细胞因子检测以评估炎症风暴风险，并排除病毒病原体。",
    "medical_order": "予一级护理，持续监测生命体征（每2小时记录T、HR、RR、BP、SpO₂）；立即予氧疗（鼻导管2-4L/min，目标SpO₂ >94%）；静脉滴注广谱抗生素（如阿莫西林-克拉维酸1.2g q8h）覆盖社区获得性肺炎；完善血常规、尿常规、CRP、生化指标（包括肝酶、心肌酶、肾功能）、凝血功能、动脉血气分析；复查胸部影像学（建议胸部CT评估磨玻璃影进展）；有条件时行呼吸道病毒检测（包括流感、COVID-19）及细胞因子检测；暂禁食水，观察24小时病情变化，必要时升级治疗。",
    "patient_dialogue": "王师傅，您的情况比普通感冒严重得多。您的高烧、咳嗽，加上检查结果，都指向肺炎——这可不是小毛病，如果不及时控制，可能会恶化成呼吸困难甚至危及生命。您现在血氧只有93%，说明身体缺氧了，必须马上吸氧和打针消炎，否则拖下去会影响心脏和肺功能。您提到要赶回去做年夜饭，但您这状态根本撑不住，强撑着工作会让病情加重，还可能传染给家人和顾客。我理解您着急订单，但健康第一，咱们得先把病治好。现在需要您住院观察一天，我们会给您吸氧、输抗生素，并做一些详细检查，确保没有其他问题。您放心，我们会尽快处理，帮您早点康复回去工作。"
  },
  {
    "id": 1586,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "52岁男性，既往高血压、2型糖尿病，因‘发热、干咳8天，气促3天’于2020-02-14凌晨由社区医院转入。入院时T 38.7 ℃，RR 28次/分，SpO₂ 87%（鼻导管5 L/min），BP 146/92 mmHg，HR 110 bpm，双肺听诊弥漫湿啰音。胸部CT示双肺多发磨玻璃影伴铺路石征，右下肺实变。咽拭子新冠病毒核酸检测阳性（ORF1ab Ct 21）。实验室：WBC 9.8×10⁹/L，LY 0.6×10⁹/L，CRP 142 mg/L，IL-6 78 pg/mL，D-二聚体 2.3 mg/L。已按第五版方案给予氧疗、甲强龙40 mg qd、洛匹那韦/利托那韦、干扰素雾化及抗菌药物，并申请院内MDS会诊。今日第14天，患者仍中低热（37.5–38.0 ℃），气促无明显缓解，高流量氧浓度60%下SpO₂ 90%–92%，复查LY 0.5×10⁹/L，CRP 118 mg/L，IL-6 65 pg/mL。患者自述乏力明显，食欲差，夜间盗汗。值班医生在床旁记录：‘抗病毒疗程已满，激素逐步减量，需评估下一步免疫调节或特殊治疗指征。’窗外凌晨2点，雨夹雪，患者家属隔着玻璃打电话询问‘还有没有其他办法？’",
    "reference_rule": {
      "condition": "患者",
      "action": "可采用恢复期血浆治疗。",
      "contraindication": null,
      "evidence": "可采用恢复期血浆治疗；"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规急诊诊疗场景，重点关注快速排除危重症并给出直接治疗指令。患者处于新冠感染第14天，虽已标准治疗但持续低氧、淋巴细胞减少及炎症指标居高，需果断干预。Step 2: 临床解码 - 关键问题：①病毒载量高（Ct值21）②免疫紊乱（LY持续<0.8×10⁹/L，IL-6>50 pg/mL）③炎症风暴风险（CRP>100 mg/L）④D-二聚体升高提示高凝状态。隐式线索：激素减量期间仍盗汗/乏力，提示免疫应答不足。Step 3: 规则对齐与安全检查 - 指南明确建议采用恢复期血浆治疗（Condition匹配），无禁忌症（无过敏史/心衰/肾衰记录）。安全核查：患者血压血糖可控，无活动性出血，符合输注条件。Step 4: 决策生成 - 基于指南Action及患者免疫指标异常，优先启动恢复期血浆治疗，同步处理高凝状态。",
    "medical_order": "1. 立即申请新冠恢复期血浆400ml输注，输注前予苯海拉明20mg iv防过敏反应\n2. 予依诺肝素钠4000U q12h sc抗凝（D-二聚体>1.5mg/L）\n3. 甲泼尼龙减量至20mg qd po\n4. 停洛匹那韦/利托那韦（疗程已满）\n5. 持续HFNC氧疗（FiO₂ 60%），维持SpO₂≥93%\n6. 急查：动脉血气、IL-6、D-二聚体、凝血四项\n7. 营养支持：肠内营养混悬液500ml qd鼻饲",
    "patient_dialogue": "（轻敲玻璃，靠近通话口）大哥您好，我是值班医生。您父亲的情况我们一直在全力处理，现在有个新的治疗方案：我们会给他输康复病人的血浆，这种血浆里带着对抗病毒的抗体，就像借别人的免疫力来帮他打仗。同时我们会给他打预防血栓的小针，避免血液太粘稠。这两天激素药会慢慢减量，但吸氧和营养支持都在加强。虽然现在还在发烧，但咱们一步步来，您和家人也要注意休息，明早查房时咱们再细聊好吗？"
  },
  {
    "id": 1571,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "47岁厨师，发热6天、干咳3天后就诊。体温38.7℃，SpO₂ 92%（未吸氧），呼吸频率28次/分，辅助呼吸肌明显参与。急诊胸部CT示双肺外周磨玻璃影较48小时前进展>50%，右下肺新见铺路石征。昨日开始经鼻高流量氧疗（FiO₂ 0.5，流量40 L/min），仍觉憋气，说话成句需停顿。实验室：淋巴细胞0.7×10⁹/L，CRP 92 mg/L，IL-6 46 pg/mL。昨日夜班护士记录他夜间因胸闷坐起两次。患者提到餐厅近期因疫情停业，自己每天骑电动车送外卖，风雨天也接单。无慢性病史，青霉素过敏。",
    "reference_rule": {
      "condition": "可根据患者呼吸困难程度、胸部影像学进展情况",
      "action": "酌情短期内（3~5日）使用糖皮质激素，建议剂量不超过相当于甲泼尼龙1~2mg/kg/日。",
      "contraindication": "应当注意较大剂量糖皮质激素由于免疫抑制作用，会延缓对冠状病毒的清除。",
      "evidence": "可根据患者呼吸困难程度、胸部影像学进展情况，酌情短期内（3~5日）使用糖皮质激素，建议剂量不超过相当于甲泼尼龙1~2mg/kg/日，应当注意较大剂量糖皮质激素由于免疫抑制作用，会延缓对冠状病毒的清除；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规急诊诊疗场景（基于Context中的'常规诊断与治疗'），作为急诊/门诊医生，关注重点在于快速识别和排除危急重症（如急性呼吸衰竭或脓毒症），并直接制定治疗决策以稳定患者病情。\n\nStep 2: 临床解码 (Clinical Decoding) - 从患者病例中提取关键信息：47岁男性，急性发热和干咳病史，结合低氧饱和度（SpO₂ 92%）、呼吸频率增快（28次/分）、辅助呼吸肌参与，提示急性呼吸窘迫；胸部CT显示双肺外周磨玻璃影进展>50%和铺路石征，符合重症病毒性肺炎（如COVID-19）的影像学特征；实验室指标（淋巴细胞减少、CRP和IL-6升高）支持系统性炎症反应；氧疗无效（高流量氧疗下仍憋气、说话停顿），夜间胸闷坐起提示病情恶化。隐式线索：职业暴露（厨师和外卖骑手，风雨天工作）增加感染风险，餐厅疫情停业暗示潜在COVID-19接触；无慢性病史，但青霉素过敏需避免相关药物。转化为医学术语：进展性急性呼吸窘迫综合征（ARDS），高度怀疑病毒性肺炎（如SARS-CoV-2感染）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition基于呼吸困难程度（严重：SpO₂低、呼吸频率快）和胸部影像学进展（CT显示>50%恶化），直接匹配糖皮质激素使用指征。Contraindication检查：大剂量糖皮质激素可能延缓冠状病毒清除（患者暴露史提示COVID-19风险），但指南建议剂量（甲泼尼龙1-2mg/kg/日）在安全范围内；无其他禁忌症（无糖尿病、免疫抑制等慢性病）。安全优先级：选择低剂量范围（1mg/kg/日）以平衡抗炎效果与病毒清除风险。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action，决策为短期（3-5日）使用糖皮质激素，剂量相当于甲泼尼龙1mg/kg/日（患者体重估计70kg，故70mg/日）。同时，加强氧疗监测和感染筛查，以排除合并细菌感染。",
    "medical_order": "予甲泼尼龙70mg静脉注射每日，疗程3-5日；继续经鼻高流量氧疗（FiO₂ 0.5，流量40 L/min），监测SpO₂、呼吸频率及生命体征每小时；完善血培养、呼吸道病原体检测（包括SARS-CoV-2 PCR）；一级护理，密切观察呼吸状况变化；避免青霉素类药物。",
    "patient_dialogue": "张先生，我是您的医生。看您呼吸这么费力，我们得赶紧处理肺部的问题。CT显示肺部炎症很厉害，像火烧一样让您喘不过气。我建议给您打一种消炎药，叫甲泼尼龙，每天一次，连续几天，这能快速消肿，帮您呼吸更顺畅。同时，氧气治疗还要继续，我们会盯着您的血氧和呼吸情况。另外，做个检查确认是什么感染，好针对性地治疗。您放心，这药剂量是安全的，不会让身体负担太重。重要的是，您要尽量少动，好好休息——现在不是送外卖的时候了，身体恢复第一。"
  },
  {
    "id": 1578,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者42岁，男性，身高172 cm，体重78 kg，体温37.4 ℃，主诉“浑身没劲，一弯腰就冒虚汗，肚子胀得跟石头似的，两天里跑了七趟厕所，全是稀水样便，没脓血”。无咳嗽、无咽痛、无胸痛。昨日自服“诺氟沙星”4粒后腹泻稍减，但乏力加重。查体：神情倦怠，皮肤弹性尚可，腹平软，肠鸣音活跃8次/分，四肢肌力Ⅳ级。血常规：WBC 5.2×10⁹/L，LY% 38%，CRP 6 mg/L；胸CT：双肺未见明显磨玻璃影。流行病学史：1周前曾到华南某海鲜市场送货，市场内多人发热，患者全程戴一次性口罩（非N95）。今日凌晨出现低热，自行驾车来筛查点，登记时反复擦汗，诉“胃里翻江倒海，闻到盒饭味就想吐”。",
    "reference_rule": {
      "condition": "医学观察期：乏力伴胃肠不适",
      "action": "推荐中成药：藿香正气胶囊（丸、水、口服液）。",
      "contraindication": null,
      "evidence": "临床表现 1：乏力伴胃肠不适\n推荐中成药：藿香正气胶囊（丸、水、口服液）"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)** 本案例属于常规诊断与治疗场景，具体为急诊/门诊常见的急性胃肠炎评估。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如排除肠梗阻、电解质紊乱或感染性休克），并给出直接、高效的处置方案，避免延误。\n\n**Step 2: 临床解码 (Clinical Decoding)** 从病例中提取关键信息并转化为医学术语：患者主诉乏力（浑身没劲）、弯腰出汗（提示自主神经功能紊乱）、腹胀（如石头感）、水样便腹泻（7次/天，无脓血，提示急性胃肠炎）；自服诺氟沙星后腹泻稍减但乏力加重（药物部分有效但可能有副作用）；查体神情倦怠、肠鸣音活跃（肠蠕动亢进）、四肢肌力Ⅳ级（轻度肌力下降）；实验室WBC正常、CRP轻度升高（轻度炎症）；胸CT排除肺炎；流行病学史提示海鲜市场暴露（可能细菌或病毒感染源，如沙门菌或诺如病毒）；今日低热37.4℃、恶心厌食（胃部不适）。隐式线索：乏力加重和肌力下降可能与脱水或电解质失衡相关，皮肤弹性尚可提示无严重脱水，但需警惕进展风险；自行驾车就诊表明当前无生命危险。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)** 指南condition为“医学观察期：乏力伴胃肠不适”，与患者症状（乏力、腹胀、腹泻、恶心）高度匹配。指南action推荐藿香正气胶囊，contraindication为null。强制安全检查：患者无提及酒精过敏或肝病病史，藿香正气制剂（尤其口服液含酒精）一般耐受性好，但需注意恶心可能影响口服耐受性；无药物相互作用（诺氟沙星已停），无禁忌症。\n\n**Step 4: 决策生成 (Decision Making)** 基于指南action，核心决策为推荐藿香正气胶囊；同时，补充支持性治疗以管理腹泻和脱水风险，确保安全。最终方案：优先采用藿香正气胶囊，辅以口服补液和饮食调整，强调观察脱水征兆。",
    "medical_order": "1. 诊断：急性胃肠炎（考虑细菌或病毒感染），轻度脱水风险。2. 治疗：予藿香正气胶囊口服，每次2粒，每日3次；停用诺氟沙星。3. 支持性措施：予口服补液盐（ORS）溶液，每日1.5-2L；建议清淡流质饮食（如米汤），避免油腻及乳制品。4. 监测：观察尿量、口渴程度及精神状态变化；如出现持续发热（>38.5℃）、少尿或意识模糊，立即复诊。5. 休息：建议居家休息3天，避免劳累。",
    "patient_dialogue": "王先生，我看您这情况主要是拉肚子、没力气，还觉得肚子胀、恶心想吐，这很可能是吃坏了东西或者接触了不干净的摊位引起的肠胃炎。别担心，现在还不算严重。我给您开点中药叫藿香正气胶囊，它专门对付这种又累又闹肚子的情况，能帮您缓解恶心和腹胀。回家后，您得每天喝点补盐液，就是那种冲水喝的小包粉——腹泻多了身体会缺水缺盐，这个能快速补充，防止您更没力气。吃饭呢，先喝点米汤或稀粥，别碰油腻的饭菜和牛奶，容易加重肚子不舒服。这两天好好在家休息，别干活了。如果发现小便少了、口干得厉害，或者发烧更高了，马上来医院，这可能是身体脱水变严重了。咱们一起把这关过了，好吗？"
  },
  {
    "id": 1576,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "隔离病房凌晨02:10，38岁武汉籍男性厨师，确诊新冠肺炎（普通型）第3天。SpO₂ 97%（鼻导管3 L/min），体温37.4 ℃，咳嗽频次减少，但夜间反复按铃。护士记录显示过去4小时内他第5次询问“我会不会突然喘不上气就死掉？”并反复检查手机疫情数据。患者自述“一闭眼就看见火神山尸袋新闻”，出汗、心悸，无法连续入睡超过20分钟。既往无精神病史，但家族史中母亲有焦虑障碍。病房灯光调至夜光模式后，他仍拒绝关闭床头显示屏，坚持要24小时观看氧气流量数字。今晚他额外主诉“喉咙异物感”，查体咽稍充血，无扁桃体肿大，考虑为焦虑相关咽部紧张。医生查房时间仅15分钟/间，需要快速判断并记录处理意见。",
    "reference_rule": {
      "condition": "患者常存在焦虑恐惧情绪",
      "action": "应当加强心理疏导。",
      "contraindication": null,
      "evidence": "患者常存在焦虑恐惧情绪，应当加强心理疏导。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于行政与伦理场景。作为规范的管理者，我的关注重点包括流程合规性（确保查房记录符合隔离病房管理规定）、文书完整性（详细记录患者心理状态和干预措施）、伦理告知（尊重患者知情权，避免焦虑信息传播），以及公共卫生责任（防止焦虑情绪在隔离病房中扩散，确保其他患者不受影响）。\n\nStep 2: 临床解码 (Clinical Decoding): 患者表现为急性焦虑障碍，具体特征包括：① 死亡焦虑（反复询问窒息风险并检查疫情数据）；② 创伤后应激症状（火神山尸袋闪回导致失眠）；③ 自主神经功能紊乱（出汗、心悸）；④ 强迫行为（持续监控氧气流量）；⑤ 躯体化症状（喉咙异物感，咽部充血但无器质性病变）。家族史（母亲焦虑障碍）增加易感性，新冠肺炎诊断作为压力源加剧症状。关键隐式线索：夜间症状恶化提示环境因素（如显示屏光线）影响休息。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition '患者常存在焦虑恐惧情绪' 与患者表现高度匹配。Contraindication为null，无安全禁忌。需强制检查伦理风险：患者拒绝关闭显示屏可能源于知情权需求，干预需平衡安抚与自主权，避免强制行为引发二次创伤。\n\nStep 4: 决策生成 (Decision Making): 基于指南Action '应当加强心理疏导'，生成具体决策：① 在查房时提供简短心理支持；② 申请精神科急会诊；③ 优化环境以减少刺激；④ 规范记录症状和干预，确保流程合规。",
    "medical_order": "予评估患者焦虑状态（记录GAD-7量表若可行）；加强心理疏导支持；请精神科急会诊；调整病房环境，夜间关闭床头显示屏；记录主诉：死亡焦虑、失眠、躯体化症状及干预措施。",
    "patient_dialogue": "王先生，我看您今晚特别担心呼吸问题，这在新冠康复期很常见——您现在的氧气是97%，很稳定，不会突然出事的。那些疫情新闻让您睡不好，我懂，它们确实吓人。咱们一起试试这个：我会请一位心理专家来和您聊聊天，教些放松法子，因为好睡眠能帮身体更快恢复。另外，晚上关掉屏幕光线，大脑才能休息得更好，我帮您调成最低亮度行吗？喉咙发紧是紧张时常见的，深呼吸几下就能缓过来，您试试？"
  },
  {
    "id": 1566,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "今日下午，患者佩戴口罩步入发热门诊，自诉3天前出现乏力、畏寒，随后体温升至38.7 ℃，伴阵发性干咳、无痰，无咽痛流涕。昨日夜间自觉胸闷，活动后稍明显，无胸痛咯血。既往体健，无慢性病史，否认吸烟史。2月5日曾自驾赴湖北黄冈出差，2月8日返杭，返程全程佩戴一次性外科口罩，未接触野生动物，无明确新冠确诊或疑似病例密切接触史。查体：T 38.5 ℃，P 92 次/分，R 22 次/分，SpO₂ 96%（未吸氧），咽部轻度充血，双肺呼吸音粗，右下肺可闻及少量细湿啰音。血常规：WBC 5.2×10⁹/L，L 0.9×10⁹/L（↓），CRP 18 mg/L（↑）。胸部CT示右肺下叶外基底段斑片状磨玻璃影，边缘模糊，局部小叶间隔增厚。患者焦急询问：“医生，我这是不是普通感冒？能不能先回家吃药观察？” 门诊护士已完成流调表，将患者引导至独立留观室，告知需等待医生进一步评估。窗外雨声密集，患者手机不断响起工地催促复工的来电。",
    "reference_rule": {
      "condition": "医务人员发现符合病例定义的疑似病例（湖北以外省份）",
      "action": "1. 立即进行隔离治疗; 2. 院内专家会诊或主诊医师会诊; 3. 会诊仍考虑疑似病例时，在2小时内进行网络直报; 4. 采集标本进行新型冠状病毒核酸检测; 5. 在确保转运安全前提下立即将疑似患者转运至定点医院。",
      "contraindication": null,
      "evidence": "各级各类医疗机构的医务人员发现符合病例定义的疑似病例后，应当立即进行隔离治疗，院内专家会诊或主诊医师会诊，仍考虑疑似病例，在2小时内进行网络直报，并采集标本进行新型冠状病毒核酸检测，同时在确保转运安全前提下立即将疑似患者转运至定点医院。"
    },
    "thought": "步骤1: 场景定义 (Scenario Definition) – 本案例属于常规急诊诊疗场景，患者在发热门诊出现急性呼吸道症状和发热，伴随流行病学史。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如COVID-19、流感、社区获得性肺炎），排除危急重症（如呼吸衰竭或脓毒症），并基于指南给出直接、高效的诊疗指令，确保患者安全。步骤2: 临床解码 (Clinical Decoding) – 从病例提取关键信息：患者有湖北黄冈旅行史（COVID-19高风险区），症状包括发热（T 38.5 ℃）、乏力、畏寒、阵发性干咳和胸闷（活动后加重），查体示右下肺细湿啰音（提示肺部浸润），实验室检查显示淋巴细胞减少（L 0.9×10⁹/L↓）和CRP升高（18 mg/L↑），胸部CT示右肺下叶磨玻璃影伴小叶间隔增厚（典型病毒性肺炎特征）。隐式线索：淋巴细胞减少和磨玻璃影强烈指向病毒性感染（尤其COVID-19），患者SpO₂ 96%暂未提示低氧危象，但胸闷需警惕进展；社会因素（工地催促复工）可能加剧患者焦虑，需在决策中考虑心理支持。步骤3: 规则对齐与安全检查 (Alignment & Safety) – 患者符合指南中“疑似病例（湖北以外省份）”定义：发热+呼吸道症状+肺部影像学异常+流行病学史（湖北旅行）。指南无禁忌症（contraindication为null），因此强制应用其行动项。安全检查：无转运禁忌（生命体征稳定，SpO₂正常），隔离已启动（护士引导至独立留观室），无药物相互作用或共病风险需优先处理。步骤4: 决策生成 (Decision Making) – 基于指南action，决策包括：立即维持隔离治疗，安排院内专家会诊以确认疑似诊断；会诊后若维持疑似，在2小时内网络直报；采集鼻咽拭子进行COVID-19核酸检测；在转运安全前提下，准备将患者转至定点医院。同时，监测生命体征以防病情恶化。",
    "medical_order": "1. 立即维持隔离治疗，将患者置于独立留观室，予一级护理，监测生命体征（体温、脉搏、呼吸、SpO₂）每2小时一次。2. 安排院内感染科专家会诊，评估是否符合新型冠状病毒肺炎疑似病例标准。3. 会诊确认疑似后，在2小时内完成传染病网络直报。4. 采集鼻咽拭子标本送检新型冠状病毒核酸检测。5. 在确保转运安全前提下（备氧气袋、监护设备），立即联系定点医院，安排转运。6. 予对症支持：物理降温，暂缓抗生素使用，待核酸检测结果再定。7. 完善血生化、动脉血气分析及流感病毒检测，以排除其他病原体感染。",
    "patient_dialogue": "先生/女士，我明白您现在很着急，工地上还在催您回去，但咱们得先解决您的健康问题。从您的症状和检查结果来看，这不太像普通感冒——您有发烧、咳嗽，还有胸闷的感觉，再加上您刚从湖北回来，肺部CT显示有些炎症变化，这都提示可能是病毒性肺炎，比如新冠肺炎的可能性。所以，为了您的安全和防止传染给家人，我们必须严格按流程处理：您现在需要留在隔离室观察，我们会马上请专家来会诊；同时，给您做个简单的鼻咽拭子检测，就是拿棉签在鼻子里取点样，查查是不是新冠病毒。如果确认是疑似病例，我们会尽快转到专门的定点医院，那里有更全面的设备和治疗。您别担心，目前您的氧气水平正常，没有生命危险，我们会全程监护。我知道这耽误您工作了，但健康第一，万一拖成重症就更麻烦了。您先安心休息，有任何不适随时告诉我。"
  },
  {
    "id": 1572,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者55岁，因发热、干咳、进行性呼吸困难3天入院。入院当天外院胸部CT示“双肺弥漫性磨玻璃影，累及>75%肺野”，核酸SARS-CoV-2阳性。入院后12 h内症状迅速恶化：呼吸频率40次/分，SpO₂ 82%（储氧面罩15 L/min），PaO₂/FiO₂ 62 mmHg，pH 7.28，PaCO₂ 48 mmHg。已予气管插管、深度镇静、肌松、肺保护性通气（潮气量 6 mL/kg理想体重，PEEP 14 cmH₂O），平台压 30 cmH₂O。护士报告：患者体型肥胖（BMI 34 kg/m²），翻身需4人协作；今日凌晨因暴雨导致电梯短暂停运，人员调配紧张。家属在门外反复询问“能不能再加点镇静，让他舒服点”。",
    "reference_rule": {
      "condition": "对于严重ARDS患者",
      "action": "1. 建议进行肺复张; 2. 在人力资源充足的情况下，每天应当进行12小时以上的俯卧位通气; 3. 俯卧位通气效果不佳者，如条件允许，应当尽快考虑体外膜肺氧合（ECMO）。",
      "contraindication": null,
      "evidence": "对于严重ARDS患者，建议进行肺复张。在人力资源充足的情况下，每天应当进行12小时以上的俯卧位通气。俯卧位通气效果不佳者，如条件允许，应当尽快考虑体外膜肺氧合（ECMO）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，重点关注快速建立鉴别诊断以排除危急重症（如脓毒症、肺栓塞或其他并发症），并基于患者当前危重状态（严重ARDS）给出最直接的干预指令。思维重点在于立即评估氧合障碍原因，优先改善呼吸功能，避免延误治疗。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者诊断为COVID-19相关重度急性呼吸窘迫综合征（ARDS），关键指标：PaO₂/FiO₂ 62 mmHg（<100 mmHg为重度ARDS）、pH 7.28提示代谢性酸中毒、PaCO₂ 48 mmHg提示高碳酸血症；机械通气参数显示平台压30 cmH₂O（>30 cmH₂O可能增加气压伤风险），已实施肺保护性通气但氧合仍恶化。隐式线索：肥胖（BMI 34 kg/m²）增加俯卧位通气难度和气压伤风险；人力资源紧张（电梯停运导致人员调配不足）可能延误俯卧位实施；家属要求增加镇静可能掩盖呼吸恶化信号，需谨慎处理。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件匹配：患者为严重ARDS（PaO₂/FiO₂ <100 mmHg），无禁忌症（contraindication null）。规则对齐：指南建议肺复张、俯卧位通气和ECMO评估。安全检查：肥胖和平台压高增加俯卧位通气风险（如皮肤压疮或气压伤），但非绝对禁忌；人力资源紧张可能限制俯卧位时长，需优先保障安全；未发现药物相互作用或共病风险，但避免过度镇静以防抑制呼吸驱动。\n\nStep 4: 决策生成 (Decision Making) - 基于指南action，优先实施俯卧位通气以改善氧合（尽管人力资源紧张，应紧急调配人员），监测1-2小时评估效果；如无效或平台压持续高，立即启动ECMO评估；肺复张可尝试但需谨慎（监测平台压）；维持当前镇静深度，不额外增加以防干扰治疗。",
    "medical_order": "1. 立即尝试实施俯卧位通气，每日目标≥12小时，强化人员调配（需4人协作），监测翻身过程避免气压伤；2. 监测氧合参数（每30分钟记录PaO₂/FiO₂、平台压），如1小时内PaO₂/FiO₂未提升或平台压≥30 cmH₂O，请重症医学科急会诊评估ECMO；3. 维持现有深度镇静、肌松及肺保护性通气（潮气量6 mL/kg理想体重，PEEP 14 cmH₂O），避免调整镇静剂量；4. 完善动脉血气分析q2h，追踪酸中毒纠正情况。",
    "patient_dialogue": "家属您好，我是负责的医生。您家人现在肺部感染非常严重，呼吸很困难，我们正在用呼吸机全力帮助他。您提到加镇静药让他舒服点，这我理解，但多加药可能会影响我们观察他的呼吸变化，耽误治疗。我们现在最紧急的是给他翻身趴着睡（俯卧位），这能帮助肺更好地工作，改善氧气吸收。虽然人手紧张，我们会尽快调人来做。如果趴着效果不好，我们可能需要用更高级的机器支持。别担心，我们每一步都在为他的康复努力，有任何变化我会及时告诉您。"
  },
  {
    "id": 1579,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "58岁女性，体重88 kg，既往高血压10年。因‘发热6天、干咳伴活动后明显气促’于昨日收入急诊隔离留观室。入院时SpO₂ 90%（鼻导管5 L/min），胸CT示双肺多发磨玻璃影，咽拭子SARS-CoV-2核酸阳性。按《第五版》方案给予标准氧疗（鼻导管→普通面罩，最大氧流量15 L/min）及抗病毒、甲强龙40 mg qd。今日上午查房：患者仍呼吸急促，RR 32次/分，辅助呼吸肌明显参与，SpO₂ 88%（储氧面罩15 L/min），PaO₂/FiO₂ 95 mmHg。患者自述‘像被人掐住脖子，躺不平’，并担心家中养的猫无人喂食。体查：BP 146/92 mmHg，HR 118次/分，T 38.2 ℃，双肺湿啰音较前增多，无下肢水肿。动脉血气（面罩15 L/min）：pH 7.44，PaCO₂ 34 mmHg，PaO₂ 58 mmHg，HCO₃⁻ 23 mmol/L，乳酸1.7 mmol/L。急诊抢救区护士报告：患者刚去了两次卫生间后血氧掉到84%，需调高氧流量才能回到88%。",
    "reference_rule": {
      "condition": "患者接受标准氧疗后呼吸窘迫和（或）低氧血症无法缓解时",
      "action": "1. 可考虑使用高流量鼻导管氧疗或无创通气; 2. 若短时间（1-2小时）内病情无改善甚至恶化，应当及时进行气管插管和有创机械通气。",
      "contraindication": null,
      "evidence": "当患者接受标准氧疗后呼吸窘迫和（或）低氧血症无法缓解时，可考虑使用高流量鼻导管氧疗或无创通气。若短时间（1-2小时）内病情无改善甚至恶化，应当及时进行气管插管和有创机械通气。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规急诊诊疗场景，作为急诊/门诊医生，我的关注重点在于快速建立鉴别诊断（如排除继发感染、心力衰竭或肺栓塞等危急重症），并基于当前病情恶化给出直接、果断的处置指令，确保及时干预以避免呼吸衰竭加重。\n\nStep 2: 临床解码 (Clinical Decoding): 从病例中提取关键信息并转化为医学术语：患者为58岁女性，确诊SARS-CoV-2感染（咽拭子阳性），表现为发热、干咳及活动后气促，提示COVID-19肺炎进展；胸CT显示双肺多发磨玻璃影，结合PaO₂/FiO₂ 95 mmHg（严重低氧血症）和动脉血气（PaO₂ 58 mmHg, pH 7.44, PaCO₂ 34 mmHg），符合急性呼吸窘迫综合征（ARDS）；隐式线索包括活动后SpO₂降至84%（提示呼吸储备不足和氧合恶化）、辅助呼吸肌参与及RR 32次/分（表明呼吸窘迫加剧），以及高血压病史（BP 146/92 mmHg）和焦虑情绪（担心宠物）。整体评估为COVID-19相关ARDS恶化，无其他危急征象（如酸中毒、下肢水肿）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 当前患者接受标准氧疗（储氧面罩15 L/min）后，低氧血症未缓解（SpO₂ 88%，PaO₂/FiO₂ 95 mmHg）且病情恶化（活动后氧合下降），完全匹配指南Condition（标准氧疗后呼吸窘迫/低氧血症无法缓解）。指南Contraindication为null，安全检查无禁忌（生命体征相对稳定，无酸中毒或血流动力学崩溃证据）。\n\nStep 4: 决策生成 (Decision Making): 根据指南Action，优先考虑高流量鼻导管氧疗（HFNC）或无创通气（如CPAP/BiPAP）以改善氧合；并设定1-2小时观察期，若氧合无改善（如PaO₂/FiO₂未提升或SpO₂持续<90%）或恶化（如呼吸频率增加、辅助呼吸肌参与加剧），则立即进行气管插管和有创机械通气。同时，继续当前抗病毒及激素治疗，并监测高血压控制。",
    "medical_order": "1. 立即予高流量鼻导管氧疗（HFNC）或无创通气（CPAP/BiPAP），目标SpO₂ ≥92%；2. 密切监测生命体征（每30分钟记录RR、HR、BP、SpO₂）、动脉血气（1小时后复查）及呼吸窘迫征象；3. 若1-2小时内PaO₂/FiO₂未改善（<150 mmHg）或恶化（如SpO₂下降、RR升高），立即准备气管插管及有创机械通气；4. 继续抗病毒治疗（按《第五版》方案）及甲强龙40 mg qd静脉注射；5. 完善血常规、C反应蛋白、D-二聚体检查，评估感染及血栓风险；6. 予一级护理，限制活动（卧床休息），避免下床如厕，改用床旁便器；7. 监测并控制高血压，予口服降压药（如氨氯地平5 mg qd），目标BP <140/90 mmHg。",
    "patient_dialogue": "阿姨，我是您的医生。您现在呼吸很困难，就像您说的‘像被人掐住脖子’，这是因为肺部感染比较重，氧气进不去。我们得马上给您换一种更强的氧气支持，比如通过鼻子的高流量氧气，这样能让您呼吸更轻松些。如果不及时处理，怕情况会变得更严重。同时，我们会每半小时检查您的呼吸、心跳和血氧，确保安全。另外，您先别下床去卫生间了——活动会让氧气掉得更快，我们用床边的便器，护士会帮忙。至于您担心的猫咪，我们会联系您家人或社区帮忙照看，您先专心养病。高血压药我们接着用，控制好血压对恢复很重要。记住，有任何不舒服，马上告诉护士。"
  },
  {
    "id": 1567,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者3天前无明显诱因出现38.7 ℃发热，伴干咳、乏力；今日出现活动后轻度气促。既往体健，无慢性病史，无药物过敏。1月18日曾自驾赴武汉出差，21日返京，同车同事2人已确诊COVID-19。查体：T 38.2 ℃，P 96次/分，R 22次/分，SpO₂ 94%（未吸氧），咽部轻度充血，双肺听诊未闻及干湿啰音。血常规：WBC 4.1×10⁹/L，LY 0.9×10⁹/L；CRP 18 mg/L；胸部CT示双肺外周多发磨玻璃影，部分实变。患者自述平时喜欢喝浓茶，今日因排队久感口渴，自带保温杯不停啜饮。",
    "reference_rule": {
      "condition": "患者（抗病毒治疗）",
      "action": "1. 可试用 α-干扰素雾化吸入（成人每次500万U或相当剂量，加入灭菌注射用水2ml，每日2次）; 2. 洛匹那韦/利托那韦（200mg/50mg，每粒）每次2粒，每日2次; 3. 或可加用利巴韦林（成人首剂4g，次日每8小时一次，每次1.2g，或8mg/kg iv. 每8小时一次）。",
      "contraindication": "要注意洛匹那韦/利托那韦相关腹泻、恶心、呕吐、肝功能损害等不良反应，同时要注意和其他药物的相互作用。",
      "evidence": "目前没有确认有效的抗病毒治疗方法。可试用 α-干扰素雾化吸入（成人每次500万U或相当剂量，加入灭菌注射用水2ml，每日2次）、洛匹那韦/利托那韦（200mg/50mg，每粒）每次2粒，每日2次，或可加用利巴韦林（成人首剂4g，次日每8小时一次，每次1.2g，或8mg/kg iv. 每8小时一次）。要注意洛匹那韦/利托那韦相关腹泻、恶心、呕吐、肝功能损害等不良反应，同时要注意和其他药物的相互作用。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于常规诊断与治疗场景，需采用急诊/门诊医生思维模式。关注点：快速建立鉴别诊断（COVID-19肺炎可能性高），排除危急重症（如呼吸衰竭），直接给出治疗指令。",
      "Step 2: 临床解码": {
        "关键线索": [
          "流行病学史：武汉疫区暴露+密接确诊者（强COVID-19风险）",
          "症状三联征：发热+干咳+进行性气促（符合病毒性肺炎进展）",
          "CT特征性表现：双肺外周磨玻璃影伴实变（典型COVID-19影像）",
          "实验室证据：淋巴细胞减少（LY 0.9×10⁹/L）+CRP升高（炎症反应）",
          "氧合临界值：SpO₂ 94%（需警惕低氧血症恶化）",
          "隐式风险：频繁饮水可能干扰雾化治疗依从性"
        ],
        "鉴别诊断": [
          "首要诊断：新型冠状病毒肺炎（临床诊断标准符合）",
          "次要排除：流感病毒肺炎（无肌痛/流涕）、细菌性肺炎（WBC不升）"
        ]
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "完全符合抗病毒治疗条件（暴露史+临床+影像确诊）",
        "禁忌症核查": [
          "洛匹那韦/利托那韦：患者无慢性病/过敏史，基线肝功能需完善",
          "干扰素雾化：饮水习惯需提前干预（雾化前后30分钟禁饮）",
          "利巴韦林：暂不首选（病情非重症，避免大剂量副作用）"
        ],
        "安全优先级": "氧饱和度监测 > 抗病毒治疗 > 液体管理"
      },
      "Step 4: 决策生成": {
        "核心决策": "立即隔离+启动抗病毒联合治疗+持续氧监测",
        "依据": [
          "指南推荐α-干扰素雾化+洛匹那韦/利托那韦双重覆盖",
          "SpO₂ 94%提示需预警性氧疗准备",
          "淋巴细胞显著降低需免疫支持"
        ]
      }
    },
    "medical_order": "1. 立即单间隔离，上报传染病卡；\n2. 抗病毒治疗：①α-干扰素雾化吸入（500万U + 灭菌注射用水2ml）每日2次（操作前后30分钟禁食水）；②洛匹那韦/利托那韦200mg/50mg 每次2粒口服 每日2次；\n3. 监测方案：持续SpO₂监测（每小时）、呼吸频率监测（每4小时），完善肝功能、D-二聚体、IL-6检测；\n4. 氧疗预案：若SpO₂≤93%或呼吸频率≥28次/分，启动经鼻高流量氧疗；\n5. 支持治疗：卧床休息，每日饮水量控制在1.5-2L，避免浓茶。",
    "patient_dialogue": "王先生，咱们需要立即做三件事：\n第一，您这个情况高度怀疑新冠病毒感染，必须马上住进隔离病房——您同事确诊了，您的症状和CT片子都指向这个病，这既是为您治疗，也是保护家人不被传染。\n第二，治疗方案很明确：每天两次雾化（像做蒸汽呼吸那样），加上早晚各吃一次抗病毒药片。雾化前后半小时别喝水，不然药效会打折扣。\n第三，您手指上这个夹子会一直监测血氧，护士每四小时记录呼吸。如果感觉喘不上气或者监护仪报警，千万别硬撑，立刻按铃！\n您带保温杯的习惯很好，但别喝太急，少量多次更安全。咱们争取把病情控制在早期阶段，您配合治疗，康复希望很大！"
  },
  {
    "id": 1552,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者42岁，建筑工人，昨日乘动车返乡。今日凌晨起畏寒、干咳，伴38.7℃发热，自服布洛芬后仍反复。急诊测SpO₂ 93%，呼吸22次/分；CT示双肺外周多发磨玻璃影，右下肺小片实变。患者自述「工地上有人咳嗽厉害，没戴口罩」。查体：咽部充血，双肺呼吸音粗，未闻及湿啰音。血常规：白细胞4.1×10⁹/L，淋巴细胞0.9×10⁹/L。患者同时抱怨「牙床长了个小脓点，咬东西疼」。",
    "reference_rule": {
      "condition": "医务人员发现符合病例定义的疑似病和临床诊断病例（湖北省）",
      "action": "1. 立即进行隔离治疗; 2. 疑似病例和临床诊断病例要单间隔离; 3. 尽快采集标本进行病原学检测。",
      "contraindication": null,
      "evidence": "各级各类医疗机构的医务人员发现符合病例定义的疑似病和临床诊断病例后，应当立即进行隔离治疗，疑似病例和临床诊断病例要单间隔离，对疑似病例和临床诊断病例要尽快采集标本进行病原学检测。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于常规急诊诊疗场景，我的关注重点是快速建立鉴别诊断（Differential Diagnosis），排除危急重症（如脓毒症、急性呼吸窘迫综合征），并基于指南给出最直接的治疗指令。作为急诊医生，需优先确保患者安全，避免病情恶化。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例中提取关键信息：患者42岁男性，急性起病（昨日暴露后今日发病），症状包括发热（38.7℃）、畏寒、干咳、自服布洛芬无效；体征SpO₂ 93%（提示轻度低氧血症）、呼吸频率22次/分（轻度增加）；CT显示双肺外周多发磨玻璃影和右下肺实变（符合病毒性肺炎影像学特征）；暴露史（工地同事咳嗽未戴口罩，提示社区传播风险）；血常规白细胞4.1×10⁹/L和淋巴细胞0.9×10⁹/L（减少，支持病毒感染）；查体咽部充血、双肺呼吸音粗（无湿啰音，排除细菌性肺炎）；额外抱怨牙龈脓肿（可能为局部感染，但不影响核心诊断）。隐式线索：乘动车返乡增加传播风险，淋巴细胞减少高度提示病毒性感染（如COVID-19）。鉴别诊断包括COVID-19、流感、其他社区获得性肺炎；排除细菌感染（无脓痰、湿啰音）和危急并发症（目前无休克或严重呼吸衰竭）。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南condition为'医务人员发现符合病例定义的疑似病和临床诊断病例（湖北省）'，患者表现（发热+呼吸道症状+影像学异常+暴露史）完全符合COVID-19疑似病例定义。指南action要求'立即隔离治疗'、'单间隔离'和'尽快采集标本检测'。Contraindication为null，无安全隐患。需优先执行隔离和检测，避免延误。\n\n**Step 4: 决策生成 (Decision Making)**\n根据指南action，生成决策：立即安排单间隔离治疗；尽快采集鼻咽拭子进行病原学检测（如SARS-CoV-2核酸）；同时给予支持治疗（如氧疗），并监测生命体征。牙龈脓肿作为次要问题，可安排会诊处理。",
    "medical_order": "1. 予患者单间隔离治疗，一级护理。2. 立即采集鼻咽拭子标本，检测SARS-CoV-2核酸、流感病毒及呼吸道病原体。3. 监测生命体征（体温、呼吸、SpO₂），予低流量氧疗维持SpO₂ >94%。4. 完善血常规、C反应蛋白、降钙素原、肝肾功能及血气分析。5. 请口腔科急会诊评估牙龈脓肿。6. 暂予对症支持治疗（补液、退热，避免非甾体抗炎药）。",
    "patient_dialogue": "王先生，听我说：您有发烧、咳嗽，肺部检查显示可能是个病毒感染，而且您提到工地上有人咳嗽没戴口罩，这增加了传染风险。为了您和家人的安全，我们必须马上把您安排到单独房间隔离，这样不会传染给其他人。我们现在会做个简单的咽拭子检查，确认是什么病毒引起的。同时，我们会给您吸点氧气，让您呼吸更顺畅，并随时监测您的状况。您说牙疼有个小脓点，我们会请口腔医生来看一下，但这不着急，先处理主要的感染问题。别担心，我们会全程照顾好您，有任何不舒服随时告诉我。"
  },
  {
    "id": 1589,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者71岁，既往高血压、COPD，因'发热咳嗽6天，喘促加重1天'于1月30日入院。胸部CT示双肺弥漫磨玻璃影，咽拭子2019-nCoV核酸阳性，按第五版方案已予抗病毒、甲强龙40 mg q12h及高流量氧疗。今日（2月2日）凌晨起，患者静息亦明显气促，RR 34次/分，SpO₂ 88%（FiO₂ 0.6），改为无创通气后仅升至90%。查体：嗜睡，呼之能应但答不切题，烦躁抓床栏；全身大汗，四肢湿冷，皮温低，毛细血管再充盈时间>5 s。T 37.9 ℃，HR 126次/分，BP 92/58 mmHg（去甲肾上腺素0.15 μg/kg·min）。舌象：舌质紫暗、边有瘀点，苔中部厚腻偏燥；脉象：浮大无根，重按即失。动脉血气：pH 7.28，PaCO₂ 52 mmHg，PaO₂ 58 mmHg，乳酸3.4 mmol/L。护士备注：昨夜患者曾自行扯掉面罩，说“闷得慌”，需家属按住肩膀才能继续无创通气。",
    "reference_rule": {
      "condition": "临床治疗期重症期：内闭外脱，临床表现：呼吸困难、动辄气喘或需要辅助通气，伴神昏，烦躁，汗出肢冷，舌质紫暗，苔厚腻或燥，脉浮大无根。",
      "action": "1. 推荐处方：人参15g、黑顺片10g（先煎）、山茱萸15g，送服苏合香丸或安宫牛黄丸; 2. 推荐中成药：血必净注射液、参附注射液、生脉注射液。",
      "contraindication": null,
      "evidence": "（3）重症期：内闭外脱\n    * 临床表现：呼吸困难、动辄气喘或需要辅助通气，伴神昏，烦躁，汗出肢冷，舌质紫暗，苔厚腻或燥，脉浮大无根。\n    * 推荐处方：人参15g、黑顺片10g（先煎）、山茱萸15g，送服苏合香丸或安宫牛黄丸\n    * 推荐中成药：血必净注射液、参附注射液、生脉注射液"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于常规急诊诊疗场景，患者为急性呼吸衰竭伴休克状态，需优先快速建立鉴别诊断（排除脓毒症休克、多器官功能障碍等危急重症），并给出最直接的干预指令，以稳定病情为核心。关注重点：快速评估呼吸循环功能，避免延误治疗。\n\nStep 2: 临床解码 (Clinical Decoding) – 患者为71岁男性，COVID-19重症肺炎（双肺弥漫磨玻璃影证实），当前表现为急性呼吸衰竭（高呼吸频率34次/分、低氧血症PaO₂ 58 mmHg、高碳酸血症PaCO₂ 52 mmHg，无创通气后SpO₂仅90%）、脓毒症休克（低血压92/58 mmHg、心动过速126次/分、乳酸升高3.4 mmol/L、四肢湿冷及毛细血管再充盈时间延长提示组织灌注不足）、神志改变（嗜睡、烦躁、答不切题）及代谢性酸中毒（pH 7.28）。隐式线索：患者烦躁抓床栏及自行扯面罩行为，可能因COPD基础病加重不耐受无创通气，需警惕呼吸肌疲劳进展；舌质紫暗边有瘀点、苔厚腻偏燥、脉浮大无根，符合中医'内闭外脱'证候，提示气血逆乱、阴阳离决。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) – 患者临床表现（呼吸困难需辅助通气、神昏烦躁、汗出肢冷、舌脉象）完全匹配指南的Condition '内闭外脱'。指南Contraindication为null，无禁忌；但需安全检查：患者高血压、COPD病史，当前用去甲肾上腺素和激素，中药黑顺片（附子）可能轻度升压，但剂量小且无直接冲突；苏合香丸或安宫牛黄丸需避免用于孕妇，但患者高龄男性，安全；中成药血必净、参附、生脉注射液常用于休克，无报道与当前抗病毒药物相互作用。优先级：安全无虞，可立即应用。\n\nStep 4: 决策生成 (Decision Making) – 基于指南Action，生成决策：立即添加中药治疗以回阳救逆、开窍固脱。处方选用人参15g、黑顺片10g（先煎）、山茱萸15g煎服，并送服安宫牛黄丸（优选于苏合香丸，因患者烦躁神昏更需清热开窍）；中成药予血必净注射液（抗炎）、参附注射液（升压固脱）、生脉注射液（改善微循环）静脉滴注。同时，维持当前支持治疗，密切监测生命体征。",
    "medical_order": "1. 继续无创通气支持，FiO₂调整至维持SpO₂ >90%，加强镇静管理（如必要时予小剂量咪达唑仑静脉推注，以改善耐受）；2. 维持去甲肾上腺素静脉泵入（当前0.15 μg/kg·min），监测血压q1h，目标MAP >65 mmHg；3. 予中药煎剂：人参15g、黑顺片10g（先煎2小时）、山茱萸15g，水煎服，每日一剂，分两次服；送服安宫牛黄丸1丸，每日两次；4. 加用中成药静脉滴注：血必净注射液50ml + NS 100ml ivgtt q12h、参附注射液50ml + NS 100ml ivgtt q12h、生脉注射液30ml + NS 100ml ivgtt qd；5. 持续心电监护，q2h监测动脉血气、乳酸、电解质；6. 完善血培养、降钙素原、肝肾功能检查，以排除继发感染；7. 一级护理，记24小时出入量，防跌倒/非计划拔管。",
    "patient_dialogue": "（面对家属）老人家现在情况不太好，呼吸很困难，血压也偏低，整个人出冷汗、手脚冰凉，这就像身体里的气力快耗尽了。咱们得抓紧用几种中药来帮忙：一种是煎的药汤，能补气固本；另一种是丸药，专门帮他清醒头脑、缓解烦躁。另外，我们会打一些针剂进去，改善血液循环和氧气供应。您放心，这些药都是针对他这种状态特别配的，能稳住病情。记住，千万别让他自己扯掉氧气面罩——这是救命的东西，闷是暂时的，坚持住才能慢慢好起来。我们会一直盯着监测仪器，有什么变化马上处理。您陪在旁边多安抚他，告诉他医生护士都在全力帮忙。"
  },
  {
    "id": 1568,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者47岁，网约车司机，今日凌晨收车回家后出现畏寒、干咳加重，伴明显气短。自测体温38.6 ℃，口服退热药后仍持续＞38 ℃。既往体健，无吸烟史。来院时神志清，呼吸频率28次/分，SpO₂ 90%（未吸氧，室温22 ℃）。查体双肺呼吸音低，右下肺可闻及细湿啰音；心率105次/分，律齐。血常规：WBC 5.2×10⁹/L，淋巴细胞0.9×10⁹/L；CRP 76 mg/L；胸部CT示双肺多发磨玻璃影，外周分布为主，右下肺局部实变。患者自述昨夜因雨雪堵车连续驾车12 h，途中仅进食泡面，未规律饮水。急诊分诊护士已为其测血压120/78 mmHg，血糖6.4 mmol/L。",
    "reference_rule": {
      "condition": "患者（氧疗）",
      "action": "及时给予有效氧疗措施，包括鼻导管、面罩给氧和经鼻高流量氧疗。",
      "contraindication": null,
      "evidence": "及时给予有效氧疗措施，包括鼻导管、面罩给氧和经鼻高流量氧疗。"
    },
    "thought": "本案例属于常规急诊诊疗场景（根据Context：常规诊断与治疗）。作为急诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如脓毒症或急性呼吸窘迫综合征），并给出最直接的诊疗指令。具体步骤：1. 场景定义：患者出现急性呼吸道症状（发热、咳嗽、气短），结合低氧血症和影像学异常，属于急诊常见表现，需优先稳定生命体征。2. 临床解码：从病例中提取关键信息并转化为医学术语：畏寒、干咳、气短提示急性呼吸道感染；SpO₂ 90%、呼吸频率28次/分、心率105次/分表明低氧血症和呼吸窘迫；双肺呼吸音低、右下肺细湿啰音及CT双肺磨玻璃影伴实变支持肺炎（可能病毒性或细菌性）；淋巴细胞减少（0.9×10⁹/L）和CRP升高（76 mg/L）反映炎症反应；病史中连续驾车12 h、不规律饮水提示潜在脱水和疲劳。鉴别诊断包括社区获得性肺炎（如COVID-19、流感或细菌性）、脓毒症，需排除其他感染或非感染性肺病。3. 规则对齐与安全检查：参考指南条件为'患者（氧疗）'，意为患者需氧疗。病例中SpO₂ 90%（未吸氧）明确符合氧疗指征。无禁忌症（指南contraindication为null；患者无COPD或吸烟史，无已知氧疗风险）。4. 决策生成：根据指南action，优先给予有效氧疗措施；同时，作为急诊管理，需补充氧疗外的紧急处置，如监测、诊断检查和经验性治疗，以排除危急重症并控制感染。",
    "medical_order": "予经鼻高流量氧疗（HFNC）起始流量40 L/min、FiO₂ 0.5，目标维持SpO₂ >94%；监测生命体征（呼吸频率、心率、SpO₂）q1h。完善动脉血气分析、COVID-19 PCR检测、流感抗原检测、血培养及降钙素原检查。静脉滴注0.9%生理盐水500 mL 纠正潜在脱水。经验性予阿奇霉素500 mg IV qd 和头孢曲松1 g IV qd 覆盖社区获得性肺炎病原体。一级护理，密切观察呼吸状态变化。",
    "patient_dialogue": "王先生，您好。从您的症状来看，您有肺炎的迹象，现在呼吸有点困难，血氧偏低，这对身体负担很大。我们需要立刻给您吸氧，帮助您更轻松地呼吸，避免情况恶化。同时，我们会做一些检查，比如抽血和取呼吸道样本，弄清楚是什么病菌引起的，比如是不是流感或新冠病毒。另外，您昨晚开车时间长，喝水少，可能有点脱水，我们会给您输点液补充水分。为了控制感染，我们先用一些抗生素药物。别担心，我们会一直在这里监测您的状况，确保您安全。现在请尽量放松，配合我们的治疗。"
  },
  {
    "id": 1577,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者今晨出现明显恶寒，测腋温37.8℃，伴干咳无痰、咽干，自觉胸口闷压、四肢倦怠，搬运货物时气短明显。近2日食欲差，偶有恶心，今日早餐后腹泻1次，便质稀溏。无吸烟史，无基础慢病。查体：精神倦，咽部轻度充血，双肺呼吸音粗，未闻及干湿啰音；心率88次/分，律齐。舌质淡红、苔白腻，脉濡。2天前同工作区出现确诊COVID-19病例，患者未佩戴口罩频繁接触。胸部CT示双肺外周多发小片磨玻璃影，边界模糊；血常规WBC 5.4×10⁹/L，淋巴细胞比例32%，CRP 18 mg/L。现候诊区座椅紧张，患者裹厚衣仍诉怕冷，担心被同事传染，又忧虑家中老小无人照顾。",
    "reference_rule": {
      "condition": "临床治疗期初期：寒湿郁肺，临床表现：恶寒发热或无热，干咳，咽干，倦怠乏力，胸闷，脘痞，或呕恶，便溏。舌质淡或淡红，苔白腻，脉濡。",
      "action": "推荐处方：苍术15g、陈皮10g、厚朴10g、藿香10g、草果6g、生麻黄6g、羌活10g、生姜10g、槟郎10g。",
      "contraindication": null,
      "evidence": "（1）初期：寒湿郁肺\n    * 临床表现：恶寒发热或无热，干咳，咽干，倦怠乏力，胸闷，脘痞，或呕恶，便溏。舌质淡或淡红，苔白腻，脉濡。\n    * 推荐处方：苍术15g、陈皮10g、厚朴10g、藿香10g、草果6g、生麻黄6g、羌活10g、生姜10g、槟郎10g"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，作为急诊/门诊医生，我将快速建立鉴别诊断（优先排除COVID-19重症风险），聚焦于直接评估症状、匹配指南并给出治疗指令，确保决策高效。Step 2: 临床解码 (Clinical Decoding) - 患者症状（恶寒、低热37.8℃、干咳、咽干、胸闷、乏力、气短、食欲差、恶心、腹泻）结合流行病学史（未戴口罩暴露于COVID-19确诊者）、查体（精神倦、咽部充血、呼吸音粗、舌苔白腻、脉濡）和辅助检查（CT示双肺外周磨玻璃影、淋巴细胞比例降低32%、CRP升高18 mg/L）提示急性病毒感染，高度符合COVID-19肺炎初期表现；中医证型为寒湿郁肺，需排除其他急症如细菌性肺炎或心衰（无啰音、心率正常）。隐式线索包括焦虑情绪（担心传染和家庭无人照顾）及轻度炎症反应。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者临床表现（恶寒、干咳、咽干、乏力、胸闷、恶心、便溏、舌淡红苔白腻脉濡）完美匹配指南中的寒湿郁肺证Condition，无Contraindication（无基础慢病、无药物过敏史），安全风险低（无呼吸困难加重），但需监测CRP升高以防病情进展。Step 4: 决策生成 (Decision Making) - 基于指南Action，直接采用推荐中药处方；补充支持性措施，包括隔离和症状监测，以快速控制病情。",
    "medical_order": "诊断：COVID-19疑似感染（依据：暴露史、症状、CT表现），中医诊断：寒湿郁肺证。予中药处方：苍术15g、陈皮10g、厚朴10g、藿香10g、草果6g、生麻黄6g、羌活10g、生姜10g、槟郎10g，每日一剂，水煎服。嘱居家隔离14天，监测体温每日两次；如出现呼吸困难（SpO2 < 94%）或高热（>38.5℃），立即复诊。完善COVID-19 RT-PCR检测。予清淡饮食，避免劳累。",
    "patient_dialogue": "您好，我看了您的症状和检查结果。您可能感染了新冠病毒，因为您最近接触过确诊的同事，而且您的咳嗽、怕冷和乏力这些表现都挺像的。别担心，这还算早期，不算严重。我给您开个中药方子，它能帮您散寒祛湿，缓解怕冷、咳嗽和肚子不舒服，您按时煎服就行。另外，非常重要的一点是：您得立刻回家隔离，别出门，也别和家人接触。如果不这样做，很容易传染给家里的老人和孩子，那就更麻烦了。在家好好休息，多喝温水，吃点稀饭、面条这样的清淡食物，别干重活。每天量两次体温，如果感觉喘不上气或烧得更高了，马上来医院找我。我会帮您安排检测确认一下。您别太焦虑，照顾好自己就是对家人最好的保护，有什么问题随时联系我。"
  },
  {
    "id": 1593,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "【现病史】患者3天前因「发热、干咳、进行性呼吸困难」入院，鼻咽拭子SARS-CoV-2 RT-PCR阳性，胸部CT示双肺外周磨玻璃影>50%。昨日起需储氧面罩15 L/min才能维持SpO₂ 88%，转入负压ICU。今晨出现躁动、皮肤湿冷，尿量减至20 mL/h。\n【既往史】2型糖尿病15年（HbA1c 9.2%），冠心病PCI术后4年（支架2枚），高血压3级，慢性肾功能不全（基线Scr 132 μmol/L）。\n【查体】T 38.7 ℃，HR 124次/分，律齐，BP 82/48 mmHg（袖带血压，上臂围32 cm），RR 32次/分，SpO₂ 85%（15 L/min储氧面罩），颈静脉怒张（+），双肺湿啰音满布，四肢末梢花斑，毛细血管再充盈时间5秒。\n【实验室】动脉血气（面罩15 L）：pH 7.28，PaCO₂ 32 mmHg，PaO₂ 56 mmHg，Lac 4.1 mmol/L；NT-proBNP 3 200 pg/mL；Scr 198 μmol/L；CRP 186 mg/L，IL-6 145 pg/mL；Hb 104 g/L，Plt 78×10⁹/L；D-二聚体 4.3 mg/L。\n【治疗经过】入院后已予甲基强的松龙40 mg qd、抗病毒、低分子肝素、胰岛素泵控糖；今晨6 h内已快速输注平衡盐液1 500 mL，血压仍进行性下降。\n【干扰信息】患者职业为长途货车司机，入院前48 h曾连续驾驶12 h未饮水；今晨6点病室空调故障，室温短暂升至28 ℃，患者自述「燥热难忍」。",
    "reference_rule": {
      "condition": "重型、危重型病例（循环支持）",
      "action": "1. 充分液体复苏的基础上，改善微循环; 2. 使用血管活性药物; 3. 必要时进行血流动力学监测。",
      "contraindication": null,
      "evidence": "充分液体复苏的基础上，改善微循环，使用血管活性药物，必要时进行血流动力学监测。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，优先级严格遵循安全 > 疗效的原则。患者患有多种基础疾病（COVID-19重症、2型糖尿病、冠心病、高血压、慢性肾功能不全），需全网扫描潜在风险点，避免治疗冲突。\n\nStep 2: 临床解码 (Clinical Decoding): 患者当前处于感染性休克（低血压82/48 mmHg、皮肤湿冷、末梢花斑、乳酸4.1 mmol/L、毛细血管再充盈时间延长）和急性呼吸窘迫综合征（ARDS）（PaO₂ 56 mmHg、SpO₂ 85%、双肺湿啰音、CT示磨玻璃影>50%），合并急性肾损伤（Scr 198 μmol/L vs 基线132 μmol/L）、高炎症状态（CRP 186 mg/L, IL-6 145 pg/mL）和血小板减少（Plt 78×10⁹/L）。既往病史提示心血管和代谢共病（冠心病PCI术后、HbA1c 9.2%），治疗经过显示液体复苏无效（平衡盐液1 500 mL后血压仍下降）。干扰因素（如脱水或空调故障）为次要，核心是循环衰竭进展。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition为“重型、危重型病例（循环支持）”，患者符合标准（需储氧面罩维持氧合、循环衰竭）。Action包括充分液体复苏基础上改善微循环、使用血管活性药物、血流动力学监测。Contraindication为null，但需全网扫描安全风险：患者肾功能不全可能增加血管活性药物（如去甲肾上腺素）的肾毒性风险；血小板减少和D-二聚体升高（4.3 mg/L）提示出血/血栓风险，抗凝治疗需谨慎；糖尿病和激素使用可能加重高血糖。无绝对禁忌症，但决策必须优先规避药物相互作用（如血管活性药与抗凝药）。\n\nStep 4: 决策生成 (Decision Making): 基于指南Action，在已尝试液体复苏基础上，立即启动血管活性药物（优选去甲肾上腺素，以最小肾毒性）和血流动力学监测（如中心静脉压），同时优化多器官支持治疗，确保安全为首要目标。",
    "medical_order": "1. 立即予去甲肾上腺素静脉泵入，起始剂量0.05 μg/kg/min，根据血压调整目标MAP ≥65 mmHg；监测尿量及肾功能。\n2. 置入中心静脉导管，行血流动力学监测（包括CVP及ScvO₂），每2小时评估一次。\n3. 维持储氧面罩氧疗，目标SpO₂ >90%；复查动脉血气q4h。\n4. 继续甲基强的松龙40 mg qd、抗病毒治疗（按COVID-19方案）、低分子肝素（调整剂量至预防性，监测PLT及D-二聚体）、胰岛素泵控糖（目标血糖7-10 mmol/L）。\n5. 监测生命体征q1h，完善血常规、电解质、乳酸及肾功能q6h；必要时评估肾脏替代治疗指征。\n6. 限制液体输入，避免加重心衰及肾损伤；予一级护理，密切观察意识状态及末梢灌注。",
    "patient_dialogue": "王先生，您的病情现在很严重，心脏和血压都出了点问题，我们需要马上处理。先给您用点药来稳住血压，这药能帮您的心脏更好地工作。同时，我们会放一个小管子到您的大血管里，这样我们能随时查看您的心脏和血液循环情况，确保治疗精准有效。您之前有糖尿病和肾病，所以我们会特别小心用药，避免给您身体带来额外负担。我知道您可能感觉燥热或不舒服，但别担心，我们医生护士都在旁边守着。您就尽量放松，配合我们，咱们一步步来，好吗？"
  },
  {
    "id": 1581,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者 17 天前确诊新冠肺炎（普通型），经定点医院治疗后病毒核酸转阴出院。今由家属搀扶步入诊室，口罩上方可见明显气短，行走 10 米即需停下扶墙喘息。主诉：‘胸口像压了石头，吃两口饭就饱，饭后恶心，偶尔吐清水；大便一天两次，稀溏粘马桶，冲两次才干净，拉完仍觉没劲。’查体：舌淡胖有齿痕，苔白腻中部厚，脉细弱。体温 36.4 ℃，SpO₂ 94%（未吸氧），HR 88 次/分，BP 108/70 mmHg。患者补充：‘原来能扛两袋大米上五楼，现在提一壶水都手抖。’今日为康复后首次复诊，未服用任何中药，仅口服维生素。家属代诉昨夜因天气突变暴雨，患者自觉胸闷加重，整夜半卧位入睡。",
    "reference_rule": {
      "condition": "临床治疗期恢复期：肺脾气虚，临床表现：气短、倦怠乏力、纳差呕恶、痞满，大便无力，便溏不爽，舌淡胖，苔白腻。",
      "action": "推荐处方：法半夏9g、陈皮10g、党参15g、炙黄芪30g、茯苓15g、藿香10g、砂仁6g（后下）。",
      "contraindication": null,
      "evidence": "（4）恢复期：肺脾气虚\n    * 临床表现：气短、倦怠乏力、纳差呕恶、痞满，大便无力，便溏不爽，舌淡胖，苔白腻。\n    * 推荐处方：法半夏9g、陈皮10g、党参15g、炙黄芪30g、茯苓15g、藿香10g、砂仁6g（后下）"
    },
    "thought": {
      "step1_场景定义": "本案例属于常规门诊复诊场景（新冠肺炎恢复期）。关注重点：排除潜在危急重症（如心肌损伤、肺纤维化），快速匹配中医证型并启动康复治疗。",
      "step2_临床解码": {
        "核心症状": "①活动耐量断崖式下降（劳力性气短+肌力减退）；②脾虚湿困证（纳差呕恶、便溏粘滞）；③天气诱发胸闷（提示卫表不固）",
        "关键体征": "舌淡胖齿痕/苔白腻（脾虚湿盛）、脉细弱（气虚）、SpO₂ 94%（未吸氧示轻度低氧）",
        "隐式风险": "进行性乏力+夜间端坐呼吸需警惕心功能不全"
      },
      "step3_规则对齐与安全检查": {
        "指南匹配": "完全符合指南'肺脾气虚证'（气短+乏力+纳差便溏+舌象吻合）",
        "禁忌筛查": "①无用药禁忌（未服中药/西药无冲突）；②需排除器质病变：建议完善心肌酶/BNP/胸部CT",
        "警报项": "夜间半卧位呼吸（启动心功能评估）"
      },
      "step4_决策生成": "采纳指南处方为核心，叠加氧疗支持及紧急预警机制"
    },
    "medical_order": null,
    "patient_dialogue": null
  },
  {
    "id": 1569,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "凌晨02:10，ICU值班住院医收到呼吸机高压报警。患者镇静RASS -1，但呼吸频率仍35次/分，潮气量设定420 ml（≈6 ml/kg理想体重），平台压28 cmH₂O，血氧饱和度92%（FiO₂ 0.8，PEEP 12 cmH₂O）。护士报告患者腹部明显隆起，上臂围38 cm，刚才量血压需用大号袖带。床旁胸片示双肺弥漫磨玻璃影较前无改善。住院医发现波形图上每隔4-5次通气就出现一次‘双触发’，提示明显人机不同步。患者职业为夜班出租车司机，家属在电话中表示‘他只是咳嗽了几天，怎么就要插管’，情绪焦虑。",
    "reference_rule": {
      "condition": "进行有创机械通气时",
      "action": "1. 采用肺保护性通气策略，即小潮气量（4-8 ml/kg理想体重）和低吸气压力（平台压<30 cmH2O）进行机械通气，以减少呼吸机相关肺损伤; 2. 较多患者存在人机不同步，应当及时使用镇静以及肌松剂。",
      "contraindication": null,
      "evidence": "采用肺保护性通气策略，即小潮气量（4-8 ml/kg理想体重）和低吸气压力（平台压<30 cmH2O）进行机械通气，以减少呼吸机相关肺损伤。较多患者存在人机不同步，应当及时使用镇静以及肌松剂。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于操作规范与测量场景。作为操作执行者，需聚焦呼吸机参数设置、人机同步性和生理干扰因素，确保符合肺保护性通气策略的操作规范。",
      "Step 2: 临床解码": {
        "显性指标": [
          "呼吸频率35次/分（显著高于正常12-20次/分）",
          "平台压28 cmH₂O（接近安全上限30 cmH₂O）",
          "双触发波形（每4-5次通气出现，提示患者主动吸气与呼吸机送气不同步）"
        ],
        "隐式线索": [
          "上臂围38 cm + 需大号血压袖带 → 肥胖（BMI≥30 kg/m²可能性高）",
          "腹部膨隆 → 腹内压增高风险，可能限制膈肌运动",
          "镇静RASS -1仍呼吸急促 → 镇静深度不足或存在疼痛/不适"
        ],
        "综合判断": "肥胖相关腹内压增高叠加双肺弥漫病变，导致平台压升高和人机对抗，触发高压报警。"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": [
          "潮气量6 ml/kg符合肺保护策略（4-8 ml/kg）",
          "平台压28 cmH₂O < 30 cmH₂O临界值，但需优化",
          "人机不同步明确存在，需按指南处理"
        ],
        "禁忌筛查": "指南无绝对禁忌，但肥胖需警惕肌松剂蓄积风险",
        "干扰因素": [
          "肥胖致胸壁顺应性下降",
          "腹内压升高影响跨肺压",
          "镇静深度不足加重人机对抗"
        ]
      },
      "Step 4: 决策生成": {
        "核心原则": "先解决人机不同步以降低平台压，再优化氧合",
        "分级处理": [
          "立即：加深镇静+肌松消除人机对抗",
          "同步：调整呼吸机参数降低平台压",
          "后续：处理腹胀及氧合障碍"
        ]
      }
    },
    "medical_order": [
      "1. 立即予丙泊酚静脉推注（0.5 mg/kg），调整镇静目标至RASS -3至-4",
      "2. 若镇静后仍见双触发波形，予罗库溴铵0.6 mg/kg静脉推注（按理想体重计算）",
      "3. 呼吸机参数调整：",
      "   - 潮气量降至380 ml（≈5 ml/kg理想体重）",
      "   - 提高吸气流量10%，延长吸气时间0.2秒",
      "   - 触发灵敏度调高至1 L/min",
      "4. 留置胃管行胃肠减压，监测腹内压",
      "5. 完善动脉血气分析，30分钟后复查平台压",
      "6. 若氧合未改善（SpO₂<94%），准备俯卧位通气"
    ],
    "patient_dialogue": {
      "对家属解释": "王先生家属您好，我是ICU医生。您父亲现在的情况是肺部炎症比较重，像两块湿海绵，需要呼吸机帮忙。但发现他的呼吸节奏和机器不太合拍，就像两人跳舞踩到脚，这样不但累，还可能伤肺。我们会：",
      "具体说明": [
        "1. 先给他稍微加深点镇静药，就像让人睡熟些，这样呼吸机和肺才能更好配合",
        "2. 如果还不行，可能用点让肌肉放松的药，但您放心，我们会严密监护",
        "3. 把呼吸机的气量调小一点，节奏调慢些，这样对肺更温和",
        "4. 他肚子胀得明显，准备插个胃管把气抽出来，这样呼吸能轻松些"
      ],
      "情绪安抚": "我理解您很着急，咳嗽几天就插管确实让人难以接受。但您父亲现在就像在爬陡坡，呼吸机就是他的登山杖。我们医护整晚都守在这儿，有任何变化会第一时间联系您。您先休息，明早我们详细聊病情。"
    }
  },
  {
    "id": 1585,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "凌晨02:10，ICU电话急响：58岁外卖骑手邱某，BMI 31 kg/m²，既往2型糖尿病15年（HbA1c 9.4%）、高血压Ⅲ级、慢性心衰（NYHA Ⅲ）、2年前因心梗放2枚支架，长期吸烟30包年。入院48 h内进展为PaO₂/FiO₂ 92 mmHg，胸片双肺“白肺”>75%，已气管插管+深度镇静+肌松，右锁骨下深静脉置管。体温39.2 ℃，WBC 16.8×10⁹/L、NE% 91%，CRP 212 mg/L，PCT 3.8 ng/mL，IL-6 407 pg/mL；BNP 1 840 pg/mL，cTnI 0.09 ng/mL，肌酐162 μmol/L（基线88），尿量0.4 mL·kg⁻¹·h⁻¹，ALT 68 U/L。呼吸机PC模式FiO₂ 90%，PEEP 14 cmH₂O，SpO₂ 88%。今晨护士汇报：12 h内胃管引流咖啡样液体150 mL，BP 82/46 mmHg（去甲0.35 μg·kg⁻¹·min⁻¹），乳酸4.6 mmol/L；新出现持续室性早搏三联律。患者妻子在视频探视时反复询问：“他平时跑单能爬七楼，怎么一下就喘不过来？医生，是不是药不够？”——窗外正逢倒春寒，雨夹雪，急救车鸣笛声此起彼伏。",
    "reference_rule": {
      "condition": "重型、危重型病例",
      "action": "1. 在对症治疗的基础上，积极防治并发症; 2. 治疗基础疾病; 3. 预防继发感染; 4. 及时进行器官功能支持。",
      "contraindication": null,
      "evidence": "在对症治疗的基础上，积极防治并发症，治疗基础疾病，预防继发感染，及时进行器官功能支持。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为博学的专科专家，我的关注重点是全网扫描检查药物相互作用、禁忌症及共病风险，确保安全优先于疗效，避免潜在危险。\nStep 2: 临床解码 (Clinical Decoding) - 患者为58岁男性，存在多重高风险基础病（肥胖、2型糖尿病控制不佳、高血压Ⅲ级、慢性心衰NYHA Ⅲ、既往心梗支架史、长期吸烟史）。当前表现为重症急性呼吸窘迫综合征（ARDS，PaO₂/FiO₂ 92 mmHg）、感染性休克（BP 82/46 mmHg，乳酸4.6 mmol/L）、急性肾损伤（肌酐升高至162 μmol/L，尿量0.4 mL·kg⁻¹·h⁻¹）、上消化道出血（胃管引流咖啡样液体150 mL）和室性心律失常（持续三联律）。隐式线索包括：高炎症指标（CRP 212 mg/L，PCT 3.8 ng/mL，IL-6 407 pg/mL）提示细菌感染；BNP升高提示心衰恶化；环境因素（倒春寒）可能加重应激；使用去甲肾上腺素和镇静药物增加药物相互作用风险。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件为“重型、危重型病例”，患者状态完全匹配。无禁忌症，但需全网扫描风险：药物相互作用（例如，去甲肾上腺素与抗心律失常药可能加重心律失常；抗凝药在胃出血时禁忌）；共病风险（如肾损伤需调整抗生素剂量；心衰和糖尿病管理需避免低血压）。安全检查重点：避免使用非甾体抗炎药或抗凝药以防出血恶化；监测电解质以防心律失常加重。\nStep 4: 决策生成 (Decision Making) - 依据指南行动：1. 对症治疗和防治并发症（优先稳定休克、控制出血和心律失常）；2. 治疗基础疾病（优化心衰和糖尿病管理）；3. 预防继发感染（经验性抗生素）；4. 器官功能支持（呼吸和循环支持）。决策优先级：安全第一（止血和抗休克），其次针对感染和基础病调整治疗。",
    "medical_order": "1. 一级护理，持续心电监护，监测生命体征、心律及尿量每小时。2. 呼吸机参数优化：维持PC模式，FiO₂ 90%，PEEP 14 cmH₂O；考虑俯卧位通气，完善血气分析q4h。3. 血流动力学支持：上调去甲肾上腺素剂量至目标MAP≥65 mmHg，监测乳酸；予液体复苏（晶体液500 mL静脉滴注），评估中心静脉压。4. 心律失常处理：静脉推注胺碘酮150 mg负荷，继以1 mg/min维持；完善电解质（钾、镁）检测，纠正异常。5. 上消化道出血管理：静脉泵注奥美拉唑40 mg q12h，暂停抗凝及抗血小板药物；监测血红蛋白，备输红细胞。6. 感染控制：经验性使用广谱抗生素（美罗培南1 g q8h静脉滴注），完善血培养、痰培养及胸部CT。7. 肾损伤管理：监测肌酐及尿量，准备肾脏替代治疗（CRRT）指征；调整药物剂量（如抗生素基于肌酐清除率）。8. 基础疾病治疗：胰岛素静脉滴注控制血糖（目标6-10 mmol/L），优化心衰用药（如呋塞米20 mg静脉推注）；维持血压目标120-140/70-90 mmHg。9. 预防措施：床头抬高30°，口腔护理q6h，预防压力性溃疡。",
    "patient_dialogue": "邱太太，您先别太着急，我明白您担心邱先生平时身体挺好，怎么突然就喘不上气了。是这样的，邱先生这次是因为肺部严重感染，加上他原有的糖尿病和心脏病，一下子就加重了，就像一辆车平时跑得动，但遇到大雨天轮胎打滑就容易出问题。我们现在在ICU全力抢救：用呼吸机帮他呼吸，打药稳住血压和心跳，还处理了胃里的小出血。不是药不够，而是需要综合治疗这些复杂问题。我们会24小时盯着他的情况，一有变化就调整。您放心，我们团队都在这里守着，您也要保重自己，有消息我马上通知您。"
  },
  {
    "id": 1591,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "患者6天前出现39.8 ℃高热、干咳，随后出现静息呼吸困难。外院胸部CT示双肺多发磨玻璃影，RT-PCR 2019-nCoV阳性。转入我院ICU时，RR 34次/分，SpO₂ 88%（储氧面罩15 L/min），BP 96/58 mmHg，HR 128次/分；血气PaO₂/FiO₂ 86 mmHg；实验室：WBC 14.7×10⁹/L，LY 0.62×10⁹/L，CRP 187 mg/L，IL-6 398 pg/mL，PCT 0.9 ng/mL，LDH 652 U/L，D-二聚体 4.1 mg/L，肌酐142 μmol/L（eGFR 46 ml/min）。已予高流量氧疗、抗病毒、经验性抗细菌及甲强龙1 mg/kg q12h静滴48 h，但体温仍38.5 ℃，呼吸窘迫加重，FiO₂ 100%下PaO₂/FiO₂降至72 mmHg，血管活性药物去甲肾上腺素0.3 μg/kg·min维持MAP 65 mmHg。今日查房，护士报告患者24 h尿量仅680 ml，四肢出现花斑，护士抱怨病房空调损坏室温升至28 ℃，患者焦躁扯管。家属在门外反复询问“网上说的净化血液有没有用”。",
    "reference_rule": {
      "condition": "对有高炎症反应的危重患者，有条件",
      "action": "可以考虑使用体外血液净化技术。",
      "contraindication": null,
      "evidence": "对有高炎症反应的危重患者，有条件可以考虑使用体外血液净化技术。"
    },
    "thought": "Step 1: 场景定义 – 本案例属于复杂合并症治疗场景，患者同时存在COVID-19相关急性呼吸窘迫综合征（ARDS）、脓毒症休克和急性肾损伤（AKI），涉及多系统共病。作为专科专家，我将重点关注全网扫描药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效，确保治疗方案无冲突且可执行。Step 2: 临床解码 – 关键信息包括：高炎症反应（CRP 187 mg/L、IL-6 398 pg/mL 提示细胞因子风暴）；危重状态（PaO₂/FiO₂ 72 mmHg 符合重度ARDS，休克需去甲肾上腺素维持）；AKI（肌酐142 μmol/L、eGFR 46 ml/min，24小时尿量680 ml提示少尿）；环境干扰（空调损坏致室温升高，可能加重脱水或不适）；治疗无效（甲强龙等48小时未缓解，病情恶化）。隐式线索：四肢花斑暗示微循环障碍，焦躁行为可能加剧氧耗。Step 3: 规则对齐与安全检查 – 指南条件为‘对有高炎症反应的危重患者，有条件可以考虑使用体外血液净化技术’，患者符合高炎症和危重标准。指南contraindication为null，但强制检查潜在风险：无绝对禁忌（如出血倾向未报告），但需评估共病风险（AKI和休克可能增加血液净化操作难度，需血流动力学稳定）；药物相互作用（甲强龙和去甲肾上腺素不影响净化，但净化可能加速药物清除，需监测剂量）。安全优先，确认环境控制到位。Step 4: 决策生成 – 基于指南action，决定启动体外血液净化技术（如连续性肾脏替代治疗，CRRT）以清除炎症介质，同时优化支持治疗以稳定患者。",
    "medical_order": "1. 予立即启动连续性肾脏替代治疗（CRRT），模式CVVHDF，抗凝方案采用枸橼酸局部抗凝，监测ACT及电解质。2. 维持当前治疗：瑞德西韦抗病毒、哌拉西林他唑巴坦经验性抗细菌、甲强龙1mg/kg q12h静脉滴注（评估48小时无效，考虑加量至2mg/kg q12h）。3. 优化血流动力学：滴定去甲肾上腺素剂量维持MAP >65 mmHg，监测中心静脉压（CVP），目标8-12 mmHg。4. 改善氧合：行气管插管机械通气，设置肺保护性通气（潮气量6ml/kg，PEEP 12-15 cmH₂O），每日俯卧位通气≥16小时。5. 管理急性肾损伤：限水（每日入量<1000ml），监测每小时尿量、肌酐及电解质。6. 环境控制：立即修复病房空调系统，维持室温22-24°C。7. 监测：q4h记录生命体征、血气分析、乳酸及炎症标志物（CRP、IL-6、D-二聚体）。8. 完善检查：急查床旁超声评估心功能及容量状态。",
    "patient_dialogue": "家属您好，我明白您在网上看到净化血液的信息，很关心这个方案。现在您家人的情况比较危急，他体内炎症反应特别强，就像身体里起了大火，导致呼吸困难、肾损伤这些问题。我们计划给他做一种血液净化治疗，这就像用机器帮血液‘洗澡’，清除那些有害的炎症物质。这能减轻器官负担，如果什么都不做，炎症会继续伤害身体。同时，我们会调整药物和氧气，确保他稳定下来。另外，病房空调坏了，我们马上修好，让他环境更舒适。请放心，我们团队24小时守着，有任何变化我会第一时间告诉您。"
  },
  {
    "id": 1584,
    "file_name": "新冠病毒感染的肺炎诊疗方案（试行第五版）.json",
    "case_input": "68岁男性，退休公交司机，因‘发热8天、气促加重2天’由外院转入。既往2型糖尿病15年（HbA1c 8.7%）、CKD 3期（基线eGFR 42 ml/min），无冠心病史。入院时体温38.9 ℃，SpO₂ 88%（储氧面罩10 L/min），呼吸32次/分，血压146/88 mmHg。肺部CT示双肺多发磨玻璃影伴实变，累及>50%肺野；血气分析（吸氧10 L/min）：pH 7.31，PaO₂ 56 mmHg，PaCO₂ 48 mmHg，乳酸2.1 mmol/L。实验室：WBC 15.2×10⁹/L，淋巴细胞0.6×10⁹/L，CRP 142 mg/L，IL-6 135 pg/mL，肌酐152 μmol/L（较基线↑30%），ALT 58 U/L。已予抗病毒、甲强龙40 mg q12h及高流量氧疗，但患者仍呼吸窘迫，RR>30次/分，SpO₂无法维持>90%。今晨查房，护士报告患者尿量减至0.4 ml/kg·h，下肢轻度水肿，血糖波动在12–16 mmol/L。家属追问：‘除了升级呼吸支持，还有没有其他药能控制炎症？’窗外暴雨，病区内Wi-Fi信号时断时续，家属视频探视屡次掉线，情绪焦虑。",
    "reference_rule": {
      "condition": "重型、危重型病例",
      "action": "可静脉给予血必净100ml/次，每日2次治疗。",
      "contraindication": null,
      "evidence": "可静脉给予血必净100ml/次，每日2次治疗；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景（基于输入Context），作为博学的专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。这要求深入检查当前用药与潜在新药的交互、患者基础疾病（糖尿病、CKD）的恶化风险，以及多器官功能状态。\n\nStep 2: 临床解码 (Clinical Decoding): 从病例中提取关键信息：患者为68岁男性，主诉发热和气促加重，临床表现为重症肺炎（肺部CT示双肺多发磨玻璃影伴实变>50%，提示病毒性或细菌性感染），急性呼吸窘迫综合征（ARDS，基于血气分析PaO₂ 56 mmHg、pH 7.31和呼吸窘迫），急性肾损伤（AKI on CKD，肌酐152 μmol/L较基线上升30%，尿量0.4 ml/kg·h伴下肢水肿），合并2型糖尿病控制不佳（HbA1c 8.7%，血糖波动）及CKD 3期（eGFR 42 ml/min）。隐式线索包括：淋巴细胞减少（0.6×10⁹/L）提示免疫抑制，增加感染风险；ALT轻度升高（58 U/L）暗示肝功异常，可能影响药物代谢；当前甲强龙治疗可能加剧高血糖和感染；尿量减少和水肿指示容量过载或肾功能恶化，需评估液体管理。转化为医学术语：患者处于脓毒症前期或早期多器官功能障碍综合征（MODS），炎症标志物（CRP 142 mg/L, IL-6 135 pg/mL）显著升高，对初始抗炎治疗反应不佳。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition为‘重型、危重型病例’——患者符合标准（低氧血症PaO₂ 56 mmHg、呼吸频率>30次/分、肺部病变广泛、多器官受累）。指南Action建议‘静脉给予血必净100ml/次，每日2次治疗’。Contraindication为null（无直接禁忌），但强制安全检查：血必净（中药注射剂，主要成分为活血化瘀成分）需评估药物相互作用（与甲强龙协同抗炎但可能增加出血或高血糖风险；无抗病毒药物冲突）、共病风险（CKD 3期和AKI，血必净经肾排泄，需监测肾功能；糖尿病增加高血糖风险，但无绝对禁忌；ALT升高提示肝功异常，但程度轻度，一般无需调整剂量）。安全优先级下，需确保无过敏史（病例未提及，假设无），并密切监测肾功能、凝血功能和血糖。\n\nStep 4: 决策生成 (Decision Making): 基于指南Action，决策为添加血必净100ml静脉给药bid，以增强抗炎效果；同时，鉴于复杂合并症，必须整合支持治疗：优化呼吸支持（评估插管需求）、管理肾功能（限制液体、监测尿量）、控制血糖，并继续当前治疗。安全第一，启动后24小时内加强监测。",
    "medical_order": "1. 予血必净注射液100ml静脉滴注，每日两次。2. 继续当前抗病毒治疗、甲强龙40mg q12h及高流量氧疗。3. 密切监测生命体征（包括每小时呼吸频率、SpO₂）、尿量、肾功能（每日肌酐、eGFR）、肝功能（ALT）、凝血功能（PT、APTT）、血糖（q4h监测）及炎症指标（CRP、IL-6）。4. 评估呼吸支持升级：请呼吸科会诊，考虑无创通气或插管机械通气。5. 优化液体管理：限制液体摄入，予呋塞米20mg静脉推注st，监测出入量及下肢水肿变化。6. 控制血糖：予胰岛素静脉滴注，目标血糖6-10 mmol/L。7. 完善血培养、痰培养及降钙素原检测，排除继发细菌感染。",
    "patient_dialogue": "您好，我是负责的医生。咱们家老爷子现在情况确实比较重，炎症反应很强，您问的那个新药，我们决定给他加一种注射药，叫血必净，每天打两次，这个能帮助身体更快地平息炎症风暴，就像给火场灭火一样。另外，他尿少了和脚肿的问题，我们会控制输液量，再给点利尿药，让身体排出多余水分，保护肾脏。血糖高的话，我们会用胰岛素调整，避免波动太大。呼吸困难这块，如果氧气不够用，我们可能考虑上呼吸机辅助，但先观察一下。这场大雨信号不好，您别着急，我们每半小时会更新情况，您随时打电话问护士站。大家齐心合力，一起帮老爷子挺过去！"
  }
]