[
  {
    "id": 1535,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者34岁，女性，远程软件工程师，今日独自推轮椅进入诊室。主诉‘阳康’后第10周起出现顽固性失眠——每晚入睡时间>2h、易醒≥4次；伴间歇性心悸、无明确诱因的焦虑发作（突发胸闷、喉部堵塞感，10–20min自缓）；近3周同事反映她‘说完就忘’，自己亦觉找词困难、代码逻辑需反复检查。无既往精神病史，病前 caffeine 摄入约300mg/日，现因失眠已减半仍无效。今日额外抱怨‘左耳耳鸣像蝉叫’，否认耳痛或流脓。查体：BP118/76mmHg，HR88次/分，律齐，双肺清，神经系统未见局灶体征。患者戴口罩，自述地铁上仍被他人咳嗽声惊出一身冷汗，担心‘脑子是不是被病毒烧坏了’。",
    "reference_rule": {
      "condition": "出现神经精神相关症状（如失眠、焦虑、认知障碍）",
      "action": "1. 完善血常规、生化、凝血、炎症标志物、风湿免疫抗体、脑脊液检查（常规/生化/病原学/脑炎抗体/OCB）；2. 行脑部MR；3. 使用量表（PSQI、MMSE等）评估症状严重程度",
      "contraindication": null,
      "evidence": "推荐意见 8：对于出现神经精神相关症状的患者，需完善血常规、生化、凝血、炎症标志物及风湿免疫相关抗体等检查、脑脊液检查（常规、生化、病原学、脑炎相关抗体、OCB 等）和脑部 MR 等影像学检查以进一步排除其他原因；可利用相关评估量表评估症状的严重程度（C4）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规门诊诊断与治疗场景，重点关注快速建立鉴别诊断、排除危急重症（如脑炎、自身免疫性脑病）并制定初步干预措施。核心是高效识别潜在器质性疾病，避免延误关键治疗。Step 2: 临床解码 (Clinical Decoding) - 关键信息转化：① '顽固性失眠+心悸+焦虑发作'提示睡眠-觉醒障碍及广泛性焦虑可能，但需警惕病毒后综合征（如长新冠）；② '找词困难+代码逻辑反复检查'表明客观认知功能障碍（执行功能/注意力下降）；③ '被咳嗽声惊吓'反映过度警觉（创伤后应激样反应）；④ '左耳耳鸣'需鉴别感音神经性聋或焦虑相关躯体化；⑤ 咖啡因减量无效暗示症状非单纯物质诱发。隐式线索：工作压力（远程工程师）、无诱因焦虑发作、对健康的灾难化认知（'脑子烧坏'）提示心理社会因素参与。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者症状（失眠、焦虑、认知障碍）完全匹配指南 Condition 的'神经精神相关症状'。Contraindication 为 null，无操作禁忌。必须执行指南 Action：通过实验室/影像学排除器质性疾病（如自身免疫性脑炎、脑血管病变），并用量表量化症状。Step 4: 决策生成 (Decision Making) - 立即启动指南要求的全套检查（血液、脑脊液、脑部MR），同步使用量表评估；鉴于耳鸣新发，增加纯音测听；针对焦虑失眠启动基础行为干预。优先级：先排除危及生命的病因（如脑炎），再处理功能性症状。",
    "medical_order": "1. 完善检查：血常规、生化全项（含肝肾功能/电解质/血糖）、凝血四项、hs-CRP + ESR、ANA + ENA谱、抗神经抗体谱（抗NMDA受体等）；腰椎穿刺取脑脊液送检常规、生化、病原学（细菌/病毒涂片培养）、脑炎抗体谱、寡克隆区带；头颅MRI平扫+增强（含DWI序列）。2. 行纯音测听及声导抗检查评估耳鸣。3. 量表评估：失眠严重指数（ISI）替代PSQI（更高效）、蒙特利尔认知评估（MoCA）替代MMSE（对执行功能更敏感）。4. 暂予非药物干预：记录睡眠日记，每日固定起床时间，睡前1小时禁用电子设备。",
    "patient_dialogue": "王女士，您的情况我仔细听了，别太紧张，咱们一步步来。首先，您'阳康'后这些不舒服——睡不着、心慌、容易忘事儿，还有耳朵里嗡嗡响，确实需要系统查一查。这就像电脑出了bug，咱们得先排查硬件问题（比如病毒感染有没有影响大脑），再调软件设置（比如焦虑情绪）。今天我给您开几项检查：抽血看看身体有没有炎症或免疫异常，做个头部核磁仔细瞧瞧脑部结构（别担心，这个没辐射），还要取一点腰背的液体化验（就像抽血一样安全，能查得更准）。另外啊，咱们测个听力，您说的耳鸣多数是疲劳引起的，但检查下更放心。最后，麻烦您填两个简单表格，帮咱们把失眠和记性问题的程度量化清楚。现在最要紧的是：今晚开始，手机别带进卧室，每天固定7点起床——哪怕没睡好也起来，这样身体生物钟才能慢慢复位。您说的'脑子烧坏'可能性极低，这些症状很多年轻人'阳康'后都有，咱们先查明原因再对症处理，好吗？"
  },
  {
    "id": 1536,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者34岁，UI设计师，居家办公。2023-01-07抗原阳性（第2次感染），发热38.6℃、咽痛，居家对症处理7天热退。随后复工，但持续出现‘脑子像蒙一层雾’——写代码时注意力只能集中10分钟，稍复杂逻辑就卡壳；下午3点后必头痛，VAS 4-5分；夜间入睡尚可，凌晨3点易醒，再睡困难；爬两层楼即气短，HR由85升至120次/分，SpO₂掉到93%。症状迁延至今（感染后14周），期间两次至公司医务室查血常规、甲功、胸部CT均正常。今日因‘忘带家门钥匙3次’被室友劝来就诊。查体：BP 108/68 mmHg，BMI 19.8，咽部无充血，心肺听诊（-），指脉氧96%（静息）。患者补充：‘我以前半马能进2小时，现在走500米就腿软，月经也提前一周。’否认既往慢性病，无抑郁史，但近1月情绪易哭。诉求：‘我是不是变傻了？还能不能回去写代码？’",
    "reference_rule": {
      "condition": "符合：1. 确诊/可能感染新冠病毒；2. 症状在感染12周后仍存在或新出现；3. 症状持续≥2个月且无法用其他疾病解释",
      "action": "诊断为长新冠综合征",
      "contraindication": null,
      "evidence": "推荐意见 5：符合以上 3 个要点并排除其他疾病，可诊断为长新冠综合征（D5）。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于常规诊断与治疗场景（门诊环境）。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（Differential Diagnosis），优先排除危及生命的紧急状况（如肺栓塞、心肌炎、颅内病变），并基于证据给出高效、直接的诊疗决策。**Step 2: 临床解码 (Clinical Decoding)**：患者关键信息解码如下：1) *感染史*：新冠确诊后14周（>12周）；2) *核心症状群*：a) 认知障碍（注意力下降、执行功能受损、记忆失误），b) 疲劳/劳力不耐受（爬楼气短、HR↑、SpO₂↓、活动耐力剧降），c) 自主神经失调（头痛、睡眠维持障碍），d) 躯体化表现（月经紊乱、情绪易波动）；3) *客观检查*：血常规、甲功、胸部CT、基础生命体征（BP、SpO₂静息）均正常，排除常见器质性疾病；4) *时间线*：症状持续>2个月（14周），且无法用其他疾病解释（如贫血、甲状腺功能异常、心肺疾病）。**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南条件完全匹配：1) 确诊新冠感染；2) 症状在感染12周后持续存在；3) 症状持续≥2个月且无其他疾病可解释。Contraindication为null，无需额外安全警示（已排除基础心肺疾病）。**Step 4: 决策生成 (Decision Making)**：根据指南Action（诊断为长新冠综合征），直接确认诊断，并制定以症状管理及功能康复为核心的门诊干预方案，避免过度检查。",
    "medical_order": "1. **诊断**：长新冠综合征（Post-COVID-19 condition, ICD-10: U09.9）。2. **鉴别诊断已排除**：依据前期血常规、甲功、胸部CT及本次查体（心肺听诊阴性、SpO₂静息正常），暂无需进一步影像学或实验室检查。3. **管理计划**：a) 认知康复：转介至康复科行计算机化认知训练（每周2次×4周）；b) 体力活动调控：开具个体化运动处方（起始强度：每日平地步行10分钟×2次，HR控制在静息+20次/分内）；c) 症状对症处理：予头痛日记记录触发因素，必要时临时口服对乙酰氨基酚500mg prn（每日≤3g）；d) 睡眠卫生教育：固定就寝时间，限制午后咖啡因；e) 心理支持：建议每周 mindfulness 练习（APP指导），若情绪持续低落转介心理科。4. **随访**：4周后门诊复评认知功能（MoCA量表）、6分钟步行试验及症状VAS评分。",
    "patient_dialogue": "李女士，我先给您吃颗定心丸——您没有变傻，更没有生什么大病。这些症状其实很常见，是新冠病毒感染后身体需要更长时间恢复的表现，我们叫‘长新冠’。就像电脑重启后要加载程序一样，您的大脑和身体还在‘重新校准’。您提到的写代码专注力下降、容易忘事、下午头痛、爬楼喘气，甚至月经变化，都是这个恢复期的一部分。检查都正常，说明器官没损伤，纯粹是功能暂时失调了。咱们一步步来：第一，您得原谅自己现在的状态，这不是偷懒，是身体在喊‘需要慢下来’。第二，我会帮您联系康复科，教些专门训练注意力的‘大脑体操’，每天几分钟就能练。第三，运动要像充电一样一点点加——先从每天散步10分钟开始，心跳别超100次，感觉累就停。头痛时吃片普通止痛药（比如泰诺），但别超过一天3片。晚上手机别带进卧室，试试睡前听白噪音。要是心里难受想哭，随时找我聊，这不是矫情，是康复的正常反应。我敢打包票，只要按计划来，您绝对能重回代码战场！4周后来复查，咱们看进步了多少。"
  },
  {
    "id": 1547,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者34岁女性，平面设计师，远程办公。4个月前感染SARS-CoV-2（当时核酸阳性，轻症发热3天），愈后持续诉‘闻什么都不对劲’：咖啡像馊抹布、香水像汽油，进餐常伴金属味，致食欲下降4 kg。无鼻塞流涕，鼻内镜及鼻窦CT均未见异常。今日因‘气味扭曲影响工作’首次来长新冠门诊。查体：体温36.5 ℃，血压112/68 mmHg，嗅觉初筛双侧识别率6/12（低于正常切点9/12）。患者顺带抱怨最近天气潮湿让她‘家里的猫味更刺鼻’。既往无慢阻肺、无过敏性鼻炎，不吸烟，职业需频繁嗅闻颜料溶剂。",
    "reference_rule": {
      "condition": "嗅觉下降或扭曲",
      "action": "嗅觉训练（接触气味香精/油及气味识别）",
      "contraindication": null,
      "evidence": "新冠病毒感染后嗅觉下降和扭曲的治疗可能通过接触气味香精或油以及气味识别进行嗅觉训练。"
    },
    "thought": "本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我将快速建立鉴别诊断（排除危急重症如颅内病变或急性感染），并聚焦于直接给出治疗指令。关键信息解码：患者表现为SARS-CoV-2感染后嗅觉功能障碍，具体为嗅觉扭曲（parosmia）和嗅觉减退（hyposmia，基于识别率6/12低于正常值9/12），无鼻部结构异常证据（鼻内镜和鼻窦CT正常）。隐式线索包括职业溶剂暴露可能加剧症状、食欲下降4 kg提示营养风险，以及环境气味敏感性增加（如猫味更刺鼻）。规则对齐与安全检查：患者症状完全匹配指南条件‘嗅觉下降或扭曲’，无禁忌症（指南contraindication null），且排除急危重症（无发热、鼻塞或神经症状）。决策生成：基于指南action，直接推荐嗅觉训练作为一线干预。",
    "medical_order": "予嗅觉训练计划：每日2次，每次5-10分钟，接触4种基础气味香精（如玫瑰、柠檬、桉树、丁香），进行气味识别练习，持续3-6个月。监测体重变化，建议避免职业相关溶剂暴露。若症状未改善，3个月后复诊评估。",
    "patient_dialogue": "王女士，我理解这几个月来气味问题让您很困扰——咖啡闻起来像馊抹布，香水像汽油，还影响了食欲和工作。好消息是，这种情况在新冠康复后很常见，我们检查过您的鼻子和头部，没发现其他严重问题。我建议您从现在开始，每天做个小练习：早上和晚上各花5到10分钟，闻闻一些常见的气味精油，比如玫瑰、柠檬、桉树和丁香，一边闻一边试着记住它们本来的味道。这就像给大脑‘重新训练’，帮助它慢慢恢复正确的气味识别能力。同时，注意做饭时别闻那些颜料溶剂，避免刺激鼻子；体重掉了4公斤，咱们得留意饮食，多吃点营养丰富的食物。如果坚持3个月后没好转，咱们再约时间复查。别担心，大多数人通过这个练习都能逐渐好转——我们一起努力，好吗？"
  },
  {
    "id": 1528,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者6周前确诊新冠（轻型），居家对症治疗后转阴。近3周出现活动后左侧胸前区闷痛，伴心悸，持续数分钟，休息可缓解。无发热、咳痰。既往体健，否认高血压、糖尿病。查体：BP 118/74 mmHg，HR 92次/分，律齐，未闻及杂音，双肺清。初诊心电图示窦性心律，V4-V6导联T波低平。今日门诊，患者仍诉爬两层楼即感心悸，并担心‘心脏会不会留下后遗症’。外面38 ℃高温，她进门时抱怨‘地铁里闷得慌，胸口更不舒服’。",
    "reference_rule": {
      "condition": "新冠病毒感染后持续存在或新出现心脏相关症状（如胸痛、心悸）",
      "action": "1. 完善心脏三联检查（心肌标志物、十二导联心电图、超声心动图）；2. 仍不能明确者行心血管磁共振（CMR）或心内膜心肌活检",
      "contraindication": null,
      "evidence": "推荐意见 7：对于新冠病毒感染后持续存在或新出现心脏相关症状的患者，首先完善心脏三联（心肌标志物、十二导联心电图、超声心动图）检查进行初步评估；不能明确心脏受累但仍有怀疑者可考虑行 CMR 或心内膜下心肌活检检查（A1a）。"
    },
    "thought": "Step 1: 场景定义：本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我将关注快速建立鉴别诊断（如排除心肌炎、心肌缺血等危急重症），并基于症状直接给出初步评估指令。Step 2: 临床解码：患者为年轻女性，post-COVID状态（6周前轻型感染），新出现活动后左侧胸前区闷痛伴心悸（exertional chest pain and palpitations），休息可缓解；高温环境加重不适（如地铁闷热），提示可能自主神经功能障碍或心肌受累。心电图V4-V6导联T波低平（flattened T waves）可能表示心肌缺血或炎症。无基础病（如高血压、糖尿病），查体生命体征稳定（BP 118/74 mmHg, HR 92 bpm），无杂音或肺部异常，初步排除急性冠脉综合征或心衰。Step 3: 规则对齐与安全检查：患者症状（胸痛、心悸）完美匹配指南condition（新冠病毒感染后新出现心脏相关症状）。无contraindication，安全可立即执行建议行动。Step 4: 决策生成：根据指南action，优先完善心脏三联检查（心肌标志物、十二导联心电图、超声心动图）进行初步评估；若结果不明确，再考虑心血管磁共振（CMR）或心内膜心肌活检。",
    "medical_order": "完善心脏三联检查：1. 心肌标志物检测（包括肌钙蛋白I/T、CK-MB）；2. 十二导联心电图（复查以评估动态变化）；3. 超声心动图（评估心室功能、瓣膜运动及心包积液）。若结果异常或仍不能明确心脏受累，转诊心脏专科行心血管磁共振（CMR）或心内膜心肌活检。建议患者避高温环境，监测症状变化。",
    "patient_dialogue": "张女士，我理解您最近爬楼梯时觉得胸口闷、心慌，还担心会不会是新冠后心脏出了什么问题。这种症状确实挺常见的，很多人在感染恢复后会出现类似情况，可能是因为身体还在调整恢复中。您提到地铁里闷热时更不舒服，这说明高温环境可能加重了症状。为了弄清楚原因，防止任何潜在风险，我们需要做几个简单检查：先抽点血查一下心脏的指标，再做个心电图看看心跳情况，最后用超声波看看心脏的结构和功能。这些检查都很安全，能帮我们快速判断心脏有没有发炎或供血问题。如果结果出来一切正常，我们就能放心了；万一需要更详细检查，我们再讨论下一步。别太焦虑，您来得正是时候，咱们及时查清楚，就能安心康复了。"
  },
  {
    "id": 1529,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者42岁，小学教师，主诉‘爬两层楼就喘，咳嗽三个月不见好’。既往无哮喘、慢阻肺史，不吸烟，体重指数23.5 kg/m²。三个月前曾患新冠（核酸检测阳性，居家自愈）。查体：静息呼吸频率22次/分，未吸氧指脉血氧94%，双肺听诊散在细湿啰音，无哮鸣音。今日为首次复诊，顺带抱怨‘最近批改作业到夜里，右肩酸痛’。患者希望尽快恢复体能，以便9月新学期带学生晨跑。",
    "reference_rule": {
      "condition": "可疑呼吸系统长新冠综合征症状（如呼吸困难、慢性咳嗽）",
      "action": "1. 监测血氧饱和度和呼吸频率；2. 完善血气电解质分析、肺功能检测和胸部影像学检查；3. 排除哮喘/慢阻肺/肺栓塞等其他疾病",
      "contraindication": null,
      "evidence": "推荐意见 6：对于可疑呼吸系统长新冠综合征症状，应监测血氧饱和度和呼吸频率，完善血气电解质分析、肺功能检测和胸部影像学检查，并排除其他疾病（D5）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如排除肺栓塞、心力衰竭等危急重症），并基于现有信息给出直接、高效的诊疗指令。Step 2: 临床解码 (Clinical Decoding) - 患者主诉'爬两层楼就喘，咳嗽三个月不见好'，结合查体（静息呼吸频率22次/分提示轻度呼吸急促，指脉血氧94%示轻度低氧血症，双肺细湿啰音提示间质性肺病或炎症），以及新冠感染史，核心问题指向呼吸系统长新冠综合征（post-COVID respiratory sequelae）。隐式线索包括：症状持续3个月、无吸烟史和既往呼吸病史降低慢阻肺风险，体重指数正常减少肥胖相关呼吸困难可能性；右肩酸痛为次要问题，可能与职业疲劳（批改作业姿势不良）相关，不影响主诊断。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者症状（呼吸困难、慢性咳嗽）完美匹配指南Condition'可疑呼吸系统长新冠综合征症状'。Action要求监测血氧和呼吸频率、完善血气电解质、肺功能和胸部影像学检查、排除其他疾病（如哮喘、慢阻肺、肺栓塞）。指南Contraindication为null，无禁忌症，安全可行。Step 4: 决策生成 (Decision Making) - 严格遵循指南Action：立即安排监测血氧饱和度和呼吸频率，完善血气电解质分析、肺功能检测（包括支气管舒张试验以排除哮喘）、胸部影像学检查（首选低剂量CT以评估肺间质病变），并优先排除肺栓塞（结合D-dimer检测）和心功能不全（通过ECG和BNP）；右肩酸痛建议保守处理，不影响主流程。",
    "medical_order": "1. 监测指脉血氧饱和度及呼吸频率；2. 完善动脉血气分析、电解质检测、肺功能检查（含支气管舒张试验）；3. 完善胸部CT平扫；4. 排除肺栓塞（予D-dimer检测）及心功能不全（完善ECG、血清BNP检测）；5. 建议休息，避免剧烈运动；6. 随访评估检查结果。",
    "patient_dialogue": "王老师，您好！听了您的描述，您这三个月咳嗽和爬楼梯喘气的问题，很可能是之前感染新冠后身体还没完全恢复。为了帮您尽快好起来，咱们得做几个检查：首先，我会让护士再给您测一下血氧和呼吸情况，看看有没有缺氧。然后，需要抽点血化验，查查肺里的气体和电解质平衡，再做个肺功能测试（就像吹气球一样，看看肺活量），最后拍个胸部的CT扫描，这样能看清楚肺里有没有炎症或其他小问题。这些检查能帮我们排除像肺栓塞或心脏问题这些严重情况，确保安全。另外，您提到批改作业后肩膀酸痛，可能是坐太久姿势不对引起的，建议您工作间隙活动一下肩膀，晚上热敷休息。别太担心，我们会一步一步来，争取让您在9月开学时能带孩子们跑步，好吗？"
  },
  {
    "id": 1561,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者42岁，女性，既往体健，2022年11月首次感染SARS-CoV-2（轻型）。转阴后持续出现活动后气短、间断胸闷、注意力难集中及夜间盗汗，症状波动已8个月。今日在社区门诊复诊：①自觉步行>500 m即需停下休息，登一层楼气促≥2 min才能平复；②近两周新增双手指尖麻木，伴入睡困难（入睡潜伏>40 min，早醒2次/周）；③自测血氧静息97%，但6分钟步行后最低降至91%；④体温正常，血压112/68 mmHg，BMI 23 kg·m⁻²，HR 86次·min⁻¹、律齐；⑤实验室：CRP 6 mg·L⁻¹（↑），NT-proBNP 142 ng·L⁻¹，HbA1c 5.4%，FT4/FT3/TSH正常；⑥肺功能：FEV1 86%pred，DLCO 72%pred；⑦胸HRCT：双下肺少许条索影，无纤维化；⑧心电图示窦性心律，T波低平V4-6；⑨既往无慢病，未吸烟，否认抑郁史。患者诉：'教案写到一半就脑子空白，上周批改作业时把同一本作业批了三次。' 今日独自骑电动车前来，戴两层口罩，担心'吹风再加重'。社区医生已予倍氯米松/福莫特罗吸入、甲钴胺口服2个月，症状改善不显。患者询问：'我是否需要去市里大医院再做一次全面检查？还是继续在社区拿药？'",
    "reference_rule": {
      "condition": "长新冠综合征患者",
      "action": "1. 长期随访+专科评估；2. 个体化多学科康复（含运动训练/心理治疗）",
      "contraindication": null,
      "evidence": "推荐意见 16：长新冠综合征患者应进行长期随访和相应专科评估，强调个体化、多学科合作的整体康复（B3b）。"
    },
    "thought": "**Step 1: 场景定义**\n本案例属于分级诊疗与随访场景，重点关注患者当前社区治疗效果与转诊指征的对比评估，需判断是否触发转诊或维持社区治疗。\n\n**Step 2: 临床解码**\n核心问题：①活动耐量显著下降（6分钟步行后SpO₂↓91%+DLCO↓72%）提示心肺储备不足；②新增神经症状（指尖麻木+认知障碍）；③炎症持续（CRP↑）；④睡眠障碍与自主神经失调（盗汗+入睡困难）。隐式线索：患者过度防护行为（双层口罩）与认知失误案例反映潜在焦虑，当前社区治疗（支气管扩张剂+营养神经药）未覆盖核心病理。\n\n**Step 3: 规则对齐与安全检查**\n完全匹配指南条件“长新冠综合征”，无禁忌症。安全核查：NT-proBNP正常排除急性心衰，胸CT无纤维化降低急性呼吸风险，但活动后低氧警示运动风险。\n\n**Step 4: 决策生成**\n符合指南“需专科评估+多学科康复”指征：社区治疗2个月无效、多系统受累（神经/心肺/免疫）、需完善社区不可及的专项检查（如CPET、神经传导检测）。决策：升级至上级医院多学科诊疗。",
    "medical_order": "诊断：长新冠综合征（累及呼吸、神经、心血管系统）\n处理：\n1. 立即转诊至上级医院长新冠多学科门诊（MDT）\n2. 完善检查：\n   - 心肺功能：心肺运动试验（CPET）+24小时动态心电图\n   - 神经评估：脑MRI+神经传导速度检测+认知功能量表（MoCA）\n   - 炎症/免疫：IL-6、CD4+/CD8+淋巴细胞亚群\n3. 当前药物调整：停用倍氯米松/福莫特罗吸入剂（治疗反应不佳），甲钴胺续用至神经科评估\n4. 对症处理：予右佐匹克隆2mg qn PRN改善睡眠\n5. 社区随访：转诊后72小时内电话追踪落实情况",
    "patient_dialogue": "李女士，您这几个月真的辛苦了！从检查结果和您描述的情况看，咳嗽发烧虽然好了，但身体还在跟病毒的影响'拉锯战'，医学上叫'长新冠'。您走路气短、手发麻、晚上睡不踏实，包括批改作业时注意力跟不上，都是典型表现。\n\n社区前期的药物对部分人管用，但您用了两个月效果不明显，说明咱们得调整'战术'了。我建议您下周就去市医院的长新冠专病门诊——那里有呼吸科、神经科和康复科专家组成团队，能一次性评估所有问题。\n\n特别要查清楚两件事：一是为什么走路后血氧会掉下来（需要做个带运动监测的精细心肺检查），二是手指发麻和忘事的原因（可能要做神经传导检查和脑部扫描）。这些设备咱们社区没有，但对制定康复方案特别关键。\n\n别担心路上吹风，戴一层医用口罩足够防护。您今天能骑电动车来，说明日常活动还是安全的，如果觉得累就让家人陪您去大医院。我先开点临时助眠药，其他药等专家评估后再定。记住啊，这种情况越早系统干预，恢复的希望越大！"
  },
  {
    "id": 1538,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者4个月前感染SARS-CoV-2，核酸转阴后仍无法恢复全职工作。主诉“脑子像被雾罩住，写代码时经常忘记函数名”，同时白天稍做PPT就极度疲乏，需躺下休息，夜间入睡困难且早醒。近2周出现明显焦虑，担心被公司裁员，常伴心慌与手抖。无发热、无呼吸困难。既往体健，未接种加强针。查体：BP 118/76 mmHg，HR 88次/分，SpO₂ 97%，体重指数23 kg/m²；神经系未见明显局灶体征。实验室检查：血常规、甲功、肝肾功、铁蛋白、VitB12均正常；头颅MRI平扫无异常。患者自评疲劳严重程度量表(FSS) 6.4分，医院焦虑抑郁量表(HADS-A) 11分。今日由其姐姐陪同步行来院，途中抱怨“天气闷热，走10分钟就腿软”。",
    "reference_rule": {
      "condition": "神经精神系统症状（如疲乏、焦虑、认知障碍）",
      "action": "1. 认知疗法+分级运动疗法（Borg量表指导）；2. 针灸/推拿；3. 必要时抗焦虑药（如苯二氮䓬类）或镇静催眠药",
      "contraindication": "激素治疗疲乏或认知障碍（无证据支持）",
      "evidence": "推荐意见 12：长新冠综合征患者神经精神系统症状的治疗以认知疗法、分级运动疗法和针灸治疗等为主，辅以抗焦虑、镇静催眠药物治疗（C4）。"
    },
    "thought": "Step 1 (场景定义): 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如急性感染、脑血管事件），并基于现有证据给出直接的治疗指令。Step 2 (临床解码): 患者表现为长新冠综合征（post-COVID condition），核心症状包括严重疲劳（FSS 6.4分）、认知障碍（主观描述为'脑雾'，如代码记忆困难）、焦虑状态（HADS-A 11分伴心慌、手抖）及睡眠障碍（入睡困难和早醒）。隐式线索包括：轻度心动过速（HR 88次/分，可能与焦虑相关）、运动耐力下降（步行10分钟腿软，提示去适应状态），但已通过实验室和影像学检查（血常规、甲功、MRI等正常）排除甲状腺疾病、贫血、感染、颅内病变等器质性病因。Step 3 (规则对齐与安全检查): 患者症状高度匹配指南的'神经精神系统症状'Condition。指南Contraindication明确指出'激素治疗疲乏或认知障碍无证据支持'，本案例未涉及激素治疗，因此无安全风险，无需调整。Step 4 (决策生成): 根据指南Action，优先实施认知疗法和分级运动疗法（使用Borg量表指导），辅以针灸/推拿；鉴于患者焦虑症状明显（HADS-A 11分），必要时添加抗焦虑药或镇静催眠药作为辅助治疗。",
    "medical_order": "诊断：长新冠综合征（神经精神症状为主，包括疲劳、认知障碍、焦虑）。治疗：1. 启动认知行为疗法（每周2次，目标改善认知功能和焦虑）；2. 实施分级运动疗法（以Borg量表Borg CR-10 Scale指导，初始低强度活动如步行5-10分钟，逐步增量）；3. 推荐针灸或推拿（每周2次）；4. 评估患者焦虑程度，必要时处方劳拉西泮（每次0.5mg，每日1-2次）或佐匹克隆（每次7.5mg，睡前）管理症状。监测：每2周复诊，复查FSS和HADS量表；避免激素治疗。",
    "patient_dialogue": "您好！从您描述的情况来看，这是新冠后常见的'脑雾'和疲劳问题，就像身体和大脑在慢慢恢复一样，咱们别太担心。首先，我会帮您安排一些治疗：一是心理练习，比如通过简单的小任务来训练记忆力和注意力，这能帮您写代码时更专注；二是运动计划，咱们从轻松的散步开始，每天只走几分钟，慢慢增加强度，这样能提升您的体力，避免走路腿软；三是针灸或按摩，能放松身体、缓解疲劳。另外，您提到最近很焦虑，心慌手抖，如果晚上还是睡不好，我们可以考虑加点药物辅助，让您更平静。记住，这些方法都是帮您一步步恢复的，别给自己太大压力，我们会定期跟进您的进展。"
  },
  {
    "id": 1541,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者32岁女性，远程程序员，既往体健，无风湿病史。4个月前感染新冠后持续乏力，近6周出现对称性膝、踝及腕关节肿痛，晨僵约30分钟，伴大腿及肩胛带游走性钝痛，夜间翻身困难，VAS评分7/10。无皮疹、眼疾或尿道炎。自行口服对乙酰氨基酚可短时缓解，停药即复发。昨日加班赶项目后症状加重，上下楼梯需扶墙。查体：双膝轻度肿胀、压痛(+)，踝关节背屈受限，肩外展70°诱发疼痛；未见关节畸形或皮下结节。辅助检查：CRP 18 mg/L，ESR 42 mm/h，RF、抗CCP均(-)，ANA 1:80(颗粒型)，下肢X线未见骨质破坏。患者自述咖啡日饮4杯，睡眠仅5小时，因疼痛无法坚持瑜伽。否认近期腹泻、泌尿症状或性生活异常。今日来诊希望‘找出疼痛根源并恢复正常跑步’。",
    "reference_rule": {
      "condition": "关节痛/肌肉疼痛/关节炎",
      "action": "1. NSAIDs或激素（口服/局部/关节内注射）；2. 难治性反应性关节炎用抗风湿药（甲氨蝶呤/羟氯喹）",
      "contraindication": null,
      "evidence": "推荐意见 14：主要通过 NSAIDs 和激素治疗关节炎相关症状；自身抗体阳性患者建议动态监测抗体；已确诊为自身免疫性疾病患者进行专科治疗（B3b）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景，作为急诊/门诊医生，我将聚焦于快速建立鉴别诊断（Differential Diagnosis），优先排除危急重症（如感染性或系统性风湿病急性发作），并给出直接、可执行的初步治疗指令。思维重点包括识别潜在病因、评估炎症程度，并确保决策高效以避免延误。\n\nStep 2: 临床解码 (Clinical Decoding): 从病例提取关键信息：患者为32岁女性，既往体健，新冠感染后出现持续乏力，近6周对称性多关节炎（膝、踝、腕关节肿痛伴晨僵30分钟），炎症标志物升高（CRP 18 mg/L、ESR 42 mm/h），ANA 1:80颗粒型弱阳性但RF/抗CCP阴性，X线无骨质破坏；无皮疹、眼疾或尿道炎等系统受累。隐式线索包括劳累加重（加班后症状加剧）、生活因素（咖啡日饮4杯、睡眠仅5小时）可能加剧炎症状态，以及自服对乙酰氨基酚仅短时缓解提示需要更强抗炎治疗。临床解码：符合反应性关节炎（post-COVID trigger）或早期血清阴性类风湿关节炎特征，需排除SLE（ANA阳性但无其他典型症状）或其他炎症性关节病。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition为‘关节痛/肌肉疼痛/关节炎’，与本病例高度匹配。Action推荐NSAIDs或激素治疗，难治时用抗风湿药；Contraindication为null，无直接禁忌（患者无风湿病史、无胃肠道溃疡或肾病提及）。强制安全检查：NSAIDs/激素在无禁忌下安全，但ANA弱阳性需动态监测（B3b证据级）；生活因素（咖啡过量、睡眠不足）可能干扰疗效，需干预。\n\nStep 4: 决策生成 (Decision Making): 根据指南Action，首选NSAIDs治疗以控制炎症；若无效，升级至激素或抗风湿药。决策：起始口服NSAIDs，结合生活方式调整；监测炎症标志物和ANA以排除自身免疫病进展；若难治，考虑后续抗风湿药物。",
    "medical_order": "予口服NSAIDs（布洛芬 400mg tid po）控制关节炎症。建议完善血常规、肝肾功能及HLA-B27检查以辅助鉴别诊断。动态监测CRP、ESR及ANA变化。鼓励限咖啡因摄入（<2杯/天）、保证睡眠7-8小时/天、渐进式低强度运动（如步行）。若症状难治（VAS评分无改善），评估后予关节内糖皮质激素注射或启动抗风湿药物（羟氯喹 200mg bid po）。",
    "patient_dialogue": "李女士，您好！从您的描述来看，这些关节疼痛和乏力很可能是新冠后身体炎症反应引起的，就像身体在‘发警报’。别担心，我们先试试消炎药来帮您止痛消肿——我会开个处方，您每天按时吃。同时，我发现您平时喝咖啡比较多、睡得也少，这些习惯会让身体更难恢复，所以建议您减少到每天一两杯咖啡，尽量睡够七八个小时。运动方面，别急着跑步，从轻松散步开始，慢慢来。如果药吃了几天效果不够好，我们再来调整方案。记住，这需要点时间，但我们会一步步帮您找回健康的生活节奏！"
  },
  {
    "id": 1543,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者42岁女性，3个月前感染SARS-CoV-2后持续乏力伴活动后胸闷，今日独自前来长新冠门诊复诊。她主诉‘爬两层楼就喘得厉害’，但夜间可平卧、无胸痛。查体：SpO₂ 97%（室温空气），HR 88次/分，BP 118/76 mmHg，Borg呼吸困难评分2分。既往无哮喘、无心脏疾病史，BMI 24 kg/m²。患者描述自己‘平时基本不动’，远程办公久坐，每天靠两杯拿铁提神，咖啡里必加全脂奶和焦糖；午餐多为外卖披萨或汉堡，晚上追剧时常配薯片。她笑着说：‘我知道该运动，可一喘就心慌，干脆懒得动。’今日天气闷热，她抱怨地铁里空调不足，‘差点憋晕’。除主诉外，她顺带提到左肩偶有酸胀，自认为‘可能是睡姿不好’。",
    "reference_rule": {
      "condition": "呼吸困难Borg评分≤3分、不需吸氧、无心脏疾病",
      "action": "实施呼吸训练和呼吸急促处理策略",
      "contraindication": null,
      "evidence": "对于症状轻（如呼吸困难 Borg 评分 ≤ 3 分）、不需要吸氧且无心脏疾病的患者，建议实施呼吸训练和呼吸急促处理策略。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于生活方式与风险干预场景，关注重点在于识别患者隐式的不良生活习惯（如久坐不动、高热量饮食），并将其与长期COVID恢复风险（如潜在体重增加、心血管问题）关联，同时提供非药物干预建议以管理症状。\nStep 2: 临床解码 (Clinical Decoding)：患者呈现长COVID综合征（Post-COVID syndrome）特征，包括劳力性呼吸困难（Borg评分2分，对应轻度症状）、乏力及活动后胸闷；隐式线索包括久坐生活方式（远程办公缺乏活动）、高热量饮食（咖啡加糖和全脂奶、外卖披萨/汉堡、薯片类零食摄入），这可能导至能量过剩和炎症加剧；BMI正常但饮食模式增加肥胖风险；左肩偶发酸胀提示姿势不良或肌肉紧张；心理因素显示自知力存在但行动力不足（因心慌避免运动）。\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南Condition（呼吸困难Borg评分≤3分、不需吸氧、无心脏疾病）完全匹配（本例Borg评分2分、SpO₂ 97%、无心脏病史）；Contraindication为null，无禁忌；安全检查确认干预安全（如呼吸训练和活动建议需循序渐进，避免诱发症状加重）。\nStep 4: 决策生成 (Decision Making)：根据指南Action（实施呼吸训练和呼吸急促处理策略），生成决策：予呼吸训练指导（如体位控制和呼吸技巧），结合生活方式干预（逐步增加体力活动、饮食调整）；添加随访计划以监测进展。",
    "medical_order": "1. 予呼吸训练指导：包括体位控制（如坐位或斜坡位）和呼吸技巧（如腹式呼吸、节奏呼吸），每日2次，每次10分钟。2. 建议循序渐进增加体力活动：起始每日低强度步行10-15分钟，避免剧烈活动；活动后监测Borg评分，如有加重则暂停。3. 饮食调整：减少高热量食物摄入（如含糖饮料、快餐），增加蔬菜水果比例；建议营养科咨询。4. 教育患者活动后症状管理策略（如休息时采用支撑位）。5. 安排4周后门诊随访评估症状改善及依从性。",
    "patient_dialogue": "王女士，您好！看到您今天来复诊，感谢您分享这些细节。您提到爬楼梯时喘得厉害，这其实是身体在感染后还在慢慢恢复的常见反应，别担心，我们会一起帮您改善。首先，我教您一些简单的呼吸练习——比如坐着或半躺时，慢慢吸气鼓肚子、再缓缓呼气，每天练两次，每次十来分钟，这样能帮您在活动时喘得没那么难受。其次，咱们得慢慢动起来：先从每天走个10分钟开始，就像散步一样，别急着爬楼或跑跳，这样能帮您恢复力气、减少心慌的感觉。您说平时老坐着、还爱喝加糖咖啡吃快餐，这些习惯时间长了可能让身体更容易疲劳，还容易长胖。建议改喝不加糖的咖啡或茶，午饭外卖选点清淡的，比如蔬菜沙拉配鸡胸肉，晚上追剧时换成水果或坚果，这样身体恢复得更快。您左肩酸胀可能是姿势问题，坐久了活动一下肩膀就好。我知道一动就喘让您不想动，但咱一步步来，别着急——坚持这些改变，您会感觉越来越有劲的！我们4周后再见，看看效果怎么样。"
  },
  {
    "id": 1546,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "42岁女性，IT程序员，今日由丈夫推轮椅进入长新冠门诊。主诉‘一动就喘’，平地走50米即需停下扶墙。现场测静息SpO₂ 90%，呼吸频率26次/分，Borg呼吸困难评分4分。患者自带的小型氧气瓶流量2 L/min下SpO₂仅升至92%。既往：2022年12月首次SARS-CoV-2感染，住院8天未插管；出院后持续乏力、咳嗽。无哮喘、无慢阻肺、无心脏病史。今日外院胸CT报告‘双肺散在磨玻璃影，较前略吸收’；NT-proBNP 85 ng/L；血常规、D-二聚体正常。患者同时抱怨‘最近天气潮湿，右膝旧伤酸痛’，但主要痛苦仍是‘喘不上气，无法回公司写代码’。查体：双肺底细湿啰音，心率96次/分，律齐，下肢无水肿。",
    "reference_rule": {
      "condition": "呼吸困难Borg评分>3分、SpO2≤92%、需辅助供氧",
      "action": "1. 呼吸科进一步检查；2. 肺康复治疗",
      "contraindication": null,
      "evidence": "出现中至重度呼吸困难（如 Borg 评分 > 3 分）、持续低氧饱和度（SpO2 ≤ 92%）、持续有新的辅助供氧需求或有其他呼吸系统症状，建议去呼吸科做进一步检查并考虑行肺康复治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如排除急性心衰、肺栓塞等危急重症），并直接给出诊疗指令，确保患者安全高效地进入下一步处理。\n\nStep 2: 临床解码 (Clinical Decoding): 患者为42岁女性，既往COVID-19感染史（2022年12月），当前表现为长新冠相关呼吸系统症状：中至重度呼吸困难（Borg评分4分）、低氧血症（静息SpO₂ 90%，辅助供氧下仅92%）、呼吸频率增快（26次/分），提示持续性肺功能障碍；查体双肺底细湿啰音指示肺底炎症或纤维化可能；胸CT显示双肺散在磨玻璃影（较前略吸收），但NT-proBNP正常（85 ng/L）、血常规和D-二聚体正常，排除了急性心衰、感染或肺栓塞；患者功能受限（无法行走50米），且需辅助供氧，但无其他心肺基础病史。隐式线索包括患者职业为IT程序员导致的久坐生活方式可能加剧症状，以及膝伤酸痛为次要问题，不影响主要呼吸诊断。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南条件（呼吸困难Borg评分>3分、SpO2≤92%、需辅助供氧）完全匹配患者情况（Borg 4分 >3，SpO2 ≤92%，辅助供氧需求）；禁忌症（contraindication）为null，无安全风险或冲突，因此可安全应用指南建议。\n\nStep 4: 决策生成 (Decision Making): 根据指南action（呼吸科进一步检查；肺康复治疗），生成决策：立即转诊呼吸科进行专科评估（包括肺功能测试和动脉血气分析），并启动肺康复治疗计划，以优化呼吸功能恢复。",
    "medical_order": "1. 建议呼吸科转诊，完善肺功能测试、动脉血气分析及高分辨率CT复查评估肺纤维化程度。2. 立即启动肺康复治疗计划，包括呼吸训练、渐进性运动疗法及氧疗监测。3. 监测生命体征（SpO₂、心率、呼吸频率），一级护理。4. 暂不处理右膝酸痛，因无急性指征。",
    "patient_dialogue": "张女士，您好！从您的描述来看，您走路时就喘得厉害，氧气水平也偏低，这可能是之前新冠感染后肺部还没完全恢复引起的。我们现在需要做两件事来帮您：第一，我会把您转到呼吸科的专家那里，他们会做更详细的检查，比如测测肺活量和血液气体，弄清楚肺部具体怎么了；第二，我们马上安排一个肺康复计划，教您做些呼吸练习和轻度运动，慢慢帮您恢复体力，这样您就能早点回去上班写代码了。您别太担心，虽然现在难受，但通过治疗，多数人都会好转的。至于膝盖酸痛，天气潮湿时旧伤可能有点影响，但目前重点还是先解决呼吸问题，好吗？"
  },
  {
    "id": 1540,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者34岁，平面设计师，远程视频复诊。主诉：‘阳’后第14周仍咳得睡不着，夜里得垫两个枕头。咳嗽为阵发性、无痰、说话或冷空气即诱发，咳到尿失禁。已自行服完两瓶某品牌‘强力枇杷露’无效。无发热、无喘鸣，但声音嘶哑、胸骨后隐痛。既往体健，未接种加强针。今日北京沙尘，她边咳边说：‘老师，我能不能先打一针流感疫苗再治咳？’查体：咽部轻度充血，双肺听诊清，呼吸音对称。外院两周前胸片报告‘双肺纹理稍增粗’，血常规、CRP正常。患者同时抱怨最近加班画稿，用眼过度，‘眼睛干得像沙子’，希望顺便开人工泪液。",
    "reference_rule": {
      "condition": "持续性咳嗽",
      "action": "1. 非处方止咳药（苯佐那酯/愈创甘油醚/右美沙芬）；2. 吸入疗法（支气管扩张剂/糖皮质激素）；3. 顽固性咳嗽用阿片类药物（最后选择）",
      "contraindication": "常规使用阿片类药物（仅限顽固性咳嗽）",
      "evidence": "对于持续性咳嗽，处理方法与病毒感染后咳嗽综合征患者的咳嗽类似，必要时使用非处方止咳药，如苯佐那酯、愈创甘油醚、右美沙芬等。吸入疗法（如吸入性支气管扩张剂或糖皮质激素）可能有效。考虑到潜在风险，阿片类药物很少用于治疗咳嗽，仅用于严重、无法耐受、干扰睡眠和/或降低生存质量的顽固性咳嗽患者。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于常规诊断与治疗场景。作为急诊/门诊医生，重点关注快速建立鉴别诊断：排除肺炎、哮喘急性发作等危急情况，优先处理严重影响生活质量的咳嗽症状。",
      "Step 2: 临床解码": {
        "核心问题": "病毒感染后咳嗽综合征（PICS）",
        "关键线索": [
          "时间：'阳'后14周 >8周符合慢性咳嗽",
          "特征：无痰/冷空气诱发/咳嗽性尿失禁/胸骨后痛（提示气道高反应性）",
          "阴性指征：无发热/喘鸣/感染指标正常",
          "环境因素：沙尘加重刺激",
          "合并诉求：干眼症（用眼过度）、流感疫苗接种需求"
        ],
        "危险信号排除": "双肺听诊清+胸片无实变→排除肺炎；无喘鸣→暂缓哮喘诊断"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": {
          "Condition": "持续性咳嗽（符合PICS诊断）",
          "Action适用": "首选非处方止咳药（右美沙芬）和吸入疗法（激素+支扩剂），避免阿片类（非顽固性咳嗽）"
        },
        "禁忌核查": [
          "无阿片类药物使用指征（未尝试一线治疗）",
          "疫苗接种：急性咳嗽非绝对禁忌，但沙尘暴期间外出接种有风险"
        ]
      },
      "Step 4: 决策生成": {
        "咳嗽治疗": "阶梯式方案：1. 右美沙芬镇咳 + 试验性吸入激素/支扩剂 2. 盆底肌训练应对尿失禁",
        "其他处置": "1. 暂缓疫苗接种（优先止咳） 2. 人工泪液缓解干眼 3. 环境干预（防尘口罩）"
      }
    },
    "medical_order": "1. 诊断：病毒感染后咳嗽综合征（PICS）。2. 治疗：（1）止咳：右美沙芬15mg 口服 tid（必要时）；（2）吸入：布地奈德/福莫特罗干粉吸入剂 1吸 bid；（3）行为干预：咳嗽时行凯格尔运动，沙尘天佩戴N95口罩。3. 辅助：玻璃酸钠滴眼液 1滴 qid。4. 宣教：暂缓流感疫苗接种（咳嗽稳定后补种）。5. 随访：2周后复评咳嗽视觉模拟评分（VAS）。",
    "patient_dialogue": "李设计师，您这咳嗽是新冠后常见的'气道敏感'现象，就像受伤的皮肤一碰就疼——现在气道特别容易受刺激。咱们分三步走：第一步，开个止咳药水（右美沙芬），咳得睡不着时喝10ml；第二步，这个吸入剂（布地奈德/福莫特罗）像'气道面膜'，每天早晚吸一次，慢慢修复敏感。咳嗽时记得夹紧大腿肌肉，能预防漏尿。沙尘天出门务必戴N95口罩，您这嗓子现在比眼睛还怕'吃沙子'呢！疫苗咱们等咳嗽好些再打，现在去打万一路上咳狠了更受罪。眼药水给您开好了，看电脑时设个闹钟，每小时休息10分钟眨眨眼。两周后咱们再视频，看要不要调整方案。"
  },
  {
    "id": 1557,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者38岁，女性，BMI 21 kg·m⁻²，既往无心血管危险因素。8个月前确诊SARS-CoV-2感染后持续乏力、活动后气促，近6周出现胸骨后钝痛，无放射，持续10–30 min，与运动无关。疼痛发作时曾在急诊查高敏肌钙蛋白I 3 ng·L⁻¹（正常<26 ng·L⁻¹）、NT-proBNP 68 ng·L⁻¹（正常<125 ng·L⁻¹），心电图示窦性心律、胸前导联T波低平；冠脉CTA未见狭窄，心脏MRI未见延迟强化。今日门诊复查：血压112/74 mmHg，心率88次·min⁻¹，SpO₂ 97%（室内空气），肺部听诊清，无奔马律及心包摩擦音。患者自述疼痛每周发作2–3次，夜间明显，服用对乙酰氨基酚后仅轻微缓解。同时伴指尖发凉，遇冷加重，但无典型雷诺现象。实验室：hs-CRP 2.1 mg·L⁻¹，总胆固醇4.2 mmol·L⁻¹，糖化血红蛋白5.1%，甲状腺功能正常。患者诉因胸痛担心再次心梗，已自行减少日常步行至<3000步/日，睡眠差（AIS评分11分）。",
    "reference_rule": {
      "condition": "胸痛且排除缺血性心脏病",
      "action": "1. NSAIDs或小剂量秋水仙碱；2. 疑内皮功能障碍者用钙通道阻滞剂/长效硝酸盐/雷诺嗪；3. 无效者用营养补充剂（甜菜根提取物/L-精氨酸）",
      "contraindication": null,
      "evidence": "对于胸痛的患者，如排除缺血性心脏病，可考虑予非甾体类抗炎药物（NSAIDs）试验性治疗，或加用小剂量的秋水仙碱，怀疑有内皮功能障碍的患者，可予钙通道阻滞剂、长效硝酸盐类药物和/或雷诺嗪试验性治疗。另外一些营养补充剂（如甜菜根提取物和 L-精氨酸）可以通过增加 NO，用于其他治疗方案无效的持续性胸痛或疑似微血管功能障碍患者。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如急性冠脉综合征或心包炎），并基于现有证据给出最直接的诊疗指令。患者症状稳定，无生命体征异常，符合常规门诊处理范畴。Step 2: 临床解码 (Clinical Decoding): 患者为38岁女性，既往COVID-19感染后出现持续症状，核心表现为胸骨后钝痛（非放射性、与运动无关、夜间加重）、活动后气促和乏力。关键隐式线索包括：心电图T波低平但无急性缺血证据；hs-CRP轻度升高（2.1 mg·L⁻¹）提示低度炎症；指尖发凉遇冷加重暗示微血管功能障碍可能；患者焦虑（担心心梗）、睡眠差（AIS评分11分）和自行限制活动（<3000步/日）可能加重症状，形成恶性循环。整体指向COVID后胸痛综合征，需鉴别微血管功能障碍、肌肉骨骼痛或焦虑相关胸痛。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南条件“胸痛且排除缺血性心脏病”完全匹配（冠脉CTA和心脏MRI已排除缺血）。指南action推荐NSAIDs/秋水仙碱为首选，疑内皮功能障碍者用钙通道阻滞剂等。无禁忌症（contraindication为null）：患者无NSAID高风险因素（如消化性溃疡或肾病病史），实验室指标正常，安全可行。Step 4: 决策生成 (Decision Making): 优先启动NSAIDs试验性治疗（针对炎症和疼痛）；鉴于微血管症状（指尖发凉），同步考虑钙通道阻滞剂作为备选。同时，必须整合生活方式干预以打破焦虑-活动减少循环，确保全面管理。",
    "medical_order": "诊断：排除缺血性心脏病后胸痛，疑COVID后胸痛综合征伴微血管功能障碍。治疗：1. 予布洛芬400 mg口服 tid（餐后），疗程2周，评估疼痛缓解情况。2. 如无效或症状持续，予氨氯地平5 mg口服 od试验性治疗（监测血压及副作用）。3. 建议逐步增加日常活动至5000步/日，避免久坐。4. 改善睡眠卫生：固定就寝时间，限制睡前屏幕使用。5. 安排2周后门诊随访，复查hs-CRP及心电图；如疼痛加剧或新发症状，立即复诊。",
    "patient_dialogue": "您好，先别担心，我从检查结果来看，您的胸痛不是心脏病发作或心梗，这一点已经通过之前的详细检查排除了。这很可能是COVID感染后身体的一些炎症反应和微血管问题引起的。接下来，我们这样处理：第一，我会给您开一种消炎药（比如布洛芬），每天三次饭后吃，帮助减轻胸痛和炎症，咱们先试试看两周，看看晚上疼痛有没有好一些。第二，如果您的手指发凉或胸痛没改善，我们可能换成另一种药来改善血管功能。同时，我知道您因为担心减少了走路，但适当活动对身体恢复很重要——慢慢来，目标是每天走到5000步左右，别一下子太累。睡眠方面，试试每天固定时间上床，睡前一小时别玩手机，这能帮助您休息得更好。记住，这些症状大多能缓解，我们一起努力，您保持积极心态很关键。两周后咱们再见面看看进展，有任何不舒服随时联系我。"
  },
  {
    "id": 1537,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者42岁，女性，体重指数23 kg/m²，既往无哮喘、无慢阻肺。今年1月确诊SARS-CoV-2（Delta株）轻症肺炎，急性期后持续干咳伴活动后气促已4个月。夜间咳嗽明显，说话稍多即诱发，伴咽喉异物感，无喘息、无发热。自行服用右美沙芬、孟鲁司特效果差。今日门诊查体：咽部轻度充血，双肺听诊散在呼气末哮鸣音，SpO₂ 97%（静息，室温）。肺功能：FEV₁ 86%预计值，FEV₁/FVC 0.72，支气管舒张试验阴性；FeNO 28 ppb；胸CT示双下肺少量磨玻璃影，支气管壁略增厚。血常规、IgE、过敏原筛查、甲状腺功能均正常。自述“写代码时咳到无法开会”，因咳嗽睡眠质量差，ESS 10分。患者诉近期公司裁员压力大，咖啡日饮4杯。无吸烟史，居家饲养一只英短猫。",
    "reference_rule": {
      "condition": "慢性咳嗽或明显呼吸道症状的长新冠综合征患者",
      "action": "短期小剂量激素治疗（如泼尼松龙10mg或地福可特8周）",
      "contraindication": "长期大剂量激素（因不良反应风险）",
      "evidence": "推荐意见 10：短期小剂量激素可考虑用于慢性咳嗽或有明显呼吸道症状的患者（C4）；肺纤维化患者抗纤维化治疗可能临床获益（C4）。"
    },
    "thought": "本案例属于常规诊断与治疗场景。作为急诊/门诊医生，关注重点是快速建立鉴别诊断以排除危急重症（如肺栓塞、心力衰竭或急性感染），并基于稳定症状（SpO₂ 97%正常、无发热喘息）给出直接治疗指令。\n\n临床解码：患者表现为COVID-19（Delta株）后长新冠综合征，包括慢性干咳（持续4个月）、活动后气促、夜间加重、说话诱发症状及咽喉异物感。关键医学术语包括：轻度阻塞性通气功能障碍（FEV1/FVC 0.72）、中度气道炎症（FeNO 28 ppb）、CT示炎症后改变（磨玻璃影和支气管壁增厚）。隐式线索：生活因素如高咖啡因摄入（日4杯，可能刺激咳嗽）、心理压力（公司裁员，ESS 10分提示睡眠障碍）、宠物暴露（英短猫，尽管过敏原筛查正常，但可能诱发敏感）；排除哮喘（支气管舒张试验阴性）和常见病因（血常规等正常）。\n\n规则对齐与安全检查：指南condition（慢性咳嗽或明显呼吸道症状的长新冠综合征患者）完全匹配患者情况。action（短期小剂量激素治疗如泼尼松龙10mg或地福可特8周）适用，无contraindication（无长期大剂量激素风险，患者年龄42岁、无骨质疏松或糖尿病史）；安全强制检查确认无药物相互作用或禁忌症（肺功能稳定，无免疫抑制证据）。\n\n决策生成：基于指南action，启动泼尼松龙10mg口服每日一次，疗程8周；同时整合非核心指南建议（如生活干预），以优化疗效。",
    "medical_order": "诊断：长新冠综合征后慢性咳嗽。\n\n治疗：予泼尼松龙10mg口服每日一次，连续8周。监测药物副作用（如血糖、血压）。\n\n生活方式建议：限制咖啡因摄入（每日≤1杯）；评估环境过敏源（建议居家减少猫毛暴露）；心理压力管理（推荐心理咨询）。\n\n随访：4周后复诊评估症状缓解及肺功能；如咳嗽持续，考虑复查FeNO或胸CT。",
    "patient_dialogue": "您好，您的咳嗽和气促已经持续几个月了，这很可能是COVID后常见的长期影响，别担心，情况不算严重，我们会帮您处理。\n\n我建议您开始用一个小剂量的激素药（泼尼松龙），每天吃一次，帮助减轻气管里的炎症——这样咳嗽应该能慢慢缓解，而且短期使用副作用很小，我们会注意监控。同时，您平时喝咖啡比较多，这可能会刺激喉咙加重咳嗽，试着减到一天一杯或换喝点温水；工作压力大时症状容易变厉害，找些放松方式，比如散步或深呼吸；家里的猫虽然测试没过敏，但毛发可能还是有点影响，多打扫一下房间，保持空气流通。\n\n坚持一段时间，症状应该会好转的，咱们4周后再来复查，看看效果如何。"
  },
  {
    "id": 1548,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者38岁，男性，外卖骑手，今日由妻子陪同到社区长新冠门诊复诊。主诉：‘跑两层楼就喘得比疫情前厉害，胸口像被绳子勒着。’既往无慢阻肺、无心衰。出院记录：2023-02-08确诊COVID-19（普通型），住院6天，未进ICU，出院时CT示双肺散在条索影。目前静息指脉氧97%，但6分钟步行试验仅420 m，步行后SpO₂降至91%，恢复时间>3 min。查体：BMI 31.4 kg/m²，颈围42 cm，呼吸频率22次/分，双肺底少许爆裂音。患者自述：‘我怕出门锻炼又染病，干脆整天躺床上刷手机，一天两顿外卖，奶茶必须全糖。’今日天气骤冷，他顺便提到‘左膝旧伤有点酸胀’，其余无症状。妻子补充：‘他夜里呼噜声比住院前还响，白天动不动就叹气。’",
    "reference_rule": {
      "condition": "COVID-19恢复早期患者",
      "action": "进行呼吸康复训练（如吸气肌训练）或WHO五阶段运动计划",
      "contraindication": "剧烈运动（可能加重症状）",
      "evidence": "推荐意见 15：COVID-19 患者在恢复早期应积极进行呼吸康复或吸气肌训练治疗（B3b）。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于生活方式与风险干预场景。作为健康管理师，我的关注重点是识别患者隐式的不良生活习惯（如久坐、高糖饮食和缺乏运动），关联这些习惯与长期健康风险（例如肥胖加重呼吸困难、睡眠呼吸暂停可能进展为心血管疾病），并以共情但坚定的语气提出非药物干预建议，强调行为改变对改善生活质量和预防并发症的重要性。\n\n**Step 2: 临床解码 (Clinical Decoding)**：从病例提取关键医学信息：1. 呼吸系统：患者活动后呼吸困难（主诉跑两层楼喘气、胸口紧缩感），6分钟步行试验仅420m且SpO₂降至91%恢复慢，结合出院CT双肺散在条索影，提示COVID-19后遗症（肺纤维化或功能减退）。2. 心血管与代谢：BMI 31.4 kg/m²（肥胖）、颈围42 cm（阻塞性睡眠呼吸暂停高风险）、呼吸频率22次/分（轻度呼吸窘迫）、双肺底爆裂音（可能轻度肺间质病变）。3. 生活习惯：自述长期卧床、高糖饮食（一天两顿外卖、全糖奶茶）和运动恐惧（怕染病不敢出门），妻子提及夜间鼾声加重（睡眠呼吸暂停可能）和白天叹气（焦虑或抑郁倾向）。4. 其他：左膝酸胀（肥胖相关关节劳损），但无急性症状。隐式线索包括久坐导致肌肉萎缩、高热量摄入加重肥胖、睡眠问题未评估。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南condition为'COVID-19恢复早期患者'，患者符合此条件（出院后肺功能减退）。指南action建议'呼吸康复训练或WHO五阶段运动计划'，但contraindication为'剧烈运动（可能加重症状）'。患者步行试验SpO₂下降和恢复时间延长，明确提示剧烈运动禁忌；需确保干预从低强度起始，避免诱发缺氧。安全检查：无药物冲突（纯非药物干预），肥胖和睡眠风险需优先管理以防恶化。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南action，核心决策为实施呼吸康复训练（如吸气肌训练，针对呼吸困难）和WHO五阶段运动计划（从阶段1低强度开始），同时结合场景重点，加入生活方式干预（减肥、饮食调整）和睡眠评估。决策优先级：安全避免剧烈运动 → 呼吸康复 → 渐进运动 → 饮食/睡眠管理。",
    "medical_order": "诊断：COVID-19后遗症（肺功能减退）、肥胖（BMI 31.4 kg/m²）、阻塞性睡眠呼吸暂停疑似。干预：1. 予呼吸康复训练，包括吸气肌训练（每日两次，每次10分钟，使用阈值负荷设备）。2. 启动WHO五阶段运动康复计划，从阶段1（低强度，如床上肢体活动）开始，监测SpO₂，避免SpO₂降至90%以下。3. 生活方式干预：建议低热量、低糖饮食（每日热量控制于1800kcal以下），并逐步增加日常活动（如室内步行）。4. 完善睡眠呼吸监测（如居家便携式多导睡眠图）。5. 避免剧烈运动及高强度活动。随访：2周后复诊评估运动耐受性和体重变化。",
    "patient_dialogue": "王先生，还有王太太，谢谢你们今天过来。我理解您出院后，爬楼梯都会喘得厉害，胸口发紧，这确实让人担心——这和您之前得的COVID有关，肺部需要时间恢复，而且您提到整天躺着、喝全糖奶茶，这些习惯会让身体更吃力。别担心，咱们一步步来调整，好吗？首先，针对您呼吸的问题，我会教您一个简单的呼吸练习：每天两次，用个吸气训练器吸吸气，就像锻炼肺部的‘肌肉’，这能帮您喘气更顺畅。同时，咱们从最轻松的运动开始，比如在床上动动手脚，或者在家慢慢走几圈，别急着出门，这样既安全又能慢慢恢复体力。您怕再感染是对的，所以咱们不强迫您外出，先从室内开始。另外，您爱喝奶茶，但全糖的会增加体重，让呼吸更困难，试试换成半糖或少糖，外卖也选清淡点的，比如多点蔬菜少点油炸。还有，王太太说您呼噜声大了，这可能影响睡眠质量，我建议您做个简单的睡眠监测，看看是不是需要进一步处理。这些小改变不会太难，但坚持下来，您的呼吸和体力会越来越好，也能降低其他健康风险。咱们一起努力，下周再来看看进展，好吗？"
  },
  {
    "id": 1534,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "42岁女性，网约车司机，今日独自推门诊玻璃门进来，手里还攥着一张上个月的肺功能报告。主诉‘跑两层楼就喘，胸口像被安全带勒住’。既往：2022-12 患新冠（重型，住院 8 d，曾高流量氧疗），出院后持续干咳与活动后气促，被街道医院标记为‘长新冠’。无吸烟史，BMI 24 kg·m⁻²。今日室温 34 ℃，她进门时额角仍冒汗，顺嘴抱怨‘车内空调坏了，乘客一直催’。查体：SpO₂ 96%（静息），两肺底散在爆裂音；HR 88 bpm，BP 118/76 mmHg。辅检：① 上月高分辨 CT——双下肺磨玻璃影伴纤细网格改变，Raj 评分 8 分；② 同期肺功能——FVC 82%pred，FEV₁/FVC 0.78，DLCO 68%pred（重度弥散下降）。社区已予布地奈德/福莫特罗 160/4.5 μg 1吸 bid 三月，症状无改善，她担心‘再这样没法开车挣钱’。",
    "reference_rule": {
      "condition": "长新冠综合征患者出现肺功能异常或肺部影像学异常",
      "action": "定期复查肺功能（重点弥散功能）和胸部CT",
      "contraindication": null,
      "evidence": "推荐意见 2：长新冠综合征患者的肺功能异常和肺部影像学异常可随时间推移逐渐改善，部分患者遗留持续性肺部 CT 影像异常改变，建议定期复查肺功能，尤其是弥散功能和胸部 CT（B2b）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) — 本案例属于分级诊疗与随访场景。作为守门人，我关注患者当前临床状况（如肺功能、影像学异常和症状控制）与治疗目标（改善呼吸症状、维持生活质量）的对比，判断是否达到稳定标准或需升级干预。\\n\\nStep 2: 临床解码 (Clinical Decoding) — 患者表现为长新冠综合征（post-COVID syndrome）伴间质性肺病特征：高分辨CT显示双下肺磨玻璃影和网格改变（Raj评分8分，提示纤维化进展风险），肺功能示重度弥散功能障碍（DLCO 68%pred）和轻度限制性通气障碍（FVC 82%pred）。隐式线索包括：职业暴露（网约车司机可能接触空气污染物和热应激）、环境因素（34°C高温和空调故障加重不适）导致症状加重（活动后气促、爆裂音提示肺泡炎症），以及吸入治疗（布地奈德/福莫特罗）无效3个月，影响工作能力（生计焦虑）。核心问题是非进展性间质性改变或需优化管理。\\n\\nStep 3: 规则对齐与安全检查 (Alignment & Safety) — 患者完全符合指南Condition（长新冠综合征伴肺功能异常和肺部影像学异常）。无禁忌证（Contraindication为null）。指南Action强调定期复查肺功能（重点弥散功能）和胸部CT（证据：部分患者遗留持续性异常，需监测变化）。安全方面：无药物相互作用或急性风险（SpO₂ 96%静息正常，BP/HR稳定），但需排除其他病因如职业性肺病。\\n\\nStep 4: 决策生成 (Decision Making) — 对比现状（症状无改善、肺功能重度异常）与达标标准（症状缓解、稳定肺功能），决定触发转诊升级：安排复查以监测进展（遵循指南Action），但鉴于吸入治疗无效和职业影响，需转诊呼吸专科进行高级评估和优化治疗（如肺康复或抗纤维化干预）。",
    "medical_order": "1. 安排复查肺功能（重点弥散功能）及胸部高分辨CT（间隔3-6个月，以Raj评分为基准）。2. 转诊至上级医院呼吸科专科门诊（评估间质性肺病进展可能，优化治疗方案）。3. 监测静息及活动后SpO₂（警惕低氧风险）。4. 评估肺康复计划（包括呼吸训练和职业调整建议）。",
    "patient_dialogue": "张女士，今天天气这么热，您还专程过来，真是辛苦了！我看了您的报告和症状，肺部的损伤可能还残留一些炎症，所以爬楼会喘、胸口发紧。之前的吸入药效果不理想，咱们得再查查肺功能和CT，看看有没有好转或变化。这样能帮我们找到更合适的办法，让您轻松点开车。我建议您去大医院的呼吸科专家那儿看看，他们经验丰富，能给您更多支持。别太担心，我们一起努力，争取让您早点回到方向盘上挣钱！"
  },
  {
    "id": 1554,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者4个月前确诊新冠（Ct值18），退烧后持续乏力，日常步行500米即需坐下休息，夜间睡眠8小时仍晨起困倦。今日由同事搀扶步入诊室，面色萎黄，说话中途停顿3次深呼吸。自诉‘脑子像罩了层雾，写方案时单词拼写都卡壳’。近期无发热、咳嗽，体重下降2 kg。既往体健，未接种加强针。查体：BP 108/70 mmHg，HR 88次/分，SpO₂ 97%，Borg自觉疲劳量表当下评分为‘有点累’（3/10）。实验室：Hb 122 g/L，TSH 2.1 mIU/L，铁蛋白28 ng/mL，Ferritin轻度降低；肝肾功能、心肌酶、CRP正常。胸部CT未见间质改变。患者追问：‘是不是我懒？可我真的一步都不想动。’室外今日32 ℃高温，她随身携带600 mL冰美式，称‘靠咖啡续命’。",
    "reference_rule": {
      "condition": "疲乏",
      "action": "1. 认知疗法；2. 分级运动疗法（Borg量表）；3. 中医针灸/腹部推拿；4. 辅酶Q10+还原型辅酶I",
      "contraindication": "激素治疗（无证据）",
      "evidence": "（1）认知疗法：帮助患者正确认知新冠病毒感染后的疲乏，缓解对病情的恐惧，树立治愈疾病的信心。（2）分级运动疗法：使用 Borg 主观疲劳感知评估量表的自我感觉疲乏量表，对运动功能进行评估。根据该量表的评分选择不同强度的运动量，并循序渐进增加运动量。（3）中医针灸、腹部推拿治疗。（4）药物治疗：辅酶 Q10 + 还原型辅酶 I 可能改善疲乏症状。（5）目前暂无证据证明激素治疗有效。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除如心肌炎、严重感染或代谢紊乱等危急重症，并基于现有证据给出最直接、高效的治疗指令，避免延误。\n\nStep 2: 临床解码 (Clinical Decoding)：从病例中提取关键信息：患者表现为新冠后持续性疲劳综合征（Post-COVID fatigue syndrome），症状包括劳力不耐受（步行500米需休息）、认知功能障碍（‘脑子像罩了层雾’及单词拼写困难）、主观疲劳（Borg量表3/10）和轻度贫血（Hb 122 g/L及铁蛋白28 ng/mL偏低）。隐式线索包括咖啡因依赖（每日600mL冰美式，提示可能通过咖啡因掩盖疲劳或加剧能量循环紊乱）、体重下降2 kg（需警惕营养不良或慢性消耗），以及情绪困扰（自问‘是不是我懒’，表明焦虑）。无危急体征（BP、HR、SpO2正常，CT及实验室排除了心肺急症）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：患者症状与指南‘疲乏’条件高度匹配。Contraindication强制检查：无激素治疗指征（指南明确无证据支持），且患者无相关禁忌（如无免疫抑制病史），确保安全。其他潜在风险已排除（如心肌酶正常排除心肌炎、CRP正常排除活动性炎症）。\n\nStep 4: 决策生成 (Decision Making)：根据指南Action，优先推荐非药物干预（认知疗法和分级运动疗法）作为核心，辅以补充疗法（中医针灸/腹部推拿和辅酶Q10+还原型辅酶I）。决策基于排除危急重症后，直接聚焦于缓解疲劳和认知症状，避免不必要检查。",
    "medical_order": "1. 启动认知行为疗法：每周1次，针对COVID-19后疲劳认知重塑，缓解恐惧，树立康复信心。2. 实施分级运动疗法：基于Borg自觉疲劳量表评分3/10，起始低强度运动（如每日步行10分钟），逐步递增；每周评估量表，调整运动量。3. 推荐中医治疗：选择针灸（每周2次）或腹部推拿（每周3次），以缓解疲劳。4. 处方药物治疗：辅酶Q10 100mg 每日一次口服 + 还原型辅酶I 10mg 每日一次口服，可能改善能量代谢。5. 监测铁蛋白：复查铁蛋白（目标>50 ng/mL），若持续偏低，考虑铁补充剂。6. 生活方式干预：建议减少咖啡因摄入（每日<200mg），避免加重疲劳循环。7. 随访安排：2周后复诊，评估疲劳程度和认知功能改善。",
    "patient_dialogue": "嗨，我完全理解你现在的感受——整天疲惫不堪，连走路都费劲，脑子也像蒙了一层雾，这绝不是懒惰！新冠后很多人都会这样，是身体在恢复过程中发出的信号。咱们一步步来：首先，我们会教你一些简单的心理技巧，帮你重新认识疲劳，减少焦虑，让你更有信心战胜它。第二，运动要慢慢来，别急着走远路，先从每天10分钟散步开始，感觉累了就停，这样身体才会逐渐适应。第三，我建议试试针灸或推拿，这些中医方法能帮助放松，缓解疲劳感。另外，我会开点营养补充剂，像辅酶Q10，它能给细胞加点‘油’，提升精力。对了，咖啡虽然能提神，但喝太多反而容易让身体更累——试着减到一天一杯吧。两周后咱们再聊聊，看看有没有好转。记住，这不是你的错，我们一起努力，你会好起来的！"
  },
  {
    "id": 1549,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "今日长新冠门诊复诊。患者主诉“脑子像被棉花塞住，一打开设计软件就心慌、手抖、想哭”，夜间反复刷手机查后遗症信息至凌晨3点，近4周体重掉了4 kg。她否认胸闷气短，但补充“天气一闷热就像有人掐住喉咙”。既往体健，无精神病史；自评PHQ-9=16，GAD-7=15。查体：BP 118/76 mmHg，HR 92次/分，SpO₂ 98%，余无阳性体征。实验室与头颅MRI均未见异常。患者自述“咖啡能续命”，每天3杯美式；无吸烟饮酒。她低声问医生：“我这是不是好不了了？同事都说我矫情。”",
    "reference_rule": {
      "condition": "精神症状（焦虑/抑郁）",
      "action": "1. 认知疗法（冥想/正念减压）；2. 物理治疗（生物反馈/针灸）；3. 抗焦虑抑郁药物",
      "contraindication": null,
      "evidence": "（1）认知疗法：正确认识长新冠综合征的症状，鼓励健康饮食，逐渐恢复日常生活或爱好和保持社交，保证充足的睡眠和掌握放松技巧（如冥想、正念减压疗法等）。（2）物理治疗：包括松弛治疗、物理治疗、生物反馈和针灸治疗等。（3）药物治疗：必要时适当应用抗焦虑抑郁的药物。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于生活方式与风险干预场景。作为健康管理师，我重点关注识别隐式不良习惯（如高咖啡因摄入和睡眠剥夺），关联长期风险（如焦虑加重、体重持续下降和社会功能受损），并优先以共情但坚定的语气提出非药物干预建议。Step 2: 临床解码 (Clinical Decoding) - 患者呈现中度焦虑抑郁症状（PHQ-9=16和GAD-7=15符合诊断标准），主诉认知障碍（\"脑子像被棉花塞住\"）、情境性焦虑（使用设计软件时心慌、手抖、想哭）、睡眠剥夺（夜间刷手机至凌晨3点导致睡眠周期紊乱），以及体重下降4kg（提示营养或代谢失衡）。查体显示轻度交感神经亢进（HR 92次/分），但无器质性异常（实验室和MRI正常）。隐式风险包括咖啡因依赖（每天3杯美式）、社会心理压力（同事误解引发无助感）。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 与指南condition \"精神症状（焦虑/抑郁）\"完全匹配。指南contraindication为null，无禁忌症（如无药物过敏或共病风险）。Step 4: 决策生成 (Decision Making) - 基于指南action，优先非药物干预：实施认知疗法（冥想/正念减压）和物理治疗（生物反馈/针灸），必要时评估药物治疗；强化生活方式调整（减少咖啡因、改善睡眠卫生），以降低长期风险。",
    "medical_order": "建议：1. 予认知疗法指导，包括冥想和正念减压练习，每日一次。2. 推荐物理治疗，如生物反馈或针灸，每周两次。3. 评估抗焦虑抑郁药物适应症（考虑SSRIs类）。4. 生活方式干预：减少咖啡因摄入至≤1杯/天，建立规律作息（22:00前入睡），避免睡前使用电子设备。5. 监测体重、心率和PHQ-9/GAD-7评分，4周后复诊。",
    "patient_dialogue": "（温和地）您好，我完全理解您现在的感受——那种脑子糊糊的、工作时心慌手抖的难受劲儿，还有晚上刷手机停不下来的焦虑。您绝对不是矫情，这是长新冠后常见的反应，我们一起来慢慢改善。首先，关于咖啡：虽然它让您有精神，但一天三杯可能会让身体更紧张，咱们试试减到一杯，换成温水或花草茶，好吗？这样能帮您更平稳些。（停顿）晚上刷手机到凌晨也影响休息，从今晚开始，咱们约定10点放下手机，可以听听轻音乐或读本书放松。另外，我会教您简单的冥想技巧，每天花5分钟深呼吸，帮您平静下来。别担心，这不是好不了，我们一步一步来，您会感觉越来越好的。"
  },
  {
    "id": 1558,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者8个月前感染SARS-CoV-2后，持续出现心悸、胸闷及乏力。近1周心悸明显加重，呈阵发性，夜间入睡时尤为明显，伴轻度头晕。无胸痛、黑蒙或晕厥。自测静息心率常波动于105–118次/分，偶见手表提示“房性早搏”。既往无高血压、甲亢或心脏病史，未吸烟，偶尔喝拿铁1杯/日。近期加班频繁，每日平均睡眠5小时。体检：BP 118/72 mmHg，HR 112次/分、律不齐，可闻及早搏3次/分，心肺听诊未及杂音，甲状腺无肿大。12导联ECG：窦性心动过速，频发房性早搏；24 h Holter：平均HR 102次/分，单发房早2 847次，室早0次。实验室：hs-cTnI 3 ng/L(正常)、NT-proBNP 58 ng/L、TSH 1.6 mIU/L、Hb 132 g/L。心脏彩超：LVEF 65%，各腔室大小及瓣膜未见异常。患者自述曾尝试戒咖啡、冥想呼吸，但心悸仍困扰日常工作，尤其线上会议前加重。今日门诊希望‘尽快把心率压下来，别再半夜被自己心跳吓醒’。天气闷热，患者候诊时手持冰美式，额头可见细密汗珠。",
    "reference_rule": {
      "condition": "心悸明显",
      "action": "低剂量β-阻滞剂（比索洛尔/美托洛尔/普萘洛尔）或非双氢吡啶类钙通道阻滞剂（地尔硫卓/维拉帕米），逐步调整剂量",
      "contraindication": null,
      "evidence": "对心悸明显的患者，可加入低剂量的 β-阻滞剂（如比索洛尔、美托洛尔、普萘洛尔）或非双氢吡啶类钙通道阻滞剂（如地尔硫卓、维拉帕米），并逐步调整剂量，这可能有助于适度提高运动耐受性和缓解症状。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规门诊诊疗场景。作为急诊/门诊医生，关注重点是快速排除危急重症（如恶性心律失常、心肌炎），建立COVID-19后心悸的鉴别诊断，优先控制症状。\n\nStep 2: 临床解码 - 核心问题：COVID-19感染后持续性窦速+频发房早（2847次/24h）。关键线索：① 夜间症状加重提示自主神经失调 ② 咖啡因摄入（冰美式）与睡眠不足（5小时）构成明确诱因 ③ 应激反应（线上会议前加重） ④ 已排除器质性疾病（正常cTnI/BNP/甲功/心超）。\n\nStep 3: 规则对齐与安全检查 - 指南condition'心悸明显'与患者阵发性心悸+心率>100次/分完全匹配。无绝对禁忌症（血压正常/无哮喘/心功能正常），但需注意：① 咖啡因可能削弱药效 ② 睡眠不足增加β受体敏感性。\n\nStep 4: 决策生成 - 依据指南action，首选β阻滞剂控制心率。选择比索洛尔：半衰期长利于夜间覆盖，且无内源性拟交感活性。起始超低剂量规避低血压风险，同步强化生活方式干预。",
    "medical_order": "1. 予比索洛尔片1.25mg qd po（晨服），监测服药后2小时立位血压\n2. 严格禁饮含咖啡因饮品（包括咖啡、茶、可乐）\n3. 保证每日睡眠≥7小时，建议22:30前就寝\n4. 健康教育：指导心率自测方法（晨起静息状态）\n5. 1周后复诊：复查心电图，评估心率控制及早搏变化\n6. 若出现心率<55次/分或收缩压<95mmHg立即停药就诊",
    "patient_dialogue": "李女士，您的心跳快和早搏问题，主要是身体还没从新冠感染中完全恢复，加上最近熬夜加班、咖啡没断，神经就像绷紧的弦。咱们分两步走：\n\n第一，给您开个特别温和的小药片（比索洛尔），每天早上一粒。它就像给心脏装个'调速器'，让心跳别跑那么快，晚上也能睡安稳些。您注意吃药后量量血压——家里有血压计吧？我教您怎么测...\n\n第二，您手里这杯冰美式得戒啦！咖啡因会火上浇油，奶茶可乐也不行。晚上十点半前必须上床，睡前用手机放点雨声白噪音，比数羊管用。\n\n别担心，您心脏结构很健康，咱们先这样调整一周。下次来复诊带着心率记录，我看看要不要微调药量。记住啊，您现在最该加的班是'睡眠班'！"
  },
  {
    "id": 1532,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者42岁，IT程序员，感染SARS-CoV-2后8个月仍有活动后心悸、胸闷。自述居家办公期间日均久坐12小时，外卖为主，‘无辣不欢’，每周至少三晚夜宵烧烤配啤酒，BMI 29.4 kg/m²。今日复诊时抱怨昨夜加班到凌晨两点，心悸明显，伴左手小指短暂发麻。否认既往高血压、糖尿病，但父亲55岁因心梗支架植入。患者掏出手机记录显示过去一周平均静息心率102次/分，夜间亦>90次/分。诊室外正逢暴雨，他进门时外套滴水，连打喷嚏两次，随口说‘可能昨晚空调吹感冒了’。",
    "reference_rule": {
      "condition": "有心血管症状的长新冠综合征患者",
      "action": "1. 严格遵循健康生活方式；2. 规范心血管疾病一级/二级预防；3. 对症处理（如β-阻滞剂治疗心悸）",
      "contraindication": null,
      "evidence": "推荐意见 11：有心血管症状的长新冠综合征患者应严格遵循健康生活方式，接受规范的心血管疾病一级或二级预防（A1a）；治疗以经验性支持和对症处理为主。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于生活方式与风险干预场景。作为健康管理师，我将重点识别患者隐式的不良习惯（如久坐、高热量饮食），关联其长期心血管风险（尤其结合家族史和肥胖），并以共情但坚定的语气提出非药物干预建议，强调行为改变的必要性。Step 2: 临床解码 (Clinical Decoding) - 患者有长新冠综合征伴心血管症状（活动后心悸和胸闷），关键风险因素包括：久坐行为（日均12小时，提示 sedentary lifestyle）、肥胖（BMI 29.4 kg/m²，属超重）、不良饮食模式（高热量外卖、辛辣食物、夜宵烧烤配啤酒，反映高脂高盐摄入）、家族心血管病史（父55岁心梗，增加遗传风险）。隐式线索：心率持续增快（静息102次/分，夜间>90次/分，提示持续性心动过速）；左手小指短暂麻木（需警惕神经血管问题）；当前感冒症状（打喷嚏、外套滴水，可能为上呼吸道感染）。这些转化为医学术语：长COVID相关自主神经功能失调、代谢综合征风险、潜在心脑血管事件前兆。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者符合指南condition“有心血管症状的长新冠综合征患者”。无contraindication，安全可推进。需对齐action：实施健康生活方式干预、心血管疾病一级预防（针对无既往病史）、对症处理（如β-阻滞剂）。Step 4: 决策生成 (Decision Making) - 基于指南action，决策优先非药物干预：制定生活方式调整计划（减少久坐、改善饮食、体重管理）；规范一级预防（监测生命体征、排除急性病因）；对症处理可考虑β-阻滞剂（但需评估当前感冒和麻木以排除急症）。",
    "medical_order": "予生活方式干预：建议每日久坐时间控制在8小时以下，每小时活动5-10分钟；调整饮食为低脂低盐，避免辛辣、烧烤及酒精；目标减重5-10%。规范心血管一级预防：监测血压、血脂、血糖；完善心电图、血常规、心肌酶谱检查，评估心悸及麻木原因；建议家庭自测心率。对症处理：考虑予小剂量β-阻滞剂（如美托洛尔12.5mg bid）控制心动过速，但需排除感染禁忌。评估当前上呼吸道感染：予对症支持护理，建议休息多饮水。",
    "patient_dialogue": "张先生，我理解您工作压力大，IT行业经常加班，但您的健康问题确实让我有点担心。您的心跳一直这么快，加上胸闷和手指发麻，如果不及时调整，将来可能像您父亲那样出心脏问题。咱们一步步来：工作时每坐一小时就起来走动几分钟，哪怕在屋里转转也行；外卖少吃点，自己做菜时少放盐和油，烧烤和啤酒咱们尽量减到每周一次，好吗？体重方面，争取减个5-10斤，对心脏负担会小很多。另外，您说昨晚感冒了，多休息多喝水，别让身体再受折腾。那个手指麻木虽然可能没事，但我们得做个检查确保安全。别担心，这些小改变坚持下来，身体会慢慢好起来的——咱们一起努力，您看行不行？"
  },
  {
    "id": 1564,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者18天前抗原阳性，发热3天，咳嗽、肌痛1周缓解，但第10天起出现进行性双下肢无力、上楼费力、持筷掉筷子，伴吞咽干食呛咳及间断复视。既往：2型糖尿病6年（HbA1c 7.8%）、高血压3级（最高190/110 mmHg）、痛风史。无其他免疫病史。查体：T 36.7 ℃，BP 158/96 mmHg，HR 92次/分，SpO₂ 97%（RA）。神清，双眼水平复视，双侧上睑轻下垂（眼裂由8 mm→5 mm），疲劳试验(+)。双上肢肌力4⁺/5，双下肢近端3/5、远端4/5，腱反射普遍消失，病理征未引出。感觉检查正常。实验室：空腹血糖11.2 mmol/L，肌酐102 μmol/L（eGFR 72 mL/min），ALT 38 U/L；新冠抗体IgG(+)，IgM(-)；抗AChR抗体（放免法）6.8 nmol/L（↑），抗MuSK(-)。颈椎MRI平扫未见脊髓病变。神经传导：双侧正中、尺、腓总神经CMAP波幅降低20–30%，重复电刺激3 Hz衰减14%。患者诉昨日出现呼吸“像被勒住”，屏气只能维持12秒。今日由家属轮椅推送复诊，室外气温34 ℃，他额头仍贴有退热贴，称“怕热、出汗少”。",
    "reference_rule": {
      "condition": "明确新冠病毒感染后吉兰-巴雷综合征/脑炎/重症肌无力",
      "action": "1. 急性期：大剂量激素冲击±免疫球蛋白冲击；2. 稳定期：口服激素渐减量±免疫抑制剂",
      "contraindication": null,
      "evidence": "若明确是新冠病毒感染后导致的吉兰-巴雷综合征、脑炎和重症肌无力等自身免疫性疾病，可根据《中国吉兰-巴雷综合征诊治指南 2019》、《中国自身免疫性脑炎诊治专家共识（2022 年版）》、《中国重症肌无力诊断和治疗指南（2020 版）》治疗，急性期可选用大剂量激素冲击或（和）免疫球蛋白冲击，稳定期改口服激素，并逐渐减量，部分患者可能需要长期口服小剂量激素维持，必要时加用免疫抑制剂治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保安全（安全 > 疗效）。需综合评估患者的重症肌无力症状、新冠感染史及基础疾病（糖尿病、高血压、痛风），避免治疗引发新并发症。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：患者新冠感染后18天出现进行性肌无力（双下肢近端肌力3/5、双上肢4⁺/5）、复视、眼睑下垂及疲劳试验阳性，伴吞咽呛咳和呼吸窘迫（屏气12秒），抗AChR抗体升高（6.8 nmol/L）和神经传导异常（CMAP波幅降低、重复电刺激衰减）支持重症肌无力（MG）诊断。隐式线索包括：呼吸症状提示肌无力危象风险（潜在呼吸衰竭）；出汗少和怕热暗示自主神经功能障碍；高温环境（34°C）和退热贴可能加重体温调节失衡；基础疾病（糖尿病HbA1c 7.8%、高血压BP 158/96 mmHg、痛风史）需警惕治疗副作用，如激素升高血糖或诱发痛风发作。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition明确为新冠病毒感染后重症肌无力，Action推荐急性期大剂量激素冲击±免疫球蛋白冲击。无绝对禁忌，但强制安全检查：激素可能加重糖尿病（空腹血糖11.2 mmol/L）、高血压（BP 158/96 mmHg）或诱发痛风；免疫球蛋白在肾功能轻度下降（eGFR 72 mL/min）下相对安全，但需监测过敏风险；共病优先级：呼吸窘迫为危急症状，需优先处理以避免呼吸衰竭。\n\nStep 4: 决策生成 (Decision Making) - 基于指南Action和安全性优先级，选择免疫球蛋白冲击（IVIG）作为一线治疗（减少激素对糖尿病/高血压的恶化风险），辅以呼吸支持监测。同时，优化基础疾病管理，避免药物相互作用。",
    "medical_order": "1. 诊断：新冠病毒感染后重症肌无力（MG）。2. 急性期治疗：静脉输注免疫球蛋白（IVIG）0.4 g/kg/天 × 5天；备选方案：甲泼尼龙冲击治疗1000 mg/天 × 5天（若IVIG不可用，需严密监测血糖及血压）。3. 合并症管理：胰岛素控制空腹血糖至4.4–7.0 mmol/L；氨氯地平5 mg口服每日一次优化血压（目标<140/90 mmHg）；别嘌醇100 mg口服每日一次预防痛风发作。4. 监测与支持：一级护理，持续SpO₂及呼吸频率监测；屏气试验每日评估；肌力及眼征每8小时记录；血糖每日四次测量（餐前及睡前）；肾功能及电解质每日检查。5. 禁忌：避免使用氨基糖苷类抗生素及β-受体阻滞剂（加重肌无力）。6. 入院：收入神经内科监护病房。",
    "patient_dialogue": "张先生，我看了您的检查结果，情况需要重视。您的肌肉无力问题，特别是呼吸时感觉像被勒住，这很危险，可能与之前的新冠感染有关。我们必须立刻处理，防止它变得更严重。我建议您住院，我们会用一种叫做免疫球蛋白的药水通过输液给您，它能帮助您的身体修复肌肉力量，比其他药物更安全，因为您还有糖尿病和高血压，我们不想让这些变糟。住院期间，我们会一直看着您的呼吸和体力，每天检查几次血糖和血压。天气热，您出汗少，我们会帮您调节好室温，别担心，我们一起努力让您早点好起来。"
  },
  {
    "id": 1533,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者78岁，退休邮递员，因‘阳后3月仍明显乏力、活动后气促’今日由女儿陪同来社区门诊复诊。急性期曾住院9天，当时需高流量氧疗，出院记录记载入院首日即出现发热、干咳、味觉丧失、腹泻、全身酸痛、胸闷、心悸共7种症状。既往有2型糖尿病15年、高血压20年、冠心病PCI术后8年，长期服二甲双胍+格列美脲、氨氯地平、瑞舒伐他汀。今日测血压146/88 mmHg，SpO₂ 94%（室温空气），随机血糖11.2 mmol/L，体重较出院时反增3 kg。患者自诉每日步行不足500米即需停下休息，夜间无阵发性呼吸困难，但食欲差，常觉口干。女儿补充：父亲记忆力下降，常忘记是否吃过药。今日复查血常规、肝肾功能、NT-proBNP、D-二聚体已抽血待报。患者另抱怨最近一周左膝疼痛，怀疑是天气潮湿所致，与新冠无关。",
    "reference_rule": {
      "condition": "高龄、肥胖、合并基础疾病、急性期病情严重、感染初期出现5种以上临床症状",
      "action": "1. 加强随访；2. 早期抗新冠病毒治疗（如发病5天内使用奈玛特韦）",
      "contraindication": null,
      "evidence": "推荐意见 4：长新冠综合征的高危因素包括高龄、肥胖、合并基础疾病、急性期病情严重和感染初期较多临床症状（C4），对此类患者建议随访和早期抗新冠病毒治疗以减少长新冠综合征的发生（B3a）。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于分级诊疗与随访场景，作为社区医疗'守门人'，需评估患者是否符合社区管理标准或需转诊至上级医院。重点关注活动耐量下降、氧合状态及潜在心衰/血栓风险是否超出社区处理能力。",
      "Step 2: 临床解码": {
        "心肺功能": "SpO₂ 94%（未吸氧）提示低氧血症；活动后气促+体重增3 kg需警惕心衰恶化（NT-proBNP待报关键）",
        "代谢紊乱": "随机血糖11.2 mmol/L示糖尿病失控；口干多饮需排查高渗状态",
        "高危因素": "符合指南C4标准（高龄+3种基础病+急性期7症状+高流量氧疗史）",
        "隐式风险": "①记忆力下降致用药依从性差（二甲双胍漏服/重复风险）②D-二聚体待报需排除肺栓塞③膝关节疼痛需鉴别痛风（糖尿病+他汀）"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "完全符合'长新冠高危因素'（B3a级推荐），但奈玛特韦已超5天窗口期不适用",
        "禁忌核查": "无绝对禁忌，但需预警：①他汀+格列美脲增加肌溶解/低血糖风险②氨氯地平可能加重下肢水肿（膝痛主诉）"
      },
      "Step 4: 决策生成": {
        "守门人逻辑": "当前无紧急转诊指征（SpO₂>90%，无胸痛/咯血），但需：①待NT-proBNP/D-二聚体结果决定是否转诊②强化社区随访频次③优化慢病用药"
      }
    },
    "medical_order": "1. 急查血常规+肝肾功能+NT-proBNP+D-二聚体（2小时内追踪结果）\n2. 调整降糖方案：停格列美脲，改达格列净 10mg qd（心肾保护+减重）\n3. 优化血压控制：氨氯地平增量至 10mg qd，监测立位血压\n4. 完善检查：即刻床旁心电图，预约心超（3日内）\n5. 随访计划：NT-proBNP>450 pg/mL或D-二聚体>0.5 μg/mL立即转急诊；余者48小时复诊",
    "patient_dialogue": "王大爷，您这三个月恢复得确实不太理想，咱们分三步走：\n\n第一，您说走几步就喘得厉害，加上脚有点肿（轻拍患者小腿），这个要重点查心脏功能。刚抽的血结果两小时出来，如果有个叫'NT-proBNP'的指标太高，咱得马上去大医院——这就像汽车发动机报警，耽误不得。\n\n第二，您血糖血压今天都偏高。我把那个可能引起低血糖的药（格列美脲）停了，换的新药还能帮您减轻点体重。降压药给您加了一片，记得每天早晨量血压，超过160要给我打电话。\n\n第三，您闺女说您有时忘记吃药，这特别重要！我给您个分装药盒（演示），每周天让闺女帮您摆好七格。膝盖疼先别贴膏药，万一是糖尿病引起的痛风，贴了反而坏事。\n\n这两天您注意：①每天同一时间称体重（涨2斤以上立刻找我）②散步改成屋里慢慢走③做菜盐减半，咸鱼酱菜千万别碰。咱们后天再见，检查结果出来我第一时间跟您闺女说清楚。"
  },
  {
    "id": 1556,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "38岁女性，既往无慢性病，2022年11月首次感染SARS-CoV-2后持续乏力、脑雾及活动后心悸，已接种3剂mRNA疫苗。今日复诊：仍诉爬三层楼即气促，夜间低热37.6℃，近2个月出现对称性手指第二指间关节晨僵>30 min，无皮疹、脱发。查体：BP 118/72 mmHg，HR 88次/分，SpO₂ 96%（RA），双手PIP2-4轻度压痛，无肿胀。实验室：Hb 112 g/L，CRP 6.8 mg/L，ESR 34 mm/h；甲状腺功能、肌钙蛋白I、NT-proBNP、补体C3/C4正常；肺CT示双下肺少许条索影；心脏MRI未见延迟强化。自身抗体：ANA 1:320（颗粒型），Ro-52(+)，U1-RNP(+)，RF 28 IU/mL，抗CCP(-)。目前未满足任何结缔组织病分类标准，亦无口干、眼干或雷诺现象。患者为夜班插画师，担心‘抗体阳性是不是要得大病’，并提及最近因赶稿连续熬夜，伴眼干异物感（但Schirmer试验15 mm/5 min）。请结合长新冠共识评估下一步处理。",
    "reference_rule": {
      "condition": "自身抗体阳性但未确诊自身免疫病",
      "action": "动态监测抗体水平",
      "contraindication": null,
      "evidence": "推荐意见 14：主要通过 NSAIDs 和激素治疗关节炎相关症状；自身抗体阳性患者建议动态监测抗体；已确诊为自身免疫性疾病患者进行专科治疗（B3b）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，涉及长新冠（Long COVID）与自身抗体阳性但未确诊自身免疫病的交互。作为专科专家，我的关注重点是全网扫描潜在风险，包括药物相互作用（如NSAIDs与贫血）、禁忌症（如激素在感染风险中的使用）及共病（长新冠与关节症状的叠加），优先级为安全（避免治疗加重症状）>疗效（缓解症状）。Step 2: 临床解码 (Clinical Decoding): 关键信息：患者为38岁女性，核心问题为SARS-CoV-2感染后长新冠（乏力、脑雾、活动后心悸、气促、低热）叠加新发对称性指间关节晨僵（PIP2-4轻度压痛），实验室提示轻度炎症（CRP 6.8 mg/L、ESR 34 mm/h）和贫血（Hb 112 g/L），自身抗体阳性（ANA 1:320颗粒型、Ro-52+、U1-RNP+、RF 28 IU/mL）但未达结缔组织病诊断标准（无口干、雷诺现象）。隐式线索：职业相关不良习惯（夜班工作、连续熬夜）可能加剧疲劳和眼干（Schirmer试验正常，但主诉异物感）；心理焦虑（‘抗体阳性是不是要得大病’）可能影响依从性；肺CT条索影提示潜在COVID后肺纤维化风险。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南condition（自身抗体阳性但未确诊自身免疫病）与患者状态匹配。Action为动态监测抗体水平。Contraindication无。安全扫描：若采用evidence中提到的NSAIDs治疗关节症状，需避免胃肠出血风险（患者Hb低）；激素暂不适用（无明确炎症证据）；长新冠管理需注意运动耐受性（气促）；熬夜是可控风险因子。Step 4: 决策生成 (Decision Making): 基于指南action，核心决策为动态监测抗体水平（3个月后复查），同时依据evidence补充NSAIDs缓解关节症状（安全优先选择低风险药物），并整合长新冠康复和生活干预。",
    "medical_order": "1. 动态监测自身抗体：3个月后复查ANA、Ro-52、U1-RNP、RF及ESR、CRP。2. 予非甾体抗炎药（布洛芬 400mg tid 口服，餐后）缓解关节压痛；监测Hb及胃肠不适。3. 长新冠管理：建议康复医学科会诊，制定渐进性运动计划；监测SpO₂及症状变化。4. 生活干预：避免熬夜，保证每日7-8小时睡眠；调整工作安排。5. 随访：1个月后复诊评估关节症状、乏力及低热；如抗体水平变化或症状加重，转风湿免疫科。",
    "patient_dialogue": "您先别太担心——抗体阳性不一定就是大病，很多人有类似情况但不会发展成严重疾病。我们计划过几个月再查一次这些抗体，看看有没有变化，这样能早点发现问题。您手指关节的僵硬和压痛，我会开一种消炎药（叫布洛芬），饭后吃能减轻不适，帮助您日常活动更轻松。另外，您提到的疲劳、气促和低热，可能是新冠后的长期影响，我建议您试试轻度锻炼，比如散步，慢慢增加活动量，这对恢复体力很有帮助。还有，熬夜画画确实会加重这些症状——尽量保证充足睡眠，调整下工作时间，身体休息好了，恢复才更快。咱们下个月再见面聊聊进展，我会全程帮您盯着的，别太焦虑！"
  },
  {
    "id": 1545,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者3个月前确诊SARS-CoV-2（Delta株）轻症，急性期症状缓解后仍持续乏力、脑雾、活动后气促，符合WHO长新冠诊断。今日复诊：体重78 kg，腰围102 cm，血压128/82 mmHg，静息心率92次/分。实验室：空腹血糖6.3 mmol/L、HbA1c 5.9%，HOMA-IR 3.7；hs-CRP 6.8 mg/L，IL-6 18 pg/mL；25-OH-D 18 ng/mL。肝肾功能正常，eGFR 102 mL/min。睡眠监测提示轻度OSA（AHI 9次/h）。患者自诉‘记忆力像被抽走’，无法完成既往擅长的财务报表，步行500米即需停下休息。既往史：多囊卵巢综合征、妊娠期糖尿病史。家族史：父亲2型糖尿病、母亲肥胖。目前未用任何处方药，仅自行服用复合维生素。今日门诊外下起了今冬第一场雪，患者抱怨‘天气一冷，关节也酸，更不想动’。",
    "reference_rule": {
      "condition": "超重/肥胖的长新冠综合征患者",
      "action": "二甲双胍治疗（降低41%长新冠风险）",
      "contraindication": null,
      "evidence": "推荐意见 13：二甲双胍可能降低超重及肥胖患者长新冠综合征的发生风险（A1b）。对于乏力、食欲减退、恶心、腹泻、体质量减轻、低血压及低钠血症的患者，应考虑肾上腺皮质功能减退症的可能，使用糖皮质激素治疗（D5）。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于复杂合并症治疗场景。作为专科专家，我的关注重点是进行‘全网扫描’，全面检查药物相互作用、禁忌症及共病风险，优先确保患者安全（安全 > 疗效）。患者涉及长新冠综合征叠加肥胖、胰岛素抵抗、炎症、维生素D缺乏、轻度OSA及既往PCOS和GDM史，需整合管理以避免潜在冲突。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例提取关键信息：患者为腹型肥胖（腰围102 cm，超阈值），胰岛素抵抗显著（HOMA-IR 3.7，空腹血糖6.3 mmol/L提示空腹血糖受损），慢性炎症状态（hs-CRP 6.8 mg/L、IL-6 18 pg/mL升高），维生素D缺乏（25-OH-D 18 ng/mL），轻度阻塞性睡眠呼吸暂停（OSA，AHI 9次/h），及长新冠症状（乏力、脑雾、活动后气促）。隐式线索包括：天气变化加重关节酸痛和活动意愿下降（可能加剧炎症和久坐行为），自行服用复合维生素但未覆盖维生素D不足（需强化补充），以及家族糖尿病和肥胖史增加代谢风险（需预防性干预）。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南条件‘超重/肥胖的长新冠综合征患者’完美匹配（患者腹型肥胖且符合WHO长新冠诊断）。行动建议为‘二甲双胍治疗’，禁忌症为null；强制安全检查：二甲双胍无绝对禁忌（肾功能正常，eGFR 102 mL/min；肝功能正常；无严重感染或心衰证据）。但需警惕潜在相对风险：维生素D缺乏可能影响骨代谢（二甲双胍罕见骨密度影响），OSA和炎症需并行管理以防恶化。指南额外提及肾上腺皮质功能减退症，但患者无低血压、低钠血症或体重减轻（血压128/82 mmHg正常，无相关症状），故无需优先考虑糖皮质激素治疗。\n\n**Step 4: 决策生成 (Decision Making)**\n基于指南action，核心决策为启动二甲双胍治疗（降低长新冠风险41%）。安全优先下，需整合共病管理：补充维生素D以改善免疫和骨健康，强化生活方式干预对抗肥胖和胰岛素抵抗，并转诊OSA以减少疲劳诱因。决策链：二甲双胍为首选药物（安全有效），辅以非药物措施确保整体疗效。",
    "medical_order": "1. 启动二甲双胍500mg bid口服；2. 补充维生素D胆钙化醇50,000 IU 每周；3. 建议低卡路里饮食（每日热量控制在1800 kcal）和适度过氧运动（如每日步行30分钟，分次进行）；4. 转诊睡眠科评估OSA，考虑CPAP治疗；5. 监测空腹血糖、HbA1c及肝肾功能每月；6. 随访hs-CRP和IL-6以评估炎症状态。",
    "patient_dialogue": "您好！看到您今天冒雪来复诊，真是辛苦了。天气冷了，关节酸、不想动，这很常见，尤其像您这样还在恢复期的朋友。结合您的症状——像记忆力下降、走路一会儿就喘——我们得一起制定个计划。首先，我建议您开始一种叫二甲双胍的药，它原本用于糖尿病，但研究显示能帮超重人群减轻长新冠的疲劳和脑雾，像‘抽走记忆’的感觉。每天早晚各一片，安全可靠，我会帮您监测身体反应。另外，您血液里的维生素D太低，这会让您更累、容易感冒，所以每周补一次高剂量的维生素D丸，就跟您平时吃的复合维生素一起，但更针对性地提升免疫力。体重和腰围超了点，咱们慢慢来：饮食上，少油少糖，多吃蔬菜瘦肉；运动呢，别强求户外，天冷可以在家走走或做点轻瑜伽，每天累计半小时就行，分几次完成。还有，您睡觉时打鼾的问题，我建议去睡眠科看看，用个小设备改善呼吸，这样白天精神会好些。这些都是小步骤，但坚持下来，记忆力、体力都会好转。别担心，咱们一步步来，我会定期跟进您的进展！"
  },
  {
    "id": 1544,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者42岁女性，4个月前感染SARS-CoV-2后持续乏力、食欲减退、恶心伴间断腹泻，近6周体重下降5.2 kg。今日复诊时自述站立5分钟即感头晕，晨起血压88/56 mmHg，随机血钠128 mmol/L（本院参考135–145）。既往史：2型糖尿病8年（HbA1c 7.1%）、桥本甲状腺炎（TSH 4.8 mIU/L，优甲乐50 μg/d）。否认结核及慢性肝病。职业：夜班网约车司机。查体：皮肤皱褶处色素沉着（腋下、掌纹），体位性低血压阳性。实验室补充：晨8点血清皮质醇3.2 μg/dL（参考5–25），ACTH 18 pg/mL（参考7–63），Na 128 mmol/L，K 5.1 mmol/L，空腹血糖6.9 mmol/L，肌酐72 μmol/L，eGFR 89 mL/min。患者询问为何一直补盐仍感虚弱。",
    "reference_rule": {
      "condition": "乏力、食欲减退、恶心、腹泻、体质量减轻、低血压及低钠血症",
      "action": "考虑肾上腺皮质功能减退症，使用糖皮质激素治疗",
      "contraindication": null,
      "evidence": "推荐意见 13：二甲双胍可能降低超重及肥胖患者长新冠综合征的发生风险（A1b）。对于乏力、食欲减退、恶心、腹泻、体质量减轻、低血压及低钠血症的患者，应考虑肾上腺皮质功能减退症的可能，使用糖皮质激素治疗（D5）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，涉及COVID-19后遗症、2型糖尿病、桥本甲状腺炎等多重疾病交互。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全（安全 > 疗效），避免因合并症引发不良反应。\n\nStep 2: 临床解码 (Clinical Decoding): 从病例中提取关键信息并转化为医学术语——患者症状包括乏力、食欲减退、恶心、腹泻、体质量减轻5.2 kg（提示慢性消耗），体征有体位性低血压阳性（立位头晕，血压88/56 mmHg）和皮肤皱褶处色素沉着（腋下、掌纹，典型Addison病表现）。实验室显示低血清皮质醇（3.2 μg/dL，低于参考值5-25 μg/dL）、低钠血症（128 mmol/L）、高钾血症（5.1 mmol/L，参考3.5-5.0 mmol/L），支持原发性肾上腺皮质功能减退症；ACTH 18 pg/mL（参考7-63 pg/mL，正常范围）可排除垂体问题；空腹血糖6.9 mmol/L（稍高，与糖尿病相关）。隐式线索：COVID-19感染可能诱发肾上腺功能不全；补盐无效（患者自述）表明盐皮质激素缺乏导致电解质失衡未纠正；夜班职业（网约车司机）可能加剧昼夜节律紊乱和应激，加重症状；既往糖尿病和桥本甲状腺炎（TSH 4.8 mIU/L稍高，提示亚临床甲减）需警惕药物叠加风险。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南condition（乏力、食欲减退、恶心、腹泻、体质量减轻、低血压及低钠血症）与患者表现完全匹配。Action指示考虑肾上腺皮质功能减退症并使用糖皮质激素治疗。指南contraindication为null，但强制检查后确认无绝对禁忌（否认结核、肝病，无急性感染证据）。安全风险扫描：糖皮质激素可能升高血糖（患者糖尿病，HbA1c 7.1%），需监测；优甲乐（50 μg/d）与糖皮质激素无显著相互作用，但TSH升高提示甲状腺功能需优化；钾偏高需防高钾血症危象。优先级确保安全：避免电解质紊乱恶化。\n\nStep 4: 决策生成 (Decision Making): 基于指南action和临床证据，诊断为原发性肾上腺皮质功能减退症，启动糖皮质激素替代治疗（核心方案），同时处理共病风险。具体决策包括使用氢化可的松纠正皮质醇缺乏，补充盐皮质激素和电解质管理，并监测糖尿病及甲状腺功能。",
    "medical_order": "1. 诊断：原发性肾上腺皮质功能减退症（继发于COVID-19感染？）。2. 治疗：予氢化可的松20mg口服（晨间8点10mg，下午4点5mg，睡前5mg）；氟氢可的松0.1mg口服qd。3. 监测：每日血清钠、钾、血糖（空腹及餐后）；每周体重及血压记录；完善ACTH刺激试验确诊。4. 合并症管理：优化糖尿病治疗（监测HbA1c，调整二甲双胍剂量）；评估甲状腺功能（复查TSH、游离T4，调整优甲乐剂量）。5. 护理：一级护理，限制夜班工作，建议规律作息。",
    "patient_dialogue": "您好，我理解您一直感觉虚弱，补盐也效果不大，这确实很煎熬。别担心，我们一起找原因——您的检查显示肾上腺（身体里的小‘压力工厂’）功能有点不足了，这会让身体处理盐分和能量的能力下降，所以光补盐没解决问题。我们需要给您开一种激素药来帮它恢复正常，同时监测血糖（因为您有糖尿病），避免它波动。另外，您的工作是夜班司机，太辛苦可能让身体更累，建议暂时调整到白天班，好好休息。坚持治疗几周后，您会慢慢感觉有劲儿的，我们随时跟进您的状况。"
  },
  {
    "id": 1550,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者42岁女性，既往体健，2022年11月首次感染SARS-CoV-2（轻型），康复后持续出现活动后胸闷、心悸伴乏力6月余。近2周症状加重，爬两层楼即需停歇，夜间偶发阵发性呼吸困难。无发热、咳嗽。既往史：妊娠高血压史（2018年，顺产），无DM、无甲亢；无吸烟饮酒。家族史：父亲55岁心梗。查体：BP 118/76 mmHg，HR 96 bpm（窦性），BMI 30.4 kg/m²，颈静脉无怒张，双肺底细湿啰音（+），心界向左扩大，S1低钝，可闻及S3，双踝轻度凹陷性水肿。实验室：NT-proBNP 1 240 pg/mL（↑），hs-cTnI 8 ng/L（轻度↑），HbA1c 5.6%，TSH 1.8 mIU/L，Cr 78 µmol/L，eGFR 78 mL/min/1.73 m²，UACR 22 mg/g。ECG：窦性心律，V4-6导联T波低平。超声心动图：LVEF 46%，左室整体纵向应变减低（-14%），轻度二尖瓣关闭不全，左房容积指数 38 mL/m²；CMR未见延迟强化。24 h-Holter：单发室性早搏 1 876次，无VT。心肺运动试验：Peak VO₂ 21 mL/kg/min（64%预计值），VE/VCO₂斜率 35，运动恢复期收缩压下降10 mmHg。患者今日复诊，主诉仍不能胜任超市收银站立工作，担心“心脏落下病根”。",
    "reference_rule": {
      "condition": "有心血管相关症状的长新冠综合征患者",
      "action": "1. 遵循心血管疾病指南进行诊断和鉴别诊断；2. 明确是否为PASC-CVD（可诊断心血管疾病）或PASC-CVS（无法解释的心血管症状）",
      "contraindication": null,
      "evidence": "推荐意见 3：对于有心血管相关症状的长新冠综合征患者，应考虑常见心血管疾病的诊断和鉴别诊断，其评估应遵循现有指南建议，并应进一步明确是否为 PASC-CVD 或 PASC-CVS（A1a）。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于复杂合并症治疗场景，涉及长新冠综合征（PASC）与心血管症状的整合管理。作为专科专家，我的关注重点是全网扫描潜在风险，包括药物相互作用、禁忌症及共病（如心力衰竭、肥胖和肾功能异常），优先确保安全性（安全 > 疗效）。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例中提取关键信息：患者有长新冠背景（感染后6个月持续症状），心血管症状（活动后胸闷、心悸、夜间呼吸困难）提示心力衰竭（HF）；查体（肺底啰音、S3、心界扩大、水肿）和实验室（NT-proBNP 1240 pg/mL ↑、hs-cTnI 8 ng/L ↑、UACR 22 mg/g ↑）支持HF诊断；影像学（LVEF 46%、左室应变减低）证实收缩功能减低；肥胖（BMI 30.4 kg/m²）、妊娠高血压史和家族心梗史增加心血管风险；eGFR 78 mL/min/1.73 m²轻度降低提示潜在肾病；Holter室性早搏和心肺运动异常（Peak VO₂ 64%预计值）需监测。隐式线索：症状加重和客观证据更倾向PASC-CVD（可诊断心血管疾病），而非PASC-CVS（无法解释症状），需排除缺血性心脏病（家族史和ECG T波低平）。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南Condition为“有心血管相关症状的长新冠综合征患者”，完美吻合患者情况（长新冠背景 + 心血管症状）。Action要求遵循心血管疾病指南进行诊断和鉴别诊断，并明确PASC-CVD或PASC-CVS。Contraindication为null，无直接禁忌，但强制安全检查：全网扫描潜在风险——肥胖、eGFR降低和电解质失衡可能增加药物副作用（如ARNI或β-blockers引起高钾或低血压）；无药物相互作用记录（当前无用药），但未来治疗需避免肾毒性；共病风险包括HF进展或冠心病。优先级：安全第一，治疗需个体化调整剂量。\n\n**Step 4: 决策生成 (Decision Making)**\n基于指南Action：1. 遵循ESC心力衰竭指南进行诊断（确诊为HFrEF，NYHA II-III级），鉴别排除冠心病；2. 明确为PASC-CVD（有客观证据支持心血管疾病）。生成决策：启动心力衰竭指南推荐药物治疗（ARNI优先），建议生活方式干预，安排冠脉评估，设置随访监测安全性。",
    "medical_order": "诊断：心力衰竭（LVEF 46%，NYHA II-III级），与长新冠相关（PASC-CVD）。\n鉴别诊断：排除缺血性心脏病。\n治疗：予ARNI起始（沙库巴曲缬沙坦 49/51 mg bid），监测血压、肾功能、电解质；加用β-blocker（比索洛尔 1.25 mg qd，逐步上调）；如血钾正常，予MRA（螺内酯 12.5 mg qd）。\n生活方式：建议低盐饮食（<2 g/d钠摄入）、减重计划（目标BMI <25 kg/m²）。\n进一步检查：完善冠脉CTA或运动负荷试验评估心肌缺血。\n随访：2周后复查NT-proBNP、eGFR、电解质、血钾；4周后复查超声心动图。",
    "patient_dialogue": "您好，我看了您的检查结果，咱们来谈谈您的身体状况。您之前感染过新冠，现在心脏确实有点‘累’了，这导致您爬楼时胸闷、晚上偶尔喘不上气，这些症状不是小事。别太担心，这不是‘落下病根’，我们完全可以一起想办法改善。我会给您开一些保护心脏的药，它们能帮助心脏轻松点工作，但我们会从小剂量开始，定期抽血检查，确保药物安全，不会伤到肾脏。同时，我建议您平时做饭少放盐，咸菜、酱料这些也尽量少吃，因为盐会让身体积水，加重水肿和气喘。另外，减点体重对心脏特别好——咱们设定个小目标，比如每周散步几次，慢慢来。接下来，我们还需要做个检查看看心脏血管有没有堵塞，这能帮我们更准地治疗。您先按这个计划走，两周后咱们再见面复查，我会全程陪着您，好吗？"
  },
  {
    "id": 1542,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "患者42岁，女性，BMI 22 kg/m²，既往体健。2023年1月第2次新冠核酸阳性，当时为轻症，居家对症处理。痊愈后复工，但自3月起反复出现以下症状：① 持续疲劳——每日下班需躺休≥1小时才能准备晚餐；② 胸痛——位于左侧乳房下缘、钝痛，每次10-15 min，与运动无关；③ 干咳——遇冷空气或讲话超过5 min即诱发；④ 呼吸困难——爬两层楼需停下喘气，主观评分为mMRC 2级；⑤ 失眠——入睡潜伏期>45 min，夜间易醒≥3次；⑥ 双下肢肌痛——VAS 4/10，以小腿为主，休息无缓解；⑦ 认知障碍——‘写完一句就忘下句’，影响写策划案，MoCA自测24分（≤26）。上述症状已持续2.5个月，中间无完全缓解期。曾在外院查：血常规、甲功、肝肾功能、CRP、BNP、D-二聚体、胸CT、心电图及心脏彩超均无异常；肺功能示‘限制性障碍倾向，DLCO 78% pred’。否认既往哮喘、冠心病、焦虑障碍及甲状腺病史。今日复诊，主诉‘已经跑了三家医院，都说检查正常，可我真的没法正常工作’。查体：T 36.4 ℃，SpO₂ 96%（RA），HR 88次/分，双肺听诊清，未及干湿啰音。患者提到最近因赶方案连续熬夜，但强调‘以前熬夜第二天照样爬山’。目前未服用任何处方药物，仅自行口服复合维生素。门诊室外气温32 ℃，患者着长袖外套，自述‘空调房里总觉得冷’。",
    "reference_rule": {
      "condition": "新冠病毒感染12周后仍然存在疲劳、胸痛、咳嗽、呼吸困难、失眠、肌痛和认知障碍等症状，并持续2个月以上，且排除其他疾病",
      "action": "应考虑长新冠综合征",
      "contraindication": null,
      "evidence": "推荐意见 1：对于新冠病毒感染 12 周后仍然存在疲劳、胸痛、咳嗽、呼吸困难、失眠、肌痛和认知障碍等症状，并持续 2 个月以上，且排除其他疾病，应考虑长新冠综合征（B2c）。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（Differential Diagnosis），优先排除任何危急重症（如心肌梗死、肺栓塞或急性感染），并基于现有证据给出直接、高效的诊疗指令，避免不必要的延误。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例中提取关键信息并转化为医学术语：患者42岁女性，既往体健，新冠感染后12周（2023年1月感染，症状自3月起始，持续2.5个月，总病程约4.5个月）出现多系统症状，符合长新冠综合征核心表现——① 疲劳（日常活动受限，需躺休≥1小时）；② 胸痛（左侧乳房下缘钝痛，非心源性）；③ 干咳（由冷空气或语音诱发，提示气道高反应性）；④ 呼吸困难（mMRC 2级，爬两层楼喘气）；⑤ 失眠（入睡潜伏期延长、夜间易醒，符合睡眠障碍）；⑥ 肌痛（双小腿VAS 4/10，休息无缓解）；⑦ 认知障碍（MoCA 24分，提示轻度认知功能障碍）。隐式线索：空调房冷感（可能自主神经功能失调），熬夜可能加重症状（但既往耐受良好，暗示新发易感性），多次就诊无果显示患者焦虑和挫折感。检查已排除心肺、感染、代谢等危急重症（血常规、BNP、D-二聚体等正常），肺功能DLCO 78% pred提示轻度气体交换障碍（符合长新冠肺损伤模式）。鉴别诊断需排除焦虑障碍、纤维肌痛或慢性疲劳综合征，但病史和检查不支持其他病因。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n与参考指南Condition严格对齐：患者症状（疲劳、胸痛、咳嗽、呼吸困难、失眠、肌痛、认知障碍）在新冠感染12周后持续2个月以上，且已通过全面检查排除其他疾病（如心脏病、肺栓塞、甲状腺功能异常）。Contraindication为null，无禁忌或安全风险（无药物相互作用、基础疾病或急性恶化迹象）。安全检查确认：SpO₂ 96%、HR正常、无啰音，排除呼吸衰竭或心衰等危急情况。\n\n**Step 4: 决策生成 (Decision Making)**\n根据指南Action“应考虑长新冠综合征”，生成直接决策：诊断长新冠综合征（Post-COVID-19 condition），并启动多学科管理计划。优先对症支持（非药物治疗为主），避免不必要的用药，安排随访监测症状进展。",
    "medical_order": "诊断：长新冠综合征（Post-COVID-19 condition）。\n处理：\n1. 予健康教育和生活方式干预：避免熬夜，保证规律作息；建议适度有氧运动（如每日步行30分钟）。\n2. 转诊康复科行综合评估：包括心肺功能训练、认知康复及物理治疗（针对肌痛）。\n3. 对症支持：予睡眠卫生教育（固定就寝时间、避免屏幕蓝光）；若干咳持续，考虑环境控制（避免冷空气暴露）。\n4. 随访：2周后门诊复诊，评估症状变化；若呼吸困难加重或出现新症状，完善动态肺功能及血气分析。\n注意事项：暂不予处方药物，监测情绪状态。",
    "patient_dialogue": "您好！我仔细看了您的病历和检查结果，完全理解您这段时间的煎熬——跑了那么多医院，检查都说正常，可身体就是不舒服，连工作都受影响，这确实让人着急又无奈。别担心，根据您的症状，尤其是新冠后出现的疲劳、胸痛、咳嗽这些持续问题，我们初步判断这是'长新冠'，意思是感染后身体恢复慢，有些症状会拖得比较久。它不是大病，但需要慢慢调理。\n\n接下来，咱们一起制定个计划：首先，您得尽量别熬夜了——我知道工作忙，但熬夜会让身体更难恢复，试试每天固定时间睡觉，睡前别玩手机。其次，针对肌肉痛和气喘，我建议您去康复科做个评估，他们会教您一些简单锻炼和放松技巧，比如每天散步半小时。另外，咳嗽的话，少在空调房里待着，出门时戴个口罩保暖。\n\n记住，这不是您的问题，很多人都有类似经历，通过规律生活大多能好转。2周后咱们再见面聊聊进展，如果中间有加重，随时来复诊。您看这样安排行吗？"
  },
  {
    "id": 1560,
    "file_name": "长新冠综合征临床诊治专家共识.json",
    "case_input": "42岁女性，身高162 cm，体重55 kg，既往体健，无吸烟饮酒史。2022年12月首次感染SARS-CoV-2（重型，住院10 d，曾用高流量氧疗）。出院后持续干咳、活动后气促，伴明显乏力、记忆力下降及睡眠障碍。近4个月症状反复，爬两层楼即需停下喘息。今日复诊：\n\n- 生命体征：BP 118/76 mmHg，HR 88次/分，SpO₂ 94%（室内空气）。\n- 查体：双肺底可闻及细湿啰音；杵状指（-）。\n- 实验室：CRP 12 mg/L（↑），空腹皮质醇 6.2 µg/dL（↓，参考8-20），D-二聚体 0.7 mg/L（↑）。\n- 肺功能：DLCO 58% 预计值，FVC 72%，FEV₁/FVC 0.78。\n- HRCT：双肺外周网格影+磨玻璃影，牵拉性支气管扩张，纤维化评分 15%。\n- 6分钟步行试验：380 m，最低SpO₂ 89%，恢复时间>3 min。\n\n合并症：\n1. 甲状腺功能减退（TSH 6.8 mIU/L，FT₄ 正常，已口服左甲状腺素50 µg qd）。\n2. 焦虑状态（GAD-7 14分），夜间入睡困难，常凌晨2点醒后不能再睡。\n\n用药史：\n- 复方甲氧那明（止咳）\n- 左甲状腺素钠\n- 维生素D 800 IU qd\n- 间断对乙酰氨基酚（头痛时）\n\n患者自述：\n“咳嗽倒好点了，但一走路就喘，脑子像蒙着雾，写代码根本集中不了精神。公司催我返岗，可我现在连地铁都挤不动。”\n\n干扰信息：\n患者今日因暴雨迟到，鞋袜全湿，候诊时不慎将随身咖啡洒落，情绪低落，反复道歉。",
    "reference_rule": {
      "condition": "长新冠综合征患者",
      "action": "1. 专科治疗为主，必要时多学科会诊；2. 对症治疗+营养支持；3. 有肺纤维化/低皮质醇时用小剂量糖皮质激素；4. 心理治疗+中医治疗+早期康复治疗",
      "contraindication": null,
      "evidence": "推荐意见 9：长新冠综合征的治疗，以专科治疗为主，必要时多学科会诊；以对症治疗、营养支持等综合治疗为主；有肺纤维化、低皮质醇水平等证据时可采用小剂量糖皮质激素治疗；积极治疗基础疾病，并给予心理治疗、中医治疗，以及早期积极康复治疗（C4）。"
    },
    "thought": "### Step 1: 场景定义 (Scenario Definition)\n本案例属于复杂合并症治疗场景。作为博学的专科专家，我将全网扫描关键信息：重点关注药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。患者存在长新冠综合征伴肺纤维化、肾上腺功能低下（低皮质醇）、亚临床甲状腺功能减退和焦虑状态等多种合并症，需避免治疗冲突并优化整体管理。\n\n### Step 2: 临床解码 (Clinical Decoding)\n- **核心问题**：患者符合长新冠综合征（COVID-19后持续>3个月症状），关键特征包括：① 呼吸系统：肺功能DLCO 58%↓（弥散障碍）、FVC 72%↓（限制性通气功能障碍）及HRCT显示肺纤维化（评分15%），活动后气促和6分钟步行试验SpO₂降至89%提示功能受限；② 内分泌：空腹皮质醇6.2 µg/dL↓（提示HPA轴抑制，可能加重乏力），TSH 6.8 mIU/L↑（亚临床甲减，左甲状腺素剂量不足）；③ 神经心理：GAD-7 14分（中度焦虑）、睡眠障碍和认知雾（‘脑子像蒙着雾’）；④ 炎症/凝血：CRP↑和D-二聚体↑提示持续炎症及血栓风险。\n- **隐式线索**：患者情绪低落（候诊时反复道歉）可能加剧焦虑，干扰治疗依从性；复方甲氧那明（含茶碱）可能与焦虑或新药物相互作用；体重55 kg（BMI正常）但乏力明显，需营养支持；干扰信息（暴雨迟到）不影响医疗决策，但提示需心理安抚。\n- **药物史分析**：左甲状腺素50 µg qd不足（TSH仍高），复方甲氧那明可考虑停用（咳嗽好转且可能加重焦虑），维生素D和对乙酰氨基酚无冲突。\n\n### Step 3: 规则对齐与安全检查 (Alignment & Safety)\n- **指南对齐**：患者符合指南Condition‘长新冠综合征’，Action匹配：① 专科治疗为主（需多学科会诊）；② 对症+营养支持；③ 有肺纤维化/低皮质醇证据，适用小剂量糖皮质激素；④ 心理+中医+康复治疗。Contraindication为null，无绝对禁忌。\n- **安全检查**：全网扫描风险：① 药物相互作用—糖皮质激素可能升高血糖或血压，但患者无糖尿病/高血压史，BP正常；与左甲状腺素无冲突，但需监测皮质醇；复方甲氧那明含中枢兴奋成分，停用可降低焦虑风险。② 禁忌症—糖皮质激素在活动感染中慎用，但患者无急性感染征象（CRP轻度↑，无发热）；低皮质醇是适应症，非禁忌。③ 共病风险—肺纤维化进展需防急性加重；焦虑可能影响康复依从性；低皮质醇和甲减需优先优化以防恶化。安全优先级确保：糖皮质激素小剂量起始，避免长期副作用；甲状腺治疗调整防甲亢。\n\n### Step 4: 决策生成 (Decision Making)\n基于指南Action生成决策：① 启动小剂量糖皮质激素（针对肺纤维化和低皮质醇）；② 优化甲状腺治疗；③ 对症支持（停不必要药物、营养）；④ 多学科会诊（呼吸、内分泌、心理）；⑤ 心理和康复干预。重点安全措施：糖皮质激素低剂量、密切监测；心理支持提升依从性。",
    "medical_order": "诊断：长新冠综合征（肺纤维化、肾上腺功能低下）；亚临床甲状腺功能减退；焦虑状态。\n\n治疗：\n1. 启动小剂量糖皮质激素：泼尼松 5 mg qd po，疗程4周，监测空腹血糖、血压、皮质醇水平及症状变化。\n2. 调整甲状腺治疗：左甲状腺素增至 75 µg qd po，4周后复查TSH、FT4。\n3. 对症支持：停用复方甲氧那明（咳嗽已缓解）；继续维生素D 800 IU qd po；评估营养状况，予均衡饮食建议。\n4. 多学科会诊：安排呼吸科、内分泌科及心理科会诊，评估肺纤维化进展、HPA轴功能及焦虑管理。\n5. 康复干预：转诊康复科，制定个体化肺康复计划，包括低强度有氧训练及呼吸锻炼。\n6. 随访：4周后复诊，复查肺功能（DLCO、FVC）、6分钟步行试验、皮质醇、TSH及CRP；若有SpO₂<90%或气促加重，立即就诊。",
    "patient_dialogue": "李女士，别担心，咱们一步步来。您的情况我清楚了——这是新冠后身体还没完全恢复，特别是肺部和一些激素水平出了问题，导致您走路喘气、脑子发雾和睡不好觉。这些都很常见，不是您一个人的问题，我们一定能找到办法改善。\n\n首先，为了帮您的肺修复和平衡激素，我建议加一种小剂量的药（泼尼松），每天一片，量很小，安全。我会盯着副作用，比如偶尔体重变化，但风险很低。您现在的甲状腺药也需要稍微加点量，这样能让精力好些。另外，既然咳嗽好多了，咱们就把那个止咳药停掉，免得影响睡眠。\n\n还有，您提到写代码集中不了精神，晚上总醒——这跟焦虑有关，我完全理解。公司催着上班，压力大，但身体要紧。我建议您找心理科同事聊聊，他们专业处理这种问题，可能会教些放松技巧或开点温和的药。同时，康复科会帮您设计些简单练习，比如在家走走楼梯或深呼吸，慢慢增强体力，这样挤地铁就不会那么累。\n\n您今天淋了雨，情绪低落，我很心疼。记住，这不是您的错，咱不急，先养好身体。回去后多吃点蛋白质和蔬菜，维生素D继续吃。4周后咱们再见面，看看效果。如果有啥不舒服，随时打我电话。我们一起努力，好吗？"
  }
]