[
  {
    "id": 1775,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者今日由丈夫陪同来门诊领取抗结核四联药物。护士在发药窗口核对信息时，患者小声询问：“我丈夫要不要也查一下那个‘免疫力’的病？听说我们村去年一下查出十几个。”丈夫插话：“我去年在工地体检抽过血，没事，现在就是有点咳嗽，可能抽烟抽的。”患者补充：“家里还有 76 岁的婆婆，晚上帮我们带孩子，最近总说没力气。”室外 34 ℃，候诊区空调故障，患者额角可见细汗。门诊病历显示患者 HIV 初筛结果尚未回报，医生已开具 GeneXpert 检测，但尚未记录家属任何检测信息。",
    "reference_rule": {
      "condition": "在HIV高负担地区，所有结核病患者家庭成员及其他密切接触者",
      "action": "提供HIV检测",
      "contraindication": null,
      "evidence": "在HIV高负担地区，应该对所有结核病患者家庭成员及其他密切接触者提供HIV检测（强烈推荐，证据信度非常低）。"
    },
    "thought": "本案例属于行政与伦理场景，作为规范的**管理者**，我的关注重点在于流程合规性、文书完整性、伦理告知及公共卫生责任。Step 1: 场景定义：患者就诊涉及药物领取和家属健康咨询，核心问题是HIV检测的行政执行与伦理告知，需确保指南合规和公共卫生责任落实。Step 2: 临床解码：从病例中提取关键信息——患者为结核病（TB）患者，领取抗结核四联药物；家属包括丈夫（自述咳嗽，去年体检正常但未指定检测项目）和76岁婆婆（同住，近期乏力），均属密切接触者；隐式线索如‘村里查出十几个’（提示HIV高负担地区）、环境因素（高温出汗）无关核心；患者HIV初筛未回报，GeneXpert检测已开，但家属检测信息缺失。Step 3: 规则对齐与安全检查：指南Condition‘在HIV高负担地区，所有结核病患者家庭成员及其他密切接触者’匹配（基于村庄HIV高负担推断），Action为‘提供HIV检测’，Contraindication为null（无禁忌）；安全检查确认无直接健康风险，但需强调伦理告知（如自愿原则）以避免歧视。Step 4: 决策生成：基于Action，决策是为丈夫及婆婆提供HIV检测咨询与安排，确保文书记录完整。",
    "medical_order": "1. 为患者丈夫及同住婆婆提供HIV检测咨询及预约检测服务。2. 完善家属密切接触者信息记录于门诊病历。3. 随访患者HIV初筛及GeneXpert检测结果，并评估家属暴露风险。",
    "patient_dialogue": "医生：大姐，您刚才提到您丈夫和婆婆的情况，咱们得好好聊聊。您丈夫说去年体检过，但咳嗽不能大意，尤其家里有结核病，容易互相传染；婆婆年纪大了，总没力气也可能和这有关。我建议他们都做个HIV检测——就是您说的‘免疫力’病检测。村里查出不少，早点查能预防问题，保护全家健康。检测是免费的，我们会帮您安排，您们商量好随时来就行。别担心，这只是个常规检查，咱们一起把家里人照顾周全！"
  },
  {
    "id": 1753,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者34岁女性，确诊HIV感染4年，目前服TDF/3TC/DTG，病毒载量<50copies/mL，CD4 260/μL。今日按时到门诊取药，候诊时轻声告诉护士：“这两周总觉得累，下午低烧37.5-37.8℃，晚上睡觉时胸口出汗，睡衣都湿。”护士注意到她戴着双层口罩，偶尔轻咳无痰。体重自报较3月前下降2kg。候诊区开着空调，她仍觉得冷，抱臂缩肩。无胸痛、无咯血、无呼吸困难。既往无结核病史，但2年前PPD皮试硬结12mm，未接受预防性治疗。今日天气闷热，门诊外暴雨，她鞋边沾满泥水。",
    "reference_rule": {
      "condition": "PLHIV人群每次到访医疗机构",
      "action": "筛查结核病",
      "contraindication": null,
      "evidence": "PLHIV人群每次到访医疗机构都应该筛查结核病（强烈推荐，证据信度非常低）。"
    },
    "thought": "本案例属于常规诊断与治疗场景，作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如结核病进展），并给出直接指令。首先，临床解码：患者为34岁女性PLHIV，ART治疗稳定（病毒载量<50 copies/mL），但CD4 260/μL提示免疫功能低下；症状包括疲劳、午后低热（37.5-37.8℃）、夜间盗汗、体重下降2kg、轻咳无痰，以及主观寒战（尽管环境温暖），结合2年前PPD皮试阳性（硬结12mm）且未预防治疗，高度怀疑活动性结核病；无胸痛/咯血/呼吸困难，初步排除急危呼吸衰竭。隐式线索如戴双层口罩和体重下降，强化感染风险。规则对齐：指南要求PLHIV每次到访必须筛查结核病（强烈推荐），无禁忌症（contraindication null），需优先执行以确保安全。决策生成：立即启动结核病筛查程序，排除结核病为首要任务，防止遗漏危急重症。",
    "medical_order": "完善结核病筛查：胸部X光、痰涂片及抗酸染色、痰培养、GeneXpert MTB/RIF检测。监测生命体征（体温、脉搏、呼吸）。继续当前ART方案（TDF/3TC/DTG）。实施呼吸道隔离预防。记录体重变化趋势。",
    "patient_dialogue": "您好，我听您说最近两周总感觉累、下午有点低烧，晚上还出很多汗把睡衣弄湿了，这加上体重下降和偶尔咳嗽，确实让人担心。尤其是您有HIV病史，免疫力较低，这些症状可能和结核感染有关——结核如果不查清，会慢慢加重影响身体。我们现在需要做些检查，比如拍个胸片和留点痰样，来确认有没有问题。放心，这些都是常规操作，很快就能做完。我会让护士帮您准备，好吗？咱们一起确保您安全健康。"
  },
  {
    "id": 1763,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "夜班查房，17岁女性患者蜷缩在靠窗的床位，夜间仍低热37.8℃。她13岁确诊HIV，CD4 46/μL，近两周干咳加重、盗汗明显。护士记录：昨日最高心率118次/分，SpO₂ 94%（室内空气），听诊右上肺偶闻细湿啰音。无咯血、无胸痛。患者母亲陪床，小声说女儿“总嫌累，走几步就喘”。病历提示：患者来自WHO通报结核病发病率≥10%的省份，本次因机会性感染收治于成人感染科病房。窗外正下细雨，母亲担心女儿出院后回村被邻居排斥，反复询问“这次能不能彻底查清楚肺里到底怎么了”。",
    "reference_rule": {
      "condition": "在结核病报告发病率≥10%的地区，对于在病房中住院的成年和未成年AIDS患者",
      "action": "采用一种WHO推荐的分子快速检测技术开展系统的结核病筛查",
      "contraindication": null,
      "evidence": "在结核病报告发病率≥10%的地区，对于在病房中住院的成年和未成年AIDS患者，应采用一种WHO推荐的分子快速检测技术开展系统的结核病筛查（强烈推荐，证据信度中等）。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于常规诊断与治疗场景，重点关注快速建立鉴别诊断（Differential Diagnosis），优先排除危急重症（如活动性结核病、肺孢子菌肺炎等），并给出直接、高效的诊疗指令。思维重点在于基于现有症状和体征，快速识别高风险疾病，避免延误治疗。\n\n**Step 2: 临床解码 (Clinical Decoding)**：从患者病例中提取关键信息并转化为医学术语：1. **免疫抑制状态**：HIV感染（确诊于13岁），CD4计数极低（46/μL），提示严重免疫缺陷，易发机会性感染；2. **呼吸道症状**：干咳加重、盗汗、低热（37.8℃）、右上肺细湿啰音，结合SpO₂ 94%（轻度低氧血症）和心率118次/分（轻度心动过速），高度怀疑肺部感染，如结核病或肺孢子菌肺炎；3. **功能状态**：疲劳和活动后气促（“走几步就喘”），表明呼吸功能受损；4. **流行病学背景**：来自结核病高发地区（发病率≥10%），增加结核暴露风险；5. **社会心理因素**：母亲提及社会排斥担忧，但这不影响核心医疗决策。隐式线索包括：低CD4计数和症状持续两周，提示感染可能进展；无咯血或胸痛，可初步排除大咯血等急症。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南Condition（结核病报告发病率≥10%的地区，病房住院AIDS患者）与病例完全匹配（患者来自高发省份，因机会性感染住院）。Action要求使用WHO推荐分子快速检测技术进行结核病筛查。强制检查Contraindication：指南中为null，无禁忌症（如无药物过敏或技术不可用）。证据支持强烈推荐，确保决策安全。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南Action，立即进行结核病分子快速检测筛查（如Xpert MTB/RIF），以快速确诊或排除活动性结核病。同时，鉴于免疫抑制状态，需并行排除其他机会性感染（如肺孢子菌肺炎），但结核筛查为首要直接指令，以优先处理高危风险。",
    "medical_order": "予一级护理，监测生命体征（体温、心率、SpO₂、呼吸频率）。完善痰标本采集，行WHO推荐分子快速检测（如Xpert MTB/RIF）筛查结核病。同时，完善胸部影像学检查（如胸部X光或CT），血常规、C反应蛋白、血气分析，以评估肺部感染严重程度及排除其他机会性感染。若有指征，予氧疗维持SpO₂ >95%。",
    "patient_dialogue": "你好，我是你的医生。我理解你最近咳嗽厉害、出汗多，还容易累，这让我们很担心肺里的情况。尤其是考虑到你从小就有HIV，抵抗力比较弱，我们又生活在结核病多的地方，我们需要尽快做个检查确认一下肺部有没有结核感染。这个检查很简单，就是用你的痰做个快速测试，结果出来快，能帮我们早点开始治疗。如果查出问题，我们能用药控制；如果没事，我们也放心。另外，我们还会拍个胸片看看肺部的样子，确保没有其他感染。你妈妈担心出院后的事情，咱们先一步步来，把身体检查清楚最重要。有什么不舒服或疑问，随时告诉我，好吗？"
  },
  {
    "id": 1764,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "17岁女性，身高158 cm，体重46 kg，今日由母亲陪同首次在本市HIV综合关怀门诊随诊。患者7个月前因反复口腔溃疡在外院确诊HIV-1感染，CD4 178 cells/µL，目前规律服用TDF/3TC/DTG，自述服药依从性>95%。近3周出现低热（午后37.6–38.1 °C）、夜间盗汗明显，并伴右锁骨上隐痛，无咳血，无呼吸困难。今日门诊测量生命体征：体温37.8 °C，脉搏88次/分，呼吸20次/分，SpO₂ 97%（室内空气）。听诊右上肺可闻及细湿啰音，余肺清。患者为高中住校生，近期班级里有两名同学因“肺结核”休学，她曾在宿舍共用吹风机。母亲焦急询问：‘孩子是不是也被传染了？要不要拍片子？’",
    "reference_rule": {
      "condition": "成年和未成年PLHIV人群",
      "action": "启用WHO推荐的分子快速检测技术筛查结核病",
      "contraindication": null,
      "evidence": "在成年和未成年PLHIV人群中，可以启用WHO推荐的分子快速检测技术筛查结核病（有条件的推荐，证据信度中等）。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（优先排除危急重症如肺结核），并给出直接、高效的诊疗指令。Step 2: 临床解码 - 患者为免疫抑制HIV感染者（CD4 178 cells/µL，提示中度免疫缺陷），出现低热、盗汗、右锁骨上隐痛及右上肺细湿啰音，结合近期结核暴露史（班级同学确诊肺结核、宿舍共用物品），这些隐式线索转化为医学术语：高度疑似肺结核感染（TB reactivation in HIV）。无咳血或呼吸困难，排除了紧急呼吸衰竭；但HIV状态和症状组合增加机会性感染风险。Step 3: 规则对齐与安全检查 - 患者符合指南的Condition（未成年PLHIV人群），指南Action推荐启用WHO分子快速检测技术筛查结核病；Contraindication为null，无安全禁忌，可直接应用。Step 4: 决策生成 - 依据指南，首要决策是立即安排WHO推荐的分子快速检测（如GeneXpert MTB/RIF），以快速确诊或排除结核病；同时，需结合其他基础评估确保全面性。",
    "medical_order": "完善结核病筛查：予WHO推荐的分子快速检测（GeneXpert MTB/RIF）及痰标本采集。同时，完善胸部X线平片、血常规、C反应蛋白评估感染状态；监测生命体征；建议呼吸道隔离至排除传染性。维持当前ART方案（TDF/3TC/DTG），评估服药依从性。",
    "patient_dialogue": "妈妈，我理解您着急的心情。孩子最近有低烧、盗汗和锁骨这儿疼，加上学校有同学得了肺结核，这确实让人担心。作为HIV感染者，孩子的免疫力较低，更容易感染结核病。所以，我们先做个快速检测，用痰液样本在机器上检查结核菌，结果大概一两天就能出来，比普通检查快很多。同时，还要拍个胸片看看肺部情况。这能帮我们早发现早治疗，避免病情加重。别太紧张，孩子现在生命体征稳定，按时吃药的习惯很好，我们按步骤来，很快就会搞清楚的。"
  },
  {
    "id": 1758,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "17岁男生由母亲陪同，骑了40分钟电动车赶到门诊，外面正下小雨，他头发湿漉漉地走进筛查室。护士让他脱去上衣准备拍胸片，发现少年身高183cm、体重95kg，肩背厚实。拍片技师把14×17英寸平板竖放在他胸前后，发现标准成人胸片固定带几乎扣不上，勉强用魔术贴末端只粘住不到1cm。少年有些局促地说自己平时爱打篮球，最近两周偶尔干咳、无痰，否认发热盗汗，但昨晚熬夜复习后觉得胸口“像跑完800米那样发紧”。母亲补充，孩子初中时患过肺炎，当时医生提过“肺部留了一个小疤”。室外湿度92%，胸片机刚开机预热，技师正在电脑里勾选“≥15岁入学筛查”协议。",
    "reference_rule": {
      "condition": "在15周岁以上推荐开展结核病筛查的人群中",
      "action": "在开展结核病筛查和分诊过程中，启用计算机辅助阅片软件（CAD）代替影像学技师解读胸片结果",
      "contraindication": null,
      "evidence": "在15周岁以上推荐开展结核病筛查的人群中，在开展结核病筛查和分诊过程中，可以启用计算机辅助阅片软件（CAD）代替影像学技师解读胸片结果（有条件的推荐，证据信度低）。"
    },
    "thought": "本案例属于操作规范与测量场景。作为操作执行者，我的关注重点是：物理条件是否满足（如固定带适配性）、操作步骤是否遗漏（如设备预热），以及是否存在影响准确性的干扰因素（如肥胖和环境湿度）。\n\n- **Step 1: 场景定义**：当前为结核病筛查操作场景，涉及胸片拍摄规范。需优先确保物理条件（固定带适用性、设备状态）符合标准，避免图像质量缺陷。\n- **Step 2: 临床解码**：患者17岁男性，BMI 28.3（身高183cm, 体重95kg），提示肥胖及胸壁厚度增加，可能导致胸片穿透不足或伪影；环境因素（室外湿度92%，患者湿发）可能引入水分相关伪影；固定带仅粘住1cm，增加图像移动模糊风险；症状（干咳2周、胸闷，类比运动后不适）需排除急性呼吸道问题；既往肺炎疤痕提示潜在肺部结构性变化；符合≥15岁入学筛查协议。\n- **Step 3: 规则对齐与安全检查**：指南条件（15周岁以上筛查人群）匹配患者年龄，无禁忌症（contraindication null）。但干扰因素（肥胖、固定带问题、高湿度）可能降低CAD准确性：肥胖和固定不良可导致图像失真，CAD误读风险升高；湿度可能影响设备性能。安全检查确认：必须优化物理条件以保障安全（避免重复曝光）。\n- **Step 4: 决策生成**：基于指南action（启用CAD），决策：先解决物理干扰以确保高质量胸片，再应用CAD软件解读。具体包括调整固定带、验证设备状态后拍摄，再启动CAD。",
    "medical_order": "1. 评估并优化胸片拍摄条件：使用扩展型成人胸片固定带适配患者体型（身高183cm，体重95kg），确保平板稳固无移动。2. 确认胸片机预热完成，环境湿度控制（必要时擦拭患者皮肤干燥）。3. 拍摄后立即评估图像质量（检查穿透度及伪影）。4. 启用计算机辅助阅片软件（CAD）进行结核病筛查结果解读。5. 若图像质量不合格，重复拍摄并调整参数。",
    "patient_dialogue": "小伙子，别紧张啊！咱们现在要拍个胸片，检查一下你刚才说的胸口发紧和咳嗽。因为你身材比较壮实，咱们得先把那个绑带调整好，确保照片拍得清清楚楚的——这样电脑软件分析时才不会出错。对了，你头发有点湿，我来帮你擦干一下，免得影响机器。拍完后，软件会帮我们快速看结果。整个过程几分钟就完事儿，你配合得很好！"
  },
  {
    "id": 1768,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者今日独自前来复诊，神情轻松。既往2019年确诊HIV-1感染，一直服用TDF/3TC/DTG，病毒载量<50拷贝/mL已持续18个月。本次CD4+T淋巴细胞计数报告为156个/µl（两周前抽血）。患者自述无咳嗽、无盗汗、无体重下降，夜间体温偶尔37.2℃，自认为‘天气闷热’。门诊病历记录：体温36.8℃，脉率84次/分，SpO₂ 98%（室温空气），BMI 22.4 kg/m²，胸片半年前正常，未做过结核菌素皮试。护士提问：‘CD4又在100–200之间，要不要顺手做个尿LAM？’患者补充：‘我最近接了一份夜班外卖的兼职，怕耽误上班，最好少做检查。’",
    "reference_rule": {
      "condition": "在门诊患者中，HIV阳性成人、青少年和儿童，患者未出现结核病症状且CD4+T淋巴细胞计数在100~200个/µl之间",
      "action": "不采用侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）作为活动性结核病的辅助诊断",
      "contraindication": "患者未出现结核病症状且CD4+T淋巴细胞计数在100~200个/µl之间",
      "evidence": "在门诊患者中，对于符合下列情况的HIV阳性成人、青少年和儿童，WHO不推荐采用LF-LAM作为活动性结核病的辅助诊断：1.  未开展结核病症状评价（强烈推荐，就检测准确性而言，证据信度非常低）。2.  患者未出现结核病症状且CD4+T淋巴细胞计数未知，或患者未出现结核病症状且CD4+T淋巴细胞计数≥200个/µl（强烈推荐，就检测准确性而言，证据信度非常低）。3.  患者未出现结核病症状且CD4+T淋巴细胞计数在100~200个/µl之间（有条件推荐，就检测准确性而言，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于复杂合并症治疗场景，重点关注HIV感染者合并免疫抑制状态下的结核病筛查策略。核心矛盾：指南推荐与患者实际需求（减少检查）的平衡。\nStep 2: 临床解码 - 关键医学参数：①CD4+ 156/μl（持续18个月<200，严重免疫抑制）②偶发低热37.2℃（潜在感染信号）③无典型结核症状（咳嗽/盗汗/消瘦）④ART治疗成功（病毒持续抑制）。隐式风险：CD4持续低下增加机会性感染风险，夜班工作可能导致免疫进一步受损。\nStep 3: 规则对齐与安全检查 - 严格匹配指南条件：无症状+CD4 100-200/μl→符合'有条件不推荐LF-LAM'条款。强制检查禁忌症：无结核症状+CD4在阈值内→无禁忌。但需注意：低热需排除亚临床结核，胸片过期需更新。\nStep 4: 决策生成 - 根据WHO指南，否决LF-LAM检测；但需升级常规结核筛查（胸片+皮试），因CD4持续<200且存在非特异发热。同时需评估夜班工作对免疫的影响",
    "medical_order": [
      "否决尿LAM检测（依据WHO指南：无症状且CD4 100-200/μl不推荐）",
      "完善结核病筛查：1) 立即行胸部X线检查（距上次检查已6个月） 2) 安排结核菌素皮肤试验",
      "发热监测：嘱患者每日记录早晚体温，若>37.5℃或持续低热≥3天复诊",
      "免疫评估：3个月后复查CD4+T淋巴细胞计数及病毒载量",
      "ART方案维持：继续TDF/3TC/DTG（当前病毒抑制良好）"
    ],
    "patient_dialogue": "王先生，看您精神不错！关于护士说的那个尿检，咱们仔细分析过了：您现在没有咳嗽、晚上出汗这些结核病的典型表现，血液里的免疫细胞（CD4）虽然偏低但还在安全范围内。这种情况下国际指南不建议做这个检查，因为结果可能不太准，白让您跑一趟还耽误送外卖。不过啊——（身体前倾）您提到偶尔觉得身上热热的，这个咱们得重视。接下来需要：1) 拍个新的胸片，和半年前对比下；2) 在手臂上做个小皮试，就像打青霉素前做的那种测试。这两个检查更重要也更准。另外您记着每天量两次体温，要是连续三天超过37度5，或者夜里发热更频繁了，随时来找我！您这送夜宵的活儿挺辛苦，千万注意别累着，免疫力可是您健康的守门员啊！"
  },
  {
    "id": 1770,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者今日独自前来取药，精神状态良好，无咳嗽、无发热、无盗汗或体重下降。自诉在建筑工地做资料员，近期工地粉尘大，偶尔觉得喉咙干。既往HIV-1感染7年，目前服用TDF/3TC/DTG，自述规律服药，漏服<1次/月。本次复查CD4 280个/µl（两周前结果），病毒载量<50拷贝/ml。护士提醒她上次抽血时顺便留了尿样，同事随口问：‘要不要加做个LAM？听说能早点查出结核。’患者追问：‘我需要吗？我一点症状都没有。’门诊病历显示：既往无结核病史，胸部X线半年前正常，最近一次TST 6mm，γ-干扰素释放试验阴性。今日体温36.4℃，BMI 22kg/m²，听诊双肺清，无淋巴结肿大。",
    "reference_rule": {
      "condition": "在门诊患者中，HIV阳性成人、青少年和儿童，患者未出现结核病症状且CD4+T淋巴细胞计数未知，或患者未出现结核病症状且CD4+T淋巴细胞计数≥200个/µl",
      "action": "不采用侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）作为活动性结核病的辅助诊断",
      "contraindication": "患者未出现结核病症状且CD4+T淋巴细胞计数未知，或患者未出现结核病症状且CD4+T淋巴细胞计数≥200个/µl",
      "evidence": "在门诊患者中，对于符合下列情况的HIV阳性成人、青少年和儿童，WHO不推荐采用LF-LAM作为活动性结核病的辅助诊断：1.  未开展结核病症状评价（强烈推荐，就检测准确性而言，证据信度非常低）。2.  患者未出现结核病症状且CD4+T淋巴细胞计数未知，或患者未出现结核病症状且CD4+T淋巴细胞计数≥200个/µl（强烈推荐，就检测准确性而言，证据信度非常低）。3.  患者未出现结核病症状且CD4+T淋巴细胞计数在100~200个/µl之间（有条件推荐，就检测准确性而言，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于复杂合并症治疗场景（HIV感染合并结核病筛查需求），需重点关注药物安全性、免疫状态与共病风险的交互作用。Step 2: 临床解码 - ①HIV感染者CD4 280个/µl（中度免疫抑制）但病毒完全抑制；②无结核病症状（无咳嗽/发热/盗汗）、TST弱阳性(6mm)但γ-干扰素阴性、半年前胸片正常；③粉尘暴露致咽喉刺激症状（非结核特异性）；④ART方案TDF/3TC/DTG依从性良好。Step 3: 规则对齐与安全检查 - 严格匹配指南：患者无症状且CD4≥200个/µl（280>200），符合WHO强烈反对使用LF-LAM的禁忌证（证据信度非常低）；无药物相互作用风险（DTG无结核药禁忌）。Step 4: 决策生成 - 基于指南action，拒绝LF-LAM检测，维持当前ART方案，优先处理粉尘暴露的呼吸道刺激问题。",
    "medical_order": "1. 无需进行侧流尿脂阿拉伯甘露聚糖（LF-LAM）检测（符合WHO指南：无症状且CD4≥200个/µl）；2. 维持当前ART方案（TDF/3TC/DTG），嘱继续规律服药；3. 建议职业防护：佩戴N95口罩减少粉尘吸入，每日饮水≥1.5L；4. 随访计划：①每月自我监测结核病症状（咳嗽/发热/盗汗），②6个月后复查CD4+T淋巴细胞计数及胸部X线。",
    "patient_dialogue": "王阿姨，咱们先说说结核检查的事。您同事提到的那个尿检（LAM），我仔细核对了国际指南和您的情况：您现在没有任何咳嗽发烧的症状，免疫力也在安全线以上（CD4超过200），这个检查对您反而容易误判，咱们不做冤枉检查。倒是工地粉尘的问题得重视——您喉咙发干就是信号，明天起带好N95口罩，水杯随时装满喝，别让粉尘伤着气管。抗HIV的药一定按时吃，您做得特别棒！记住如果哪天突然咳嗽超过两周或莫名发烧，立刻来医院找我。咱半年后再拍个胸片复查，您看这样安排行吗？"
  },
  {
    "id": 1749,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "17岁女性，由母亲陪同走进HIV关怀门诊。护士记录：确诊HIV感染4个月，尚未启动ART；近3周出现午后低热（最高37.8℃）、夜间盗汗明显，晨起校服常被汗水浸透；体重自51kg降至47kg，同学调侃她“校服越来越松”。患者轻声补充：“还有咳嗽，总觉得肺里痒，又不敢用力咳，怕别人听见。”候诊区空调温度偏低，她仍把外套裹紧。母亲焦急询问：“医生，她这咳嗽老不好，会不会是肺结核？学校最近体检拍胸片说‘右上肺隐约小斑片’，但报告没写清楚。”护士随即将其引导至筛查室，准备使用WHO四症状筛查表进一步评估。",
    "reference_rule": {
      "condition": "成年和未成年PLHIV人群",
      "action": "1. 采用WHO推荐的四症状筛查工具进行系统的结核病筛查; 2. 对于报告正在发生咳嗽、低热、体质量降低或盗汗的个体，接受进一步的结核病或其他疾病诊断评价",
      "contraindication": null,
      "evidence": "在成年和未成年PLHIV人群中，应采用WHO推荐的四症状筛查工具进行系统的结核病筛查，其中报告正在发生咳嗽、低热、体质量降低或盜汗的个体应该接受进一步的结核病或其他疾病诊断评价（强烈推荐，证据信度中等）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，优先排除危急重症（如活动性肺结核或机会性感染），并基于症状直接给出诊疗指令，确保患者安全。Step 2: 临床解码 (Clinical Decoding) - 患者为17岁女性，HIV感染4个月未启动ART，处于免疫抑制状态。关键症状包括午后低热（最高37.8°C，提示感染性发热）、夜间盗汗（典型结核病症状）、体重下降4kg（体质量降低）、干咳伴肺痒感（刺激性咳嗽）。隐式线索：胸片报告“右上肺隐约小斑片影”（可能肺结核浸润），行为上裹紧外套（畏寒或不适），不敢咳嗽（社交恐惧或疾病焦虑）。整体提示结核病高风险。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者属于未成年PLHIV人群，报告了所有WHO四症状（咳嗽、低热、体质量降低、盗汗），完全匹配指南Condition，需进行进一步结核病诊断评价。指南Contraindication为null，无禁忌。安全检查：排除活动性肺结核传播风险（如咳嗽症状），优先考虑隔离措施；同时评估HIV相关免疫状态，避免ART启动前未排除结核病导致的免疫重建炎症综合征（IRIS）。Step 4: 决策生成 (Decision Making) - 根据指南Action，立即执行WHO四症状筛查工具（护士已准备），并安排进一步结核病诊断评价，包括痰液检查和影像学复查；同时评估HIV参数以指导后续治疗。",
    "medical_order": "予完善WHO四症状筛查；予痰涂片抗酸染色、痰培养及胸部X线复查；予检测CD4计数和HIV病毒载量；予启动隔离措施至结核病排除；予监测体温、体重变化；予评估ART启动时机，待结核病诊断明确后考虑。",
    "patient_dialogue": "你好，我是医生。别担心，我理解你和妈妈都很着急，咳嗽、盗汗这些症状确实让人不舒服。从你说的这些情况来看，咱们需要仔细检查一下，因为HIV感染会让身体更容易得一些病，比如肺结核。你提到的胸片报告有点模糊，咱们得重新拍个胸片，还要请你咳点痰来做化验，看看有没有病菌。同时，我们会测一下你的免疫系统情况，好决定怎么用药。为了安全起见，建议你暂时戴上口罩，避免传染给其他人。别紧张，咱们一步步来，很快就能找出原因。妈妈，你也放心，我们会全力帮孩子的。"
  },
  {
    "id": 1777,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者34岁，男性，HIV感染确诊5年，目前服用TDF/3TC/DTG，CD₄ 420/μL，VL<50 cp/mL。今日因“右侧胸痛3周、午后低热”来门诊。查体：T 37.8 ℃，HR 88次/分，RR 18次/分，SpO₂ 97% RA，右锁骨下区叩诊稍浊，呼吸音减弱。余肺野清，无杵状指。患者否认咳血，但近10天出现干咳，夜间盗汗明显。无体重下降（自述近月体重稳在68 kg）。吸烟史：5支/日×12年；职业为夜班外卖骑手，常出入通风较差的取餐点。胸片已拍，报告提示“右肺上野条索影，建议进一步检查”。患者焦虑地追问：“医生，我这片子是不是没事？能继续送外卖吗？”",
    "reference_rule": {
      "condition": "正在接受ART的PLHIV人群",
      "action": "1. 给予胸部影像学检查; 2. 对于影像学结果未见异常的个体，提供TPT",
      "contraindication": null,
      "evidence": "可考虑给予正在接受ART的PLHIV人群胸部影像学检查，对于影像学结果未见异常的个体提供TPT（有条件的推荐，就估算效果而言，证据信度低）。"
    },
    "thought": "本案例属于常规门诊诊疗场景，作为急诊/门诊医生，我的关注重点在于快速建立鉴别诊断（Differential Diagnosis），排除危急重症（如活动性结核或肺炎），并基于直接线索给出高效指令。临床解码：患者为HIV感染者ART控制良好（CD4 420/μL，VL<50），但症状包括右侧胸痛3周、午后低热（T 37.8℃）、干咳10天、盗汗明显，查体右锁骨下区叩诊浊音和呼吸音减弱，胸片示右肺上野条索影（提示肺部病变如结核或炎症）。隐式线索包括吸烟史（5支/日×12年）和职业暴露（通风差环境），增加结核或机会性感染风险。鉴别诊断优先考虑结核病（因HIV背景），其次为细菌性肺炎、肺真菌感染或非特异性炎症。规则对齐与安全检查：指南Condition为‘正在接受ART的PLHIV人群’，患者符合；Action建议胸部影像学检查（已执行但异常），故TPT（结核病预防治疗）不适用（针对影像学未见异常者）；Contraindication为null，无禁忌。决策生成：鉴于胸片异常和症状，需完善进一步检查以确诊病因（如结核），并建议暂时休息以排除传播风险。",
    "medical_order": "1. 完善胸部CT平扫评估肺部病变。2. 留痰标本：抗酸杆菌涂片、结核培养及药敏试验。3. 抽血：血常规、ESR、CRP、复查CD4及VL。4. 评估结核病可能性，建议门诊隔离观察。5. 嘱患者居家休息，避免职业暴露。",
    "patient_dialogue": "李先生，您的胸片结果确实显示右肺有点问题，不是完全没事——有条索状的阴影，这可能是因为感染或其他原因引起的。结合您最近有胸痛、低热和盗汗的情况，我们最担心的是结核感染，这在HIV控制良好的人群中也可能发生。接下来，我们需要做更详细的检查：一个是胸部CT扫描，能更清楚地看肺部；另一个是留痰样本，检查有没有结核菌；还要抽血化验，确保HIV治疗还在正轨。同时，因为结核可能传染，您最好先在家休息，别去送外卖了——那些通风差的环境可能加重问题。等结果出来，我们就能确定治疗方案。别太焦虑，早期发现就好处理，咱们一步步来。"
  },
  {
    "id": 1779,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "上午10点，感染科病房。患者阿卜杜拉（化名）正接受HRZE四联抗结核治疗，CD4 136/μl，病毒载量 180 000 cp/ml。责任护士准备给他做ART用药宣教时，患者妻子（38岁）带着15岁女儿和73岁母亲来探视，一家四口挤在6人间靠窗的床位旁。妻子小声告诉护士，她最近两个月夜里总出汗、体重掉了3公斤，但以为是照顾丈夫累的；女儿偶尔咳嗽，老人有多年糖尿病。窗外沙尘暴黄色预警，病房内通风扇嗡嗡作响。护士记录完家属主诉后，准备把情况反馈给管床医生，并在电脑里打开‘结核病密接登记表’，却突然发现栏位里‘HIV筛查’一项还是空白。",
    "reference_rule": {
      "condition": "所有结核病并发HIV感染患者的家庭密切接触人员",
      "action": "提供HIV检测",
      "contraindication": null,
      "evidence": "应该对所有结核病并发HIV感染患者的家庭密切接触人员提供HIV检测（强烈推荐，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于行政与伦理场景。作为管理者，我的关注重点在于流程合规性（确保医疗文书完整和操作符合指南）、文书完整性（补充缺失记录）、伦理告知（强调知情同意和隐私保护）以及公共卫生责任（控制传染病传播风险）。Step 2: 临床解码 (Clinical Decoding) - 患者阿卜杜拉为结核病并发HIV感染（CD4 136/μl示免疫抑制，病毒载量 180 000 cp/ml示高病毒活性），当前接受HRZE四联抗结核治疗。家属作为家庭密切接触人员：妻子报告盗汗和体重减轻（3公斤），提示潜在结核暴露或感染；女儿有偶发咳嗽，可能提示呼吸道传播风险；母亲有糖尿病史，为免疫低下人群，增加感染易感性。环境因素包括病房拥挤（6人间）、通风不良（通风扇噪音示效率不足）及沙尘暴预警，可能加剧空气传播风险。关键文书缺失：结核病密接登记表中‘HIV筛查’项空白，表明筛查未执行。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件‘所有结核病并发HIV感染患者的家庭密切接触人员’与病例完全匹配（妻子、女儿、母亲均属密切接触）。无禁忌症（contraindication null），因此检测安全可行。证据虽信度低但强烈推荐，需优先执行以履行公共卫生责任。Step 4: 决策生成 (Decision Making) - 依据指南 action ‘提供HIV检测’，决策为立即安排家属HIV检测。同时，基于家属症状和环境风险，补充决策：完善文书记录、评估结核暴露，并改善环境控制。",
    "medical_order": "予安排患者阿卜杜拉所有家庭密切接触人员（妻子、15岁女儿、73岁母亲）HIV抗体筛查及咨询；完善结核病密接登记表，补充‘HIV筛查’栏位信息，并记录家属主诉（盗汗、体重减轻、咳嗽）。建议并行结核菌素皮肤试验或干扰素γ释放试验以评估潜在结核暴露；考虑环境干预，如调整床位或加强通风，降低传播风险；随访家属症状变化。",
    "patient_dialogue": "阿卜杜拉先生，还有您的家人，大家好。我知道您现在身体不舒服，一家人都在这里陪着很辛苦。刚才护士提到您妻子晚上出汗多、体重掉了些，女儿偶尔咳嗽，老人家也有糖尿病——这些都让我们很担心。因为您正在治疗结核和HIV，这些病有可能在家人间传播，尤其是住得近的时候。为了早点预防和保护大家，我们建议给您的妻子、女儿和妈妈都做个简单的血液检查，看看有没有感染HIV。这个检查是自愿的，结果会完全保密，我们只在必要时和您私下讨论。如果早点发现，我们能更快治疗，避免问题变严重。同时，病房里人多空气不太好，我们会尽量帮你们调整一下位置，减少风险。大家别太紧张，这是常规的健康保护措施，我们一起努力让全家都健康起来。"
  },
  {
    "id": 1750,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者因“低热、夜间盗汗2周”由当地疾控中心转来。2年前确诊HIV感染，目前服用TDF/3TC/DTG，自述近3个月体重下降4 kg。今日门诊体温37.8 ℃，指脉氧96%，呼吸20次/分，右锁骨上可触及1枚1.5 cm质韧淋巴结，无明显压痛。患者担心拍片辐射，反复询问“能不能只做抽血”。陪同的母亲补充：孩子最近学校准备期末考试，希望尽量当天往返。候诊区空调故障，候诊时间已超90分钟，患者略显烦躁。",
    "reference_rule": {
      "condition": "成年和未成年PLHIV人群",
      "action": "开展胸片筛查结核病",
      "contraindication": null,
      "evidence": "在成年和未成年PLHIV人群中，可以开展胸片筛查结核病（有条件的推荐，证据信度中等）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，重点关注快速建立鉴别诊断（如排除结核病等危急重症），并基于指南给出直接、高效的诊疗指令。作为急诊/门诊医生，我将优先评估症状的紧急程度，确保决策聚焦于排除潜在致命感染。Step 2: 临床解码 (Clinical Decoding) - 从患者病例中提取关键信息：HIV感染者（PLHIV）在ART治疗中（TDF/3TC/DTG），症状包括低热（37.8°C）、夜间盗汗、体重下降（4kg/3个月），体征为右锁骨上淋巴结肿大（1.5cm，质韧无压痛），提示结核病（TB）或其他机会性感染（如淋巴瘤或播散性感染）；隐式线索包括患者年龄较轻（母亲陪同，强调学校事务）、免疫抑制风险（HIV感染史）、以及环境因素（候诊时间长导致烦躁），这些均增加TB筛查的紧迫性。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者符合指南条件（成年/未成年PLHIV人群），指南推荐胸片筛查TB（证据信度中等），且无禁忌症（contraindication为null）；安全检查确认胸片无绝对禁忌，但需考虑患者辐射担忧和情绪状态（烦躁），这不会改变指南核心Action。Step 4: 决策生成 (Decision Making) - 基于指南Action，决策为必须开展胸片筛查TB，作为首要步骤；同时，为全面评估，需辅助抽血检查（如血常规、TB特异性检测），但胸片不可替代以排除活动性TB。",
    "medical_order": "完善胸部X光片检查以筛查结核病；同时抽血检查血常规、CD4+T淋巴细胞计数、HIV病毒载量及干扰素γ释放试验（如T-SPOT.TB）；监测生命体征（体温、指脉氧、呼吸频率）；评估淋巴结肿大性质，必要时行细针穿刺活检；安排优先检查序列，缩短候诊时间。",
    "patient_dialogue": "你好，今天辛苦你等了这么久，我们理解你担心辐射和想早点回学校。你看，你最近有低烧、晚上出汗多，还有体重减轻，这些症状在HIV感染者中特别需要重视，可能提示结核病——这是一种能传染的感染，如果不及时查出来，可能会加重影响身体。所以，我们必须做个胸部X光片检查，这个辐射量很小，就像坐一次短途飞机一样安全，而且能快速看清肺部情况。同时，我们会抽点血做一些其他检查，比如看看免疫力和有没有结核病菌，这样更全面。我们尽量安排今天做完所有检查，让你能赶回学校准备考试。别担心，我们一起配合，早点排除问题，好吗？"
  },
  {
    "id": 1790,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者34岁，身高172 cm，体重58 kg，BMI 19.6 kg/m²，未婚，来自邻省务工。主诉：持续干咳3周，伴午后低热（37.6–38.2 °C）及夜间盗汗，无咯血、胸痛。既往体健，否认高血压、糖尿病。吸烟史8年，约10支/日；饮酒少量。无已知药物过敏。体格检查：咽部轻度充血，右锁骨上可触及一枚1.5 cm质韧淋巴结，活动可、轻压痛；双肺呼吸音粗，右上肺偶闻细湿啰音。指尖血氧饱和度96%（室温空气）。胸片示右上肺野斑片影伴小空洞，直径约1.8 cm，边缘模糊。门诊初步诊断“疑似肺结核”，已采集两份痰涂片抗酸染色待报。患者自述近期体重下降4 kg，夜间常因出汗需更换衣物，但认为“只是感冒没好”，未就诊。今日由工地同事陪同前来，希望尽快拿到病假条。室温28 °C，诊室空调故障，患者频繁用纸巾擦汗。",
    "reference_rule": {
      "condition": "所有疑似和确诊的结核病患者",
      "action": "提供HIV检测",
      "contraindication": null,
      "evidence": "应该对所有疑似和确诊的结核病患者提供HIV检测（强烈推荐，证据信度低）。"
    },
    "thought": "本案例属于常规诊断与治疗场景，需采用果断的门急诊医生思维模式。重点在于快速建立鉴别诊断，排除危急重症，并基于指南给出明确指令。患者临床表现（干咳+午后低热+盗汗+体重下降+肺空洞影）高度符合肺结核，但需警惕肺脓肿或肺癌可能。右锁骨上淋巴结肿大提示局部播散风险，血氧正常暂排呼吸衰竭。根据指南条件'所有疑似结核病患者'，患者符合'疑似肺结核'诊断（胸片+典型症状），且无禁忌症，必须执行HIV检测。决策核心：在等待痰涂片结果期间，立即启动呼吸道隔离及预防性治疗，同步完成HIV检测等关键步骤。",
    "medical_order": [
      "1. 感染防控：立即转至负压隔离诊室，患者及陪同人员佩戴医用防护口罩；",
      "2. 完善检查：",
      "   - 急查HIV抗体（ELISA法），结核菌素皮肤试验（PPD）",
      "   - 加做痰结核菌培养及GeneXpert MTB/RIF检测",
      "   - 胸部CT平扫+增强（评估空洞性质及纵隔淋巴结）",
      "   - 血常规、ESR、CRP、肝肾功能",
      "3. 治疗干预：",
      "   - 经验性抗结核治疗：异烟肼300 mg q24h + 利福平600 mg q24h + 吡嗪酰胺1500 mg q24h（根据体重调整）",
      "   - 营养支持：高蛋白口服营养补充剂每日2次（每份含30g蛋白质）",
      "4. 行政措施：",
      "   - 开具医学隔离证明及病假条（期限14天）",
      "   - 立即传染病网络直报（疑似肺结核）"
    ],
    "patient_dialogue": [
      "王先生，您先擦擦汗（递纸巾）。您这咳嗽和夜里出汗的情况，我们高度怀疑是肺结核——这不是普通感冒，而是一种会传染的肺部感染。",
      "现在要马上做三件事：",
      "第一，您和同事都需要戴上这种专用口罩（展示口罩），接下来要去单独的房间检查，避免传染给其他人；",
      "第二，今天起要开始吃三种抗结核药，必须每天按时服用。这个病能治好，但药不能停！同时给您开些营养粉，您最近瘦了不少，需要多补充蛋白质。",
      "第三，要抽血做个艾滋病毒检查——别紧张，这是结核病人的常规筛查，因为两种病容易一起出现，咱们早查早放心。",
      "病假条我开两周，工地那边会写明'需隔离治疗'。记住：千万别随地吐痰，碗筷要和别人分开用，这是保护您身边人的关键！"
    ]
  },
  {
    "id": 1769,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "周二上午，门诊抗病毒治疗室。患者32岁女性，因“CD4 210 cells/μl，病毒载量<50 copies/ml”来取替诺福韦/拉米夫定/多替拉韦续方。护士按常规询问近4周健康情况，患者轻松答道：“没什么大问题，就是上周陪儿子去郊游，回来有点累，左胸偶尔像针扎一样疼两下，昨天开始偶尔干咳，没痰、没发烧，也没盗汗。”查体：T 36.8 ℃，HR 88次/分，SaO₂ 97%（室温空气），肺部听诊双肺呼吸音对称，未及啰音。体重较3月前增加1 kg。患者目前未进行过任何结核病症状筛查问卷，病历首页“结核病症状评估”栏为空。诊室空调因前夜暴雨故障，候诊区闷热，患者不断用手扇风，抱怨“这天气闷得胸口更不舒服”。",
    "reference_rule": {
      "condition": "在门诊患者中，HIV阳性成人、青少年和儿童，未开展结核病症状评价",
      "action": "不采用侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）作为活动性结核病的辅助诊断",
      "contraindication": "未开展结核病症状评价",
      "evidence": "在门诊患者中，对于符合下列情况的HIV阳性成人、青少年和儿童，WHO不推荐采用LF-LAM作为活动性结核病的辅助诊断：1.  未开展结核病症状评价（强烈推荐，就检测准确性而言，证据信度非常低）。2.  患者未出现结核病症状且CD4+T淋巴细胞计数未知，或患者未出现结核病症状且CD4+T淋巴细胞计数≥200个/µl（强烈推荐，就检测准确性而言，证据信度非常低）。3.  患者未出现结核病症状且CD4+T淋巴细胞计数在100~200个/µl之间（有条件推荐，就检测准确性而言，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规门诊诊疗场景，重点关注快速建立鉴别诊断并排除危急重症。患者虽为常规续方，但新发呼吸道症状需优先评估结核病风险。Step 2: 临床解码 - ①免疫抑制状态（CD4 210）伴新发胸痛（针扎样）及干咳；②无典型结核症状（无发热/盗汗）但未完成基础筛查（病历空白）；③环境因素（闷热）可能放大主观不适，但非病理原因。Step 3: 规则对齐与安全检查 - 严格遵循WHO指南：患者未接受结核症状评估（contraindication满足），故明确排除LF-LAM检测（action适用）。Step 4: 决策生成 - 必须启动基础结核筛查（症状问卷+胸片），因CD4接近200且症状不典型，影像学检查是排除活动性结核的核心手段。",
    "medical_order": "1. 立即完成结核病症状筛查问卷（含咳嗽、胸痛、盗汗、体重减轻等条目）；2. 安排胸部X线摄片（PA位）；3. 续方替诺福韦/拉米夫定/多替拉韦×1月；4. 嘱患者记录症状日记（胸痛发作频率/时长，咳嗽性质变化）；5. 3日内随访胸片结果，若异常转诊感染科。",
    "patient_dialogue": "李女士，您的抗病毒治疗效果很好，病毒控制得不错！不过刚才提到的胸痛和干咳，咱们需要多关注些。虽然现在没有发烧盗汗，但咱们免疫力比常人低，这种针扎样的疼和咳嗽可能提示肺部有些小问题。我建议咱们做两件事：一是填个简单的症状问卷，二是拍个胸片看看肺的情况。胸片就像给肺拍个照片，十分钟就好，能帮咱们排除严重问题。药您继续按时吃，这三天注意休息，如果咳嗽加重或者胸痛变成持续的闷痛，随时打我电话。"
  },
  {
    "id": 1781,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者28岁女性，翻译公司夜班译员，近3周出现午后低热（37.6–38.2 °C）、夜间盗汗，伴乏力，无咳嗽、胸痛或体重明显下降。自测新冠抗原阴性，未就医。今日因“连续两晚被汗水浸透睡衣”前来门诊。查体：T 37.8 °C，HR 88次/分，BP 110/70 mmHg，SpO₂ 99%（室内空气），胸部听诊未闻及干湿啰音；体型偏瘦，BMI 19 kg/m²。追问病史：3年前曾患“颈部淋巴结结核”并完成6个月抗结核治疗；无已知HIV危险因素，但从未做过HIV检测。追问生活史：与室友合租，无养宠物，近期无外出旅行，仅每天乘地铁往返。患者轻声补充：“医生，我室友说结核筛查体检要戳手臂，我怕疼，能不能抽血解决？”——干扰信息：患者顺带抱怨地铁空调太冷导致肩颈酸痛。",
    "reference_rule": {
      "condition": "结核分枝杆菌感染检测",
      "action": "采用结核菌素皮肤试验（TST）或干扰素释放试验（IGRA）",
      "contraindication": null,
      "evidence": "结核菌素皮肤试验（TST）或干扰素释放试验（IGRA）都可以用于结核分枝杆菌感染检测（强烈推荐，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如活动性结核或播散性感染），并基于指南给出直接的诊疗指令。Step 2: 临床解码 (Clinical Decoding) - 患者为28岁女性，主诉午后低热（37.6–38.2°C）、夜间盗汗和乏力3周，结合既往颈部淋巴结结核病史（3年前完成抗结核治疗），提示结核复发高风险；BMI 19 kg/m²（偏瘦）可能暗示营养不良或慢性消耗；无咳嗽、胸痛或体重下降部分排除了活动性肺结核，但需警惕其他感染（如HIV相关）。隐式线索包括：夜班工作可能影响免疫力，从未做HIV检测增加免疫抑制风险；干扰信息（怕疼、地铁空调不适）不相关，应忽略。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件为“结核分枝杆菌感染检测”，与患者症状及病史高度匹配；行动为“采用TST或IGRA”，无禁忌症（contraindication: null）。安全检查：患者怕疼偏好抽血，TST可能因既往结核产生假阳性，IGRA更安全且符合患者偏好；无急性感染或免疫缺陷证据，需排除HIV作为潜在风险。Step 4: 决策生成 (Decision Making) - 根据指南行动，优先选择IGRA检测结核分枝杆菌感染，并扩展为全面评估：加做HIV筛查、基础炎症指标和影像学检查，以排除其他病因并确保安全。",
    "medical_order": "完善干扰素释放试验（IGRA）检测结核分枝杆菌感染；完善HIV抗体筛查；完善血常规、C反应蛋白检查；完善胸部X线检查；建议居家休息，监测体温变化每日两次。",
    "patient_dialogue": "您好，您最近的低烧和晚上出汗确实让人担心，尤其您之前有过结核病史，这可能是复发的信号。我先给您安排个简单的血液检查，叫IGRA，抽一管血就行，不用打针，一点儿也不疼，这样就能查结核了。同时，我们再加个HIV检查和其他几项基础血检，确保没有其他问题，比如免疫力低下引起的感染。另外，做个胸部X光，看看肺部情况。这几天多休息，记录体温早晚各一次，结果出来我们就能确定下一步了。别担心，这些检查很快，抽血时我会让护士轻轻操作。地铁空调的事咱们先放一边，重点是把身体查清楚。"
  },
  {
    "id": 1782,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者29岁女性，3周前在外院确诊HIV感染（CD4 156/μL，VL 4.7 log₁₀），今日首次来HIV门诊复诊。主诉：近10天间断干咳、午后低热37.8–38.2℃，夜间盗汗明显，体重较上月下降3kg。无咯血、胸痛。既往史：无高血压、糖尿病；1年前患“支原体肺炎”已愈。个人史：未婚，超市收银，每日通勤地铁2h；否认吸烟饮酒；喜喝速溶咖啡，每天3杯。查体：BMI 18.4 kg/m²，口唇无紫绀，右锁骨上可及1枚1 cm质韧淋巴结，无压痛；肺部听诊右上肺呼吸音略低。辅助检查：胸片示右上肺斑片影伴小空洞；CRP 22 mg/L；血常规WBC 5.8×10⁹/L，Hb 108 g/L；空腹血糖5.1 mmol/L；肌酐68 μmol/L。护士备注：患者候诊时轻声咳嗽，自觉“只是地铁空调太冷”。",
    "reference_rule": {
      "condition": "在临床筛查流程中报告目前出现咳嗽、发热、体质量减轻或盗汗任一症状，可能存在活动性结核病的成人和青少年HIV感染者",
      "action": "1. 进行结核病和其他疾病的评估; 2. 在排除活动性结核病的情况下，给予TPT",
      "contraindication": null,
      "evidence": "在临床筛查流程中报告目前出现咳嗽、发热、体质量减轻或盗汗任一症状，可能存在活动性结核病的成人和青少年HIV感染者，应进行结核病和其他疾病的评估，在排除活动性结核病的情况下，应给予TPT（强烈推荐，就估算效果而言，证据信度中等）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，患者为HIV感染者，合并新发呼吸系统症状和影像学异常，提示潜在活动性结核病或其他机会性感染。作为专科专家，我的关注重点是全网扫描：检查药物相互作用（如HIV治疗与结核治疗的潜在冲突）、禁忌症（如肝肾功能）及共病风险（如免疫缺陷相关进展），优先级安全 > 疗效。Step 2: 临床解码 (Clinical Decoding): 关键信息包括：HIV免疫缺陷（CD4 156/μL，VL 4.7 log₁₀）、结核病高风险症状（干咳、午后低热、盗汗、体重下降）、影像学证据（右上肺斑片影伴小空洞）、炎症标志物升高（CRP 22 mg/L）、轻度贫血（Hb 108 g/L）及淋巴结肿大（右锁骨上1cm质韧淋巴结）。隐式线索：地铁通勤史（增加暴露风险）、BMI 18.4 kg/m²（营养不良风险）、咖啡习惯（不影响药物，但需注意水分摄入）。解码后医学术语：疑似活动性结核病或机会性感染（如肺孢子菌肺炎），需排除淋巴瘤或复发肺炎。Step 3: 规则对齐与安全检查 (Alignment & Safety): 患者症状（咳嗽、发热、体重减轻、盗汗）完全符合指南条件，即存在活动性结核病风险。指南action要求进行结核病评估并在排除后给予TPT。无禁忌症（指南contraindication为null）。安全检查：药物相互作用方面，如启动抗逆转录病毒治疗（ART）可能需避免利福平（降低ART药效）；共病风险方面，CD4低易致机会性感染恶化，贫血需监测；安全优先，避免过早ART以防免疫重建综合征。Step 4: 决策生成 (Decision Making): 根据指南action，决策为：立即进行结核病评估（包括痰和影像学检查），并同步筛查其他感染；如排除活动性结核病，则给予TPT；否则启动抗结核治疗。协调HIV治疗，但优先控制急性感染以确保安全。",
    "medical_order": "1. 完善结核病相关检查：痰涂片抗酸染色、痰培养、GeneXpert MTB/RIF检测；2. 行胸部CT平扫进一步评估肺部病变；3. 检测血清β-D-葡聚糖、乳酸脱氢酶（LDH）以筛查肺孢子菌肺炎（PCP）；4. 抽血查结核感染T细胞斑点试验（T-SPOT.TB）；5. 隔离患者至负压病房，防空气传播；6. 暂缓启动抗逆转录病毒治疗（ART）及结核病预防治疗（TPT），待评估结果；7. 监测生命体征，予营养支持（高蛋白饮食）；8. 预约3天后随访，根据结果调整方案；9. 通知疾控中心报传染病疑似病例。",
    "patient_dialogue": "李女士，您好！看到您最近咳嗽、发烧，还出了不少汗，体重也掉了些，我挺担心的。这些症状可能和地铁空调无关，而是身体在提醒我们可能有感染，比如结核病，这在HIV患者中挺常见的，不及时处理会影响健康。所以，我们需要做个全面检查：取点痰样本来找病菌，再做个更详细的肺部CT扫描，这样能看清楚问题。另外，抽血检查是必要的，帮我们确认感染类型。为了您和家人的安全，我会安排您到一个单独房间，减少传染风险。您先别急着吃药，等结果出来我们再决定怎么治疗。您瘦了点，要注意多吃蛋、肉这些高蛋白食物，帮助身体恢复。咖啡可以喝，但别太多，多喝水。我们3天后再见一次，我会解释结果。别紧张，我们一起解决这个问题！"
  },
  {
    "id": 1778,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者今日在HIV专科门诊复诊，主诉“咳嗽3周，夜间盗汗明显，近10天痰中带血丝”。既往史：2019年确诊HIV-1，基线CD4 132/μL，目前规律服用TDF/3TC/DTG，VL<50 copies/mL；2021年患肺孢子菌肺炎已治愈。无DM、无HTN。实验室：今日CD4 210/μL，Hb 102 g/L，ALT 38 U/L，Cr 82 μmol/L。胸片（本院数字化DR）：右上肺斑片影伴空洞，直径约2.1 cm，右肺门淋巴结肿大。GeneXpert MTB/RIF（痰）结果刚出：MTB检出，RIF敏感。护士记录：患者候诊时戴口罩，但反复因咳嗽取下擦拭口水。室外38℃高温，候诊区拥挤，患者自述“等车时被晒得头晕”。目前未开始任何抗结核治疗，门诊药房有固定剂量复合制剂（HRZE）库存。医生需决定下一步处理。",
    "reference_rule": {
      "condition": "在HIV和结核病负担均严重的地区",
      "action": "在具备结核病诊断能力的HIV医疗机构为PLHIV人群提供抗结核治疗",
      "contraindication": null,
      "evidence": "在HIV和结核病负担均严重的地区，可以在具备结核病诊断能力的HIV医疗机构为PLHIV人群提供抗结核治疗（强烈推荐，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，涉及HIV与活动性结核病的双重感染。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，严格遵循安全优先原则（安全 > 疗效）。\n\nStep 2: 临床解码 (Clinical Decoding): 从患者病例提取关键信息：HIV感染者（CD4 210/μL，VL<50 copies/mL，ART方案为TDF/3TC/DTG）合并活动性结核病（GeneXpert MTB检出，RIF敏感；胸片示右上肺空洞伴淋巴结肿大；症状包括咳嗽、盗汗、痰血）。隐式线索：轻度贫血（Hb 102 g/L）可能加重药物毒性；候诊时取下口罩提示结核传染风险高；高温下头晕暗示脱水或热应激，可能影响治疗耐受性。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition（在HIV和结核病负担均严重的地区）匹配当前场景（HIV专科门诊具备诊断能力）。Contraindication为null，但强制安全检查揭示：利福平（RIF）为强CYP3A4诱导剂，与ART中的多替拉韦（DTG）可能发生相互作用，降低DTG浓度；轻度贫血可能增加抗结核药骨髓抑制风险；无绝对禁忌症。\n\nStep 4: 决策生成 (Decision Making): 根据指南Action（在HIV医疗机构为PLHIV提供抗结核治疗），启动抗结核治疗，但优先管理安全风险：开始HRZE固定剂量复合制剂，同时优化ART以处理相互作用；加强监测和感染控制；评估头晕以预防急性并发症。",
    "medical_order": "1. 予抗结核治疗：开始固定剂量复合制剂HRZE（异烟肼/利福平/吡嗪酰胺/乙胺丁醇）标准剂量口服；\n2. ART管理：继续TDF/3TC/DTG方案，但监测HIV病毒载量每4周（因利福平潜在降低DTG浓度）；\n3. 监测：完善全血细胞计数（每周，评估贫血进展）、肝功能（每2周）、肾功能（每2周）；评估脱水状态（测血压、心率）；\n4. 感染控制：予呼吸道隔离单间；教育患者正确佩戴口罩及咳嗽礼仪；\n5. 症状管理：评估头晕原因（如脱水予口服补液）；定期复查胸片。",
    "patient_dialogue": "老王，我看了您的检查结果，您最近咳嗽、盗汗还有痰里带血丝，这些是结核病的典型症状，化验也确认了确实是结核感染。好消息是，我们现在就能开始治疗，用一套组合药来控制它。不过，您同时在吃HIV的药，这两种药混在一起可能会互相影响效果，所以我们会密切监测您的血液和病毒情况，确保一切安全。另外，结核病传染性很强，您咳嗽时如果没戴口罩，很容易传给家人或其他人——我知道天热戴口罩不舒服，但为了大家健康，请一定坚持戴好。您说头晕，可能是在外面晒太久脱水了，多喝点水休息一下。别担心，我们会一步一步帮您康复的。"
  },
  {
    "id": 1772,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者今日由母亲陪同步行至HIV专科门诊复诊。近两周出现午后低热（37.6–38.1℃）、盗汗明显，伴体重下降3kg；无咳嗽、胸痛或咯血。既往史：6年前确诊HIV-1感染，目前服用TDF/3TC/DTG，自述依从性>95%；无糖尿病、高血压或心脏病。查体：BMI 19kg/m²，口腔黏膜无白斑，双肺呼吸音清，未闻及啰音，腹平软，肝脾肋下未触及。实验室：CD4⁺T细胞计数 72/µl（↓），HIV RNA <50 copies/ml；血常规示Hb 102g/L，WBC 3.8×10⁹/L，PLT 154×10⁹/L；CRP 18mg/L。胸片报告“双肺纹理稍增粗，未见实质浸润”。今日门诊目的：评估持续不明原因发热，排除活动性结核及其他机会性感染。干扰信息：患者提到“最近天气闷热，晚上不开空调就睡不着”。",
    "reference_rule": {
      "condition": "在门诊患者中，HIV阳性成人、青少年和儿童，无论是否发生结核病典型体征和症状，CD4+T淋巴细胞计数<100个/µl",
      "action": "采用侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）作为活动性结核病的辅助诊断",
      "contraindication": null,
      "evidence": "在门诊患者中，对于符合下列情况的HIV阳性成人、青少年和儿童，WHO推荐采用LF-LAM作为活动性结核病的辅助诊断：1.  出现结核病（肺结核/肺外结核）的典型体征和症状，或重症（有条件推荐，就检测准确性而言，证据信度低）。2.  无论是否发生结核病典型体征和症状，CD4+T淋巴细胞计数<100个/µl（有条件推荐，就检测准确性证据而言，证据信度非常低）。"
    },
    "thought": "本案例属于复杂合并症治疗场景，关注重点为全网扫描潜在药物相互作用、禁忌症及共病风险，优先确保安全性。患者为HIV阳性合并CD4低下（72/µl），出现午后低热、盗汗、体重下降等非特异性症状，提示机会感染高风险（尤其结核）。隐式线索包括CRP升高（18mg/L）支持炎症反应、贫血（Hb 102g/L）及白细胞减少（WBC 3.8×10⁹/L）可能反映慢性疾病负担；干扰信息‘天气闷热’需与盗汗病理区分。参考指南明确推荐LF-LAM作为辅助诊断活动性结核，适用于CD4<100/µl的HIV患者，无论典型症状（患者条件匹配），且无禁忌症（contraindication null）。安全检查：当前ART方案（TDF/3TC/DTG）无已知药物相互作用，但需警惕后续结核治疗潜在影响（如利福平可能降低DTG浓度）。决策生成：执行指南Action，启动LF-LAM检测作为核心诊断手段，同时综合评估其他机会感染风险。",
    "medical_order": "完善侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）以辅助诊断活动性结核；监测体温、体重变化；继续当前抗逆转录病毒治疗（TDF/3TC/DTG）；复查血常规、CRP及肝肾功能；考虑痰液抗酸杆菌涂片和培养以全面排除结核；门诊随访1周，评估症状进展。",
    "patient_dialogue": "某某先生/女士，您好！我注意到您最近有低烧、盗汗和体重减轻的情况，这可能是身体在对抗某种感染，比如结核病——尤其您的免疫系统比较弱时容易发生。为了搞清楚，我们需要做一个小便检查来筛查结核，这个测试很简单，结果出来快。另外，您提到天气热不开空调会盗汗，这确实常见，但我们得排除是否还有其他病的原因。您继续按时吃HIV药物非常重要，它能保护您的免疫力。接下来几天，我会安排再抽点血复查，看看贫血有没有改善。如果症状加重或新出现咳嗽，马上联系我。别太担心，我们一步步来查，好吗？"
  },
  {
    "id": 1773,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者因‘咳嗽伴低热3周、夜间盗汗明显’前来就诊。查体：体温37.8℃，右肺上野可闻及细湿啰音；胸片示右上肺斑片状阴影伴空洞形成，痰涂片抗酸杆菌阳性。患者自述其丈夫2个月前确诊肺结核并正在县疾控中心规律服药。患者为家庭主妇，近期除照顾丈夫外无外出史，亦无其他既往病史。今日门诊同时提到‘嗓子有点痒’，怀疑天气干燥所致，无咽痛或声音嘶哑。患者尚未接受过HIV检测，对检测必要性表示疑惑：‘我只是照顾他，也要查那个吗？’",
    "reference_rule": {
      "condition": "在HIV低负担地区，所有出现结核病典型症状的结核病患者家庭成员及其他密切接触者",
      "action": "提供HIV检测",
      "contraindication": null,
      "evidence": "在HIV低负担地区，可以对所有出现结核病典型症状的结核病患者家庭成员及其他密切接触者提供HIV检测（有条件推荐，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（Differential Diagnosis），排除危急重症（如急性呼吸衰竭或肿瘤），并给出直接、果断的治疗指令。Step 2: 临床解码 (Clinical Decoding)：患者临床表现包括咳嗽、低热、夜间盗汗持续3周，结合查体发现体温37.8℃（提示低热）、右肺上野细湿啰音（表明肺部感染），胸片示右上肺斑片状阴影伴空洞形成（典型肺结核影像学表现），痰涂片抗酸杆菌阳性（确诊肺结核的金标准）。隐式线索包括：患者为结核病患者（丈夫）的密切接触者（照顾丈夫，高暴露风险），近期无外出史支持原发性感染；自述‘嗓子痒’（可能为轻微上呼吸道刺激，无急症表现）；未接受HIV检测，暗示教育需求以消除疑虑。Step 3: 规则对齐与安全检查 (Alignment & Safety)：患者符合指南condition（在HIV低负担地区，出现结核病典型症状的结核病患者家庭成员及密切接触者），指南contraindication为null，无禁忌。强制检查后，无安全风险。Step 4: 决策生成 (Decision Making)：基于指南action，提供HIV检测；整体决策包括确诊肺结核并启动抗结核治疗，以及教育隔离措施。",
    "medical_order": "1. 诊断：肺结核（痰涂片抗酸杆菌阳性）。2. 治疗：予标准一线抗结核药物治疗（异烟肼、利福平、吡嗪酰胺、乙胺丁醇），监测药物不良反应。3. 检查：完善HIV抗体检测。4. 护理：予居家隔离指导，避免传播；监测体温、咳嗽症状变化；2周后复诊评估疗效及检测结果。",
    "patient_dialogue": "您好，我们先来聊聊您的检查结果。您咳嗽、低烧和出汗这些症状，结合胸片和痰检，确认是肺结核感染了——这是一种肺部细菌感染，好在能治。治疗上，我们需要尽快开始吃药，比如几种抗生素联合使用，防止病情加重。另外，您提到嗓子痒，这可能是天气干燥引起的，没有大碍，我们会留意。关于HIV检测，我知道您有疑问：‘我只是照顾丈夫，为啥要查这个？’其实，因为您丈夫有肺结核，您日常照顾他时更容易暴露，检测一下HIV能帮我们发现任何潜在问题，确保治疗更安全有效。这不是说您一定有风险，而是标准预防措施，就像多一重保险。别担心，整个过程我们会一步步帮您，有什么问题随时问我！"
  },
  {
    "id": 1786,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者32岁，男性，夜班出租车司机，因“间断低热、盗汗伴体重下降3周”首次来呼吸门诊。自述近1个月咳嗽加重，痰中带血丝两次，无胸痛。既往史：2年前确诊HIV感染，目前未规律抗病毒治疗，CD4 168 cells/µL，病毒载量未测。体温37.8℃，BMI 19 kg/m²，右上肺呼吸音减弱。胸片示右上肺尖段斑片影伴空洞形成，GeneXpert MTB/RIF阳性，利福平敏感。患者主动提及女友同居4年，女友尚未做过HIV或结核筛查，且最近女友也开始出现轻微咳嗽。今日门诊电脑提示“需完成传染病报告卡”，患者边咳嗽边问：“医生，我女友要不要也查一下？她最近咳得比我轻，但夜里也出汗。”",
    "reference_rule": {
      "condition": "结核病并发HIV感染患者",
      "action": "提供性伴健康服务（partner services）",
      "contraindication": null,
      "evidence": "应该对结核病并发HIV感染患者提供性伴健康服务（partner services）（强烈推荐，证据信度中等）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于行政与伦理场景。作为管理者，我的关注重点是确保流程合规性（如传染病报告要求）、文书完整性（完成强制报告卡）、伦理告知（涉及患者隐私和知情同意）以及公共卫生责任（接触者追踪以预防疾病传播）。Step 2: 临床解码 (Clinical Decoding) - 患者为32岁男性，诊断为活动性肺结核（基于GeneXpert MTB/RIF阳性、胸片示右上肺空洞形成）并发HIV感染（CD4 168 cells/µL，提示AIDS阶段免疫抑制）。关键隐式线索包括：患者女友为密切接触者（同居4年），出现轻微咳嗽和盗汗，提示潜在结核暴露风险；患者未规律抗病毒治疗，增加传播风险；门诊提示需完成传染病报告卡，强化公共卫生干预的必要性。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition（结核病并发HIV感染患者）与患者情况完全匹配。Action（提供性伴健康服务）适用，contraindication为null，无禁忌症。安全检查：无急性临床禁忌（如无胸痛或紧急并发症），但需优先公共卫生安全（避免疾病在社区扩散）。Step 4: 决策生成 (Decision Making) - 根据指南action，决策为提供性伴健康服务，包括通知并筛查女友的HIV和结核；同时，完成传染病报告卡以履行公共卫生责任。",
    "medical_order": "诊断：活动性肺结核（利福平敏感型），HIV感染（CD4 168 cells/µL）。予标准抗结核治疗（如HRZE方案），启动抗逆转录病毒治疗（ART）。完善传染病报告卡上报。提供性伴健康服务：安排女友进行HIV抗体检测及结核筛查（包括胸片和GeneXpert MTB/RIF检测）。建议患者居家隔离至痰涂片阴性，并随访CD4及病毒载量。",
    "patient_dialogue": "好的，我们来看看您的情况。首先，您查出有结核病和HIV感染，这需要马上开始吃药治疗——我们会给您开结核的药和HIV的药，帮您控制病情。关于您女友的问题，您问得很对！她确实需要尽快检查一下，因为结核病很容易传染给一起生活的人，尤其是她最近也有咳嗽和出汗的症状。如果不查，可能会耽误治疗，甚至传染给更多人。我们会帮她安排免费的HIV和结核检查，确保她安全。另外，您自己在家要注意隔离，比如戴口罩、不和别人共用餐具，这样能保护家人。别担心，我们一起处理，报告的事我这边会办妥，您专心养病。有什么问题随时问我！"
  },
  {
    "id": 1788,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者24岁，男性，身高175 cm，体重58 kg，BMI 18.9 kg/m²。主诉咳嗽伴低热6周，近2周出现夜间盗汗与明显乏力。胸片示右上肺空洞性病变；痰GeneXpert MTB/RIF阳性，利福平敏感。HIV初筛及确证试验均阳性，CD4 210 cells/µL，VL 85 000 copies/mL。血常规：Hb 108 g/L，WBC 4.1×10⁹/L，PLT 170×10⁹/L；ALT 28 U/L，Cr 76 µmol/L。既往史无慢性肝肾疾病，无癫痫或精神疾病。患者为外卖骑手，每日骑行约8小时，担心长期请假收入骤减；同时自述“听说抗艾滋药和结核药一起吃伤肝”，对同时启动ART存在顾虑。今日为抗结核治疗第3天（HRZE方案），门诊需决定ART启动时机。",
    "reference_rule": {
      "condition": "PLHIV人群（成人和青少年，发生脑膜炎典型症状的情况除外）",
      "action": "在抗结核治疗启动2周内尽快启动ART，无论CD4+T淋巴细胞计数如何",
      "contraindication": null,
      "evidence": "PLHIV人群应在抗结核治疗启动2周内尽快启动ART，无论CD4+T淋巴细胞计数如何。适用人群：成人和青少年（发生脑膜炎典型症状的情况除外）（强烈推荐，证据信度低到中等）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，重点关注HIV与肺结核共病的管理。作为专科专家，我的核心关注点是全网扫描药物相互作用、禁忌症及共病风险，优先级为安全优先于疗效。特别需要评估ART与HRZE方案的潜在冲突，并确保治疗决策基于患者个体化因素，如肝功能和职业影响。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者为24岁男性，诊断为活动性肺结核（痰GeneXpert MTB/RIF阳性，利福平敏感，胸片示右上肺空洞性病变）合并HIV感染（CD4 210 cells/µL，VL 85 000 copies/mL）。BMI 18.9 kg/m²提示营养风险；Hb 108 g/L表示轻度贫血；ALT和Cr正常，无肝肾疾病史。隐式线索：职业因素（外卖骑手每日骑行8小时）可能导致治疗依从性差和疲劳加剧；患者顾虑肝毒性源于药物相互作用谣言；当前抗结核治疗第3天（HRZE方案）需及时干预HIV以预防机会性感染。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition适用于PLHIV人群（成人和青少年，无脑膜炎症状），患者完全匹配。Action要求在抗结核治疗启动2周内尽快启动ART，无论CD4计数。Contraindication为null，无绝对禁忌。安全检查：HRZE中的利福平是强CYP3A4诱导剂，可能降低某些ART药物（如基于蛋白酶抑制剂的方案）浓度，需优先选择兼容方案（如整合酶抑制剂为基础）。患者肝功能正常（ALT 28 U/L），无癫痫史，但需监测免疫重建炎性综合征（IRIS）风险。社会因素（收入担忧和肝毒性恐惧）需纳入安全考量，以避免治疗中断。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action，立即启动ART，具体方案为整合酶抑制剂为基础的组合（如Bictegravir/Emtricitabine/Tenofovir alafenamide），以规避利福平相互作用。安全优先：加强肝功能和血常规监测，提供营养支持，并安排紧密随访以管理IRIS风险。",
    "medical_order": "予启动抗逆转录病毒治疗（ART），方案为Bictegravir/Emtricitabine/Tenofovir alafenamide 50mg/200mg/25mg 每日一次口服。继续抗结核治疗（HRZE方案）。监测肝功能（ALT、AST）、全血计数及CD4+ T细胞计数每2周一次；评估营养状况，必要时予营养支持。门诊随访1周后复诊，观察免疫重建炎性综合征（IRIS）征象。教育患者药物相互作用风险及依从性重要性。",
    "patient_dialogue": "小伙子，你好！我完全理解你的担心——既要治结核，又要对付艾滋，还怕药物伤肝，对吧？别紧张，听我慢慢说。首先，你的结核药已经用了几天，效果不错，但艾滋病毒也得赶紧控制，不然身体会更弱。我给你选的艾滋药是专门和结核药搭配的，安全系数高，我们会定期帮你查肝功能，就像给汽车做保养一样，确保一切正常。我知道你天天送外卖，挣钱不容易，但健康是根本。坚持治疗几周，你就能恢复体力，早点回到工作中。记住，有任何不舒服，比如恶心或疲劳加重，马上联系我，咱们一起解决。加油，你能行！"
  },
  {
    "id": 1761,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者34岁，男性，保安，夜班频繁。因“咳嗽4周、午后低热、盗汗明显”收入感染科。CD4 82 cells/μL，HIV-RNA 5.3 log10 copies/mL，已启动复方新诺唑预防。胸片：右上肺斑片影伴空洞。今日查房，患者仍诉活动后气促，指脉氧92%。凌晨护士记录：体温38.2℃，痰涂片抗酸染色阴性。患者还提到左踝扭伤疼痛，但无红肿。目前未开始抗结核治疗，等待进一步病原学依据。",
    "reference_rule": {
      "condition": "在住院患者中，HIV阳性成人、青少年及儿童，出现结核病（肺结核/肺外结核）的典型表征和症状",
      "action": "采用侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）作为活动性结核病的辅助诊断",
      "contraindication": null,
      "evidence": "在住院患者中，对于符合下列情况的HIV阳性成人、青少年及儿童，WHO强烈推荐采用侧流尿脂阿拉伯甘露聚糖测定法（lateral flow lipoarabinomannan assay, LF-LAM）作为活动性结核病的辅助诊断：1.  出现结核病（肺结核/肺外结核）的典型表征和症状（强烈推荐，就干预的效果而言，证据信度中等）。2.  发展成重症AIDS或病情加重（强烈推荐，就干预的效果而言，证据信度中等）。3.  无论是否发生结核病典型体征和症状，CD4+T淋巴细胞计数<200个/µl（强烈推荐，就干预的效果而言，证据信度中等）。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于常规诊断与治疗场景。作为急诊/门诊医生，需快速聚焦三大核心：1) 排除危急重症（如结核播散或合并感染）；2) 基于典型症状和免疫抑制状态推进结核诊断；3) 优先处理低氧和发热症状。",
      "Step 2: 临床解码": {
        "关键医学转化": [
          "CD4 82 cells/μL + HIV高载量 → 重度免疫抑制",
          "午后低热+盗汗+空洞性病变 → 活动性肺结核高度可疑",
          "痰涂片阴性但影像学阳性 → HIV相关结核常见假阴性",
          "指脉氧92%活动后气促 → I型呼吸衰竭早期表现",
          "左踝痛无红肿 → 需警惕结核性关节炎（肺外播散可能）"
        ],
        "隐性风险": "仅用复方新诺唑预防不足覆盖：1) 结核未治疗；2) PCP预防量≠治疗量；3) CD4<100需强化机会感染防控。"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "完全符合WHO强烈推荐LF-LAM的三大指征：1) 结核典型症状+影像学证据；2) CD4<200；3) 住院重症AIDS患者",
        "禁忌症检查": "LF-LAM为无创尿检，无绝对禁忌（指南contraindication=null）",
        "安全预警": "延迟抗结核治疗可能导致空洞破裂播散，需48小时内决策"
      },
      "Step 4: 决策生成": "立即执行LF-LAM检测，同步启动保护性呼吸道隔离；若LF-LAM阳性/临床高度怀疑，无需等待培养直接上抗结核治疗；同时排查PCP等合并感染。"
    },
    "medical_order": "1. 即刻送检尿标本行LF-LAM检测\n2. 予持续低流量吸氧（2L/min），目标SpO2≥95%\n3. 呼吸道隔离（单间病房，N95防护）\n4. 完善以下检查：\n   - 痰Xpert MTB/RIF Ultra×3份\n   - 血清ADA、G试验\n   - 下肢关节超声（左踝）\n5. 若LF-LAM阳性或明晨仍发热，启动抗结核四联治疗（HRZE方案）\n6. 停复方新诺唑预防，改为治疗剂量（TMP 15mg/kg/d）覆盖PCP可能\n7. 每4小时监测生命体征及SpO2",
    "patient_dialogue": "（拉椅子坐下，语气温和但坚定）王师傅，您这咳嗽发烧拖得有点久了，咱们得抓紧查清楚。肺上那个阴影需要重点排查结核，今天要加个新检查——留点尿液就能做，比抽血轻松多了，结果出来快的很。（稍停顿）\n\n（指监护仪）您现在活动后喘得厉害，血氧偏低，护士马上给您戴个吸氧管，就像平时抽烟那样吸气就行，能舒服不少。为了安全得换个单间，家属探视要穿防护服，不是您传染性强，是您现在免疫力太低要防着别人带病菌进来。\n\n（起身检查脚踝）脚扭伤的地方我按着疼吗？骨头应该没事，但咱们也做个超声看看里头有没有问题。（递温水）今明两天最关键，检查结果一出我马上来跟您细说方案，您躺着少走动，有事随时按铃！"
  },
  {
    "id": 1774,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者因'咳嗽3周、高热伴盗汗2日'由急诊收住感染科。入院查体：T 39.2 ℃，HR 118 次/分，RR 26 次/分，SpO₂ 92%（鼻导管4 L/min）。体型消瘦，BMI 17.8 kg/m²，颈、腋、腹股沟可触及多枚1–2 cm质韧淋巴结，右下肺叩诊浊音、呼吸音减弱。实验室：CD4⁺ 38 cells/μL，HIV RNA 4.7 log₁₀ copies/mL；Hb 89 g/L，CRP 142 mg/L，PCT 0.9 ng/mL；随机血糖7.8 mmol/L。胸片示右下肺大片实变伴空洞；当日痰涂片抗酸染色阴性。患者诉近2个月体重下降10 kg，偶有血痰，否认吸烟史，但自述近期在建筑工地打零工，常暴露粉尘。住院后已予经验性头孢曲松+阿奇霉素抗细菌治疗，仍持续高热。病房护士报告今晨患者突发轻度意识模糊，GCS 14（E4 V4 M6）。",
    "reference_rule": {
      "condition": "在住院患者中，HIV阳性成人、青少年及儿童，发展成重症AIDS或病情加重",
      "action": "采用侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）作为活动性结核病的辅助诊断",
      "contraindication": null,
      "evidence": "在住院患者中，对于符合下列情况的HIV阳性成人、青少年及儿童，WHO强烈推荐采用侧流尿脂阿拉伯甘露聚糖测定法（lateral flow lipoarabinomannan assay, LF-LAM）作为活动性结核病的辅助诊断：1.  出现结核病（肺结核/肺外结核）的典型表征和症状（强烈推荐，就干预的效果而言，证据信度中等）。2.  发展成重症AIDS或病情加重（强烈推荐，就干预的效果而言，证据信度中等）。3.  无论是否发生结核病典型体征和症状，CD4+T淋巴细胞计数<200个/µl（强烈推荐，就干预的效果而言，证据信度中等）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及HIV/AIDS重症患者合并肺部感染及新发神经系统症状。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险（如免疫抑制、结核病、贫血等），并优先确保治疗安全性（安全 > 疗效）。Step 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者为HIV阳性（CD4⁺ 38 cells/μL，HIV RNA 4.7 log₁₀ copies/mL），诊断为重症AIDS；出现结核病典型症状（如咳嗽3周、高热伴盗汗、体重下降10 kg、血痰、肺部实变伴空洞），尽管痰涂片抗酸染色阴性，但提示肺结核可能；当前细菌感染治疗无效（头孢曲松+阿奇霉素后持续高热）；新发意识模糊（GCS 14）提示病情加重，可能源于感染扩散、代谢紊乱或药物不良反应；其他风险包括营养不良（BMI 17.8 kg/m²）、贫血（Hb 89 g/L）、炎症标志物升高（CRP 142 mg/L, PCT 0.9 ng/mL），以及粉尘暴露史（可能增加机会性感染风险）。关键医学术语：严重免疫抑制、空洞性肺炎、意识障碍、治疗失败。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 将解码信息与指南 Condition 匹配：患者为住院HIV阳性成人，CD4⁺ <200 cells/μL（38 cells/μL），出现结核病表征（咳嗽、高热、盗汗、肺部空洞），且病情加重（持续高热及新意识模糊），符合WHO推荐使用LF-LAM作为活动性结核病辅助诊断的强适应症。检查 Contraindication：指南中无禁忌（null），因此LF-LAM检测安全无风险。Step 4: 决策生成 (Decision Making) - 基于指南 Action，核心决策是采用侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）辅助诊断结核病。同时，作为复杂合并症专家，需全网扫描风险：评估意识模糊原因（排除低血糖、电解质紊乱或败血症），监测药物相互作用（如头孢曲松/Azithromycin可能掩盖结核症状），并优先安全考虑（避免延误结核治疗）。最终决策：立即实施LF-LAM检测，并并行评估意识模糊以排除其他急症。",
    "medical_order": "予一级护理，持续监测生命体征（体温、心率、呼吸、SpO₂）及意识状态（GCS）。立即开立侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）检测，以辅助诊断活动性结核病。完善相关检查：急查血常规、血糖、电解质（包括钠、钾）、血培养、动脉血气分析，评估意识模糊原因；复查痰涂片抗酸染色、痰培养及胸部CT（增强）。暂停当前头孢曲松+阿奇霉素治疗，考虑经验性抗结核治疗启动（如异烟肼+利福平+吡嗪酰胺+乙胺丁醇），待LF-LAM结果回报后调整。加强支持治疗：氧疗维持SpO₂>95%，营养支持（予高热量肠内营养），监测出入量。",
    "patient_dialogue": "您好，我是您的医生。您现在的发烧、咳嗽和迷糊情况，我们都很重视。您免疫系统比较弱，这可能是结核病在捣乱——结核病就像一种细菌感染，会导致肺里发炎、空洞等症状。为了查清楚，我们需要做一个简单的尿检，只需要一点尿液样本就行，不痛不痒。这个检查能帮我们早点发现结核，防止病情恶化。另外，您早上有点迷糊，这可能是发烧或身体里电解质不平衡引起的，我们会抽点血检查一下，确保一切安全。我们还会调整一下药物，换成更针对性的治疗，同时给您吸氧和营养支持，帮助您恢复体力。别担心，我们会全程盯着，确保您舒服些。"
  },
  {
    "id": 1765,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者27岁，已知HIV阳性4年，近2周出现午后低热（37.8–38.2℃）、夜间盗汗、咳少量白色黏痰伴血丝，体重下降4kg。查体：消瘦，呼吸24次/分，右上肺叩诊稍浊、可闻及细湿啰音；颈部可触及2枚1.5cm质韧淋巴结，无压痛。CD4 92 cells/μL，HIV-RNA 1.8×10⁵ copies/mL。胸片示右上肺野斑片影伴空洞形成。今日空腹，留取晨尿标本待检。患者诉近期在建筑工地做搬运，尘土大、饮水少，自觉“小便有点黄”。",
    "reference_rule": {
      "condition": "在门诊患者中，HIV阳性成人、青少年和儿童，出现结核病（肺结核/肺外结核）的典型体征和症状，或重症",
      "action": "采用侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）作为活动性结核病的辅助诊断",
      "contraindication": null,
      "evidence": "在门诊患者中，对于符合下列情况的HIV阳性成人、青少年和儿童，WHO推荐采用LF-LAM作为活动性结核病的辅助诊断：1.  出现结核病（肺结核/肺外结核）的典型体征和症状，或重症（有条件推荐，就检测准确性而言，证据信度低）。2.  无论是否发生结核病典型体征和症状，CD4+T淋巴细胞计数<100个/µl（有条件推荐，就检测准确性证据而言，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规门诊诊疗场景，患者以非急症症状就诊。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（优先排除危急重症如大咯血或脓毒症），并基于证据给出直接指令，确保高效诊断和治疗启动。\n\nStep 2: 临床解码 (Clinical Decoding): 患者症状（午后低热、夜间盗汗、咳白色黏痰伴血丝、体重下降）和体征（消瘦、呼吸增快、右上肺叩诊浊音及湿啰音、颈部淋巴结肿大）强烈提示活动性肺结核（肺结核）。胸片显示右上肺斑片影伴空洞形成是典型结核表现。CD4 92 cells/μL（<100）表明严重免疫抑制，HIV-RNA高载量提示HIV控制不佳。隐式线索包括尘土暴露（增加呼吸道感染风险）和饮水少致小便黄（可能轻度脱水，但无尿路感染迹象）。鉴别诊断需排除其他机会性感染（如肺炎或真菌感染），但无危急重症证据（如咯血量大或呼吸困难恶化）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 该病例完美匹配指南条件：门诊HIV阳性成人，出现结核典型症状（低热、盗汗、咳嗽带血、体重下降），且CD4<100 cells/μL。指南推荐使用LF-LAM作为辅助诊断（有条件推荐）。强制检查禁忌症（Contraindication）为null，无安全风险。\n\nStep 4: 决策生成 (Decision Making): 根据指南Action，优先执行LF-LAM检测（尿标本已留），同时鉴于结核高度可能，立即启动经验性抗结核治疗。此外，评估HIV治疗状态，启动ART以控制免疫抑制，确保整体管理安全有效。",
    "medical_order": "诊断：疑似活动性肺结核（基于症状、体征及影像学）。予执行侧流尿脂阿拉伯甘露聚糖测定（LF-LAM）检测晨尿标本。启动经验性抗结核治疗：异烟肼 300mg qd、利福平 600mg qd、吡嗪酰胺 1500mg qd、乙胺丁醇 1200mg qd。评估HIV治疗状态，如未启动抗逆转录病毒治疗（ART），立即开始ART方案（如替诺福韦/恩曲他滨/多替拉韦）。完善痰抗酸染色、痰培养及胸部CT检查。建议住院观察或密切门诊随访，监测生命体征及药物不良反应。",
    "patient_dialogue": "你好，看到你最近有发烧、盗汗、咳嗽带点血丝的情况，还有体重减轻，这些症状很可能是因为肺结核感染，就是肺部的一种细菌感染，不是太严重但需要赶紧治疗。我们已经留了你的尿液样本，会做个快速测试来帮忙确认。同时，我会立刻给你开几种药，专门对付这种感染，防止它恶化。另外，你说在工地干活尘土大，这容易伤肺，建议工作时戴个口罩保护自己；小便黄说明你可能喝水不够，多喝点水帮助身体恢复。别担心，我们一步步来，按时吃药配合检查，很快就能好转的。"
  },
  {
    "id": 1791,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者自述近3周午后低热（37.6–38.1 °C）、盗汗明显，夜间咳嗽伴少量白色黏痰，无咯血。2天前于当地医院拍胸片示‘右肺上叶斑片影伴空洞’，痰涂片抗酸染色阴性。既往史：2019年确诊HIV感染，目前服用替诺福韦/拉米夫定/多替拉韦（TDF/3TC/DTG）方案，ART依从性>95%；无糖尿病、无慢性肾病。实验室：CD4 110/μL，HIV-RLA <40 cp/mL；随机血糖5.8 mmol/L，肌酐76 μmol/L，eGFR 102 mL/min；ALT 28 U/L。患者担心‘皮试会不会因为HIV低CD4不准’，今日门诊旨在明确结核感染状态并决定后续预防或治疗方案。诊室空调刚维修，屋内稍显闷热，患者进门时轻微气喘，自称‘爬两层楼就这样’。无药物过敏史，不吸烟，偶尔周末饮啤酒1–2听，职业为外卖骑手，担心检查耽误工作。",
    "reference_rule": {
      "condition": "结核分枝杆菌感染检测",
      "action": "采用结核分枝杆菌抗原皮肤试验（TBST）",
      "contraindication": null,
      "evidence": "结核分枝杆菌抗原皮肤试验（TBST）可以被用于结核分枝杆菌感染检测（有条件推荐，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，患者存在HIV感染（免疫抑制状态）与疑似结核感染的合并症。作为专科专家，我的关注重点是进行全网扫描，优先检查药物相互作用、禁忌症及共病风险，确保安全第一（安全 > 疗效）。Step 2: 临床解码 (Clinical Decoding): 从病例中提取关键信息：患者表现为午后低热（37.6–38.1°C）、盗汗、夜间咳嗽伴少量白色黏痰及活动后轻微气喘（提示呼吸功能下降），胸片显示右肺上叶斑片影伴空洞（高度怀疑肺结核空洞形成），但痰涂片抗酸染色阴性（不排除免疫低下导致的假阴性）。HIV感染史中，CD4计数110/μL（严重免疫抑制），ART方案替诺福韦/拉米夫定/多替拉韦（TDF/3TC/DTG）依从性良好，病毒抑制（HIV-RNA <40 cp/mL）。实验室指标正常（eGFR、ALT、血糖），无其他并发症。隐式线索包括：患者对结核皮肤测试（TBST）准确性的担忧（因低CD4可能导致假阴性），职业为外卖骑手（提示工作压力影响随访），以及轻微气喘（可能反映肺部病变进展）。这转化为医学术语：免疫缺陷状态下的疑似活动性肺结核，需排除其他机会性感染。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition为'结核分枝杆菌感染检测'，与患者症状（低热、咳嗽、空洞影）高度匹配；指南Action推荐'采用结核分枝杆菌抗原皮肤试验（TBST）'，且Contraindication为null（无绝对禁忌）。强制安全检查：无药物过敏史，ART方案（TDF/3TC/DTG）与TBST无直接药物相互作用（仅为皮肤测试），但低CD4是共病风险（可能降低TBST敏感性，增加假阴性概率）。安全优先级：整体安全，但需补充其他检测以规避假阴性风险。Step 4: 决策生成 (Decision Making): 基于指南Action，决定执行TBST测试；但鉴于免疫抑制状态，同步安排分子检测（如GeneXpert MTB/RIF）以提高诊断准确性，并评估活动性结核风险以指导后续治疗。",
    "medical_order": "予结核分枝杆菌抗原皮肤试验（TBST）；完善痰GeneXpert MTB/RIF检测及痰抗酸杆菌培养；评估活动性肺结核风险；监测呼吸功能，必要时行胸部CT；ART方案维持不变，注意药物相互作用监测；安排1周后复诊，评估测试结果及症状变化。",
    "patient_dialogue": "嗨，我看您最近有低烧、出汗多，晚上还咳嗽，这些症状加上胸片上的空洞，确实让我们担心可能有结核感染。为了确认，我们打算做个皮肤测试——就是在您手臂上注射一点东西，两天后看反应。不过，您的免疫系统因为HIV有点弱，可能会让这个测试结果不太准，所以我们同时要验一下您的痰，做个更快的检查，这样结果更可靠。另外，您爬楼时有点喘气，说明肺部可能受影响，得密切关注。检查不会花太多时间，我们会尽量安排在工作间隙，您放心，结果出来后我们下周再聊下一步。别担心，咱们一步步来，先把这事搞清楚。"
  },
  {
    "id": 1771,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者阿卜杜勒，37岁，体重58kg，因“咳嗽5周、夜间盗汗、近10天痰中带血丝”由HIV专科转诊至结核病门诊。既往史：2019年确诊HIV-1感染，基线CD4 132/μL，目前规律服用TDF/3TC/DTG，病毒载量<50 copies/mL；无糖尿病、无肝炎。胸片：右上肺空洞性病变，GeneXpert MTB/RIF阳性（RIF敏感）。实验室：ALT 38 U/L，血肌酐0.9 mg/dL，血小板195×10⁹/L。患者询问：“我听说HIV阳性的人吃TB药时间可以短一点，是真的吗？”同时抱怨“最近天气闷热，走两层楼就喘”，并出示一份网络文章，称“HIV合并结核只需4个月疗程”。",
    "reference_rule": {
      "condition": "HIV阳性的结核病患者",
      "action": "接受至少同HIV阴性患者疗程相同的每日抗结核治疗方案",
      "contraindication": null,
      "evidence": "建议HIV阳性的结核病患者接受至少同HIV阴性患者疗程相同的每日抗结核治疗方案（强烈推荐，证据信度高）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，因为患者同时患有HIV感染（控制良好）和活动性肺结核（空洞性病变）。作为专科专家，我将重点全网扫描药物相互作用（特别是抗逆转录病毒治疗与抗结核药物之间）、禁忌症及共病风险（如免疫抑制状态可能加剧结核进展），优先级确保治疗安全性高于疗效。Step 2: 临床解码 (Clinical Decoding) - 患者阿卜杜勒，37岁，男性，体重58kg，核心症状包括咳嗽5周、夜间盗汗和痰中带血丝，结合胸片显示右上肺空洞性病变及GeneXpert MTB/RIF阳性（RIF敏感），确诊为肺结核。HIV感染史（基线CD4 132/μL，病毒载量<50 copies/mL），当前ART方案为TDF/3TC/DTG。实验室指标（ALT 38 U/L, 血肌酐0.9 mg/dL, 血小板195×10⁹/L）均正常，提示无肝、肾或血液系统急性异常。隐式线索：患者抱怨“走两层楼就喘”可能指示结核病进展（如肺功能下降或胸腔积液），HIV免疫抑制状态增加结核复发风险；ART药物（特别是DTG）与利福平存在潜在相互作用风险。患者误解（基于网络文章）认为HIV合并结核疗程可缩短至4个月，需纠正。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件“HIV阳性的结核病患者”完全匹配患者情况。Action要求接受至少同HIV阴性患者疗程相同的每日抗结核治疗方案（标准为6-9个月）。指南contraindication为null，无禁忌。安全检查：利福平（RIF）是CYP3A4诱导剂，可能降低DTG浓度（需剂量调整或监测）；当前实验室指标正常，无肝肾损害证据；呼吸困难需排除其他共病（如心衰或结核播散）。Step 4: 决策生成 (Decision Making) - 依据指南，启动标准抗结核治疗方案（利福平、异烟肼、吡嗪酰胺、乙胺丁醇），每日给药，疗程至少6个月（因空洞病变可能延长至9个月）。继续ART方案（TDF/3TC/DTG），监测药物相互作用。同时，评估呼吸困难原因（如完善影像学检查），并向患者解释疗程不能缩短的科学依据。",
    "medical_order": "诊断：1. 肺结核（空洞性，RIF敏感）。2. HIV感染（病毒学抑制）。治疗：1. 启动标准抗结核治疗：利福平450mg每日口服、异烟肼300mg每日口服、吡嗪酰胺1500mg每日口服、乙胺丁醇1200mg每日口服。2. 继续抗逆转录病毒治疗：替诺福韦/拉米夫定/多替拉韦（TDF/3TC/DTG）每日口服。监测：1. 每月复查肝功能（ALT）、肾功能（血肌酐）、CD4计数、HIV病毒载量。2. 评估药物相互作用：监测DTG浓度或临床反应，必要时调整剂量。3. 完善胸部CT扫描评估呼吸困难原因。4. 定期痰涂片及培养确认结核治疗反应。",
    "patient_dialogue": "阿卜杜勒先生，您好！我们先聊聊您的结核病治疗。您提到网上有人说HIV阳性的人吃结核药时间能缩短到4个月，这确实是个常见的误解，但我必须告诉您，这不太安全。因为您的身体同时对抗HIV和结核，缩短疗程容易让结核复发，尤其您的肺部有空洞，风险更高。专业指南都建议您和HIV阴性患者一样，至少需要6个月甚至更长的完整疗程，这样效果才可靠。\n\n关于您说的走楼梯气喘的问题，我会安排做个CT扫描，看看结核病有没有影响您的肺部功能。别担心，您的HIV药物我们会继续用，但需要定期检查肝肾功能，因为有些结核药可能和您的HIV药有点小冲突，我们会盯着这个问题。\n\n记住，坚持吃药是关键——每天按时服结核药和HIV药，别漏服。如果有任何不舒服，比如恶心或疲劳，马上告诉我。我们一起努力，确保您恢复健康！"
  },
  {
    "id": 1767,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "夜班查房，27岁女性患者，主诉“这两天只是有点累，没有咳嗽也不发烧”。查体：体温37.4℃，心率96次/分，呼吸20次/分，SpO₂ 96%（室内空气）。她7年前确诊HIV，近2年自行停药；入院当天CD4+T淋巴细胞计数180个/µl。胸片报告“两肺纹理增粗，未见明显实变”，但CRP 28mg/L、Hb 9.2g/dL。患者还合并口腔念珠菌感染，无糖尿病史。此刻她正半躺在病床上用手机点外卖，说想吃点辣的面条提提胃口。护士提醒她凌晨抽血需要空腹，她随口问：“医生，我不咳也不烧，肺也没事，为啥还要查结核？”窗外正下小雨，病房里开着暖气，她裹着外套仍觉脚冷。",
    "reference_rule": {
      "condition": "在住院患者中，HIV阳性成人、青少年及儿童，无论是否发生结核病典型体征和症状，CD4+T淋巴细胞计数<200个/µl",
      "action": "采用侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）作为活动性结核病的辅助诊断",
      "contraindication": null,
      "evidence": "在住院患者中，对于符合下列情况的HIV阳性成人、青少年及儿童，WHO强烈推荐采用侧流尿脂阿拉伯甘露聚糖测定法（lateral flow lipoarabinomannan assay, LF-LAM）作为活动性结核病的辅助诊断：1.  出现结核病（肺结核/肺外结核）的典型表征和症状（强烈推荐，就干预的效果而言，证据信度中等）。2.  发展成重症AIDS或病情加重（强烈推荐，就干预的效果而言，证据信度中等）。3.  无论是否发生结核病典型体征和症状，CD4+T淋巴细胞计数<200个/µl（强烈推荐，就干预的效果而言，证据信度中等）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)\n本案例属于复杂合并症治疗场景，患者存在HIV感染、免疫抑制（CD4+ <200/µl）、机会性感染（口腔念珠菌）及潜在贫血，涉及多重疾病交互。作为博学的专科专家，我的关注重点为全网扫描药物相互作用、禁忌症及共病风险，确保安全优先（如避免结核扩散或抗病毒药物冲突），再考虑疗效。\n\nStep 2: 临床解码 (Clinical Decoding)\n从病例中提取关键隐式线索：主诉疲劳和脚冷可能源于贫血或感染；CD4+ 180/µl（重度免疫抑制）和CRP 28mg/L（炎症标志升高）提示活动性感染风险；胸片纹理增粗但无实变，可能为早期结核或肺炎；Hb 9.2g/dL（贫血）可能与HIV慢性病相关；口腔念珠菌感染证实免疫缺陷；患者自行停药HIV治疗2年，显示依从性差，增加机会感染风险；饮食偏好（辣面条）和空腹要求需协调；患者质疑结核检查，反映对无症状结核认知不足。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)\n将解码信息与指南Condition匹配：患者HIV阳性、CD4+ <200/µl（180/µl），无论结核典型症状（如咳嗽、发热），符合WHO推荐条件。指南Contraindication为null，无禁忌。安全检查：全网扫描潜在风险—无药物相互作用（当前未用药，但重启抗病毒药时需评估与抗结核药交互）；共病风险包括贫血恶化或念珠菌扩散；优先级确保安全，避免结核漏诊导致脓毒症。\n\nStep 4: 决策生成 (Decision Making)\n根据指南Action，采用LF-LAM作为结核辅助诊断。同时，针对合并症，需紧急重启HIV治疗、处理念珠菌感染，并评估贫血。决策以安全为基：先排除结核（高优先级），再优化整体管理。",
    "medical_order": "予侧流尿脂阿拉伯甘露聚糖测定法（LF-LAM）筛查活动性结核。重启高效抗逆转录病毒治疗（HAART），依据CD4计数调整方案。予氟康唑口服治疗口腔念珠菌感染。完善贫血评估：铁代谢、维生素B12、叶酸及网织红细胞计数检测。监测生命体征 q4h，包括体温、心率、呼吸、SpO₂。安排空腹抽血查结核培养、HIV病毒载量及血常规复查。限制辛辣饮食，予营养支持。",
    "patient_dialogue": "您好，我理解您觉得不咳嗽、不发烧，肺片也没大问题，为什么还要查结核。其实，您的免疫系统因为HIV控制不好，现在非常弱，结核菌可能偷偷藏在身体里，不表现症状，但一旦爆发会很危险—就像暗藏的炸弹。这次尿检（LF-LAM）是专门针对这种情况的，简单又安全，能帮我们及早发现。另外，您脚冷和疲劳可能和贫血或感染有关，我们需要抽血检查（记得凌晨空腹哦，不能吃东西）。关于外卖，辣面条可能刺激胃口，但抽血前先忍一忍，抽完再吃。同时，我会给您开药治口腔感染，并重启HIV药物来保护免疫系统。我们一起把这些小问题解决好，好吗？"
  },
  {
    "id": 1792,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者阿卜杜勒，34岁，男性，体重58 kg，身高172 cm。主诉持续低热、夜间盗汗及咳血丝痰3周。胸片示右上肺空洞性病变，痰涂片抗酸杆菌阳性，GeneXpert MTB/RIF检测为结核分枝杆菌且对利福平敏感。今日HIV快速检测呈阳性，CD4 142 cells/µL，VL 180 000 copies/mL。既往史：6个月前因社区获得性肺炎住院，无已知慢病。实验室：ALT 38 U/L，Cr 82 µmol/L，随机血糖6.1 mmol/L。患者为货运司机，常往返邻国，自述“抽自制烟卷，每天半包；偶尔饮酒”。今日门诊护士记录体温37.9 ℃，SpO₂ 94%（室内空气），并发现患者对注射操作明显紧张。天气闷热，候诊区空调故障，患者衬衫已被汗水浸透。",
    "reference_rule": {
      "condition": "在HIV和结核病负担均严重的地区",
      "action": "1. 在结核病医疗机构启动ART; 2. 与HIV防治规划建立联系和合作机制",
      "contraindication": null,
      "evidence": "在HIV和结核病负担均严重的地区，应该在结核病医疗机构启动ART，且与HIV防治规划建立联系和合作机制（强烈推荐，证据信度非常低）。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于复杂合并症治疗场景，患者同时患有活动性肺结核（基于痰涂片抗酸杆菌阳性、GeneXpert MTB/RIF阳性及空洞性病变）和HIV感染（HIV快速检测阳性、CD4低、VL高）。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保安全性（安全 > 疗效），包括抗结核治疗与ART的潜在冲突、免疫重建炎症综合征（IRIS）风险、以及生活方式因素（如吸烟）对治疗的影响。\n\n**Step 2: 临床解码 (Clinical Decoding)**：从病例提取关键信息：患者为34岁男性，体重58 kg（BMI 19.6 kg/m²，正常），主诉持续低热（37.9 ℃）、夜间盗汗和咳血丝痰3周，确诊肺结核（利福平敏感）；HIV阳性（CD4 142 cells/µL，中度免疫抑制；VL 180 000 copies/mL，高病毒载量）。隐式线索包括：职业（货运司机频繁跨境）增加结核传播风险；吸烟（每天半包自制烟卷）和饮酒可能加重肺部疾病和药物肝毒性；对注射操作紧张提示焦虑，可能影响治疗依从性；环境因素（闷热天气、SpO₂ 94%）可能加剧不适。实验室指标（ALT正常、Cr正常、血糖正常）无急性异常，但需监测潜在毒性。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南条件（‘在HIV和结核病负担均严重的地区’）匹配，患者跨境活动暗示高风险区域。Action指示在结核病医疗机构启动ART并与HIV防治规划合作。安全检查：无禁忌症（contraindication null），但需全网扫描风险。药物相互作用：利福平（CYP3A4诱导剂）可能降低ART药物（如NNRTIs）浓度，需选择兼容方案（如DTG-based ART）。共病风险：CD4 <200增加IRIS风险（应在结核治疗2-8周内启动ART）；吸烟可能升高肝毒性和治疗失败概率；焦虑需心理支持以防依从性差。优先级：安全第一，避免过早ART引发IRIS。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南Action，决策包括：1. 在结核病医疗机构启动ART（选择DTG-based regimen确保与利福平兼容）；2. 与HIV防治规划建立合作机制（整合护理）。具体措施：先强化抗结核治疗，ART稍后启动（2-4周内）；添加生活方式干预（戒烟咨询）；监测IRIS和副作用；确保感染控制。",
    "medical_order": "诊断：1. 活动性肺结核（GeneXpert MTB/RIF阳性，利福平敏感）；2. HIV感染（CD4 142 cells/µL，VL 180 000 copies/mL）。予以下方案：\n- 抗结核治疗：启动标准一线方案（异烟肼 5 mg/kg/d + 利福平 10 mg/kg/d + 吡嗪酰胺 25 mg/kg/d + 乙胺丁醇 15 mg/kg/d），口服，密切监测肝功能及痰涂片。\n- ART启动：予TDF/3TC/DTG方案（替诺福韦 300 mg/d + 拉米夫定 300 mg/d + 多替拉韦 50 mg/d），在抗结核治疗2周后开始，避免IRIS。\n- 协作机制：立即转诊至HIV防治规划，协调随访（CD4/VL监测每3月，结核治疗完成6月）。\n- 支持性措施：一级护理，监测体温、SpO₂；予戒烟咨询；完善心理评估（缓解注射焦虑）；避免酒精摄入。\n- 实验室复查：每周ALT、Cr；每月痰抗酸杆菌涂片；ART启动后4周VL复查。",
    "patient_dialogue": "阿卜杜勒先生，您好，我理解您现在可能有点紧张和不舒服，特别是刚才打针时您显得很焦虑，这很正常，我们会慢慢解释清楚。检查结果显示您有两个问题需要一起治疗：一个是肺结核，就是肺部的感染，这会让您一直低烧、出汗和咳嗽带血；另一个是HIV，它让您的免疫系统变弱了。如果不及时治疗，肺结核可能传染给家人，而HIV会让身体更难恢复。\n\n所以，我们计划这样帮您：第一，您需要吃药治疗肺结核——这是几种药片一起吃，杀灭病菌，防止它扩散。同时，我们会稍晚一点（大约两周后）开始HIV的治疗药，因为一起吃太早可能引起身体反应。我们会选最安全的搭配，避免副作用。第二，我们会联系专门的HIV团队来支持您，确保您得到全面照顾。第三，您抽的那个自制烟卷得尽量戒掉，因为它会伤害您的肺，让治疗效果变差——我们可以帮您找戒烟方法。第四，需要定期抽血检查，看药物有没有影响肝脏，我会安排护士轻点操作，减少您的不适。\n\n记住，按时吃药是关键！如果漏服了，病菌可能变得更难对付。我会给您详细的时间表，有任何担心或不舒服，随时告诉我，我们一起解决。您能做到的，坚持治疗会让您恢复健康。"
  },
  {
    "id": 1747,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者因“咳嗽伴低热3周”由当地VCT点转来。既往史：1年前确诊HIV感染，尚未启动ART，CD4 210 cells/μL。查体：消瘦（BMI 17.8 kg/m²），颈部可触及2枚1 cm质软淋巴结，右下肺呼吸音减弱。今日门诊抽血做基线评估，实验室回示：C反应蛋白 7 mg/L（参考<5）。患者父亲在候诊区不断询问“是不是普通感冒？能不能先吃点止咳药？”窗外暴雨导致诊所走廊积水，护士提醒地面湿滑。",
    "reference_rule": {
      "condition": "成年和未成年PLHIV人群",
      "action": "C反应蛋白≥5mg/L可以被用于筛查结核病",
      "contraindication": null,
      "evidence": "在成年和未成年PLHIV人群中，C反应蛋白≥5mg/L可以被用于筛查结核病（有条件的推荐，证据信度低）。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于常规诊断与治疗场景。我作为果断的急诊/门诊医生，关注重点在于快速建立鉴别诊断（如结核病、肺炎或其他机会性感染），排除危急重症（如结核病进展或严重免疫抑制并发症），并基于现有证据给出最直接的诊疗指令。场景中患者症状持续3周且存在HIV免疫抑制背景，需优先识别潜在威胁生命的疾病。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例中提取关键信息并转化为医学术语：患者为PLHIV（People Living with HIV），CD4计数210 cells/μL（中度免疫抑制状态），未启动ART（抗逆转录病毒治疗），增加机会性感染风险。主诉“咳嗽伴低热3周”提示慢性呼吸道感染或炎症。查体显示消瘦（BMI 17.8 kg/m²，营养不良状态）、颈部淋巴结肿大（直径1 cm，质软，可能为反应性淋巴结）和右下肺呼吸音减弱（暗示肺炎、胸膜病变或肺结核）。实验室结果显示C反应蛋白7 mg/L（高于参考值<5 mg/L，指示系统性炎症反应）。隐式线索：父亲询问普通感冒，但症状持续时间和HIV背景强烈提示非自限性感染；暴雨和走廊积水为环境干扰，不影响核心诊疗决策。综合分析，鉴别诊断优先考虑结核病（TB），其次为细菌性肺炎、肺孢子菌肺炎（PCP）或恶性肿瘤；低热和CRP升高支持感染性病因。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南规则condition为“成年和未成年PLHIV人群”，患者符合此人群（成年HIV感染者）。Action为“C反应蛋白≥5mg/L可以被用于筛查结核病”，患者CRP 7 mg/L（≥5 mg/L），因此适用于结核病筛查。Contraindication为null，表明无禁忌或安全风险。证据信度低（条件性推荐），但匹配成功，故筛查必要。安全检查：无药物相互作用或禁忌，但需确保检查及时以避免延误治疗；患者免疫抑制状态增加TB进展风险，安全优先级高。\n\n**Step 4: 决策生成 (Decision Making)**\n基于指南action，决策核心为立即筛查结核病，并排除其他危急情况。具体指令：安排胸部影像学（如X光）和痰检查以确诊TB，同时评估ART启动；若筛查阳性，转诊至专科治疗。门诊环境下，优先快速行动预防重症。",
    "medical_order": "予完善胸部X光检查、痰涂片抗酸染色和结核培养；抽血复查CD4计数和HIV病毒载量；评估启动抗逆转录病毒治疗（ART）；监测生命体征（体温、呼吸频率）；暂予对症支持治疗（如补液营养）；若影像或痰检异常，立即转诊感染科。",
    "patient_dialogue": "您好，我是医生。我理解您和您父亲的担心，咳嗽带低烧已经三周了，这确实让人焦虑。但这不是普通感冒那么简单，因为您之前有HIV感染，身体抵抗力较低，我们需要小心检查看看有没有更严重的原因，比如肺结核。您的验血结果也显示身体里有炎症，所以不能随便吃止咳药——那可能会暂时缓解症状，但耽误了找出真正病因，反而更危险。接下来，我们要给您拍个胸片，还要检查一下痰液，看看是不是肺结核引起的。同时，我们会评估是否需要开始HIV的治疗药物，帮助您恢复免疫力。请放心，我们一步步来，早点查清楚才能早点好起来。另外，外面下雨地面滑，您和父亲走路时多注意安全。"
  },
  {
    "id": 1785,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者今日由丈夫骑摩托冒雨送来，主诉“咳嗽两周、低热”，但无咯血、无盗汗。既往史：2021 年确诊 HIV，CD4 最低 180 cells/µL，三个月前开始 TDF+3TC+DTG，病毒载量已 <50 cp/mL；无结核病史。查体：T 37.6 ℃，SpO₂ 97%，肺部听诊右下肺少许湿啰音。胸片报告“右下肺纹理增粗，未见空洞”；GeneXpert MTB/RIF 痰检阴性。实验室：CD4 210 cells/µL，Hb 9.8 g/dL，ALT 22 U/L，肌酐 0.6 mg/dL，妊娠试验阳性（孕 18 周）。门诊记录显示：患者每日仍在镇上露天集市卖活禽，自述“记不清有没有把药吃满 30 天”。",
    "reference_rule": {
      "condition": "在结核病高传播地区，对于不太可能罹患活动性结核病的成年和青少年PLHIV群体，无论LTBI检测结果未知或阳性，无论是否正在接受ART治疗、免疫抑制程度、前期抗结核史及妊娠状况",
      "action": "给予为期36个月的异烟肼每日服药方案（IPT）",
      "contraindication": null,
      "evidence": "在结核病高传播地区，对于不太可能罹患活动性结核病的成年和青少年PLHIV群体，无论LTBI检测结果未知或阳性，至少应该给予为期36个月的异烟肼每日服药方案（isoniazid preventive therapy, IPT）。同时，无论是否正在接受ART治疗、免疫抑制程度、前期抗结核史及妊娠状况，都应该给予他们36个月的IPT干预（有条件推荐，就估算效果而言，证据信度低）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及HIV感染、妊娠状态、潜在肺部感染及免疫抑制。作为专科专家，我将重点关注全网扫描药物相互作用（如ART与IPT之间）、禁忌症（尤其妊娠相关）及共病风险（如贫血、呼吸道症状），严格遵循安全 > 疗效的优先级。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者为PLHIV（孕18周），CD4 210 cells/µL提示持续免疫抑制，有呼吸道症状（咳嗽两周、低热37.6℃、右下肺湿啰音），但痰检及胸片排除活动性结核；Hb 9.8 g/dL示轻度贫血，ART依从性可疑（自述未记清服药30天）；职业暴露（卖活禽）增加呼吸道感染风险；指南条件匹配（结核高传播地区、不太可能活动性TB、妊娠状态不影响决策）。隐式线索：ART依从性差可能导致病毒反弹，职业暴露或为症状诱因，贫血或源于营养不良或慢性病。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition完全适用（无活动性TB证据、无结核史、免疫抑制和妊娠不构成禁忌），Action推荐36个月IPT；但强制安全检查：异烟肼在妊娠期安全（无致畸性），但需补充维生素B6预防神经病变；ART药物（TDF+3TC+DTG）与异烟肼无显著相互作用，但需监测肝毒性（ALT正常）；共病风险包括呼吸道症状需优先排除细菌性肺炎、贫血需评估。无绝对禁忌，但需先处理急性症状以确保安全。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action，启动36个月异烟肼预防治疗（IPT）；但鉴于呼吸道症状，先排除活动性感染并优化ART依从性。决策优先级：安全处理急性症状 > 启动IPT > 管理共病。",
    "medical_order": "1. 予异烟肼300 mg每日口服，为期36个月，作为结核预防治疗（IPT）。2. 补充维生素B6 25 mg每日口服，预防周围神经病变。3. 完善痰涂片、痰培养及血培养，排除活动性结核及细菌性肺炎。4. 经验性予阿莫西林-克拉维酸625 mg口服每日三次，治疗社区获得性肺炎，疗程5天。5. 加强抗逆转录病毒治疗（ART）依从性监测：予TDF+3TC+DTG每日固定剂量复方制剂，安排每周电话随访。6. 评估贫血原因：查血清铁、铁蛋白、维生素B12及叶酸水平。7. 监测肝功能（ALT）、肾功能（肌酐）及全血计数，每2周复查。8. 建议避免职业暴露：暂停活禽售卖工作。",
    "patient_dialogue": "大姐，您先别紧张，我慢慢跟您说。您咳嗽和低烧的情况，加上您有HIV感染和怀孕18周，我们需要特别注意保护您和宝宝的健康。首先，我会给您开一种预防结核病的药，叫异烟肼，每天吃一粒，要坚持三年左右——因为您免疫力较低，这种药能大大降低感染结核的风险，对孕妇也安全。同时，我会加一个小剂量的维生素B6，防止手脚发麻的副作用。另外，您的咳嗽和低烧可能不是结核，但为安全起见，我们还要开点抗生素（阿莫西林）吃五天，看看能不能缓解症状；如果还不好，可能需要进一步检查。\n\n关于您每天吃的HIV药（TDF+3TC+DTG），一定要按时服用，千万别漏掉，这对控制病毒和免疫力恢复至关重要——我会让护士每周打电话提醒您。您卖鸡鸭的活儿，风险太高了，雨水多、禽类容易传病，建议您暂时别去市场了，或者至少戴好口罩保护自己。\n\n还有，您血有点稀（贫血），我们得查查原因，可能是缺铁或营养问题，等结果出来再处理。记住，这些药都很重要，我们一起努力，确保您平平安安生下健康宝宝。有问题随时问我，别担心！"
  },
  {
    "id": 1793,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "凌晨02:17，急诊抢救室。患者32岁，男性，体重52 kg，BMI 17.2 kg/m²，意识模糊，GCS 12分（E3V4M5）。家属代诉：近3周间断发热（最高39.8 °C）、盗汗、咳黄痰并带血丝；昨夜突然加重，咯鲜血约100 ml。既往史：2021年确诊HIV感染，自述“一直未规律服药”，CD4细胞计数最近一次（3个月前）为42 cells/µL，病毒载量>1 000 000 copies/mL；否认高血压、糖尿病。查体：T 39.4 °C，HR 128次/分，BP 94/58 mmHg，RR 28次/分，SpO₂ 88%（储氧面罩10 L/min）。口腔白斑明显，颈部可触及2枚1.5 cm质韧淋巴结。右肺上野叩诊浊音，听诊支气管呼吸音伴细湿啰音。实验室：WBC 2.1×10⁹/L，Hb 89 g/L，PLT 98×10⁹/L，CRP 187 mg/L，PCT 2.4 ng/mL，Na⁺ 129 mmol/L，ALT 78 U/L，Cr 112 µmol/L（eGFR 68 mL/min）。床旁胸片：右肺上叶大片实变伴空洞形成，直径约3.2 cm。床旁超声未见明显胸腔积液。HIV快速抗体复检阳性；GeneXpert MTB/RIF痰检结果待出。家属焦急询问：“他以前不肯吃药，现在还能不能救？” 抢救室护士提醒：患者腕带信息显示青霉素过敏（皮疹）。",
    "reference_rule": {
      "condition": "所有重症AIDS患者",
      "action": "1. 重大机会性感染的筛查; 2. 治疗和（或）预防; 3. 快速启动ART; 4. 强化治疗依从性管理服务",
      "contraindication": null,
      "evidence": "所有重症AIDS患者都应该被给予一揽子的干预措施，包含重大机会性感染的筛查、治疗和（或）预防、快速启动ART及强化治疗依从性管理服务（强烈推荐，证据信度中等）。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于复杂合并症治疗场景。患者为晚期HIV感染者（CD4 42/µL）合并急性呼吸衰竭、脓毒症休克及多系统功能障碍，需重点关注机会性感染、药物相互作用及血流动力学稳定。核心关注点：1) 致命性机会性感染的紧急覆盖 2) ART启动的时机与安全性 3) 药物过敏史处理 4) 多器官支持治疗。",
      "Step 2: 临床解码": {
        "红色警报": [
          "呼吸衰竭（SpO₂ 88% on 10L O₂, RR 28）",
          "脓毒症休克（BP 94/58, PCT 2.4, CRP 187）",
          "大咯血风险（新鲜咯血100ml+空洞病变）"
        ],
        "机会性感染线索": [
          "肺部：空洞性病变+咳血痰→结核/真菌/PCP可能",
          "免疫状态：CD4<200→PCP/隐球菌/播散性结核高风险",
          "口腔白斑：念珠菌感染标志"
        ],
        "系统损害": [
          "血液：三系减少（HIV骨髓抑制/OI消耗）",
          "肾脏：AKI（Cr 112, 低灌注/OI相关）",
          "电解质：重度低钠（129 mmol/L）"
        ],
        "关键禁忌": "青霉素过敏（需避用β-内酰胺类抗生素）"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "符合'重症AIDS患者'条件，需执行四大干预：",
        "机会性感染处理": [
          "覆盖PCP（复方新诺明）+细菌（非青霉素类）+真菌（氟康唑）",
          "结核待GeneXpert结果，但需提前准备隔离"
        ],
        "ART启动": "需24-48小时内启动，但先控制脓毒症休克",
        "安全扫描": [
          "药物相互作用：抗真菌药/抗结核药与ART的代谢冲突",
          "肾功能：调整经肾排泄药物剂量（如复方新诺明）",
          "过敏规避：禁用所有青霉素及头孢类"
        ]
      },
      "Step 4: 决策生成": {
        "优先级": "①稳定生命体征 ②经验性抗感染 ③ART启动准备",
        "抗感染策略": "三联覆盖（PCP+革兰阴性菌+真菌）+结核防控",
        "ART选择": "整合酶抑制剂为基础（如DTG），低药物相互作用",
        "依从性干预": "采用固定剂量复合制剂（1日1片）+床旁用药督导"
      }
    },
    "medical_order": "1. 重症监护：持续心电监护，每小时监测生命体征及SpO₂\n2. 呼吸支持：储氧面罩10 L/min维持SpO₂>92%，备无创通气\n3. 液体复苏：生理盐水500 mL快速输注（30 min），评估组织灌注\n4. 经验性抗感染：\n   - 复方新诺明（TMP-SMX）15-20 mg/kg/d IV 分3次（PCP覆盖）\n   - 莫西沙星400 mg IV q24h（非青霉素类革兰阴性菌覆盖）\n   - 氟康唑800 mg负荷量，后400 mg IV q24h（真菌覆盖）\n5. 结核防控：单间负压隔离，痰抗酸染色及培养，密切监测GeneXpert结果\n6. 实验室：急查动脉血气、乳酸、CD4计数、真菌抗原检测\n7. 支持治疗：\n   - 纠正低钠血症：限水<1000 mL/d，必要时3%高渗盐水\n   - 营养支持：高蛋白肠内营养液鼻饲，目标热量35 kcal/kg/d\n8. ART准备：感染控制后24小时启动比克替拉韦/恩曲他滨/丙酚替诺福韦（BIC/FTC/TAF）1片qd\n9. 会诊：感染科（ART调整）、呼吸科（支气管镜评估）",
    "patient_dialogue": "（握着家属的手，语气坚定而温和）您别慌，我们正在全力抢救。现在最紧急的是三件事：第一，他的肺部有严重感染，我们用了最强效的抗生素组合，但特意避开了他过敏的青霉素。第二，等感染稍微控制住，24小时内就会开始服用艾滋病特效药，这次选用每天只吃1片的新药，护士会每天监督服药。第三，他的营养状态很差，我们已经安排了高营养的流食，就像婴儿奶粉那样通过鼻子喂进去，这对恢复免疫力至关重要。（稍停顿）我知道他过去不愿吃药，这次我们会用便携药盒分装，您只需要提醒他按时开盒就行。现在请先去休息室，有任何变化我立刻通知您。"
  },
  {
    "id": 1789,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者34岁，男性，体重59 kg，BMI 18.4 kg/m²。主诉‘咳嗽伴低热6周，痰血3天’。既往史：2021年确诊HIV感染，未规律抗病毒治疗，最近一次CD4⁺T细胞 110/μL，病毒载量 280 000 copies/mL。胸部CT：右上肺空洞伴树芽征，GeneXpert MTB/RIF检出结核分枝杆菌且对利福平耐药；痰培养+药敏提示耐多药（异烟肼、利福平、左氧氟沙星均耐药）。肝肾功能：ALT 42 U/L，Cr 0.9 mg/dL，eGFR >90 mL/min。患者为夜班网约车司机，自述‘跑车常忘记吃饭’。今日就诊目的是制定二线抗结核方案并评估是否需同时启动ART。无其他合并症，青霉素过敏。",
    "reference_rule": {
      "condition": "HIV感染并发耐药结核病患者，需要二线抗结核药物治疗",
      "action": "在抗结核治疗开启后尽早（在抗结核治疗启动后8周内）启动ART，无论CD4+T淋巴细胞计数如何",
      "contraindication": null,
      "evidence": "对所有需要二线抗结核药物治疗的HIV感染并发耐药结核病患者，无论CD4+T淋巴细胞计数如何，应该在抗结核治疗开启后尽早（在抗结核治疗启动后8周内）启动ART（强烈推荐，证据信度非常低）。"
    },
    "thought": "本案例属于复杂合并症治疗场景（涉及HIV感染并发耐多药结核病），作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保安全性再考虑疗效。\n- **Step 1: 场景定义 (Scenario Definition)**：患者为HIV感染并发耐多药结核病（MDR-TB），需二线抗结核药物治疗。此场景要求我全面评估药物相互作用（如抗结核药与ART的潜在冲突）、禁忌症（青霉素过敏）及共病风险（免疫抑制、营养不良）。\n- **Step 2: 临床解码 (Clinical Decoding)**：患者主诉‘咳嗽伴低热6周，痰血3天’提示活动性肺结核；HIV病史（CD4⁺T细胞110/μL、病毒载量280 000 copies/mL）表明重度免疫抑制；胸部CT和GeneXpert显示右上肺空洞及耐利福平结核；痰培养证实耐多药（异烟肼、利福平、左氧氟沙星耐药），需二线抗结核方案。隐式线索包括体重不足（BMI 18.4 kg/m²）、职业因素（夜班网约车司机，忘记吃饭）暗示营养不良风险和依从性问题；肝功能轻度异常（ALT 42 U/L）需警惕药物肝毒性；青霉素过敏须避免β-内酰胺类抗生素。\n- **Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南条件‘HIV感染并发耐药结核病患者，需要二线抗结核药物治疗’完全匹配病例；禁忌症为null，无强制排除。但安全检查识别风险：药物相互作用（如二线抗结核药中的注射剂可能影响ART药物代谢，需选择低相互作用ART方案）；禁忌症（青霉素过敏，所有方案中排除相关药物）；共病风险（免疫抑制增加机会感染风险，营养不良和肝功能异常可能加剧药物毒性）。优先级：安全第一，避免肝毒性和依从性失败。\n- **Step 4: 决策生成 (Decision Making)**：根据指南Action，在启动二线抗结核治疗后8周内启动ART。具体决策：立即制定个体化二线抗结核方案（基于药敏结果，避开耐药药物）；选择兼容的ART方案（优先整合酶抑制剂以减少相互作用）；加入营养支持和监测计划，确保安全性和疗效。",
    "medical_order": "1. 启动二线抗结核治疗：予阿米卡星肌注（剂量按体重调整）、乙硫异烟胺口服、环丝氨酸口服、吡嗪酰胺口服、贝达喹啉口服；根据药敏结果调整方案，避开耐药药物（异烟肼、利福平、左氧氟沙星）。2. 启动抗逆转录病毒治疗（ART）：予多替拉韦/替诺福韦/拉米夫定每日一次口服，在抗结核治疗启动后2-4周内进行。3. 监测计划：每周检测肝功能（ALT、AST）、肾功能（Cr、eGFR）；每月检测CD4⁺T细胞计数和HIV病毒载量；密切观察药物不良反应（如肝毒性、骨髓抑制）。4. 营养支持：予高热量高蛋白饮食建议，必要时转诊营养科评估；监测体重和BMI变化。5. 避免青霉素及衍生物，记录药物过敏史。",
    "patient_dialogue": "张先生，您的情况我清楚了：您咳嗽带血和低热已经几周了，检查发现是肺结核，而且这种结核对常用药物不太敏感，需要用一些更强效的药来对付。另外，您的HIV感染也需要尽快开始治疗。这样，我们一起制定个计划：我会给您开一组专门的结核药，每天按时服用；同时，在开始结核药后的几周内，我们会加上HIV药，这样可以双管齐下，更好地控制两个病。我知道您开夜班车忙，有时顾不上吃饭，但吃药和营养特别重要——身体强壮了，药物才能发挥作用，不然容易有副作用。咱们安排护士教您怎么记住吃药，再聊聊饮食加营养补充剂的事，好吗？别担心，我们会一步步来，您只要配合，康复希望很大。"
  },
  {
    "id": 1780,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "今日凌晨被邻居送来急诊：高热 39.8 ℃、寒战明显，呼吸 32 次/分，指尖 SpO₂ 87% 吸空气。查体可见弥漫性针尖样丘疹，压之不退色；双肺散在细湿啰音；肝肋下 2 cm、质韧、轻叩痛；颈部、腋窝可触及多枚 1–1.5 cm 淋巴结，质中偏软。血常规：WBC 3.1×10⁹/L，Hb 92 g/L，PLT 68×10⁹/L；CRP 142 mg/L；降钙素原 1.8 ng/mL；ALT 102 U/L，TBil 28 μmol/L。胸片提示双肺弥漫性 1–2 mm 粟粒样小结节，分布均匀；床旁超声见肝脾轻度增大，未见局灶性病变。患者自述近两周体重骤降 6 kg，夜间盗汗严重，伴阵发性干咳，无痰。职业：夜班出租车司机，昨日仍出车 12 小时。家属补充：患者 3 天前曾自行服用对乙酰氨基酚退热，效果差，未就诊。无已知结核接触史，但同住 5 人中有 1 人近月咳嗽。无磺胺过敏史，目前未用任何抗感染药物。",
    "reference_rule": {
      "condition": "在出现血行播散性肺结核典型症状的HIV阳性成人和儿童中",
      "action": "GeneXpert MTB/RIF 可以作为初始诊断工具，在血液中检测结核分枝杆菌",
      "contraindication": null,
      "evidence": "在出现血行播散性肺结核典型症状的HIV阳性成人和儿童中，GeneXpert MTB/RIF 可以作为初始诊断工具，在血液中检测结核分枝杆菌（有条件的推荐，证据信度非常低）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，输入Context明确指定为'复杂合并症治疗'。作为专科专家，我的关注重点是全网扫描检查药物相互作用、禁忌症及共病风险。优先级：安全 > 疗效，需覆盖潜在药物毒性、感染源交互和全身系统影响。\n\nStep 2: 临床解码 (Clinical Decoding): 从病例提取关键信息并转化为医学术语：患者表现为急性发热综合征（高热39.8℃、寒战），呼吸衰竭风险（呼吸32次/分、SpO₂ 87%），皮肤瘀点（弥漫性针尖样丘疹压之不退色提示出血倾向）。肺部体征（双肺细湿啰音）和影像学（双肺弥漫性粟粒样结节）支持血行播散性感染，结合体重骤降（6kg）、盗汗、干咳和淋巴结肝脾肿大（肝肋下2cm、质韧、轻叩痛），高度提示血行播散性肺结核（miliary TB）。实验室示脓毒症征象（WBC 3.1×10⁹/L示白细胞减少、CRP 142 mg/L、降钙素原1.8 ng/mL升高），贫血（Hb 92 g/L）、血小板减少（PLT 68×10⁹/L）和肝损伤（ALT 102 U/L、TBil 28 μmol/L）。隐式线索：职业疲劳（夜班司机）可能削弱免疫力；同住者咳嗽提示潜在结核暴露；近期对乙酰氨基酚使用无效示感染顽固；HIV状态未知但需排查，因粟粒样结节是HIV相关结核常见表现。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 将解码信息与指南Condition'在出现血行播散性肺结核典型症状的HIV阳性成人和儿童中'匹配。患者症状和影像学高度符合血行播散性肺结核典型表现（粟粒结节、盗汗、体重下降）。但HIV状态未明，需强制检查是否阳性以适用指南。指南Contraindication为null，无绝对禁忌。安全检查：患者有肝损伤（ALT升高），若使用抗结核药物（如利福平）需监测肝毒性；曾用对乙酰氨基酚但无过敏史，无药物相互作用风险；血小板减少增加出血风险，避免侵入操作；需排除其他共病如细菌性败血症（降钙素原升高）。优先级安全：生命支持优先于确诊测试。\n\nStep 4: 决策生成 (Decision Making): 根据指南Action'GeneXpert MTB/RIF 可以作为初始诊断工具，在血液中检测结核分枝杆菌'，决策为在确认HIV状态后，进行GeneXpert MTB/RIF血液检测作为初始诊断。但鉴于患者病情危急（低氧血症、脓毒症征象），需并行紧急支持治疗和经验性抗感染覆盖，包括氧疗、广谱抗生素和抗结核药物启动，同时完善HIV检测。",
    "medical_order": "1. 予一级护理，持续监测生命体征、SpO₂及意识状态。2. 吸氧，目标SpO₂ >92%，必要时升级至高流量鼻导管氧疗。3. 完善GeneXpert MTB/RIF检测于血液标本，作为结核分枝杆菌初始诊断工具。4. 启动经验性抗感染治疗：静脉广谱抗生素（如哌拉西林他唑巴坦 4.5g q8h）覆盖细菌性脓毒症；同步启动抗结核四联疗法（异烟肼 5mg/kg/d、利福平 10mg/kg/d、吡嗪酰胺 25mg/kg/d、乙胺丁醇 15mg/kg/d），注意肝功能监测（每48小时复查ALT、TBil）。5. 完善HIV抗体快速检测、血培养、痰抗酸染色及培养、胸CT平扫评估粟粒结节分布。6. 急查凝血功能、电解质及肾功能，评估出血风险及水电解质平衡。7. 暂禁食，予静脉补液支持，维持出入量平衡。",
    "patient_dialogue": "先生/女士，您现在的情况比较危险，高烧不退，呼吸也特别快，血氧很低，我们得马上给您吸氧和用药控制感染。这可能是结核病扩散到全身引起的，但也可能有其他细菌感染。我们会抽血做个快速检测来查结核菌，同时给您打上抗生素和抗结核药双管齐下——这样能更快控制病情，保护您的肺和肝。您的肝指标有点高，用药时我们会盯紧，避免伤肝。另外，需要测一下您有没有感染HIV病毒，因为这对治疗很关键。别担心，护士会全程守着您，有任何不舒服立刻说。"
  },
  {
    "id": 1783,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者昨夜再次出现38.7 °C弛张热，伴盗汗及干咳，SpO₂ 92%（室内空气）。入院时胸片示双上肺弥漫性小结节伴纵隔淋巴结肿大；昨日CT见多发1–1.5 cm中心低密度淋巴结。支气管镜活检病理报“巨噬细胞内卵圆形酵母样孢子，PAS+”，血隐球菌抗原(-)，β-D-葡聚糖 298 pg/mL；痰GeneXpert MTB/RIF阳性，rpoB无突变。血常规：Hb 89 g/L，WBC 4.1×10⁹/L，N 68%；肌酐 92 µmol/L，ALT 46 U/L。患者自诉体重近6周下降9 kg，夜间需额外盖两床棉被仍感寒冷。无吸烟史，饲养信鸽10余只。主管医生查房时讨论：同时存在播散性组织胞浆菌病与药物敏感结核，下一步如何启动抗结核治疗并兼顾二病共存及ART方案相互作用。",
    "reference_rule": {
      "condition": "同时患结核病和组织胞浆菌病的PLHIV人群",
      "action": "遵循WHO相关治疗指南开展抗结核治疗",
      "contraindication": null,
      "evidence": "同时患结核病和组织胞浆菌病的PLHIV人群应遵循WHO相关治疗指南开展抗结核治疗（有条件推荐，证据信度非常低）。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于复杂合并症治疗场景。作为专科专家，需全网扫描药物相互作用、共病风险及治疗优先级，核心原则：安全 > 疗效。重点关注抗结核治疗与抗真菌治疗的协同性、ART方案调整及免疫抑制下的感染控制。",
      "Step 2: 临床解码": {
        "关键病理": [
          "确诊药物敏感肺结核（痰GeneXpert阳性，rpoB无突变）",
          "确诊播散性组织胞浆菌病（活检见酵母样孢子，PAS+，伴纵隔低密度淋巴结及β-D-葡聚糖升高）",
          "PLHIV状态（指南指定人群）"
        ],
        "风险信号": [
          "免疫抑制三联征：弛张热+盗汗+6周体重降9kg",
          "呼吸功能受损（SpO₂ 92%，干咳）",
          "鸟粪暴露史（信鸽饲养）是组织胞浆菌病复发隐患",
          "贫血（Hb 89 g/L）增加治疗耐受风险"
        ]
      },
      "Step 3: 规则对齐与安全检查": {
        "指南对齐": "符合WHO对'PLHIV合并TB/组织胞浆菌病'的推荐：优先启动抗结核治疗（有条件推荐）",
        "禁忌筛查": [
          "利福平 vs 伊曲康唑：禁忌（强CYP3A4诱导剂降低抗真菌浓度）",
          "两性霉素B vs 氨基糖苷类：未使用，肾毒性风险可控（肌酐92正常）",
          "ART相互作用：利福平显著降低整合酶/蛋白酶抑制剂浓度"
        ],
        "安全警报": [
          "IRIS风险：ART+抗感染治疗可能诱发炎症风暴",
          "肝功能预警：抗结核药+唑类抗真菌叠加肝损（ALT已46 U/L）"
        ]
      },
      "Step 4: 决策生成": {
        "治疗框架": "分阶控制：先抑菌后杀菌，全程覆盖免疫重建",
        "关键调整": [
          "抗结核核心：用利福布汀替代利福平（避免抗真菌药相互作用）",
          "抗真菌序贯：脂质体两性霉素B诱导→伊曲康唑维持（诱导期避开唑类）",
          "ART优化：选用多替拉韦（bid剂量）+TDF/FTC（与利福布汀兼容）"
        ]
      }
    },
    "medical_order": "1. 诊断：\n   - 药物敏感肺结核（A15.0）\n   - 播散性组织胞浆菌病（B39.4）\n   - HIV感染（B20）\n   - 中度贫血（D64.9）\n2. 治疗：\n   - 抗结核：利福布汀 150 mg qd + 异烟肼 300 mg qd + 吡嗪酰胺 25 mg/kg/d + 乙胺丁醇 15 mg/kg/d\n   - 抗真菌：\n     * 诱导期：脂质体两性霉素B 3 mg/kg/d IV ×14日\n     * 维持期：伊曲康唑 200 mg bid po（诱导结束后启动）\n   - ART：多替拉韦 50 mg bid + 替诺福韦/恩曲他滨 300/200 mg qd（抗结核治疗2周后启动）\n3. 支持治疗：\n   - 氧疗：鼻导管2 L/min（维持SpO₂ >95%）\n   - 贫血纠正：蔗糖铁 200 mg IV 每周3次\n   - 营养支持：高热量高蛋白饮食（≥35 kcal/kg/d）\n4. 监测：\n   - 每日：体温、SpO₂、出入量\n   - 隔日：血常规、肝肾功（重点关注ALT、肌酐）\n   - 每周：痰抗酸杆菌涂片、真菌培养\n5. 隔离：呼吸道隔离至痰涂片转阴",
    "patient_dialogue": "王先生，咱们现在要打一场'组合拳'了。您肺里同时查出了两种感染：一个是肺结核，另一个是真菌感染（鸽粪引起的组织胞浆菌病）。别担心，方案我们都设计好了：\n\n1. 先给您用两周抗真菌的输液药，把真菌压下去（可能会有点腰酸或低钾，护士会每天给您补钾）。\n2. 抗结核药今天就开始吃，但特意换了更安全的品种——普通结核药会抵消抗真菌药效，咱们用升级版避免'药物打架'。\n3. 您的抗艾滋病毒药需要稍晚两周启动，这样身体不会一下子负担太重。新方案是每天一粒复合药片+另一种早晚各半粒，我会写清楚服药时间表。\n\n住院期间要特别注意三件事：\n- 您得住单间隔离病房，因为肺结核通过咳嗽传染（家属探视时要戴N95口罩）。\n- 营养师配的高蛋白营养奶务必喝完，您瘦得太快了——这就像打仗要有充足弹药。\n- 每天抽血不是病情加重，是要盯紧药物对肝肾的影响（好比开车要看仪表盘）。\n\n等出院后，那些鸽子千万不能再养了。鸽粪里的真菌可能让您再次病倒，这比戒烟还重要！现在咱们先集中精力把烧退下来，今晚就会加用退热药让您好受些。"
  },
  {
    "id": 1776,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "孕妇自述近两周午后低热37.6℃，夜间盗汗明显，但无咳血、胸痛；体重仅增0.8kg，低于产科预期。既往史：3年前确诊HIV，CD4最低128/μL，启动TDF+3TC+DTG后病毒载量<50拷贝/mL；1年前患肺结核，完成2HRZE/4HR方案，停药时痰培养阴性。查体：体温37.4℃，呼吸20次/分，右肺尖细湿啰音；宫高平脐，胎心145次/分。实验室：CD4 210/μL，病毒载量<50拷贝/mL；C反应蛋白14mg/L；晨尿蛋白（+），肌酐76µmol/L；胸片示右肺尖条索影，未见空洞。今日产科主诉：担心结核复发影响胎儿，询问是否需要再次抗结核治疗。",
    "reference_rule": {
      "condition": "活动性结核病可能性低的成年和未成年PLHIV人群；或正在接受ART、妊娠期女性、既往接受过抗结核治疗的PLHIV人群，不论个体免疫抑制程度如何，即使在LTBI检测无法获得的情况下",
      "action": "1. TPT应该作为HIV关怀服务包的一部分; 2. 给予预防性治疗",
      "contraindication": null,
      "evidence": "对于活动性结核病可能性低的成年和未成年PLHIV人群，TPT应该作为HIV关怀服务包的一部分。对于正在接受ART、妊娠期女性、既往接受过抗结核治疗的PLHIV人群，不论个体免疫抑制程度如何，即使在结核分枝杆菌潜伏感染（LTBI）检测无法获得的情况下，都应给予预防性治疗（强烈推荐，就估算的效果而言，证据信度高）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及HIV感染、既往肺结核病史和妊娠状态的多重交叉。作为专科专家，我的关注重点是全网扫描潜在风险：检查药物相互作用（如ART与抗结核药物）、禁忌症（特别是妊娠期用药安全性）和共病风险（结核复发与妊娠并发症），优先级确保安全第一（胎儿和母体），再考虑疗效。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者表现为午后低热（37.6℃）和夜间盗汗，提示结核复发可能；体重增长不足（仅0.8kg）和右肺尖细湿啰音支持肺部活动性病变；实验室指标如CD4 210/μL（中度免疫抑制）、C反应蛋白14mg/L（轻度炎症反应）、晨尿蛋白阳性（需排除妊娠期高血压或肾病）和胸片右肺尖条索影（可能陈旧性病变但需排除活动性）；病史显示HIV控制良好（病毒载量<50拷贝/mL）和肺结核治疗完成1年（停药时痰培养阴性），但免疫状态仍脆弱。隐式线索包括低热盗汗组合可指向活动性结核感染风险，尿蛋白阳性增加妊娠并发症可能性。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 将解码信息与指南Condition匹配：患者属于正在接受ART、妊娠期女性、且既往接受过抗结核治疗的PLHIV人群，活动性结核可能性需进一步评估但整体风险较低。指南推荐给予预防性治疗（TPT），不论免疫抑制程度或LTBI检测缺失。强制检查Contraindication：指南为null，但需全网扫描安全风险：1）药物相互作用—ART方案（TDF+3TC+DTG）与TPT（如异烟肼）可能增加肝毒性风险；2）妊娠禁忌—异烟肼在孕期相对安全，但需监测胎儿；3）共病风险—尿蛋白阳性提示潜在肾脏负担，需排除妊娠高血压影响治疗。\n\nStep 4: 决策生成 (Decision Making) - 基于指南Action（给予预防性治疗），但由于患者症状（低热、盗汗）提示活动性结核可能，决策分两步：1）优先排除活动性结核病以确保安全；2）若排除，则立即启动TPT作为HIV关怀服务包的一部分。具体行动：安排快速诊断测试，阴性结果后给予TPT。",
    "medical_order": "1. 完善结核病诊断检查：行痰涂片、痰培养及GeneXpert MTB/RIF检测，必要时行结核菌素皮肤试验或干扰素γ释放试验，以排除活动性结核病。2. 若检测阴性，启动结核预防性治疗（TPT）：予异烟肼300mg口服每日一次，疗程6个月；监测肝功能（每2周查ALT、AST）及药物不良反应。3. 继续现有抗逆转录病毒治疗（ART）：TDF+3TC+DTG方案，确保病毒载量维持<50拷贝/mL。4. 监测妊娠并发症：定期产科随访，监测血压、尿蛋白及胎儿发育（每周胎心监护）；若尿蛋白持续阳性，完善24小时尿蛋白定量及肾功能评估。5. 多学科协作：感染科与产科联合随访，每2周复诊评估症状及实验室指标。",
    "patient_dialogue": "您好，我完全理解您的担忧，特别是您最近有低热和夜里出汗多的情况，这确实让人担心结核会不会再犯。别紧张，咱们一步步来。首先，我们会安排几个简单的检查，比如让您咳点痰去化验，还有快速的血检和皮肤测试，这样就能看清楚结核有没有活动起来。同时呢，考虑到您以前得过结核，又有HIV在控制中，再加上您现在怀孕，我们会给您一种预防性的药物，帮助阻止结核复发。这药我们选的是孕期比较安全的，您每天吃一次就行，大概半年时间。用药期间，我们会定期查您的肝功能和宝宝的情况，确保一切平稳。记住，您体重长得慢，我们也会多留意血压和尿检，防止其他小问题。别太焦虑，咱们一起盯着，保护您和宝宝的健康最重要。"
  },
  {
    "id": 1784,
    "file_name": "《世界卫生组织结核病整合指南模块6_ 结核病及其共患病-HIV》解读.json",
    "case_input": "患者3周前开始低热、盗汗，体重下降4 kg，伴咳嗽及血丝痰。HIV感染史7年，目前未接受ART，CD4 110/μL，病毒载量 180 000 copies/mL。胸片示右上肺空洞样病变，GeneXpert MTB/RIF阳性，利福平敏感。既往有痛风和复发性口腔溃疡；近半年反复出现带状疱疹。实验室：血红蛋白 98 g/L，ALT 38 U/L，肌酐 78 μmol/L，空腹血糖 5.1 mmol/L。患者职业为夜班出租车司机，担心服药后嗜睡影响工作，并询问是否需要额外药物预防其他感染。今日门诊需确定抗结核及HIV综合治疗方案。",
    "reference_rule": {
      "condition": "所有罹患活动性结核病的PLHIV人群，无论CD4+T淋巴细胞计数如何",
      "action": "被给予常规的复方新诺明预防性用药",
      "contraindication": null,
      "evidence": "所有罹患活动性结核病的PLHIV人群，无论CD4+T淋巴细胞计数如何，应该被给予常规的复方新诺明预防性用药（强烈推荐，证据信度高）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为专科专家，我将全网扫描药物相互作用、禁忌症及共病风险，优先级是安全 > 疗效，重点关注抗结核药物、抗逆转录病毒治疗（ART）和预防用药的潜在冲突，以及患者的基础疾病（如痛风）和社会因素（如职业需求）。\n\nStep 2: 临床解码 (Clinical Decoding) - 关键信息提取：患者有活动性肺结核（基于症状如低热、盗汗、体重下降、咳嗽伴血丝痰，胸片示右上肺空洞，GeneXpert MTB/RIF阳性且利福平敏感）；HIV感染未治疗（CD4 110/μL提示严重免疫抑制，病毒载量高）；合并症包括痛风（既往史）、复发性口腔溃疡（可能为HIV相关或自身免疫表现）和反复带状疱疹（表明机会感染风险高）；实验室数据显示贫血（血红蛋白98 g/L）；社会因素为夜班司机，担忧药物嗜睡影响工作；患者还询问额外感染预防需求。隐式线索包括CD4低值易导致机会感染（如PCP、弓形虫），痛风可能增加尿酸相关药物风险，贫血需排查营养或慢性病因素。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件匹配：患者为PLHIV且罹患活动性结核病，无论CD4计数，符合指南条件（需给予复方新诺明预防）。强制检查禁忌症：指南contraindication为null，但需评估患者特异性风险。复方新诺明禁忌包括磺胺过敏、严重肝肾功能不全等；患者无过敏史、肝酶ALT 38 U/L和肌酐78 μmol/L正常，无禁忌证据。安全扫描：抗结核方案（如利福平）可能诱导CYP3A4，影响ART药物浓度（避免蛋白酶抑制剂，优选整合酶抑制剂如多替拉韦）；复方新诺明可能轻度升高尿酸，需监测痛风但非绝对禁忌；患者职业担忧嗜睡，需选择低嗜睡风险ART药物（如避免依非韦伦）。\n\nStep 4: 决策生成 (Decision Making) - 根据指南action，必须予复方新诺明预防性用药。综合决策：启动标准抗结核治疗（利福平敏感，用RIPE方案）；启动ART（选利福平兼容方案，优先多替拉韦为基础）；监测贫血原因；针对嗜睡担忧，优化给药时间；无需额外感染预防药物，复方新诺明已覆盖主要风险。优先级确保安全：避免药物相互作用，强调ART和抗结核同步启动以降低死亡率。",
    "medical_order": "诊断：1. 活动性肺结核（右上肺空洞，GeneXpert MTB/RIF阳性，利福平敏感）。2. HIV感染（CD4 110/μL，病毒载量 180 000 copies/mL）。3. 贫血（血红蛋白 98 g/L）。4. 痛风病史。治疗：予标准抗结核治疗方案：异烟肼 300 mg qd、利福平 600 mg qd、吡嗪酰胺 1500 mg qd、乙胺丁醇 1200 mg qd。启动抗逆转录病毒治疗：多替拉韦 50 mg qd + 替诺福韦艾拉酚胺 25 mg qd + 恩曲他滨 200 mg qd（利福平兼容方案）。予复方新诺明片（磺胺甲噁唑/甲氧苄啶）960 mg qd 预防性用药。监测：肝功能、肾功能、全血细胞计数每2周；空腹尿酸每4周（监测痛风）；CD4计数和HIV病毒载量每3个月。完善贫血评估：查血清铁、铁蛋白、维生素B12、叶酸水平。随访：门诊每周复诊，评估药物耐受性及疗效。",
    "patient_dialogue": "您好，先生。您的检查结果出来了，您同时有肺结核和HIV感染，这两种病都需要马上开始吃药治疗。我会给您开三组药物：一组专门对付肺结核，一组控制HIV病毒，还有一组是用来预防其他感染的，比如肺炎之类的，因为您的免疫系统现在比较弱，容易生病。我知道您开夜班出租车，担心吃药后会犯困影响工作，这个我特别理解。咱们选的HIV药是副作用比较小的，不容易嗜睡，您可以试试晚上休息前吃，或者和夜班时间错开。但记住，药不能停，否则病情会加重。另外，您有痛风病史，吃药期间我们会定期抽血检查，看看有没有尿酸升高的问题。如果觉得头晕或不舒服，随时告诉我，我们一起调整。坚持治疗几个月，情况就会好转的，别太担心，咱们一步一步来。"
  }
]