[
  {
    "id": 1668,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "患者右颈部出现一枚缓慢扩大的暗红色斑块3个月，中央轻度萎缩，边缘呈堤状隆起，表面覆少许黏着性鳞屑，无明显痛痒。既往体健，近2周出现低热（37.5–38℃）伴夜间盗汗。查体：颈部单个7 cm×5 cm斑块，触之质韧，无波动感；双侧锁骨上可及数枚0.8 cm淋巴结，质韧活动。患者自述在菜市场卖活禽，近期市场有禽类检疫异常报道（无关噪音）。实验室初筛：血常规WBC 6.8×10⁹/L，ESR 48 mm/h，CRP 28 mg/L；肝肾功能、HIV、梅毒血清学均未见异常。门诊已取皮损边缘活检送组织病理+抗酸染色，结果未回。",
    "reference_rule": {
      "condition": "所有皮肤结核患者在开始抗结核治疗前",
      "action": "1. 全面评估患者健康状况（包括合并肺结核及其他肺外结核情况、皮肤受累类型和范围、免疫水平、肝肾疾病史及药物过敏史）；2. 进行胸部影像检查；3. 通过计算机断层成像、磁共振成像、超声、内镜检查排除其他部位结核感染；4. 若有临床症状或检查提示合并肺结核或其他部位结核感染，转诊至结核病定点医院",
      "contraindication": null,
      "evidence": "在进行抗结核治疗前须全面评估患者的健康状况，包括有无合并肺结核及其他肺外结核情况、皮肤受累类型和范围、免疫水平、肝肾疾病史及药物过敏史等，建议在诊断皮肤结核的同时对所有皮肤结核患者进行胸部影像检查，考虑通过计算机断层成像、磁共振成像、超声、内镜检查等方式排除其他部位结核感染。如患者有相关临床症状或检查结果提示合并肺结核或其他部位结核感染，考虑转诊至结核病定点医院或机构继续治疗。"
    },
    "thought": "本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如皮肤结核、真菌感染或恶性肿瘤），排除危急重症（如系统性感染或败血症），并给出直接、高效的诊疗指令。基于患者病例，临床解码显示：皮肤病变特征（右颈部7 cm×5 cm暗红色斑块，中央萎缩，边缘堤状隆起，表面覆黏着性鳞屑）高度提示寻常狼疮或皮肤结核；系统性症状（低热37.5–38℃伴夜间盗汗）和体征（双侧锁骨上0.8 cm淋巴结肿大，质韧活动）支持感染性病因；实验室结果（ESR 48 mm/h和CRP 28 mg/L升高）反映慢性炎症，职业暴露（卖活禽）为无关噪音；活检结果未回是关键待确认点。规则对齐与安全检查：指南要求所有皮肤结核患者在抗结核治疗前进行全面评估。当前临床高度怀疑皮肤结核，但活检未确诊，需强制遵循指南行动；无禁忌症（指南中contraindication为null）。决策生成：立即启动指南行动，安排全面评估（包括胸部影像检查、其他部位感染排查），同时等待活检结果；如评估发现合并感染，则转诊至结核病定点医院。",
    "medical_order": "完善胸部X光检查评估肺部情况；安排腹部超声检查排除腹腔结核感染；询问详细药物过敏史、肝肾疾病史及免疫状态；监测体温及盗汗症状；等待皮肤活检及抗酸染色结果回报；如影像学或症状提示合并肺结核或其他肺外结核感染，立即转诊至结核病定点医院。",
    "patient_dialogue": "您好，张先生。从您的症状来看，脖子上的这块斑块和最近的低热、盗汗，很可能和一种叫结核的感染有关，虽然还不完全确定，但我们需要尽快做些检查来搞清楚。为了安全起见，我建议您先做个胸部X光，看看肺部有没有被感染，因为结核有时会从皮肤扩散到肺里。另外，咱们还得检查一下肚子和其他部位，可能会安排个超声波扫描。您平时有没有对什么药物过敏？或者肝、肾方面的毛病？这些都很重要，避免用药时出问题。活检结果还没出来，我们正在等，这期间您注意量体温，如果发烧更厉害或者有新的不舒服，马上告诉我。别担心，咱们一步步来，早点查清楚才好对症治疗。"
  },
  {
    "id": 1662,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "患者，42岁，云南昭通农民，主诉‘右小腿暗红色斑块伴渗液3月余’。斑块初为黄豆大结节，渐融合成4 cm×6 cm不规则浸润斑，表面少量脓性分泌物，轻压痛，边缘呈暗红色堤状隆起，中央可见2处2 mm浅溃疡，覆稀薄黄色痂。无发热、盗汗、体重下降。既往体健，无结核接触史，但家中饲养4头奶牛。近1月自行外用‘皮炎平’无效。今日门诊查体：右小腿皮损处可闻及轻度鼠臭味；余皮肤未见类似损害；腹股沟可触及1枚1 cm质韧淋巴结，活动可。患者同时抱怨‘最近雨水多，地里太滑，脚踝有点酸’。门诊护士准备取分泌物送检。",
    "reference_rule": {
      "condition": "临床皮损类似皮肤结核",
      "action": "1. 若符合标准①（皮损组织/分泌物中分枝杆菌培养阳性，并经鉴定为结核分枝杆菌）；2. 或同时符合标准②（皮损组织/分泌物中结核分枝杆菌核酸检测阳性）和标准③（皮损组织病理表现为上皮样细胞肉芽肿且中央出现干酪样坏死）",
      "contraindication": null,
      "evidence": "临床皮损类似皮肤结核，若符合①或同时符合②③两条标准，可确诊为皮肤结核；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断以排除危急重症（如脓毒症、播散性结核），并基于临床线索给出直接、高效的诊疗指令。Step 2: 临床解码 (Clinical Decoding)：患者右小腿皮损表现为慢性浸润斑块（4 cm×6 cm），有鼠臭味、脓性分泌物、浅溃疡及边缘堤状隆起，提示肉芽肿性炎症（如皮肤结核或深部真菌感染）；腹股沟淋巴结肿大（1 cm、质韧、活动）为反应性增生；饲养奶牛（4头）增加牛分枝杆菌暴露风险，无全身症状（如发热）降低急性感染可能性；外用激素‘皮炎平’无效排除单纯皮炎；环境因素（云南多雨、脚踝酸）可能加重局部刺激，但非主要病因。关键转化：皮损特征符合‘结核样病变’，需优先排除皮肤结核、孢子丝菌病等。Step 3: 规则对齐与安全检查 (Alignment & Safety)：临床皮损与指南‘condition’（类似皮肤结核）高度匹配。无禁忌症（‘contraindication’为 null）。当前未满足任何确诊标准（①培养阳性、②核酸阳性+③病理干酪样坏死），分泌物送检中，故需等待实验室证据。安全方面：排除危急重症（无发热、皮损局限），但需警惕潜在传播风险（如分枝杆菌）。Step 4: 决策生成 (Decision Making)：根据指南‘action’，确诊依赖检查结果。决策：1. 完成分泌物培养及核酸检测以评估标准①/②；2. 加行皮肤活检获取病理（评估标准③）；3. 给予局部护理和监测，避免经验性治疗干扰诊断；4. 待结果回报后明确诊断和治疗。",
    "medical_order": "1. 完善右小腿皮损分泌物分枝杆菌培养及结核分枝杆菌核酸检测。2. 建议行皮肤活检，送病理检查（重点观察上皮样细胞肉芽肿及干酪样坏死）。3. 予局部清洁护理：生理盐水湿敷 tid，避免搔抓或外伤。4. 监测体温及皮损变化 qd，记录淋巴结大小及活动度。5. 暂不予抗结核或抗真菌药物，待实验室结果回报后制定方案。",
    "patient_dialogue": "您好，张先生！您右小腿这块皮肤问题有几个月了，从表现看，像是某种慢性感染，比如结核菌或真菌引起的。护士已经取了分泌物去化验，我们得等结果出来才能确认具体原因——这就像破案一样，需要证据。化验大概要几天时间，期间您要注意：每天用温水轻轻清洗伤口，别用手抓或碰脏东西，穿宽松裤子减少摩擦，避免下田干活儿加重刺激。您家养了牛，这可能有风险，所以等结果出来，咱们再商量要不要隔离或用药。别担心，这不是急症，但得认真对待，防止扩散到其他地方。脚踝酸可能是走路累的，先多休息，好了后我们再看怎么处理。"
  },
  {
    "id": 1673,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "患者右小腿前侧暗红色斑块2月余，边缘微隆、中央萎缩覆有薄痂，轻压痛，无瘙痒。自诉曾外用‘皮炎平’2周无改善，近1周斑块略扩大。无发热、盗汗、咳嗽。既往体健，否认结核病史及接触史。查体：斑块约4 cm×6 cm，触之质韧，表面可见少许毛细血管扩张；局部皮温正常，同侧腹股沟可及1枚1.2 cm可移动淋巴结，无压痛。实验室：血常规WBC 7.8×10⁹/L，CRP 12 mg/L，ESR 38 mm/h；胸片未见活动性病灶。皮肤活检病理报告提示真皮内多发结核样肉芽肿，抗酸染色阴性，但PCR检出结核分枝杆菌复合群DNA。肝肾功能正常，体重68 kg。今日门诊需制定抗结核方案，患者询问是否需要住院及药物副作用。",
    "reference_rule": {
      "condition": "药物敏感性皮肤结核（成人）",
      "action": "1. 强化治疗期（2个月）：每日服用：异烟肼 5~8 mg·kg⁻¹·d⁻¹，利福平 8~10 mg·kg⁻¹·d⁻¹ (≤ 600 mg/d)，吡嗪酰胺 20~30 mg·kg⁻¹·d⁻¹，乙胺丁醇 15~25 mg·kg⁻¹·d⁻¹ (≤ 1000 mg/d)；2. 维持治疗期（4个月）：每日服用：异烟肼 5~8 mg·kg⁻¹·d⁻¹，利福平 8~10 mg·kg⁻¹·d⁻¹ (≤ 600 mg/d)",
      "contraindication": null,
      "evidence": "强化治疗期：服用不少于4种有效的抗结核药，连续服用2个月：异烟肼 5~8 mg·kg⁻¹·d⁻¹，利福平 8~10 mg·kg⁻¹·d⁻¹ (≤ 600 mg/d)，吡嗪酰胺 20~30 mg·kg⁻¹·d⁻¹，乙胺丁醇 15~25 mg·kg⁻¹·d⁻¹ (≤ 1000 mg/d)；维持治疗期：服用不少于2种抗结核药，连续服用4个月：异烟肼 5~8 mg·kg⁻¹·d⁻¹，利福平 8~10 mg·kg⁻¹·d⁻¹ (≤ 600 mg/d)"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（排除危急重症如系统性结核或败血症），并给出直接的诊疗指令。患者皮肤活检已确诊结核感染，需立即启动抗结核方案，避免延误治疗。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者右小腿暗红色斑块（慢性皮肤病变，提示肉芽肿性感染），边缘隆起和中央萎缩（特征性结核皮损），PCR检出结核分枝杆菌复合群DNA（确诊皮肤结核），腹股沟淋巴结肿大（局部感染扩散征象），CRP和ESR轻度升高（炎症活动证据），但无系统症状（如发热）和胸片正常（排除肺部结核或危急并发症）。外用糖皮质激素无效支持非过敏性病因。体重68 kg用于剂量计算。隐式线索包括抗酸染色阴性（可能菌量低，但PCR阳性确认）和淋巴结无压痛（稳定状态，不需急症干预）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为'药物敏感性皮肤结核（成人）'，病例与条件完全匹配（PCR阳性、无耐药证据）。指南Contraindication为null，患者肝肾功能正常且无过敏史，无禁忌症。剂量计算：异烟肼（5 mg/kg×68 kg=340 mg/d）、利福平（10 mg/kg×68 kg=680 mg/d，但上限600 mg/d）、吡嗪酰胺（25 mg/kg×68 kg=1700 mg/d）、乙胺丁醇（25 mg/kg×68 kg=1700 mg/d，但上限1000 mg/d）。安全优先级：所有药物在推荐剂量内，无交互风险。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action，制定6个月抗结核方案：强化期2个月（四联药物），维持期4个月（二联药物）。患者无系统症状，可门诊治疗；需监测药物副作用和随访淋巴结。决策包括药物剂量和随访安排。",
    "medical_order": "诊断：皮肤结核（基于皮肤活检病理及PCR结果）。治疗：启动标准抗结核方案。强化期（2个月）：予异烟肼 300 mg/d（po），利福平 600 mg/d（po），吡嗪酰胺 1500 mg/d（po），乙胺丁醇 1000 mg/d（po）。维持期（4个月）：予异烟肼 300 mg/d（po），利福平 600 mg/d（po）。监测：定期随访（每2周评估皮损和淋巴结变化），完善肝功能、肾功能、视力检查（基线及每月）。教育：告知药物副作用及依从性重要性。住院：非必要，门诊治疗。",
    "patient_dialogue": "王先生，您这个腿上的斑块我们已经确认是皮肤结核感染引起的，这是一种细菌感染，好在没有影响到肺部或其他器官。需要尽快开始治疗，不然它可能会继续扩大。我给您开一种口服药方案，总共有四种药一起吃两个月，这是为了快速杀灭细菌；然后减到两种药再吃四个月，总共六个月。这样就能彻底清除感染了。这些药都是安全的，您肝肾功能正常，很适合用。但要注意，药物可能有副作用，比如肝损伤或视力模糊，所以咱们要定期复查血和眼睛。不用住院，在家按时吃药就行，我会每两周安排您来门诊复查，看看腿上的变化和那个小淋巴结。记住，千万别自己停药，坚持服完整个疗程才能防止复发。"
  },
  {
    "id": 1674,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "患者 3 个月前左小腿外侧被秸秆划伤，自行敷草药后创面迁延不愈，逐渐出现「指甲盖大」暗红色斑块，边缘微隆起，表面覆有少量黏着性鳞屑，触之较硬，轻压痛。近 4 周斑块向四周缓慢扩大至 4 cm×6 cm，中央出现浅表萎缩性瘢痕并散在粟粒大小脓点。无发热、盗汗、咳嗽。既往体健，无结核病史。家中饲养 6 只山羊，村内有‘老痰’牛。今日门诊查体：皮损位于左小腿外侧，境界清，玻片压诊可见「苹果酱色」小结节；左腹股沟可触及 1 枚 1.5 cm 质韧淋巴结，轻压痛。患者同时抱怨‘天气潮湿，膝关节酸’。辅助检查：血常规 WBC 6.8×10⁹/L，ESR 38 mm/h，CRP 12 mg/L；胸部 DR 未见活动性病灶；门诊快检 HIV、梅毒均阴性。皮肤镜下可见橙色无定形结构及散在白色瘢痕样区域。",
    "reference_rule": {
      "condition": "临床皮损类似皮肤结核",
      "action": "若符合②、③、④、⑤、⑥中任一条，则疑似皮肤结核",
      "contraindication": null,
      "evidence": "若符合②③④⑤⑥中任一条，疑似皮肤结核。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（排除危急重症如播散性结核或败血症），并基于直接线索给出高效决策。\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：① 皮损特征（暗红色斑块、边缘隆起、玻片压诊见苹果酱色结节、表面鳞屑和脓点）高度提示寻常狼疮（皮肤结核典型表现）；② 暴露史（家养山羊和村内牛，增加结核暴露风险）；③ 淋巴结肿大（左腹股沟淋巴结，提示局部感染扩散）；④ 实验室异常（ESR和CRP升高，提示慢性炎症）；⑤ 慢性病程（外伤后迁延不愈，自行草药处理无效）。隐式线索：皮肤镜下橙色无定形结构常见于肉芽肿性疾病，结合无全身症状（无发热等），需优先排除皮肤结核而非其他如深部真菌感染或非结核分枝杆菌病。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件为‘临床皮损类似皮肤结核’，本案皮损符合（苹果酱结节等）。指南行动要求‘若符合②、③、④、⑤、⑥中任一条则疑似’，本案匹配：接触史（②）、淋巴结肿大（③）、ESR升高（④）、皮损特征（⑤）等。强制检查禁忌症：指南中为null，无禁忌；需排除HIV/梅毒（已阴性），确保安全。\nStep 4: 决策生成 (Decision Making) - 基于指南，高度疑似皮肤结核。决策：优先完善确诊性检查（如活检），并启动经验性抗结核治疗以防进展；排除其他感染（如细菌或真菌）。",
    "medical_order": "1. 完善皮肤活检行组织病理学检查及抗酸染色。\n2. 行结核菌素试验（PPD）及干扰素释放试验（如T-SPOT.TB）。\n3. 取皮损脓液行分枝杆菌培养及药敏试验。\n4. 予经验性抗结核治疗：异烟肼300 mg qd、利福平600 mg qd、吡嗪酰胺1500 mg qd、乙胺丁醇1200 mg qd，口服。\n5. 监测肝肾功能及视力变化，定期复查ESR/CRP。\n6. 若活检结果阴性，排查其他如孢子丝菌病（完善真菌培养）。\n7. 门诊随访1周评估治疗反应及淋巴结情况。",
    "patient_dialogue": "医生：您好，从您腿上的伤口情况来看，我们怀疑这可能和结核有关，因为您家有山羊，村里有牛，这些动物有时会带结核菌，伤口拖了这么久没好，还出现了淋巴结肿大，说明感染在慢慢扩散。别担心，这不算严重，但需要及时查清楚。我们会取一小块皮肤做个检查，再抽点血测试一下，确认是不是结核。同时，我先给您开些抗结核的药，以防万一——这些药很安全，但需要您按时吃，并注意有没有眼睛模糊或肚子不舒服，我会安排您下周再来复查。这样能早点治好，避免恶化。您觉得这样安排行吗？有什么担心的随时告诉我。"
  },
  {
    "id": 1682,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "患者右小腿外侧一处暗红色斑块已18个月，边缘隆起、中央萎缩伴瘢痕挛缩，面积6 cm×4 cm，表面反复破溃渗血，外院多次按‘湿疹’换药无效。近2个月斑块周围新发3个卫星结节，触痛明显。无发热、盗汗，体重稳定。既往体健，否认结核病史，家中饲养奶牛。查体：斑块质地硬如软骨，轻压脓性分泌物渗出，腹股沟可触及1枚1.5 cm质韧淋巴结。今日门诊天气闷热，患者穿长筒皮靴进入诊室，脱靴后散发异味，她尴尬地解释‘地里忙，没时间换袜子’。实验室：T-SPOT.TB 抗原A 28 SFCs/2.5×10⁵ PBMC，抗原B 32；CRP 18 mg/L，余血常规、肝肾功能正常。胸片未见活动性病灶。皮肤活检病理报告待出。",
    "reference_rule": {
      "condition": "局限性或顽固性皮损",
      "action": "1. 手术切除或外科矫形术作为辅助治疗；2. 需在有效抗结核药物治疗条件下进行；3. 皮肤软组织毁损在药物治疗后期或完成后手术修复",
      "contraindication": "未经有效抗结核药物治疗的手术",
      "evidence": "对于局限性或顽固性皮损，可采用手术切除和外科矫形术作为全身抗结核治疗的辅助治疗。手术切除有利于降低细菌感染负荷，但存在播散感染的风险，需权衡利弊，建议尽量在有效抗结核药物治疗的条件下进行。对病变引起的皮肤及软组织毁损，也可在药物治疗后期或治疗完成后进行手术整形修复。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于常规诊断与治疗场景，作为门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如脓毒症或恶性肿瘤），并基于现有证据给出直接、高效的诊疗指令。鉴别诊断优先考虑皮肤结核（如寻常狼疮），其次为细菌感染（如慢性脓皮病）或肿瘤（如鳞状细胞癌），但需结合活检排除其他可能。**Step 2: 临床解码 (Clinical Decoding)**：从病例中提取关键信息并转化：1. 皮损特征（18个月暗红色斑块、边缘隆起、中央萎缩伴瘢痕挛缩、反复破溃渗血）符合皮肤结核典型表现；2. 新发卫星结节及触痛提示活动性感染；3. T-SPOT.TB阳性（抗原A 28 SFCs/2.5×10⁵ PBMC，抗原B 32）强烈支持结核分枝杆菌感染；4. CRP升高（18 mg/L）反映炎症状态；5. 奶牛饲养史增加牛结核暴露风险；6. 腹股沟淋巴结肿大（1.5 cm质韧）可能为反应性；7. 卫生习惯差（穿皮靴异味）可能加重局部感染；8. 胸片正常排除肺活动性结核；9. 活检待出需用于确诊。**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南条件为‘局限性或顽固性皮损’，匹配当前局灶性、顽固性皮损（18个月无效治疗）。强制检查禁忌症‘未经有效抗结核药物治疗的手术’：目前无抗结核治疗，手术存在播散感染风险，绝对禁忌。**Step 4: 决策生成 (Decision Making)**：基于指南动作‘需在有效抗结核药物治疗条件下进行手术’，优先启动抗结核治疗；活检结果将确认诊断；后续手术（如切除或修复）仅可在药物治疗有效后作为辅助。决策：立即开始经验性抗结核治疗，等待活检报告，监测淋巴结，并教育卫生管理。",
    "medical_order": "予标准四联抗结核药物治疗（异烟肼300mg qd、利福平600mg qd、吡嗪酰胺1500mg qd、乙胺丁醇1200mg qd），监测药物不良反应及肝肾功能。完善皮肤活检病理报告，预约1周后复诊评估疗效。查体记录腹股沟淋巴结大小变化。教育患者皮肤清洁护理，避免局部压迫。CRP每2周复查。",
    "patient_dialogue": "您好，我理解您这段时间腿上的伤口一直没好，还让您挺尴尬的——特别是今天天气热，您穿靴子忙农活，袜子没换，这很正常，但咱们得一起解决它。从检查看，您腿上这个红肿破皮的地方，很可能是因为接触奶牛引起的特殊感染，不是湿疹。如果不及时治，它可能会扩散或留疤。我会给您开几种药片，专门针对这种感染，您需要每天按时吃，坚持几个月。这药能控制住感染，防止它变得更严重。另外，您平时干农活时，尽量穿干净透气的袜子，勤换洗，保持皮肤干燥——这样药效会更好。一周后再来复查，我们会看看恢复情况。如果有需要，以后可能做个小手术修复皮肤，但现在吃药是第一步。别担心，我们一起努力，这个能治好！"
  },
  {
    "id": 1684,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "32 岁女性，翻译公司职员，5 周前因“左颈项暗红色斑块 3 个月、缓慢扩大”在外院活检，病理示“真皮内上皮样细胞肉芽肿伴干酪样坏死”，抗酸染色（+），胸片未见活动性结核灶，被诊断为“皮肤结核”，予 2HRZE/4HR 方案治疗。今日复诊，她戴着一次性雨披帽走进诊室，抱怨“最近雨多，骑车总淋湿，皮损好像更痒了”。查体：原斑块 4.5 cm×3.2 cm，边缘仍稍隆起，中央轻度渗出，与初诊时相比面积缩小不足 20%，无新发卫星灶；体温 36.8 ℃，余查体无特殊。患者自述“每天都按时吃药，但胃有点胀，怕伤肝，自己把吡嗪酰胺改成隔日吃”。实验室：ALT 28 U/L，Cr 62 μmol/L，ESR 38 mm/h，痰涂片未送。她问：“医生，是不是药膏没涂够？怎么还不见好？”",
    "reference_rule": {
      "condition": "所有接受抗结核治疗的患者",
      "action": "1. 全程监测疗效和药物不良反应；2. 初始治疗4~6周评估皮损缓解情况；3. 若反应不佳，排查耐药或重新评估诊断",
      "contraindication": null,
      "evidence": "治疗期间需要进行疗效监测和药物不良反应监测。药物治疗效果可通过临床反应评估，多数患者在初始治疗4~6周后可观察到皮损缓解。若对药物治疗反应不佳，需警惕耐药性结核分枝杆菌感染，同时考虑对诊断进行重新评估。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于分级诊疗与随访场景。作为守门人 (Gatekeeper)，我的关注重点是严格对比当前治疗状态与指南达标标准（治疗4~6周应观察到皮损明显缓解），并据此判断是否需要维持原方案或触发升级治疗（如转诊至专科或加强检查）。\n\nStep 2: 临床解码 (Clinical Decoding) - 关键信息：患者接受2HRZE/4HR方案治疗5周（处于4~6周评估窗口），皮损面积缩小不足20%（定义为治疗反应不佳），ESR 38 mm/h（升高，提示持续炎症），且患者擅自将吡嗪酰胺改为隔日服用（药物依从性差，可能导致治疗不充分）。隐式线索：患者淋湿后皮损瘙痒加重（外部刺激可能加重局部炎症），痰涂片未送（遗漏关键检查，影响耐药排查），以及患者误解治疗（询问药膏，暗示对皮肤结核口服药机制认知不足）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南 Condition 匹配：患者正接受抗结核治疗，符合监测要求。Contraindication：无（无药物禁忌或安全风险）。现状与指南对齐：反应不佳触发 Action 3（需排查耐药或重新评估诊断），同时需强化 Action 1（监测不良反应，如患者胃胀）。安全方面：ALT正常，无肝损迹象，但擅自改药需纠正以防止耐药风险。\n\nStep 4: 决策生成 (Decision Making) - 根据指南 Action：治疗反应不佳（皮损缓解不足20%），因此触发排查耐药或重新评估诊断。具体决策：完善痰涂片及培养检查以排除耐药结核；重新评估诊断（考虑非结核分枝杆菌感染可能）；加强药物依从性教育与不良反应监测；暂维持原方案但强调规范用药，若后续无改善则转诊至感染科。",
    "medical_order": "1. 完善痰涂片及抗酸杆菌培养检查，以排除耐药结核分枝杆菌感染。2. 复查ESR及肝功能（ALT），监测治疗反应及药物不良反应。3. 评估药物依从性，教育患者规范用药（吡嗪酰胺每日服用），避免自行调整剂量。4. 加强皮损局部护理，保持干燥，预防继发感染。5. 若2周后复诊皮损无进一步改善（缩小>50%），则转诊至感染科进行耐药测试及诊断再评估。",
    "patient_dialogue": "您好，我看您最近淋雨骑车，皮肤湿了后更痒了，这确实会让皮损不舒服——雨水刺激了皮肤，容易加重炎症，以后尽量穿防水外套或带伞保护一下。不过，您说吃药后不见好，可能有两个原因：一是您自己把吡嗪酰胺改成隔天吃，这会让药效打折扣，就像吃饭不按顿，身体吸收不够，治不快；二是皮肤结核本来就好得慢，需要点时间。别担心，这不是药膏的事，咱们主要靠口服药。为了确保治疗有效，我建议您严格每天吃药，别乱改剂量。同时，咱们得做个痰液检查，看看有没有耐药菌，这样能更有针对性地帮您。记住，坚持规范治疗，大多数人都能康复的！"
  },
  {
    "id": 1677,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "患者82岁，女性，体重48 kg，既往高血压20年、2型糖尿病伴糖尿病肾病（eGFR 38 mL·min⁻¹·1.73 m⁻²）、骨质疏松。3个月前右小腿出现无痛性暗红色结节，逐渐破溃形成边缘潜行的溃疡，表面少量脓性分泌物，当地诊所反复外用抗生素无效。胸部CT：双肺上叶纤维结节灶，陈旧性可能；T-SPOT.TB 抗原A 28 mm、抗原B 32 mm。皮肤活检病理：真皮中部多个结核结节伴干酪样坏死，抗酸染色可见少量抗酸杆菌，PCR鉴定为结核分枝杆菌。患者自诉近期夜尿增多，双踝轻度水肿，无发热、咳嗽。门诊复查血肌酐132 μmol/L，eGFR 38 mL·min⁻¹·1.73 m⁻²，尿蛋白++。目前口服氨氯地平5 mg qd、胰岛素早18 U晚14 U、阿仑膦酸钠70 mg qw。今日由家属推轮椅前来，抱怨伤口疼痛影响睡眠，并询问“能不能用点好药早点收口”。",
    "reference_rule": {
      "condition": "药物敏感性皮肤结核（高龄患者）",
      "action": "1. 根据肾小球滤过率减少吡嗪酰胺、乙胺丁醇用量；2. 80岁以上禁用吡嗪酰胺，总疗程延长至9个月",
      "contraindication": "80岁以上人群使用吡嗪酰胺",
      "evidence": "高龄患者：建议根据肾小球滤过率适当减少吡嗪酰胺、乙胺丁醇用量；因肝毒性或胃肠道不耐受发生率较高，不建议80岁以上人群使用吡嗪酰胺，此情况下治疗总持续时间应延长至9个月。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于复杂合并症治疗场景。患者高龄（82岁），合并高血压、糖尿病肾病（CKD G3b期）、骨质疏松及新诊断皮肤结核。重点关注：抗结核药物与基础病的相互作用（尤其肾毒性/肝毒性）、高龄禁忌症执行、多系统治疗优先级。",
      "Step 2: 临床解码": {
        "关键医学指征": [
          "皮肤结核确诊：皮肤活检（结核结节+干酪样坏死+PCR阳性）+T-SPOT.TB强阳性（A/B>20mm）",
          "肾功能不全：eGFR 38 mL/min（CKD G3b期）伴蛋白尿++，禁用肾毒性药物",
          "高龄风险：82岁+低体重（48kg）+骨质疏松，肝代谢能力下降",
          "药物冲突点：利福平可能降低氨氯地平疗效（CYP3A4诱导），抗结核药加重骨流失"
        ],
        "患者需求解码": "溃疡疼痛→需镇痛+局部处理；'好药收口'→误解结核溃疡需全身治疗非局部"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南对齐": "条件匹配'药物敏感性皮肤结核（高龄患者）'",
        "禁忌症强制核查": "患者82岁→触发绝对禁忌：禁用吡嗪酰胺（肝毒性风险↑↑）",
        "扩展安全扫描": [
          "乙胺丁醇需减量（eGFR<50mL/min）",
          "避免NSAIDs镇痛（加重肾损伤）",
          "利福平与骨质疏松：需补钙/VitD防骨流失"
        ]
      },
      "Step 4: 决策生成": {
        "核心方案": "采用HR方案（异烟肼+利福平），剔除吡嗪酰胺；乙胺丁醇减量；总疗程延至9个月",
        "共病管理": "镇痛用对乙酰氨基酚（非NSAIDs）；强化血糖/血压监测；钙剂补充",
        "监测重点": "肝功能（利福平肝毒）+视力（乙胺丁醇眼毒）+肾功能"
      }
    },
    "medical_order": "1. 抗结核治疗：异烟肼 300 mg qd po；利福平 450 mg qd po（空腹）；乙胺丁醇 15 mg/kg（720 mg qd po）。总疗程9个月（禁用吡嗪酰胺）。\n2. 镇痛：对乙酰氨基酚 0.5g prn（每日≤3g）。\n3. 伤口护理：生理盐水清创 qd + 无菌敷料覆盖。\n4. 基础病管理：\n   - 继续氨氯地平5 mg qd（监测血压，利福平可能降低其浓度）\n   - 胰岛素剂量根据血糖调整（利福平可能干扰血糖）\n   - 加用碳酸钙 600 mg qd + 骨化三醇 0.25 μg qd（对抗利福平骨流失）\n5. 监测：\n   - 血常规、肝肾功能、尿酸 每月\n   - 视力、尿蛋白/肌酐比 基线+每2月\n6. 转诊：结核病专科定期随访（首次1月内）。",
    "patient_dialogue": "老人家，您腿上这个溃疡啊，咱们查清楚了，是结核菌引起的。治这个病得吃专门杀结核菌的药，但您年纪大了，有些药咱们得特别小心——比如有个叫吡嗪酰胺的药，80岁以上的人用了伤肝风险太高，咱们坚决不用它！我给您开的三种药（异烟肼、利福平、乙胺丁醇）都是调整过剂量的，既安全又能治根，不过得耐心吃满9个月才能彻底消灭细菌，中途可千万不能自己停药啊！\n\n伤口疼的话，我给您开个温和的止痛药（对乙酰氨基酚），疼得厉害时吃一片，每天别超过6片。平时换药时护士会用生理盐水给您轻轻擦洗，别自己涂药膏——结核菌藏在皮肤深处，表面涂药不管用的。\n\n您本身有糖尿病和肾不好，我会让护士每月给您抽血查肝肾功能（这些药偶尔伤肝），还要查视力（防药物影响眼睛）。降压药和胰岛素照常吃，但利福平可能会让血压血糖有点波动，家里测勤快点。另外啊，治结核的药会加速钙流失，您每天得加吃钙片和维生素D，保护骨头。下次复诊咱们约在4周后，要是吃药后恶心或者眼睛看东西模糊，一定马上来医院！"
  },
  {
    "id": 1681,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "患者34岁男性，建筑工人，因右小腿前侧反复溃疡伴疼痛3个月来诊。既往确诊HIV感染7年，CD4 152 cells/μL，病毒载量<50 copies/mL，规律服用替诺福韦/拉米夫定/多替拉韦。无糖尿病、高血压史，否认结核接触史。查体：右小腿前侧5 cm×3 cm不规则溃疡，基底呈暗红色肉芽，边缘潜行，轻压痛，表面少量黄色分泌物；左腋下可触及2枚1 cm淋巴结，质韧、活动。实验室：溃疡分泌物GeneXpert MTB/RIF阳性，RIF敏感；T-SPOT.TB 抗原A 32 SFCs/2.5×10⁵ PBMC；胸部CT未见活动性病灶；肌酐78 μmol/L，ALT 28 U/L。患者自述近两周夜间盗汗明显，但无咳嗽、低热。今日长沙气温34 ℃，他穿长筒胶靴作业，抱怨靴内闷热瘙痒，要求顺便开“脚气膏”。",
    "reference_rule": {
      "condition": "药物敏感性皮肤结核（HIV感染者）",
      "action": "1. 治疗方案与单纯结核感染者一致；2. 疗程延长2~3个月；3. 使用利福布丁替代利福平",
      "contraindication": null,
      "evidence": "HIV感染者：抗结核治疗方案与单纯结核感染者一致，疗程可适当延长2~3个月，建议使用利福布丁替代利福平。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，优先级安全大于疗效。患者HIV感染合并皮肤结核，需全网扫描ART与抗结核药物潜在冲突、免疫抑制风险及环境因素影响。Step 2: 临床解码 (Clinical Decoding) - 关键信息包括：免疫抑制状态（CD4 152 cells/μL，严重缺陷）；确诊药物敏感性皮肤结核（溃疡分泌物GeneXpert MTB/RIF阳性，RIF敏感，T-SPOT.TB阳性，伴盗汗、淋巴结肿大）；ART方案（替诺福韦/拉米夫定/多替拉韦，病毒控制良好）；职业暴露（穿胶靴作业，闷热瘙痒提示足癣可能）；无肝肾损害（肌酐、ALT正常）。隐式线索：溃疡反复及盗汗提示结核活动，胶靴环境增加继发感染风险，淋巴结肿大需排除播散。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition匹配（HIV感染者伴药物敏感性皮肤结核），Contraindication为null，无绝对禁忌症；安全检查：利福平与多替拉韦有严重相互作用（CYP3A4诱导剂降低药效），需替换为利福布丁；免疫抑制增加复发风险，延长疗程必要；足癣为次要问题，无结核治疗冲突。Step 4: 决策生成 (Decision Making) - 基于指南Action：启动标准抗结核方案，使用利福布丁替代利福平，疗程延长至8-9个月；同步处理足癣；监测药物安全。",
    "medical_order": "1. 启动抗结核治疗：强化期2个月（利福布丁300 mg每日一次口服，异烟肼300 mg每日一次口服，吡嗪酰胺1500 mg每日一次口服，乙胺丁醇1200 mg每日一次口服）；巩固期6-7个月（利福布丁300 mg每日一次口服，异烟肼300 mg每日一次口服），总疗程8-9个月。2. 维持现有ART方案（替诺福韦/拉米夫定/多替拉韦），监测药物相互作用，每月复查肝功能、肾功能及HIV病毒载量。3. 溃疡局部处理：每日生理盐水清洗，莫匹罗星软膏外用预防继发感染。4. 予克霉唑软膏外用每日两次治疗足癣。5. 建议避免穿不透气鞋靴，穿棉袜保持足部干燥。6. 安排2周随访复查溃疡愈合及药物耐受性，必要时淋巴结活检排除播散。",
    "patient_dialogue": "王先生，您的情况我已经仔细看过了。这个小腿溃疡是结核感染引起的，和HIV有关，需要赶紧开始吃药治疗。我们会给您开几种药片，得连续吃8到9个月，因为您身体抵抗力弱些，时间短了怕清除不彻底。别担心，这些药和您平时吃的HIV药物不会打架，我们特意选了安全的搭配。另外，您说脚在胶靴里闷得痒，这可能是脚气，我给您开个药膏，每天抹两次，能止痒杀菌。平时上班尽量别穿那种长胶靴了，换成透气的鞋子，穿棉袜子吸汗，不然容易复发。药片开始吃后，如果觉得恶心或不舒服，随时告诉我。两周后咱们再见面，检查一下溃疡好没好转。坚持治疗，很快就能好起来的！"
  },
  {
    "id": 1678,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "9岁男童，来自贵州黔东南山区，因‘右小腿暗红色斑块伴渗液2个月’由母亲陪同初诊。患儿2个月前无明显诱因右小腿中下部出现黄豆大红色丘疹，逐渐扩大成2.5 cm×3 cm不规则浸润斑块，表面覆少量黏着性鳞屑，轻压疼痛，中央可见2处针尖大脓点。外院曾予头孢口服7天无改善，近1周斑块边缘出现新旧交替的卫星灶。无发热、盗汗、咳嗽。否认结核接触史，卡介苗接种史不详。家族中无类似皮损。PE：斑块呈暗红-棕红色，质地韧，玻片压诊呈‘苹果酱色’；触诊局部皮温略高，可触及1枚1 cm质韧无痛性腹股沟淋巴结。辅助检查：血常规WBC 7.8×10⁹/L、CRP 6 mg/L；胸片未见异常；T-SPOT.TB A抗原22，B抗原18；皮损分泌物GeneXpert MTB/RIF检测阳性，rpoB基因未检出突变。体重26 kg。今日门诊室温28 ℃，患儿因路途遥远略显疲惫，母亲担心留疤反复询问能否缩短疗程。",
    "reference_rule": {
      "condition": "药物敏感性皮肤结核（3个月至16岁儿童和青少年）",
      "action": "1. 疗程4个月；2. 异烟肼 10~15 mg·kg⁻¹·d⁻¹ (≤ 300 mg/d)；3. 利福平 10~20 mg·kg⁻¹·d⁻¹ (≤ 600 mg/d)；4. 吡嗪酰胺 30~40 mg·kg⁻¹·d⁻¹ (≤ 2000 mg/d)；5. 若处异烟肼耐药高流行区，前2个月加乙胺丁醇 15 mg·kg⁻¹·d⁻¹ (≤ 750 mg/d)",
      "contraindication": null,
      "evidence": "儿童和青少年（3个月至16岁）：可遵循儿童非严重类型结核病治疗方案，疗程4个月。若处于异烟肼耐药高流行区，可选择在前2个月加用乙胺丁醇。推荐剂量如下：异烟肼 10~15 mg·kg⁻¹·d⁻¹ (≤ 300 mg/d)，利福平 10~20 mg·kg⁻¹·d⁻¹ (≤ 600 mg/d)，吡嗪酰胺 30~40 mg·kg⁻¹·d⁻¹ (≤ 2000 mg/d)，乙胺丁醇 15 mg·kg⁻¹·d⁻¹ (≤ 750 mg/d)"
    },
    "thought": "本案例属于常规诊断与治疗场景，作为急诊/门诊医生，我的思维重点是快速建立鉴别诊断（排除如深部真菌感染或脓皮病等危急重症），并给出直接、高效的治疗决策。Step 1: 场景定义——患者以皮肤病变就诊，无全身危急症状（如发热或呼吸窘迫），属于非紧急的常规皮肤结核诊疗，需优先排除其他感染性疾病并启动标准化疗。Step 2: 临床解码——关键信息包括：患儿右小腿‘苹果酱色’浸润斑块（典型皮肤结核征象）、卫星灶（提示病变扩散）、脓点（继发感染可能）；T-SPOT.TB和GeneXpert阳性（确诊结核分枝杆菌感染），rpoB无突变（药物敏感）；血常规和胸片正常（排除全身结核或细菌感染）；来自黔东南山区（结核高流行区，暗示暴露风险）；母亲焦虑留疤和缩短疗程（需心理安抚）。隐式线索：卡介苗接种史不详（可能影响免疫力），头孢无效（支持非细菌性感染），患儿疲惫（强调治疗依从性重要性）。Step 3: 规则对齐与安全检查——指南Condition‘药物敏感性皮肤结核（3个月至16岁儿童和青少年）’完美匹配病例（年龄9岁、检测阳性、无耐药）。Contraindication为null（无禁忌药物）；安全考虑：体重26kg在剂量范围内（计算异烟肼≤300mg/d、利福平≤600mg/d等），贵州属异烟肼耐药高流行区（需加乙胺丁醇前2个月）；无肝肾功能异常（血常规正常），但需监测药物副作用（如肝毒性或视力影响）。Step 4: 决策生成——依据指南Action，确定4个月疗程，药物剂量基于体重计算：异烟肼300mg/d（上限）、利福平400mg/d（15mg/kg/d）、吡嗪酰胺1000mg/d（38mg/kg/d）、乙胺丁醇390mg/d（前2个月），辅以随访和教育。",
    "medical_order": "诊断：药物敏感性皮肤结核。予抗结核治疗：异烟肼 300 mg 口服 每日一次；利福平 400 mg 口服 每日一次；吡嗪酰胺 1000 mg 口服 每日一次；乙胺丁醇 390 mg 口服 每日一次（限前2个月）。疗程4个月。监测肝功能和视力（每月复查ALT、AST及眼科评估）。伤口护理：局部消毒，保持干燥。随访：每2周门诊复查皮损及药物耐受性。若出现黄疸、视力模糊或新症状，立即就诊。",
    "patient_dialogue": "张妈妈，您和孩子辛苦了，大老远赶来不容易。我先跟您说说孩子的情况：他腿上这个红块儿不是普通感染，是结核菌引起的皮肤问题，我们叫‘皮肤结核’。这病必须好好治，不然容易反复或加重。治疗方案是吃四种药，每天一次，需要坚持整整4个月。头两个月会多吃一种药，因为咱们贵州那边结核菌有时耐药，这样更保险。药名我写给您：异烟肼、利福平、吡嗪酰胺，还有乙胺丁醇（前两个月用）。剂量我们按孩子体重算好了，都是安全的。千万别自己减药或停药——疗程短了的话，病菌可能没死光，以后复发会更难治，还容易留疤。吃药期间，咱们得注意：如果孩子眼睛看东西模糊，或者皮肤、小便变黄，马上告诉我。伤口要每天用碘伏轻轻擦洗，保持干净。您担心留疤我理解，但按时吃药能最大程度减少疤痕。咱们每两周来复诊一次，我帮您盯着。孩子累了，今天早点休息，药从明天开始吃。坚持下来，孩子一定能好起来的！"
  },
  {
    "id": 1694,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "【复诊场景】\n患者3个月前因“右颈部无痛性溃疡2个月”在外院活检，病理报告“真皮非干酪样肉芽肿，抗酸染色见零星阳性杆菌”，当地予HRZE四联抗结核治疗。溃疡一度缩小，但近3周边缘再次隆起渗血，并出现新发脐状丘疹沿胸锁乳突肌排列。追问病史：近1个月午后低热37.6–38.1 ℃，夜间盗汗明显，自行口服对乙酰氨基酚退热。既往：2年前诊断“胸椎8-9结核”，曾不规则服用HR方案6个月后自行停药；否认糖尿病、肝炎。查体：颈部6 cm×4 cm不规则溃疡，基底呈暗红色颗粒，边缘潜行；胸锁乳突肌中下段可触及3枚0.5–0.8 cm质韧皮下结节，无压痛。实验室：WBC 6.8×10⁹/L，LY 28%，CRP 42 mg/L，ESR 78 mm/h；胸片示右肺尖条索影，纵隔窗CT提示T8椎体溶骨性破坏伴椎旁2.2 cm冷脓肿。肝肾功能：ALT 18 U/L，Cr 56 μmol/L。患者职业为夜班网管，抱怨“最近网吧空调太冷，伤口老渗液，黏住衣领”。",
    "reference_rule": {
      "condition": "抗结核治疗后复发病例/治疗反应不佳/合并其他脏器结核感染",
      "action": "考虑进行药物敏感性试验",
      "contraindication": null,
      "evidence": "若为抗结核治疗后复发的皮肤结核病例，或对常规抗结核治疗反应不佳，或合并其他脏器结核感染，可考虑进行药物敏感性试验。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)** - 本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险。作为专科专家，我将全网扫描潜在风险，优先级确保安全（如药物毒性、疾病进展）先于疗效。患者存在皮肤结核和脊柱结核的复发，需检查药物交互、环境因素影响及共病并发症。\n\n**Step 2: 临床解码 (Clinical Decoding)** - 关键信息转化为医学术语：① 皮肤结核复发（溃疡边缘隆起渗血、新发脐状丘疹提示淋巴皮肤结核扩散），合并脊柱结核复发（T8椎体溶骨破坏及冷脓肿）。② 治疗反应不佳：HRZE治疗初期好转后复发，伴午后低热、盗汗（活动性结核症状）。③ 既往依从性问题：胸椎结核曾不规则停药，提示潜在耐药风险。④ 炎症标志物升高（CRP 42 mg/L、ESR 78 mm/h）支持活动性感染。⑤ 职业环境隐式风险：网吧空调低温导致伤口渗液黏着衣领，可能诱发感染或延迟愈合。⑥ 自行口服对乙酰氨基酚：虽肝肾功能正常，但需警惕与抗结核药（如异烟肼）的肝毒性叠加风险。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)** - 指南条件匹配：患者符合“抗结核治疗后复发病例”（溃疡复发）、“治疗反应不佳”（近3周恶化）、“合并其他脏器结核感染”（脊柱结核），指南推荐“考虑药物敏感性试验”。无禁忌症（Contraindication null）。安全检查：① 药物相互作用：HRZE与对乙酰氨基酚联用可能增加肝损伤风险，但当前ALT正常，需持续监测。② 禁忌症：无肝炎、糖尿病史，肝肾功能正常。③ 共病风险：脊柱结核冷脓肿可能导致截瘫；伤口潜在细菌感染；环境暴露加重愈合延迟。安全优先：监测肝酶、避免药物毒性，并评估脊柱稳定性。\n\n**Step 4: 决策生成 (Decision Making)** - 根据指南Action，首要决策为进行药物敏感性试验以评估耐药性，鉴于既往不规则治疗史。同时，强化抗结核方案（升级至二线药物）、影像学评估脊柱风险、优化伤口护理，并干预环境因素，确保整体安全。",
    "medical_order": "1. 完善结核分枝杆菌药物敏感性试验（包括利福平、异烟肼等一线药）。\n2. 调整抗结核方案：停用HRZE，改用二线强化方案（如含阿米卡星0.4g iv qd、左氧氟沙星0.75g po qd、环丝氨酸0.25g po bid），疗程至少12个月；监测肝功能（每2周查ALT、AST）及肾功能。\n3. 影像学评估：行脊柱MRI（含增强）评估T8冷脓肿范围及神经压迫风险，必要时请骨科会诊手术引流。\n4. 局部处理：颈部溃疡清创后予生理盐水湿敷 bid，覆非粘连敷料保护；新发丘疹观察，避免挤压。\n5. 避免自行口服对乙酰氨基酚，改用物理降温；监测体温 qd。\n6. 职业干预：建议更换工作环境或伤口暴露管理，避免潮湿低温接触。",
    "patient_dialogue": "王先生，您好。看了您的检查结果，我理解您最近伤口又疼又渗液，还发烧出汗，这确实让人烦恼。咱们的结核病可能有点反复了，以前用的药效果不够好，所以我们要做个专门的测试，看看哪种药物对您最管用——这就像给细菌做个‘体检’，找出最好的武器来对付它。另外，您背部的旧问题也需要检查一下，防止它加重影响神经，我会安排一个更详细的扫描。伤口护理上，我建议每天用盐水轻轻清洗，再盖个透气纱布，网吧空调太冷的话，尽量穿宽松衣服或者用创可贴保护，别让伤口老黏着衣领，容易感染。还有，退烧药先别自己吃，万一和结核药冲突伤肝就不好了，用冷毛巾敷额头就行。您放心，咱们一步步来，我会帮您制定一个更稳妥的治疗计划，争取早点好起来。"
  },
  {
    "id": 1696,
    "file_name": "中国皮肤结核临床诊疗专家共识（2024版）.json",
    "case_input": "患者因“左小腿溃疡3个月、疼痛加重1周”就诊。3个月前局部出现黄豆大结节，破溃后形成边缘潜行的溃疡，基底呈暗红色肉芽，覆少量脓性分泌物，触痛明显。外院曾按“细菌性皮肤溃疡”给予头孢+甲硝唑2周无效。既往史：2018年确诊HIV感染，未规律抗病毒治疗；2022年患肺结核，痰涂片阳性，药敏提示异烟肼耐药、利福平敏感，完成6个月R+E+Z+左氧氟沙星方案后痰阴转。无糖尿病、无肝病。查体：T 37.8 ℃，左小腿前侧5 cm×3 cm不规则溃疡，边缘呈蓝紫色，可触及皮下硬结，局部淋巴结未肿大。实验室：WBC 6.8×10⁹/L，Hb 112 g/L，CRP 42 mg/L，ESR 78 mm/h；溃疡分泌物GeneXpert MTB/RIF阳性，rpoB野生型，inhA突变阳性；HIV RNA 1.8×10⁵ copies/mL，CD4 110/μL；肝肾功能正常。胸片示右上肺条索影，无活动性病灶。患者担忧再次长期住院，询问能否门诊治疗并尽快开始抗病毒药。",
    "reference_rule": {
      "condition": "耐药性皮肤结核（多重耐药或广泛耐药）",
      "action": "1. 参考耐药肺结核方案；2. 结合药敏结果选用二线药物（氯法齐明、环丝氨酸等）；3. 多重耐药结核：9~12个月短程或18~20个月长程方案（起始≥4种有效药物）；4. 异烟肼耐药利福平敏感：利福平+乙胺丁醇+吡嗪酰胺+左氧氟沙星治疗6个月；5. HIV感染者：抗结核开始8周内启动抗逆转录病毒治疗，采用6(H)REZ-左氧氟沙星方案",
      "contraindication": "5岁以下或体重<10kg儿童使用氟喹诺酮类；老年患者使用丙硫异烟胺、阿米卡星等肝肾毒性药物",
      "evidence": "目前对于耐药性皮肤结核的治疗尚无相关研究，可参考耐药肺结核治疗方案，结合药物敏感性检测结果、药物的可及性、有效性和安全性，根据个体情况使用二线抗结核药物进行治疗。多重耐药结核病的治疗包括9~12个月的短程治疗方案和18~20个月的长程治疗方案（治疗开始时至少应有4种可能有效的抗结核药物）。对于确诊的异烟肼耐药而利福平敏感的患者，建议用利福平、乙胺丁醇、吡嗪酰胺、左氧氟沙星治疗6个月。儿童耐多药结核病的治疗可参考成人的治疗方案，但在选择药物时应充分权衡利弊，原则上不推荐氟喹诺酮类用于5岁以下或体重低于10kg的儿童。老年患者应按年龄分层酌情选择抗结核药物的种类和数量，慎用丙硫异烟胺、阿米卡星、卷曲霉素等有肝肾毒性的药物。对于HIV感染者，应在抗结核治疗开始后8周内开始接受抗逆转录病毒治疗，推荐使用 6(H)REZ（H：异烟肼，R：利福平，Z：吡嗪酰胺，E：乙胺丁醇，疗程6个月）-左氧氟沙星治疗方案。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，涉及耐药性皮肤结核（异烟肼耐药、利福平敏感）与未控制的HIV感染共存。作为专科专家，我的关注重点是全网扫描药物相互作用（如抗结核药与ART的潜在冲突）、禁忌症（特别是肝肾毒性风险）及共病风险（HIV免疫抑制可能加重结核），优先级为安全 > 疗效。\n\nStep 2: 临床解码 (Clinical Decoding): 关键信息提取：溃疡分泌物GeneXpert阳性确认皮肤结核，药敏显示inhA突变（异烟肼耐药）和rpoB野生型（利福平敏感），结合既往肺结核治疗史（R+E+Z+左氧氟沙星有效），表明为异烟肼耐药结核。HIV相关：CD4 110/μL（严重免疫抑制）、HIV RNA 1.8×10⁵ copies/mL（高病毒载量），未规律ART，增加机会感染风险。隐式线索：轻度发热（T 37.8℃）、CRP/ESR升高提示活动性炎症；溃疡边缘蓝紫色和皮下硬结暗示深部感染；肝肾功能正常但需警惕药物毒性；患者担忧住院，寻求门诊治疗，需评估可行性。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南condition匹配‘耐药性皮肤结核（异烟肼耐药利福平敏感）’。Action对齐：推荐利福平(R)+乙胺丁醇(E)+吡嗪酰胺(Z)+左氧氟沙星(L)治疗6个月；HIV感染者需在抗结核开始8周内启动ART。安全检查：无contraindication（患者成人，无儿童或老年相关限制；肝肾功能正常，但氟喹诺酮类（左氧氟沙星）和吡嗪酰胺有潜在肝肾毒性风险，需监测）。全网扫描：R可能降低某些ART药物浓度（如NNRTIs），需选择兼容方案；HIV免疫抑制增加结核治疗失败风险；无糖尿病或肝病，但ESR/CRP升高需警惕全身炎症。\n\nStep 4: 决策生成 (Decision Making): 基于指南action和安全优先原则，决策为：门诊启动抗结核（R+E+Z+L 口服6个月）和ART（选用与R兼容的方案，如含多替拉韦的整合酶抑制剂），辅以局部溃疡护理；ART在抗结核后尽快开始（≤8周内），但鉴于CD4低，优先1-2周内启动；门诊可行因无全身危急症状，但需密集随访监测药物毒性及疗效。",
    "medical_order": "诊断：耐药性皮肤结核（异烟肼耐药、利福平敏感）；HIV感染（未控制）。\n处理：\n1. 抗结核治疗：予利福平600 mg 口服 QD、乙胺丁醇1200 mg 口服 QD、吡嗪酰胺1500 mg 口服 QD、左氧氟沙星750 mg 口服 QD，疗程6个月。\n2. 抗逆转录病毒治疗：予多替拉韦50 mg 口服 BID + 替诺福韦 300 mg 口服 QD + 恩曲他滨200 mg 口服 QD，启动时间不晚于抗结核后2周。\n3. 局部护理：溃疡予生理盐水清洗 QD，覆银离子敷料，监测感染征象。\n4. 监测：每周随访查体、溃疡评估；每2周查血常规、肝肾功能、CRP、ESR；抗结核启动后4周复查溃疡分泌物GeneXpert；ART启动后4周测HIV RNA及CD4。\n5. 门诊管理：予一级护理，若出现发热>38.5°C、溃疡恶化或肝酶升高>3倍，立即转诊住院。",
    "patient_dialogue": "张先生，我完全理解您不想再住院的心情，咱们先聊聊您的病情和治疗计划。您的腿上的溃疡不是普通的感染，而是一种叫结核的病菌引起的，而且它对一种常用药有抵抗力——这有点像是细菌‘学会了’躲开药物。好消息是，咱们有办法对付它！同时，您的HIV也需要尽快控制，因为它让身体抵抗力变弱，容易让溃疡更难好。\n\n治疗上，我们会给您开四种药片：一种叫利福平，一种乙胺丁醇，一种吡嗪酰胺，还有一种左氧氟沙星——这些专门针对结核菌，每天按时吃就行，预计需要6个月。另外，您提到想尽快开始HIV药，这很对！我们会在两周内给您加上三种新药，帮助您提高免疫力。如果不及时用药，溃疡可能扩散或复发，HIV也会继续伤害身体。\n\n现在，好消息是：您目前没有高烧或严重问题，咱们可以在门诊治疗，不用住院。但您得每周来诊所检查一次伤口和抽血，这样我们确保药物有效且安全——比如有些药可能影响肝脏，咱们得盯紧点。您能答应我按时吃药和复查吗？这很关键，就像给身体打一场‘保卫战’，我会全程帮您！"
  }
]