[
  {
    "id": 1699,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "呼吸与危重症医学科病房，上午交接班。患者女性，32岁，BMI 19.4 kg/m²，既往「2型糖尿病」6年，血糖控制欠佳（空腹血糖9.8 mmol/L，HbA1c 8.7%）。主因「咳嗽伴活动后喘憋8个月，加重伴发热3天」入院。8个月前确诊「气管支气管结核」，已完成规范抗结核治疗（2HRZE/10HRE），痰MTB阴性。近4个月因主气道瘢痕狭窄在外院接受4次球囊扩张+冷冻消融，每次术后2-3周再发喘鸣。入院查体：T 38.2 ℃，RR 28次/分，SpO₂ 89%（鼻导管5 L/min），三凹征阳性；听诊双肺哮鸣音，右肺为主。急诊血气：PaO₂ 56 mmHg，PaCO₂ 48 mmHg。颈部增强CT：气管中段及右主支气管环形瘢痕狭窄，最窄处直径约4 mm，长度2.1 cm，管壁轻度软化，远端肺野斑片渗出影。患者自述「走平路不足50米就得停下喘气」，夜间无法平卧，已请假暂停网店客服工作。今日痰培养提示铜绿假单胞菌阳性。早晨查房，住院医师汇报：球囊扩张联合冷冻已反复4次仍狭窄复发，患者呼吸功能持续恶化，请示下一步方案。",
    "reference_rule": {
      "condition": "气管、主支气管等大气道严重狭窄导致呼吸困难、呼吸衰竭，严重影响生活质量者；气管支气管结核管壁软化型合并呼吸道反复严重感染；中心气道瘢痕狭窄经球囊扩张成形术等联合治疗反复多次仍难以奏效，并呼吸功能不佳者",
      "action": "1. 置入支架，首选硅酮支架（国内尚无，可选择可回收的全覆膜金属支架或金属裸支架）；2. 推荐金属支架取出时间为置入后 30d 内，最长不应超过 60d；3. 支架置入后 24~48h、第 1 个月内应每周、1 个月后每月进行气管镜检查 1 次；4. 应用冷冻术消除气道内肉芽组织增生；5. 气道雾化吸入、祛痰药应用",
      "contraindication": "同支气管镜检查禁忌证",
      "evidence": "适应证：气管、主支气管等大气道严重狭窄导致呼吸困难、呼吸衰竭，严重影响生活质量者；气管支气管结核管壁软化型合并呼吸道反复严重感染；中心气道瘢痕狭窄经球囊扩张成形术等联合治疗反复多次仍难以奏效，并呼吸功能不佳者。禁忌证：同支气管镜检查禁忌证。治疗原理：气道内支架治疗是利用支架的支撑作用重建气道壁的支撑结构，保持呼吸道通畅。支架类型：目前适合于治疗气管支气管结核气道狭窄的支架为硅酮支架、全覆膜金属支架及金属裸支架。支架应首选硅酮支架，因国内尚无硅酮支架，可选择可回收的全覆膜金属支架、可回收的金属裸支架，一般情况下禁止使用不可回收的金属裸支架。注意事项：①气管支气管结核所引起的气道狭窄为良性狭窄，支架置入术应慎之又慎、权衡利弊。②由于支架置入后肉芽组织增生所致的再狭窄不可避免，尤其是无覆膜的金属裸支架刺激增生作用较强，管壁软化基础上可能继发 III 型狭窄，且后续处理耗费人力物力较大，不论是 IV 型还是 V 型，均以置入临时性支架为妥。推荐金属支架取出时间为置入后 30d 内，最长不应超过 60d。至于既不影响支架取出，又是置入最短时长，而且气道成形、硬化又具有良好支撑作用的共同时间点，还有待于不断研究探索。③若合并呼吸困难、呼吸功能不良、呼吸道反复感染，临床评估患者生存期较短、临时性支架效果可能不佳，又无手术指征者，才可考虑永久性支架置入。④支架置入后 24~48h、第 1 个月内应每周、1 个月后每月进行气管镜检查 1 次。气道雾化吸入、祛痰药应用可降低气道再狭窄发生率。⑤气管结核合并气管及主支气管等气道狭窄，气管支架置入能迅速改善通气、缓解症状，并能为处理下游主支气管等气道狭窄提供了充足的空间帮助。可通过支架对下游狭窄气道进行球囊扩张术等介入治疗。⑥支架置入后可应用冷冻术消除气道内肉芽组织增生。并发症：支架置入可引刺激性咳嗽、气道局部异物感、出血、感染、气道再狭窄（痰液阻塞及黏膜肉芽肿增生）、支气管管壁瘘、支架移位、支架疲劳、支架断裂及支架取不出等并发症。"
    },
    "thought": {
      "Step 1: 场景定义 (Scenario Definition)": "本案例属于复杂合并症治疗场景，涉及气管狭窄、糖尿病控制不佳及呼吸道感染的交互作用。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险（如糖尿病恶化感染、支架并发症），严格遵循安全 > 疗效的优先级。",
      "Step 2: 临床解码 (Clinical Decoding)": "基于病例提取关键信息：① 活动后喘憋及夜间无法平卧表明严重呼吸衰竭（PaO₂ 56 mmHg，PaCO₂ 48 mmHg）；② 4次介入治疗失败后狭窄复发提示瘢痕顽固性（气管最窄4mm，长度2.1cm）；③ 铜绿假单胞菌感染（痰培养阳性）和发热（T 38.2℃）需紧急处理；④ 糖尿病控制差（HbA1c 8.7%）增加感染风险和伤口愈合障碍；⑤ 管壁软化（CT显示）可能加剧支架术后再狭窄风险。隐式线索：反复操作可能已诱发局部炎症和肉芽增生，加重气道阻塞。",
      "Step 3: 规则对齐与安全检查 (Alignment & Safety)": "病例完美匹配指南 Condition（中心气道瘢痕狭窄反复治疗无效、呼吸功能恶化合并感染）。检查 Contraindication：无支气管镜禁忌（无出血倾向、心肺功能稳定）。安全扫描：① 糖尿病需优化降糖以防感染加重；② 支架类型需避免不可回收金属裸支架（指南禁止）；③ 铜绿假单胞菌要求针对性抗生素。风险优先级：感染控制 > 支架置入时机 > 血糖管理。",
      "Step 4: 决策生成 (Decision Making)": "根据指南 Action，决策分步执行：① 立即控制感染（铜绿假单胞菌）并优化呼吸支持；② 置入可回收全覆膜金属支架（硅酮支架国内不可得），30天内取出；③ 术后强化随访（支气管镜监测）及辅助治疗（雾化+祛痰）；④ 同步管理糖尿病。排除永久支架（患者年轻、良性狭窄）。"
    },
    "medical_order": "1. 予一级护理，持续心电监护及SpO₂监测；鼻导管氧疗调整为高流量湿化氧疗（Flow 40 L/min，FiO₂ 50%），目标SpO₂ > 92%。2. 抗感染治疗：静脉滴注头孢他啶 2g q8h（覆盖铜绿假单胞菌），疗程7-10天；监测痰培养及药敏。3. 优化血糖控制：予胰岛素泵持续皮下输注，目标空腹血糖4.4-7.0 mmol/L，餐后血糖<10 mmol/L；每日监测血糖谱。4. 气道介入治疗：全麻下行支气管镜引导气道支架置入术（选用可回收全覆膜金属支架），术后24h内复查支气管镜；支架计划30日内取出。5. 辅助治疗：布地奈德混悬液 2mg + 乙酰半胱氨酸 0.3g 雾化吸入 bid；盐酸氨溴索 30mg 静脉推注 tid。6. 随访计划：支架置入后24h、第1周、2周、4周行支气管镜检查；若肉芽增生予冷冻消融术。7. 完善检查：每日复查血气分析；3天后复查颈部CT评估支架位置及肺部渗出。",
    "patient_dialogue": "姑娘，咱们得一步步解决你喘不上气的问题。首先，你肺里现在有个细菌感染在捣乱，这就像伤口发炎一样，让你发烧还更憋得慌。我们今天就会给你用上强效的消炎药，帮你把感染压下去。另外，你之前扩张气道的治疗没效果，是因为疤痕太‘顽固’了——就像橡皮筋总弹回去。所以，我们计划放一个临时的小支架进去，把它撑开，这样你呼吸就能顺畅些。这个支架是特制的，一个月内就能取出来，不会一直留在身体里。不过啊，你有糖尿病这个老问题，血糖没管好会让感染更难对付。咱们得一起努力，护士会教你用胰岛素泵，把血糖稳下来。这几天你多吸氧，配合做雾化（对着面罩慢慢吸气就行），把痰排干净。别太担心，我会每天来看你，咱们争取早点让你能走路、能平躺着睡觉！"
  },
  {
    "id": 1692,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "32岁女性，既往体健，3年前确诊肺结核并完成标准抗结核治疗。近半年出现活动后气促、干咳，外院CT提示‘右主支气管壁增厚伴管腔重度狭窄’，转诊至我院。支气管镜下见右主支气管距隆突1.5 cm处瘢痕性环形狭窄，狭窄段长度约1.8 cm，最小内径3 mm，黏膜苍白无活动性溃疡；吸气相CT三维重建显示同一水平气道软化，管腔塌陷>70%。肺功能：FEV1 0.95 L（占预计值35%），FEV1/FVC 0.48，提示重度阻塞性通气功能障碍。今日复诊，患者步行10米即喘，静息指脉SpO2 92%，伴夜间咳嗽影响睡眠；无发热、盗汗或痰血。实验室：血常规、CRP正常，痰涂片及GeneXpert MTB/RIF三次阴性。患者为地铁安检员，担心因病失业，情绪焦虑。目前口服茶碱缓释片0.2 g bid，雾化布地奈德1 mg bid，症状无改善。",
    "reference_rule": {
      "condition": "针对 IV、V 型临床非活动期气管支气管结核",
      "action": "主要是治疗气道狭窄、闭塞、软化，尤其是严重中心气道，最大限度的恢复病变段气道的通畅和引流，改善肺的通气，尽可能保全肺功能",
      "contraindication": null,
      "evidence": "针对 IV、V 型临床非活动期气管支气管结核，主要是治疗气道狭窄、闭塞、软化，尤其是严重中心气道，最大限度的恢复病变段气道的通畅和引流，改善肺的通气，尽可能保全肺功能。"
    },
    "thought": "本案例属于复杂合并症治疗场景。作为专科专家，我的关注重点是全网扫描潜在风险，包括药物相互作用、禁忌症及共病风险，确保安全优先于疗效。Step 1: 场景定义 – 患者有肺结核后遗症（气道狭窄和软化），合并重度阻塞性通气功能障碍和生活质量受损，属于复杂病变需多学科干预。Step 2: 临床解码 – 关键信息：32岁女性，结核病史已治愈（非活动期），现右主支气管瘢痕性环形狭窄（长度1.8 cm，内径3 mm）伴软化（塌陷>70%），导致重度阻塞性通气功能障碍（FEV1 35%），症状包括活动后气促、静息低氧（SpO2 92%）和夜间咳嗽；当前治疗（茶碱和布地奈德）无效，无活动性结核证据（痰阴性）；隐式线索：焦虑情绪可能影响依从性，职业暴露（地铁安检员）或加重呼吸道刺激，肺功能严重下降提示紧急干预必要。Step 3: 规则对齐与安全检查 – 指南针对IV、V型非活动期气管支气管结核，本病例完全匹配（狭窄和软化为主）；指南contraindication为null，无禁忌；安全检查：茶碱有窄治疗窗风险（如心律失常），需监测血药浓度；布地奈德安全，但无效提示需升级；共病风险：低氧血症可能进展为呼吸衰竭，焦虑未处理或影响治疗。Step 4: 决策生成 – 根据指南action（治疗气道狭窄/软化以恢复通畅），优先介入治疗（如支气管镜球囊扩张或支架置入）以改善通气；同时支持治疗缓解症状，并整合心理干预。",
    "medical_order": "予评估支气管镜介入治疗指征，完善术前检查（包括血常规、凝血功能、心电图）；建议行右主支气管球囊扩张术或硅酮支架置入术，以恢复管腔通畅；监测氧饱和度，必要时予低流量氧疗（目标SpO2 >94%）；停用无效药物（茶碱缓释片、布地奈德雾化）；予肺功能复查及动脉血气分析；推荐心理科会诊评估焦虑；建议职业健康咨询；出院后随访肺康复计划。",
    "patient_dialogue": "王女士，我理解您最近呼吸很困难，走路几步就喘，晚上还咳嗽得睡不好，这确实让人焦虑。放心，这不是结核复发，而是以前结核留下的疤痕让您的气道变窄变软了，就像水管堵住了一样，所以吸不进气。我们会尽快安排一个微创小手术，用个气球样的工具把狭窄的地方撑开，或者放个小支架保持通畅，这样呼吸就能轻松很多。现在您吃的药效果不大，我们先停掉，换成其他方法帮您。另外，您提到担心工作的事，这很正常，但别急，等治疗改善了，咱们再一起和单位商量调整岗位。记住，这不是大病，但得及时处理，不然呼吸会更吃力。您有任何疑问随时问我！"
  },
  {
    "id": 1679,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "患者近6周出现刺激性干咳，夜间加重，伴活动后气短，无发热、盗汗或咯血。外院按‘过敏性咳嗽’口服孟鲁司特及吸入布地奈德2周无缓解。既往体健，无吸烟史，宠物店店员（每日接触鹦鹉、仓鼠）。查体：双肺听诊未闻及干湿啰音，SpO₂ 97%（未吸氧）。门诊胸片示‘双肺纹理增粗，右肺门影稍浓’；血常规嗜酸粒细胞4%，CRP 8 mg/L，T-SPOT.TB 抗原A 28 SFCs/2.5×10⁵ PBMC（阳性界值≥6）。患者今日复诊时提到‘早上刷牙会咳出一点点像胶水一样的白痰，带一点点血丝’，并抱怨最近两周声音变得嘶哑。",
    "reference_rule": {
      "condition": "临床高度怀疑气管支气管结核存在",
      "action": "进行支气管镜检查",
      "contraindication": null,
      "evidence": "临床高度怀疑气管支气管结核存在，应进行支气管镜检查。支气管镜检查的适应证如下：1. 肺结核患者咳嗽、气促、呼吸困难等临床症状与肺部病灶范围、严重程度不相符。2. 肺结核患者抗结核化学治疗后，肺内病变吸收好转，但咳嗽等症状仍无明显改善。3. 肺结核患者治疗过程中出现患侧病灶增多、增大，出现支气管播散病灶、张力性空洞。4. 肺结核患者 X 线胸片等影像学检查提示阻塞性肺炎、肺充气不良、肺不张、局限性肺气肿及多叶段广泛病灶。5. 肺结核患者胸部 CT 平扫、高分辨率 CT、气管及支气管多维重建技术等，提示气管、支气管内壁粗糙、不光滑或伴有叶、段支气管狭窄及闭塞。6. 不明原因慢性持续性咳嗽、咳痰、咯血、喘鸣、声嘶及呼吸困难，尤其是痰抗酸杆菌阳性而肺部无结核病灶。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，优先排除危急重症（如活动性结核或恶性肿瘤），并基于现有证据给出直接的诊疗指令。Step 2: 临床解码 (Clinical Decoding)：患者病史显示慢性刺激性干咳（6周）、夜间加重、活动后气短、治疗无效（孟鲁司特和布地奈德无缓解），新出现痰中带血丝和声嘶，提示气道刺激或病变。关键隐式线索包括T-SPOT.TB阳性（28 SFCs，高于阳性界值≥6）和职业暴露（宠物店店员，接触鹦鹉和仓鼠，增加感染风险），胸片异常（双肺纹理增粗、右肺门影稍浓）支持气道炎症。医学术语转化：符合气管支气管结核的临床表现（如不明原因慢性咳嗽、咳血、声嘶），需鉴别鹦鹉热、支气管肿瘤或其他感染。Step 3: 规则对齐与安全检查 (Alignment & Safety)：患者症状（慢性咳嗽、气短、血丝痰、声嘶）与指南Condition '临床高度怀疑气管支气管结核存在' 高度匹配，尤其符合证据第6条（不明原因咳嗽、咳血、声嘶）。指南无禁忌症（Contraindication为null），安全检查确认患者生命体征稳定（SpO₂ 97%，无发热），支气管镜检查风险可控（无出血倾向或严重心肺疾病）。Step 4: 决策生成 (Decision Making)：根据指南Action '进行支气管镜检查'，直接决策为立即安排支气管镜检查，以确诊或排除气管支气管结核。",
    "medical_order": "予立即安排支气管镜检查，评估气管支气管结核可能；完善痰抗酸杆菌涂片及培养；监测生命体征；限制剧烈活动；门诊随访。",
    "patient_dialogue": "王先生，您的咳嗽症状持续了快两个月，药物没效果，现在又出现了痰中带血丝和声音嘶哑，这确实让人担心。结合检查结果，我们高度怀疑气管里可能有结核感染或其他问题。为了搞清楚原因，我们需要做个支气管镜检查——就是用一根很细的管子，轻轻伸进喉咙里，看看气管里面的情况。这能帮我们确诊，尽早开始治疗。如果不做检查，可能会耽误病情，结核感染是可以治好的，别太紧张。检查过程会有点不舒服，但我们会用麻药减轻疼痛，确保安全。"
  },
  {
    "id": 1687,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "今日介入室。患者 27 岁，体重 48 kg，因「咳嗽 4 个月、活动后气促 2 周」由结核科转入。胸部 CT 提示右主支气管腔内不规则软组织影，管腔狭窄约 70%。镜下见右中间段支气管开口处一簇灰粉色葡萄样肉芽突入管腔，触之易出血，基底宽广。护士把标准 7 mm 支气管镜插入后，发现肉芽几乎堵塞工作通道；患者血氧 92%，心率 110 次/分，自述「像有人掐住胸口」。她是一名插花师，担心术后嗓音改变影响接单。今日治疗目标为尽快恢复通气并取材送检，但气道黏膜水肿明显，操作需格外谨慎。",
    "reference_rule": {
      "condition": "气管支气管结核肉芽增殖型",
      "action": "1. 使用热消融疗法（激光、高频电刀、氩等离子体凝固（APC）、微波等）削减突出到管腔内较大的结核性肉芽肿；2. 依次推荐使用激光、高频电刀、微波及 APC 等，并要求尽量不损伤气道黏膜；3. 肉芽肿基底部推荐使用冷冻疗法；4. 针对中心气道等较大气道严重瘢痕狭窄、管腔闭塞，推荐使用针形激光刀或针形高频电刀；5. 热消融治疗时禁止使用氧疗吸入",
      "contraindication": "同支气管镜检查禁忌证",
      "evidence": "适应证：气管支气管结核肉芽增殖型。禁忌证：同支气管镜检查。治疗措施：目前利用热消融疗法治疗方式有激光、高频电刀、氩等离子体凝固（argon plasma coagulation, APC）、微波等，各自具有特点及治疗优缺点。治疗原理：利用发热效应引起结核等组织细胞凝固与坏死而达到治疗目的。激光治疗主要借助于高功率激光，直接烧灼、凝固、汽化或炭化组织；高频电刀是通过高频电流热效应烧灼病变组织，使病变组织发生蛋白质变性、凝固、坏死；APC 又称氩气刀，通过高频电刀电离的氩气将高频电流输送到靶组织，避免了高频电刀的电极与组织直接接触；微波治疗是基于高频电磁波-微波对不同血运组织、细胞敏感性不同，使组织、细胞蛋白质变性、凝固及坏死。注意事项：①上述治疗措施均可能造成气道黏膜损伤，刺激黏膜增生即再生肉芽肿发生。APC 黏膜损伤范围大于激光、高频电刀。②热消融疗法削减突出到管腔内较大的结核性肉芽肿，依次推荐使用激光、高频电刀、微波及 APC 等，并要求尽量不损伤气道黏膜。③若使用热消融疗法削减较大结核性肉芽肿，肉芽肿基底部推荐使用冷冻疗法，以更好修复气道黏膜损伤及彻底消除再生性肉芽肿。④针对中心气道等较大气道严重瘢痕狭窄、管腔闭塞处理，因气道走行出现较大扭曲而偏离原正常走行，若使用热消融疗法，推荐使用针形激光刀或针形高频电刀，慎重选择 APC 或高频电凝，切不可盲目行事，以免造成气道及周围血管透壁伤而危及生命。⑤热消融治疗时禁止使用氧疗吸入。并发症：均可导致气道黏膜烧伤、气道穿孔、气道内大出血、低氧血症、气胸、纵隔和皮下气肿等，汽化烟雾可引起咳嗽等。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于操作规范与测量场景，涉及支气管镜下的热消融治疗执行，需严格遵循指南操作流程。关注重点：物理条件是否满足（如设备可用性、患者生命体征稳定性）、操作步骤是否遗漏（基于指南推荐顺序）、干扰因素（如气道堵塞、黏膜水肿、氧疗风险）是否影响操作准确性。\nStep 2: 临床解码 (Clinical Decoding): 从病例提取关键信息：患者体重48kg（可能影响麻醉剂量），血氧92%（轻度低氧血症）、心率110次/分（心动过速）、自述窒息感（提示急性气道阻塞），镜下见右中间段支气管开口处肉芽堵塞工作通道（中心气道严重狭窄）、基底宽广且触之易出血（易出血性肉芽肿）、气道黏膜水肿（增加操作风险）。隐式线索：患者为插花师担心嗓音改变（暗示喉部损伤风险），今日目标为恢复通气并取材（需快速有效操作）。转化为医学术语：气管支气管结核肉芽增殖型导致气道阻塞、低氧血症、心动过速、黏膜水肿性狭窄。\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 病例与指南Condition匹配（气管支气管结核肉芽增殖型）。检查禁忌证：支气管镜检查禁忌证包括严重心肺功能不全、凝血障碍或不稳定状态；患者血氧92%和心率110提示潜在风险（但未提及明确禁忌如凝血问题），需在操作前确认无禁忌。安全重点：操作中禁止氧疗吸入（避免火灾风险），黏膜水肿和肉芽易出血增加并发症（如气道穿孔或大出血）风险，需优先稳定生命体征。\nStep 4: 决策生成 (Decision Making): 根据指南Action，针对中心气道严重狭窄（右中间段支气管），优先选择激光热消融（推荐序列首位）削减肉芽肿，基底部应用冷冻疗法以减少黏膜损伤和再生风险；禁止氧疗吸入；操作中需密切监测生命体征，确保物理条件（如设备准备）完备，以快速恢复通气并取材送检。",
    "medical_order": "予支气管镜下介入治疗：1. 准备激光热消融设备，削减右中间段支气管开口处肉芽肿；2. 肉芽肿基底部应用冷冻疗法；3. 操作中禁止氧疗吸入；4. 取材送病理及微生物检查；5. 全程监测血氧、心率、血压，备好止血及复苏设备；6. 术后观察嗓音变化及并发症（如出血、低氧）。",
    "patient_dialogue": "你好，我是你的医生。今天我们要处理你气道里的那些肉芽，它们堵塞了你的呼吸，所以你才会感觉像被掐住胸口。我们会用一种特殊的光线治疗来烧掉这些肉芽，整个过程很快，目的是让你呼吸更顺畅，同时取点样本去化验确认病因。操作时不能用氧气，以防意外，但我们会小心保护你的嗓子——我知道你是插花师，靠声音工作，我会尽量避免任何影响。手术后，你的胸闷感应该会缓解，我们也会检查你的声音情况。别担心，团队都在这里确保安全，咱们一起搞定它！"
  },
  {
    "id": 1693,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "患者因“咳嗽伴活动后气促3个月”入院。胸部增强CT提示右主支气管距隆突1.5 cm处瘢痕性环形狭窄，狭窄段长约1.2 cm，剩余管径3 mm，所属右肺各叶分支通畅、未见损毁；痰Gene-Xpert MTB/RIF阳性，已启动HRZE四联抗结核第17天，体温37.0 ℃，血CRP 18 mg/L。今日上午支气管镜见原狭窄口被灰白色坏死膜与水肿组织部分堵塞，镜身4.9 mm无法通过。患者上臂围34 cm，常规袖带无法固定，护士正在寻找大号袖带准备术前血压监测。患者职业为地铁安检员，担心术后无法尽快返岗，不停询问“能不能一次就把管子撑回原来那么粗”。室外暴雨，电梯短暂故障，运送车滞留在三楼。",
    "reference_rule": {
      "condition": "气管支气管结核引起的中心气道等较大气道瘢痕性狭窄，所属该侧肺末梢无损毁",
      "action": "1. 把握扩张时机，不能操之过急（如急性炎症期）也不能延误扩张机会（如气道完全闭锁）；2. 全身及局部有效抗结核药物治疗，冷冻术等措施减轻水肿、清除坏死物、削减肉芽肿及纤维瘢块等，待气道内局部病灶得到控制后再行扩张；3. 扩张用压力可选择 2~8 个大气压（202~808 kPa），通常由低到高；4. 扩张气管时球囊持续膨胀时间 15s 以内，扩张气管以下部位时球囊持续膨胀时间 1 min 左右；5. 若无明显出血，间隔 15~30s，可重复 1~2 次充盈球囊扩张；6. 结合胸部 CT 支气管多维重建影像学及支气管镜下表现，准确判断狭窄程度和范围，选择适当型号的球囊导管；7. 对于狭窄程度重且气道开口较小病例，先以探针试探能否进入狭窄气道；8. 若不能进入，尝试冷冻术、针形激光刀或针形高频电刀进行狭窄口切开；9. 对于气道完全闭锁，尝试冷冻术或在气道内超声引导下用针形激光刀或针形高频电刀打通闭锁；10. 扩张中遇瘢痕组织较硬，逐渐增加压力泵压力及扩张维持时间，或以针形激光刀、针形高频电刀对纤维瘢痕行放射状切割松解；11. 气管狭窄及距隆突较近部位主支气管狭窄扩张时，重视主气道是否通畅；12. 多部位中心气道等较大气道狭窄，采用先处理近端气道再处理远端气道；13. 扩张出现气道撕裂伤，先镇咳，预防感染及对症处理；14. 长期反复行支气管镜检查、扩张，认真权衡利弊",
      "contraindication": "气管支气管结核管壁软化型，其他禁忌证同支气管镜检查",
      "evidence": "适应证：气管支气管结核引起的中心气道等较大气道瘢痕性狭窄，所属该侧肺末梢无损毁。禁忌证：气管支气管结核管壁软化型，其他禁忌证同支气管镜检查。治疗原理：球囊扩张治疗的原理是将球囊导管自支气管镜活检孔送至气道狭窄部位，用液压枪泵向球囊内注水使球囊充盈膨胀，导致狭窄部位气道形成多处纵行撕裂伤，从而使狭窄气道得以扩张。注意事项：①应严格掌握适应证，充分进行术前准备，把握扩张时机，既不能操之过急（如急性炎症期）也不能延误扩张机会（如气道完全闭锁）。全身及局部有效抗结核药物治疗，冷冻术等措施有助于减轻水肿、清除坏死物、削减肉芽肿及纤维瘢块等，待气道内局部病灶得到控制后再行扩张。上述措施在减轻临床症状、促进病灶愈合、为早期扩张创造机会又防止扩张后病灶播散、再狭窄的发生等方面具有积极意义。②扩张用压力可选择 2~8 个大气压（202~808 kPa），通常由低到高，扩张气管时球囊持续膨胀时间 15s 以内，扩张气管以下部位时球囊持续膨胀时间 1 min 左右，若无明显出血，间隔 15~30s，可重复 1~2 次充盈球囊扩张。③结合胸部 CT 支气管多维重建影像学及支气管镜下表现，尽量准确判断狭窄的程度和范围及有无扩张指证，并选择适当型号的球囊导管，避免选择超过狭窄段正常生理直径的球囊导管。④对于狭窄程度重且气道开口较小病例，目测不好判断狭窄程度及球囊导管能否顺利进入时，可先以探针试探能否进入狭窄气道并大致估计狭窄程度。若不能进入，可尝试冷冻术、针形激光刀或针形高频电刀进行狭窄口切开。上述措施除冷冻术外需特别慎重。⑤对于气道完全闭锁、探针进入狭窄段较浅病例，应首先结合病史、临床及影像学等判断有无处理价值，可尝试冷冻术或在气道内超声引导下用针形激光刀或针形高频电刀打通闭锁，闭锁打通后再进行球囊扩张。若合并末梢侧肺已明显毁损，则建议外科手术。⑥扩张中遇瘢痕组织较硬，扩张时应逐渐增加压力泵压力及扩张维持时间，或以针形激光刀、针形高频电刀对纤维瘢痕行放射状切割松解，切不可骤增扩张压力，以防止出现较大的撕裂伤，甚至造成气道的撕裂出现纵隔气肿、气胸、气管-胸膜瘘及气管-食道瘘等严重并发症。⑦气管狭窄及距隆突较近部位主支气管狭窄扩张时，尤其是要重视主气道是否通畅，肺部通气功能是否受到影响。⑧多部位中心气道等较大气道狭窄，应采用先处理近端气道再处理远端气道，即由近端向远端扩张方案。⑨扩张出现气道撕裂伤，可先镇咳，预防感染及对症处理等治疗，一般均可自愈。局部小量出血可应用稀释的肾上腺溶液局部喷洒止血。60岁以上年龄较大的患者要慎重选择扩张治疗。⑩长期反复行支气管镜检查、扩张，势必造成患者身心、经济上的负担，应认真权衡利弊，更加符合卫生经济学、伦理学要求。并发症：常见急性并发症表现为胸部疼痛不适、少量出血，气道严重撕裂可引起气道内大出血、纵隔气肿、皮下气肿、气胸、气道软化、气管-胸膜瘘及气管-食管瘘等，慢性并发症为肉芽组织增生致增生性再狭窄。"
    },
    "thought": "本案例属于操作规范与测量场景，作为操作执行者，我的关注重点是物理条件是否满足（如血压监测设备适配、环境干扰）、操作步骤是否遗漏（如术前准备、扩张时机把握）及是否存在影响准确性的干扰因素（如炎症未控、患者焦虑）。\n\n**Step 2: 临床解码 (Clinical Decoding)**：患者诊断为气管支气管结核引起的右主支气管瘢痕性狭窄（基于CT显示距隆突1.5 cm处环形狭窄，剩余管径3 mm，所属右肺末梢无损毁），痰Gene-Xpert阳性证实结核感染。当前抗结核治疗仅17天（HRZE方案），体温37.0°C正常但CRP 18 mg/L轻度升高，支气管镜见狭窄口被灰白色坏死膜与水肿组织堵塞、4.9 mm镜身无法通过，提示局部炎症活动期未完全控制。隐式线索：上臂围34 cm需大号袖带（常规袖带无法固定）、环境干扰（暴雨致电梯故障、运送车滞在三楼）可能延迟操作；患者职业焦虑（地铁安检员，担忧返岗时间），表达急切扩张请求，但狭窄程度重（剩余管径仅3 mm）需谨慎处理。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：病例与指南Condition匹配（结核性瘢痕性狭窄，肺末梢无损毁）。强制检查Contraindication：无证据提示管壁软化型（CT显示瘢痕性狭窄）；其他支气管镜禁忌（如严重出血倾向、心肺功能衰竭）未提及，故无禁忌。安全风险：指南强调不能操之过急（Action 1），当前炎症未控（CRP升高、坏死膜堵塞）可能诱发并发症（如撕裂伤）；狭窄开口小（Action 7）需先清除堵塞物；环境干扰（运送车滞留）影响操作准备。\n\n**Step 4: 决策生成 (Decision Making)**：根据指南Action 2（先控制局部病灶）、Action 7（狭窄口小需冷冻术或探针试探），决策为暂缓球囊扩张，优先进行支气管镜下冷冻术清除坏死物和水肿组织；继续抗结核治疗；确保物理条件（使用大号袖带、处理环境问题）；教育患者分期治疗必要性。",
    "medical_order": "1. 继续HRZE抗结核治疗，监测体温、CRP及痰涂片，评估炎症控制情况。2. 安排支气管镜下冷冻术清除右主支气管狭窄口坏死膜及水肿组织，术中视情况以探针试探狭窄程度（必要时考虑针形激光刀辅助）。3. 术前准备：使用大号袖带（适配上臂围34 cm）监测血压；协调后勤解决电梯故障，确保运送车可用。4. 暂缓球囊扩张，待局部病灶控制（如CRP正常、支气管镜示水肿消退）后复查胸部CT多维重建，评估再行扩张指征。5. 术后予镇咳（如右美沙芬）、预防感染（如头孢曲松）及对症处理。",
    "patient_dialogue": "张师傅，我理解您着急想快点好起来回去上班的心情，做地铁安检工作确实不容易。咱们先聊聊您的情况：您的气管里有个地方变窄了，是因为结核菌感染后留下的疤痕，就像水管里长了锈堵住了。现在里面还有点发炎化脓，如果直接用球囊硬撑开，可能会把管子撑破，那可就麻烦了，搞不好得住院更久，反而耽误您返岗。所以啊，咱们得一步步来：先用药把炎症消下去，再用个冷冻的小工具把那层脓膜清掉，等管子干净了、结实了，再慢慢扩张。这样才安全，恢复也快些。护士已经在找大号的血压计袖带了，您胳膊粗，得用合适的才准。外头下雨电梯坏了，我们正叫人帮忙，不会耽误您检查的。您放心，咱们目标是让您尽快健康返岗，但急不得，安全第一！"
  },
  {
    "id": 1680,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "患者29岁，女性，翻译公司夜班员工，主诉‘干咳3个月、间断低热’。近2周出现活动后气短，夜间有轻度喘鸣，无吸烟史。自述曾在入职体检时胸片‘正常’，但同事提醒她‘声音偶尔嘶哑’。查体：体温37.6℃，右下肺可闻散在湿啰音，吸气相较明显；间接喉镜见右侧声带轻度固定。血常规WBC 8.1×10⁹/L，CRP 18mg/L；PPD硬结18mm，T-SPOT阳性。急诊胸CT报告：右中间段支气管壁不规则增厚，管腔轻度狭窄，远端可见树芽征。患者同时抱怨‘最近地铁空调太冷，喉咙更痒’，但无咽痛、流涕。目前尚未接受任何抗结核治疗。",
    "reference_rule": {
      "condition": "满足确诊或高度疑诊标准",
      "action": "诊断为气管支气管结核",
      "contraindication": null,
      "evidence": "1. 结核病临床表现及临床治疗反应。2. 痰涂片、集菌抗酸杆菌阳性，最好是培养 MTB 阳性。3. 影像学改变。4. PPD 试验阳性。5. 支气管镜下直视的气管、支气管典型病变。6. 支气管刷片或支气管冲洗液抗酸杆菌阳性。7. 经支气管镜活检组织提示结核性病理改变。具备上述 `5+6`、`5+7`、`5+2` 为确诊标准，`1+2+3`、`1+3+4`、`2+3`、`3+4`、`5`、`6`、`7` 为高度疑诊标准。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规急诊诊疗场景，作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（包括肺结核、支气管结核、哮喘、肺癌等），排除危急重症（如急性呼吸衰竭或肺炎恶化），并给出直接、明确的诊疗指令。Step 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者表现为慢性干咳（3个月）、间断低热（体温37.6℃）、活动后气短和夜间喘鸣（提示气道阻塞或炎症），结合查体右下肺湿啰音（basal crepitations吸气相明显）和右侧声带固定（vocal cord fixation），暗示支气管或喉部病变；实验室显示CRP轻度升高（18mg/L，提示炎症）、PPD强阳性（硬结18mm）和T-SPOT阳性（确认结核暴露）；CT影像显示右中间段支气管壁不规则增厚、管腔狭窄及树芽征（tree-in-bud sign，为支气管结核典型表现）。隐式线索包括声音嘶哑（与声带固定相关）和夜间工作暴露（可能影响免疫力），总体指向慢性感染性病变。鉴别诊断需排除哮喘、COPD或肺癌，但结核证据占主导。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 将解码信息与指南Condition匹配：患者满足高度疑诊标准（1+3+4：临床表现如干咳、低热+影像学改变如CT异常+PPD阳性）。同时检查Contraindication为null，无禁忌症；安全方面，患者无急性呼吸窘迫、过敏史或共病，可安全启动治疗。Step 4: 决策生成 (Decision Making) - 根据指南Action‘诊断为气管支气管结核’，生成决策：确诊为高度疑诊气管支气管结核，立即启动抗结核治疗，并安排支气管镜检查以进一步确诊。",
    "medical_order": "诊断：高度疑诊气管支气管结核。予标准抗结核化疗（异烟肼300mg qd、利福平600mg qd、吡嗪酰胺1500mg qd、乙胺丁醇1000mg qd口服），隔离预防传播。完善支气管镜检查（包括刷片、冲洗液抗酸杆菌检测及活检病理）。监测生命体征、症状变化及肝肾功能；复查胸CT 4周后。建议休息，避免冷空气暴露。",
    "patient_dialogue": "王女士，您好！根据您的症状和检查结果，我们高度怀疑您患了支气管结核——这是一种细菌感染引起的呼吸道疾病，会导致咳嗽、发热和呼吸问题。如果不及时治疗，它可能加重或传染给他人，所以我们得马上行动。第一，您需要开始吃药，这是专门针对结核的药物组合，每天按时服用，大概需要6个月以上。这药能杀死细菌，防止病情恶化。第二，为了确认诊断，我们得做个支气管镜检查：就是用一根细管子从鼻子进去看看气管内部，同时取点样本化验，这样能更精准。检查前我们会详细解释，别担心，这是常规操作。另外，因为结核有传染性，建议您在家隔离一段时间，避免和他人密切接触，尤其是家人。平时多休息，做菜少放盐保持清淡，晚上工作时注意保暖，地铁空调冷的话戴个围巾保护喉咙。治疗过程可能有点长，但坚持下来效果很好，我会全程帮您监测。有任何不舒服随时告诉我，好吗？"
  },
  {
    "id": 1685,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "患者28岁，女性，体型偏瘦，因‘瘢痕狭窄型气管支气管结核（左主支气管近闭塞）’于4周前在全麻下行硬镜下球囊扩张+金属支架置入。术后第3周起出现活动后气促再次加重，复查气管镜见支架两端大量粉红色新生肉芽，管腔再狭窄至约30%。今日为第二次介入治疗日，术前常规禁食6h。患者自述昨夜轻微干咳、无痰，今晨步行入镜室时感胸闷，SpO₂ 92%（吸空气）。护士注意到她左腕戴有细银镯，提醒需取下避免冷冻探头接触金属。室外暴雨，患者鞋袜微湿，护士递给她一次性鞋套并轻声安慰：“别紧张，今天还是做冷冻，时间不长。”",
    "reference_rule": {
      "condition": "肉芽增殖型、淋巴结瘘型、瘢痕狭窄型（管腔闭塞）气管支气管结核，气道支架置入后再生肉芽肿的消除",
      "action": "1. 推荐使用冷冻消融方式治疗；2. 每次持续时间约为 5~6 min，一般不要超过 10 min；3. 间隔 0.5~1.0 min 后，可重复进行 1~3 个冷冻-解冻循环周期；4. 每周进行 1 次",
      "contraindication": "无特殊禁忌证，禁忌证同支气管镜检查",
      "evidence": "适应证：肉芽增殖型、淋巴结瘘型、瘢痕狭窄型（管腔闭塞）气管支气管结核，气道支架置入后再生肉芽肿的消除。禁忌证：无特殊禁忌证，禁忌证同支气管镜检查。治疗原理：基于制冷物质和冷冻器械产生的超低温，可使局部结核性肉芽肿组织及 MTB 菌体因组织细胞内的水分子迅速结晶成冰、细胞停止分裂并融解坏死，并引起局部血流停止及微血栓形成等慢性病理过程而导致坏死。治疗方式：分冷冻消融和冷冻切除 2 种方式。冷冻消融即冷冻及自然融化，较其他介入手段作用慢，并具有延迟效应，远期疗效较好；冷冻切除即直接撕扯下坏死组织而立即削减病灶，但应注意治疗结核性肉芽肿时冷冻切除极容易引起大出血。临床推荐使用冷冻消融方式治疗。推荐冷冻消融治疗时每次持续时间约为 5~6 min，一般不要超过 10 min，间隔 0.5~1.0 min 后，可重复进行 1~3 个冷冻-解冻循环周期，每周进行 1 次。特点：冷冻术作用较弱，局部反应轻，患者易接受。冷冻治疗一般不损伤气道软骨，几乎不会发生气道穿孔，治疗后肉芽组织增生、纤维瘢痕形成率低，不影响心脏起搏器工作，不破坏金属、硅酮支架。并发症：单纯冷冻治疗并发症较少见，主要为气道的痉挛，特别长时间冷冻可导致气道冻伤。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于操作规范与测量场景，作为操作执行者，重点关注物理条件是否满足（如移除金属饰品、环境因素）、操作步骤是否完整（如冷冻消融时间控制和循环设置）、以及潜在干扰因素（如低氧状态、患者紧张和湿鞋袜）是否影响准确性或安全。\n\nStep 2: 临床解码 (Clinical Decoding) – 从病例提取关键信息：患者因支架置入后再生肉芽肿导致管腔再狭窄至30%，表现为活动后气促加重、SpO₂ 92%（提示低氧血症）、轻微干咳和胸闷；隐式线索包括左腕银镯（需移除以避免冷冻探头金属接触风险）、鞋袜微湿（可能增加寒冷不适或感染风险）、患者紧张（护士已安慰），以及体型偏瘦（可能影响耐受性）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) – 将病例与指南条件匹配：患者为瘢痕狭窄型气管支气管结核支架置入后再生肉芽肿，完全符合冷冻消融适应症。检查禁忌证：无特殊禁忌证（同支气管镜检查），患者无出血倾向、严重心肺功能不全等绝对禁忌；但SpO₂ 92%表明低氧血症，需警惕操作中气道痉挛风险（指南指出并发症主要为气道痉挛），故需优先处理低氧。安全强制检查：移除金属饰品（银镯）以避免冷冻探头接触干扰；评估湿鞋袜作为潜在干扰（增加不适，可能影响患者配合）；指南强调冷冻不损伤支架，但需严格控制时间以防冻伤。\n\nStep 4: 决策生成 (Decision Making) – 基于指南Action：执行冷冻消融治疗，每次时间5-6分钟（不超过10分钟），间隔0.5-1分钟后重复1-3个冷冻-解冻循环；治疗频率为每周一次。额外决策：针对SpO₂ 92%，予吸氧支持以改善低氧；确保移除所有金属饰品；监测生命体征预防并发症（如气道痉挛）。",
    "medical_order": "予硬镜下冷冻消融治疗。适应症：瘢痕狭窄型气管支气管结核支架置入后再生肉芽肿（管腔狭窄30%）。操作规范：每次冷冻时间控制在5~6分钟，不超过10分钟；间隔0.5~1分钟后，重复1~3个冷冻-解冻循环。术前准备：移除所有金属饰品（左腕银镯已取下）；禁食6小时完成；评估SpO₂ 92%（吸空气），予鼻导管吸氧2-4L/min以维持SpO₂ >95%。监测：术中持续监测生命体征，警惕气道痉挛。术后计划：每周复查并重复治疗一次，直至肉芽肿消退。",
    "patient_dialogue": "李女士，您好！今天咱们继续做冷冻治疗，这方法安全又温和，专门针对您支架周围那些新长的小肉芽，不会伤到支架。您放心，整个过程就几分钟，护士刚才也说了时间不长。对了，您手上那个银镯子我们已经帮您取下来了，这样避免治疗时探头碰到金属出意外。看您今早有些胸闷，血氧偏低，我先给您戴上氧气鼻管，吸点氧能让呼吸更顺畅，治疗也会更舒服。鞋子湿了别担心，护士给了鞋套，换好后咱们就开始。您深吸几口气放松一下，我会全程在旁边看着，有任何不舒服就告诉我，好吗？"
  },
  {
    "id": 1691,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "患者28岁，女性，小学教师，近3周出现阵发性刺激性干咳，伴活动后气短，夜间平卧时加重，无发热、盗汗。自行口服头孢及止咳药症状无缓解。既往体健，无结核接触史。查体：T 36.7 ℃，SpO₂ 95%（室内空气），右肺中部可闻及吸气相哮鸣音。门诊胸片提示右肺中叶不张，CT示右中间段支气管壁增厚、管腔狭窄，周围可见斑点状钙化淋巴结。血常规、CRP正常，PPD 18 mm，T-SPOT阳性。今日为首次呼吸科门诊就诊，患者自述“最近粉笔灰刺激后咳嗽更明显”，并担心耽误期末考试监考工作。",
    "reference_rule": {
      "condition": "基于气管支气管结核分型",
      "action": "1. I型（炎症浸润型）：经支气管镜吸引清除气道分泌物，局部给予抗结核药物；2. II型（溃疡坏死型）：经支气管镜吸引、钳夹等清除气道分泌物，局部给予抗结核药物，冷冻术去除坏死物及促溃疡修复；3. III型（肉芽增殖型）：经支气管镜局部给予抗结核药物，冷冻消融或冷冻切除消除增殖肉芽组织，热消融疗法应用消除较大的增殖肉芽组织；4. IV型（瘢痕狭窄型）：球囊扩张术为首选、主要手段。中心气道等较大气道狭窄处瘢痕严重者，慎重选用热消融疗法（针形激光刀、针形高频电刀）予以切割消除狭窄或为球囊扩张创造条件。中心气道等较大气道完全闭塞，所属肺不张形成时间较短且末梢侧肺呈致密改变无毁损者，尝试冷冻或在审慎评价后慎选热消融疗法打通闭锁，联合应用球囊扩张术、暂时性支架置入术。对多次球囊扩张、局部药物应用，气道仍反复回缩性狭窄者，若合并反复感染、咯血，有手术指征者建议手术切除；若合并呼吸困难，无手术指征，经评估生存期较短者，在审慎评价后可考虑永久性支架置入；若合并反复感染、呼吸困难，无手术指征，经评估生存期较长者，在审慎评价后可考虑暂时性支架置入；5. V型（管壁软化型）：对于中心气道管壁软化，可考虑硅酮支架置入术，鉴于国内尚缺乏硅酮支架，在审慎评价后可置入全覆膜金属支架或金属裸支架临时性置入；6. VI型（淋巴结瘘型）：破溃前期及破溃期可经支气管镜局部给予抗结核药物、冷冻术及热消融疗法；破溃后期若存在瘘口肉芽肿形成，则给予冷冻术、热消融疗法，若瘘口愈合闭塞仅局部遗留炭末沉着则无需特殊处理",
      "contraindication": null,
      "evidence": "6. 各型气管支气管结核的介入及综合介入治疗：(1) I型：经支气管镜吸引清除气道分泌物，局部给予抗结核药物。(2) II型：经支气管镜吸引、钳夹等清除气道分泌物，局部给予抗结核药物，冷冻术去除坏死物及促溃疡修复。(3) III型：经支气管镜局部给予抗结核药物，冷冻消融或冷冻切除消除增殖肉芽组织，热消融疗法应用消除较大的增殖肉芽组织。(4) IV型：球囊扩张术为首选、主要手段。中心气道等较大气道狭窄处瘢痕严重者，可依据胸部 CT 多维重建及增强扫描情况，慎重选用热消融疗法（针形激光刀、针形高频电刀）予以切割消除狭窄或为球囊扩张创造条件。中心气道等较大气道完全闭塞，所属肺不张形成时间较短且末梢侧肺呈致密改变无毁损者，可尝试冷冻或在审慎评价后慎选热消融疗法打通闭锁，联合应用球囊扩张术、暂时性支架置入术。对多次球囊扩张、局部药物应用，气道仍反复回缩性狭窄者，若合并反复感染、咯血，有手术指征者建议手术切除；若合并呼吸困难，无手术指征，经评估生存期较短者，在审慎评价后可考虑永久性支架置入；若合并反复感染、呼吸困难，无手术指征，经评估生存期较长者，在审慎评价后可考虑暂时性支架置入。(5) V型：对于中心气道管壁软化，可考虑硅酮支架置入术，鉴于国内尚缺乏硅酮支架，在审慎评价后可置入全覆膜金属支架或金属裸支架临时性置入。(6) VI型：淋巴结瘘破溃前期及破溃期可经支气管镜局部给予抗结核药物、冷冻术及热消融疗法；破溃后期若存在瘘口肉芽肿形成，则给予冷冻术、热消融疗法，若瘘口愈合闭塞仅局部遗留炭末沉着则无需特殊处理。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于常规门诊诊断与治疗场景，作为急诊/门诊医生，需快速建立鉴别诊断，排除危急重症（如气道完全梗阻、活动性大咯血等），直接给出诊疗方案。关注重点：患者右肺中叶不张伴支气管狭窄的病因诊断及分型治疗。",
      "Step 2: 临床解码": {
        "核心症状": "阵发性干咳（粉笔灰加重）+活动性气短+夜间平卧加重 → 提示中央气道梗阻",
        "体征": "右肺吸气相哮鸣音 → 局部狭窄客观证据",
        "影像关键": "右中叶不张+中间段支气管壁增厚/狭窄+钙化淋巴结 → 符合气管支气管结核（TBTB）特征",
        "检验证据": "PPD 18mm（强阳性）+T-SPOT阳性 → 活动性结核感染",
        "治疗史": "抗生素无效 → 支持非细菌性感染",
        "职业提示": "粉笔灰刺激加重咳嗽 → 需职业防护干预"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "CT显示支气管壁增厚伴管腔狭窄，符合指南中III型（肉芽增殖型）或IV型（瘢痕狭窄型）特征。需支气管镜明确分型：若为III型适用冷冻消融+局部给药；若为IV型首选球囊扩张术",
        "禁忌核查": "无绝对禁忌症（contraindication为null）。注意：T-SPOT阳性需立即抗结核治疗；肺不张需48小时内干预防肺毁损"
      },
      "Step 4: 决策生成": "1. 立即启动全身抗结核治疗；2. 急诊支气管镜明确分型并介入治疗；3. 职业暴露防护；4. 传染性评估与公共卫生管理"
    },
    "medical_order": "1. 完善急诊支气管镜检查+活检病理+刷检抗酸杆菌；2. 启动标准抗结核治疗（HRZE方案：异烟肼0.3g qd、利福平0.45g qd、吡嗪酰胺1.5g qd、乙胺丁醇0.75g qd）；3. 根据镜下分型行介入治疗：III型予冷冻消融+局部注射异烟肼0.2g，IV型行球囊扩张术；4. 痰抗酸杆菌涂片×3次；5. 建议授课时佩戴N95口罩；6. 3日后复诊评估介入疗效及药物耐受性。",
    "patient_dialogue": "李老师，您这个咳嗽气短的问题我们已经找到原因了，是支气管结核引起的——简单说就是结核菌在气管里引起了肿胀和肉芽增生，把气管给堵住了，所以粉笔灰一刺激就更难受。别担心，这个病能治好，但需要您配合三件事：第一，今天就开始吃四种抗结核药，我会详细写清楚怎么服用；第二，明天上午咱们做个支气管镜的小治疗，从鼻孔进个细管子，把堵住气管的肉芽冷冻掉或者用小球囊撑开，做完当天就能回家；第三，上课时务必戴好N95口罩，既能保护您的气管，也能防止传染给学生。期末考试监考您放心，治疗及时的话不会耽误工作，这两天先请同事代课好吗？"
  },
  {
    "id": 1683,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "28岁女性，动画原画师，连续熬夜交稿后出现刺激性干咳4周，夜间加重伴金属音，无痰血。自诉“像有羽毛在喉咙里挠”，先后被诊所按过敏性咳嗽给予吸入激素无效。既往体健，无结核接触史，但同工作室2个月前有一例开放性肺结核同事（已隔离治疗）。查体：T 37.4 ℃，HR 88 次/分，右上前胸廓呼吸音略低，可闻及局限吸气相哮鸣音。门诊胸片示右上肺门影增浓、右主支气管边缘毛糙；血常规嗜酸粒细胞 6%，CRP 12 mg·L⁻¹。患者今日空腹前来，打算做进一步检查，顺嘴抱怨“最近地铁空调太冷，一吹就咳得更厉害”。",
    "reference_rule": {
      "condition": "针对 I~III 型及 IV 型临床活动期气管支气管结核",
      "action": "以尽快杀灭 MTB 为重点，避免 MTB 产生耐药性，预防或减轻病变段气道遗留下器质性的狭窄、闭塞及软化等改变",
      "contraindication": null,
      "evidence": "针对 I~III 型及 IV 型临床活动期气管支气管结核，以尽快杀灭 MTB 为重点，避免 MTB 产生耐药性，预防或减轻病变段气道遗留下器质性的狭窄、闭塞及软化等改变。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于常规诊断与治疗场景。作为门诊医生，我的关注重点是快速建立鉴别诊断，优先排除危急重症（如活动性结核病），并基于临床线索给出直接、高效的诊疗指令。\n\n**Step 2: 临床解码 (Clinical Decoding)**：患者为28岁女性，主要症状为慢性刺激性干咳4周，夜间加重伴金属音（提示气道狭窄或梗阻），无咯血，描述为“像有羽毛在喉咙里挠”暗示异物感或气道刺激。关键隐式线索包括：近期结核暴露史（同工作室开放性肺结核同事）、无效吸入激素治疗（排除过敏性咳嗽）、低热（T 37.4℃）、右上前胸廓呼吸音减低和局限吸气相哮鸣音（提示局部气道病变）、影像学显示右上肺门影增浓及右主支气管边缘毛糙（符合支气管结核炎症改变）、血常规嗜酸粒细胞6%轻度升高但CRP升高（提示炎症而非单纯过敏）。患者空腹前来便于检查，且冷空气刺激加重咳嗽（支持气道高反应）。综合以上，鉴别诊断高度指向气管支气管结核（首要怀疑），需排除哮喘、支气管炎或GERD等。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：参考指南针对 I~III 型及 IV 型临床活动期气管支气管结核，要求尽快杀灭MTB、避免耐药性并预防气道并发症（狭窄等）。病例特征（暴露史、症状、体征、影像）高度匹配指南 Condition。Contraindication 为 null，患者既往体健，无禁忌症（如无药物过敏史或肝肾功能异常）。强制安全检查确认安全：无药物相互作用或共病风险。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南 Action，首要决策是立即确诊结核病以避免延误导致耐药或并发症。具体包括：安排痰结核菌检查和支气管镜确诊；如确诊，启动标准抗结核治疗；同时实施呼吸道隔离教育以减少传播风险。",
    "medical_order": "1. 完善痰涂片抗酸染色、痰培养结核菌检查，以确诊结核感染。\n2. 安排胸部CT平扫及支气管镜检查，评估气道病变程度。\n3. 予标准四联抗结核治疗：异烟肼300mg每日一次、利福平600mg每日一次、吡嗪酰胺1500mg每日一次、乙胺丁醇1200mg每日一次，并监测肝功能及肾功能。\n4. 实施呼吸道隔离措施，避免公共场所活动。\n5. 监测生命体征（体温、心率）及咳嗽症状变化，每周随访。",
    "patient_dialogue": "你好啊！我理解你这段时间咳嗽特别难受，尤其晚上加重，还有那种‘羽毛挠喉咙’的感觉，肯定很影响工作和休息。根据你的症状和检查结果，我们高度怀疑这可能是结核病引起的——因为你之前接触过那位同事，结核病容易通过空气传播。别担心，早发现早治疗，效果很好的。\n\n接下来，我们需要做几个检查确认：首先，我会让你咳出一些痰来化验细菌；其次，做个CT扫描仔细看看肺部情况；如果必要，可能还需要一个小手术（叫支气管镜）轻轻检查气管内部。这些都很安全，而且你正好空腹，今天就能安排一部分。\n\n如果确诊是结核病，咱们得马上开始吃药治疗——需要几种药一起吃几个月，彻底杀灭细菌，防止它变顽固或留下后遗症。同时，为了避免传染给别人，我建议你暂时不去人多的地方，比如地铁或工作室，在家也戴口罩通风。空调冷风确实会刺激咳嗽，尽量避开吧。坚持治疗的话，咳嗽很快会缓解的。有疑问随时问我，咱们一起搞定它！"
  },
  {
    "id": 1690,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "患者29岁女性，翻译公司夜班员工，近3周出现刺激性干咳伴活动后气短，夜间需垫高枕头入睡。2天前出现少量黄白色黏痰，痰中偶见血丝，无发热、盗汗。急诊体温37.4℃，SpO₂ 94%（室内空气）。听诊右肺上叶可闻及吸气相干鸣音，伴呼气相延长。既往体健，无结核接触史，未接种卡介苗。胸部CT示右主支气管管壁不规则增厚，管腔轻度狭窄，右上叶后段斑片影伴小空洞。痰涂片抗酸染色（+），GeneXpert MTB/RIF 检测提示结核分枝杆菌阳性，利福平敏感。患者自述因工作需频繁出差，担心长期用药影响就业。今日凌晨2点由同事陪同就诊，急诊室空调偏冷，患者着薄外套，咳嗽时明显捂嘴并背向他人。",
    "reference_rule": {
      "condition": "活动期气管支气管结核或初治、复治、耐药病例",
      "action": "1. 初治病例：抗结核化学治疗总疗程不少于 12 个月，方案如 2HR(L₂)ZE(S)/10HR(L₂)E（H：异烟肼；R：利福平；L：利福喷丁；Z：吡嗪酰胺；E：乙胺丁醇；S：链霉素）；2. 复治、耐药病例：选择复治、耐药化疗方案，MDR-TB、XDR-TB 疗程至少 24 个月；3. 需要介入治疗处理中心气道狭窄、闭塞、软化等病例：介入治疗后抗结核药物全身化学治疗原则上应不少于 9~12 个月",
      "contraindication": null,
      "evidence": "对于活动期气管支气管结核，早期诊断及早期全身抗结核药物化学治疗能够有效杀灭 MTB，减轻临床症状，减少传播及避免耐药菌的产生，减少病变气管支气管结核气道狭窄、闭塞、软化等并发症的发生；对于完成疗程的非活动期气管支气管结核，一旦形成了气道狭窄、闭塞、软化，抗结核药物化学治疗的作用就不大；对于未完成疗程的气管支气管结核，应继续应用抗结核药物，巩固治疗并完成疗程，防止结核病复发及并发症发生。根据气管支气管结核分为初治、复治及耐药病例情况，选择有效的抗结核化学治疗方案进行全身抗结核药物化学治疗，具体参见“肺结核诊断和治疗指南（2001）”和“耐药结核病化学治疗指南（2009）”。初治病例抗结核化学治疗总疗程要求不少于 12 个月，如方案：2HR(L₂)ZE(S)/10HR(L₂)E (H：异烟肼；R：利福平；L：利福喷丁；Z：吡嗪酰胺；E：乙胺丁醇；S：链霉素）。复治、耐药病例选择复治、耐药化疗方案，疗程较初治方案延长，MDR-TB、XDR-TB 要求至少 24 个月，甚至更长。需要介入治疗处理中心气道狭窄、闭塞、软化等病例，无论抗结核化疗是否满疗程，均应延长抗结核药物应用时间，介入治疗后应用抗结核药物全身化学治疗原则上应不少于 9~12 个月，以防休眠 MTB 复燃。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规急诊诊疗场景，患者凌晨2点就诊，症状包括刺激性干咳、气短和轻度低氧（SpO₂ 94%），需快速排除危急重症如呼吸衰竭或大咯血，并立即启动标准治疗。关注重点在于确诊活动性结核病、评估气道狭窄风险、处理感染控制，并确保治疗依从性，排除其他急性呼吸道疾病。\nStep 2: 临床解码 (Clinical Decoding): 患者29岁女性，夜班工作及频繁出差可能影响免疫功能和生活规律，导致结核易感。症状（干咳、活动后气短、夜间呼吸困难）和体征（右肺上叶干鸣音、呼气相延长）提示气道炎症和狭窄。CT显示右主支气管管壁增厚、管腔狭窄及右上叶空洞，结合痰抗酸染色阳性和GeneXpert MTB/RIF阳性（利福平敏感），确诊为活动性气管支气管结核（初治型）。SpO₂ 94%（室内空气）示轻度低氧血症，但无发热或盗汗，排除急性感染恶化。患者咳嗽时捂嘴背向他人显示感染控制意识，但职业压力（担心就业影响）可能威胁治疗依从性。\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南condition匹配“活动期气管支气管结核初治病例”，无contraindication（指南为null）。安全检查：SpO₂轻度下降需监测但不危急；CT示管腔狭窄，需评估是否需介入治疗；患者无药物过敏史（既往体健），确保抗结核药安全；痰阳性表明传染性强，需立即隔离防传播。\nStep 4: 决策生成 (Decision Making): 根据指南action，初治病例采用标准方案2HRZE(S)/10HRE，总疗程12个月。强化期2个月使用异烟肼（H）、利福平（R）、吡嗪酰胺（Z）、乙胺丁醇（E）；巩固期10个月使用H和R（或利福喷丁L₂）。CT显示管腔狭窄，需肺科会诊评估介入治疗必要性，但当前以全身化疗优先。同时，实施呼吸道隔离、公共卫生报告和职业支持，确保治疗依从性。",
    "medical_order": "诊断：活动性气管支气管结核（初治型），利福平敏感。\n治疗：启动抗结核化学治疗：强化期2个月异烟肼（H）300mg qd、利福平（R）600mg qd、吡嗪酰胺（Z）1500mg qd、乙胺丁醇（E）1200mg qd；巩固期10个月异烟肼300mg qd、利福平600mg qd。总疗程12个月。\n支持治疗：予持续SpO₂监测，若＜92%予低流量氧疗2L/min；完善血常规、肝肾功能基线检查，定期复查。\n隔离措施：实施呼吸道隔离，单间病房，医护N95口罩防护。\n公共卫生：立即报告疫情，安排密切接触者筛查。\n随访：每周痰涂片复查至转阴，每月胸部影像评估；肺科会诊评估气道狭窄介入治疗指征。\n健康教育：提供职业咨询，强调治疗依从性。",
    "patient_dialogue": "张女士，你好。我是王医生，今晚我们得尽快处理你的情况。检查结果出来了，你得了肺结核，这是肺部的一种感染，需要马上开始治疗。为什么这么急？因为痰里有细菌，不早点用药的话，不仅你自己咳嗽和气短会加重，还可能传染给身边的人，包括你的同事和家人。\n\n我们会给你开一套药，包括几种抗生素，你需要每天按时吃，整个疗程大约一年。别担心，这些药效果很好，能杀死细菌，防止问题变严重。头两个月药多一些，后面会减量。我们会安排你在隔离病房住几天，防止传播，出院后在家也要戴口罩，避免去人多的地方。\n\n另外，我知道你工作夜班又常出差，怕影响就业。咱们一起想办法：治疗期间最好减少出差，和公司沟通调整班次，我会开证明帮你解释。健康是第一位的，坚持用药才能彻底好，不然拖久了可能要做手术。今晚就开始吃药，好吗？有任何不舒服随时告诉我，我们在这儿支持你。"
  },
  {
    "id": 1695,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "患者29岁女性，体重48 kg，因‘气管支气管结核（II型，溃疡坏死型）’今日在全麻下行硬性支气管镜下冷冻+球囊扩张术。术程90 min，扩张至8 mm时气道明显挛缩，拔管前可见声门下2 cm处黏膜苍白、环形水肿，气道径缩窄约60%。术后1 h，患者吸气性喘鸣加重，SpO₂ 94%（储氧面罩10 L/min），伴声音嘶哑、犬吠样咳嗽。既往无哮喘、无糖尿病。术后已启动四联抗结核（HREZ）第3天。查体：体温37.8 ℃，呼吸28次/分，三凹征阳性，可闻及吸气相高调喘鸣。动脉血气：PaO₂ 68 mmHg，PaCO₂ 34 mmHg。护士报告：患者职业为配音演员，对嗓音要求极高，此刻情绪焦虑，反复询问‘我的声音还能恢复吗？’窗外沙尘天气，她抱怨喉咙‘像被沙子堵住’。",
    "reference_rule": {
      "condition": "使用糖皮质激素必须在强有力的抗结核治疗方案实施下，有下列情况：各种介入治疗后的气道局部、喉头急性水肿；介入治疗后气道明显挛缩；呼吸道严重炎症反应，常发生于 I 型和 II 型",
      "action": "短期雾化吸入或气道内局部用药",
      "contraindication": "防止滥用糖皮质激素，但未具体禁忌",
      "evidence": "使用糖皮质激素必须在强有力的抗结核治疗方案实施下，有下列情况时可酌情使用，针对气管支气管结核推荐短期雾化吸入或气道内局部用药，防止滥用糖皮质激素。1. 各种介入治疗后的气道局部、喉头急性水肿。2. 介入治疗后气道明显挛缩。3. 呼吸道严重炎症反应，常发生于 I 型和 II 型。"
    },
    "thought": "本案例属于复杂合并症治疗场景（涉及气管支气管结核术后急性并发症）。作为专科专家，我将优先扫描药物相互作用、禁忌症及共病风险，确保安全 > 疗效。Step 1: 场景定义：患者术后出现急性上呼吸道梗阻，合并情绪和环境因素，需全面评估风险。Step 2: 临床解码：提取关键信息——术后1 h出现吸气性喘鸣、三凹征阳性、低氧血症（SpO₂ 94%、PaO₂ 68 mmHg）、声音嘶哑和犬吠样咳嗽，提示急性喉头水肿和气道狭窄（声门下2 cm处黏膜苍白、环形水肿）；动脉血气显示低氧血症伴呼吸性碱中毒（PaCO₂ 34 mmHg）；体温37.8 ℃和呼吸28次/分表明炎症反应；抗结核治疗（HREZ）已启动第3天，无哮喘或糖尿病史；隐式线索包括配音演员职业导致高度焦虑，及沙尘天气可能加剧气道刺激。Step 3: 规则对齐与安全检查：与指南Condition匹配——介入治疗后喉头急性水肿和气道明显挛缩；呼吸道严重炎症反应（II型结核）；强有力的抗结核方案已实施。无具体禁忌症，但需防止滥用糖皮质激素；安全扫描：糖皮质激素局部使用风险低，无药物相互作用（HREZ无冲突），共病风险（焦虑可能加重症状）需管理。Step 4: 决策生成：基于指南Action，推荐短期雾化吸入糖皮质激素以缓解水肿，同时辅以支持性措施确保安全。",
    "medical_order": "1. 立即予布地奈德混悬液 2mg 雾化吸入 q6h，短期使用（不超过3天），以减轻喉头水肿和气道炎症。2. 持续监测生命体征：SpO₂、呼吸频率、三凹征，每30分钟记录一次；备好紧急气道管理设备。3. 维持氧疗：储氧面罩 10 L/min，目标 SpO₂ >95%。4. 环境控制：保持病室空气清洁，使用加湿器，关闭门窗避免沙尘暴露。5. 继续四联抗结核治疗（HREZ），监测药物耐受性。6. 安排耳鼻喉科会诊评估声带功能，并行语音评估。7. 予一级护理，记录出入量。",
    "patient_dialogue": "你好，我完全理解你现在的担心，特别是关于声音的问题。手术后，你的喉咙里有些肿胀，这让你喘气困难和声音沙哑，就像被沙子堵住一样——这很正常，是身体对手术的反应。我们会马上给你一种吸入的药物，就像雾化的蒸汽，直接帮你消肿消炎，这样你的呼吸和声音会慢慢舒服起来。同时，外面沙尘大，我们会把房间弄干净，加些湿气，保护你的喉咙。别着急，你的声音恢复机会很大，但需要几天时间；我会请专家来看看你的嗓子，也建议你深呼吸放松，咱们一步步来。你做得很好，有什么不舒服随时告诉我。"
  },
  {
    "id": 1686,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "29岁翻译员，因“反复刺激性咳嗽3个月、间断痰中带血丝1周”就诊。3个月来咳嗽以夜间及说话久后为甚，曾按‘支气管炎’口服头孢无效。近1周出现晨起痰中带鲜红色血丝，量不多，无发热、盗汗或胸痛。既往体健，无吸烟史。查体：右上肺呼吸音稍低，未闻及干湿啰音。门诊胸片示右上肺纹理增粗、右上纵隔边缘模糊；CT提示右主支气管管壁增厚并管腔不规则狭窄，局部可见软组织影突入腔内。痰涂片找抗酸杆菌3次均阴性，T-SPOT.TB阳性。患者今日由呼吸科转入结核门诊，希望尽快明确气道病变性质并缓解顽固咳嗽。她提到下周需赴上海参加国际会议，担心咳嗽影响同声传译工作。",
    "reference_rule": {
      "condition": "在全身有效应用抗结核药物化学治疗的基础上",
      "action": "1. 病灶表面局部药物喷洒：主要针对炎症浸润型和溃疡坏死型；2. 病灶内抗结核药物加压注射：主要适用于肉芽增殖型和淋巴结瘘型",
      "contraindication": null,
      "evidence": "气道内局部给予抗结核药物能使药物直接到达病灶区域而发挥作用，由于局部药物浓度高，能有效地起到杀菌、抑菌效果，加快痰菌转阴，促进气道内病灶吸收、减少并发症发生等，但必须是在全身有效应用抗结核药物化学治疗的基础上进行。经支气管镜直视下气道内给药，具有部位准确、操作简便等优点。经支气管镜所给予抗结核药物主要包括异烟肼和利福平等，如能在注射用抗结核药物中加入适量的高聚物或共聚物等制成的赋形剂或缓释剂，延长抗结核药物在局部的作用时间，可以进一步提高治疗的效果。经支气管镜气道内给予抗结核药物分为病灶表面局部药物喷洒及病灶内抗结核药物加压注射，前者主要针对炎症浸润型和溃疡坏死型，后者主要适用于肉芽增殖型和淋巴结瘘型。"
    },
    "thought": "本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如支气管肺癌或大咯血风险），并给出直接的治疗指令以缓解症状。关键信息解析：29岁女性，反复刺激性咳嗽3个月伴夜间加重，1周痰血，无发热盗汗；影像学示右主支气管狭窄及软组织影，T-SPOT.TB阳性但痰涂片阴性；隐式线索包括支气管结核高度可疑（T-SPOT阳性结合CT特征），需排除肿瘤（尽管年轻无吸烟史），且患者职业需求急切缓解咳嗽。与指南对齐：指南Condition要求在全身抗结核化疗基础上进行局部治疗，无禁忌症；安全检查需确认全身治疗已启动，并排除其他病因。决策：启动全身抗结核化疗，安排支气管镜检查确诊并分类病变，镜下实施局部治疗（喷洒或注射）以快速缓解症状。",
    "medical_order": "予标准抗结核四联治疗（异烟肼300mg qd、利福平600mg qd、吡嗪酰胺1500mg qd、乙胺丁醇1000mg qd）。安排急诊支气管镜检查，明确病变性质（炎症浸润型、溃疡坏死型、肉芽增殖型或淋巴结瘘型）；镜下根据分型行局部药物喷洒（异烟肼100mg，针对炎症/溃疡）或病灶内加压注射（利福平150mg，针对肉芽/瘘管）。监测咳嗽缓解情况及痰菌复查。",
    "patient_dialogue": "王女士，您的检查结果高度提示支气管结核感染——就是结核菌在气管里引起了炎症和狭窄，导致了咳嗽和痰血。别担心，这可以控制。首先，您今天就得开始吃抗结核药，每天按时服用，这是治疗的根本。同时，为了快速减轻咳嗽，特别是您下周要参会，我们安排一个支气管镜检查：简单说，就是用细管子从鼻子进气管看看病变情况，过程大约15分钟，我们会打点麻药，不太难受。检查中，我们会根据情况直接在病变处喷药或打针，这样药物浓度高，能更快消炎、缓解咳嗽。这样双管齐下，大概率下周前症状能好转。我理解翻译工作对咳嗽敏感，我们优先处理，争取不影响您的会议。"
  },
  {
    "id": 1704,
    "file_name": "气管支气管结核诊断和治疗指南(试行).json",
    "case_input": "患者34岁，女性，身高158 cm，体重46 kg，出租车司机。主诉“间断咯血3个月，加重伴活动后气促1周”。既往史：6年前确诊“气管支气管结核”，规律HRZE方案18个月，痰菌阴转；但此后每年仍反复右肺中叶感染，平均每年住院2次。无吸烟史，无糖尿病。查体：右肺中叶听诊呼吸音几乎消失，可闻及散在湿啰音；指脉氧静息92%，6分钟步行试验仅280 m。实验室：WBC 11.4×10⁹/L，CRP 78 mg/L，ESR 52 mm/h；痰GeneXpert MTB/RIF（-）。胸部增强CT：右肺中叶及下叶背段不张，远端呈囊状支气管扩张，伴黏液嵌塞；中间段支气管长约2.5 cm完全闭塞，近端管壁钙化；右肺门淋巴结蛋壳样钙化。肺功能：FEV₁ 1.18 L（占预计值38%），FVC 1.49 L，舒张试验阴性。动脉血气：PaO₂ 64 mmHg，PaCO₂ 38 mmHg。患者近3个月已接受3次支气管镜球囊扩张+冷冻消融，仍无法开放闭塞气道，且每次术后48 h内再次咯鲜血50–80 ml。今日查房，患者再次咯血约60 ml，伴心悸，血红蛋白由入院时112 g/L降至92 g/L。患者焦虑地询问：“医生，我老是出血，能不能别再折腾镜子了？”窗外暴雨，病房停电切换备用灯，光线昏暗。",
    "reference_rule": {
      "condition": "气管支气管结核合并所属气道狭窄、闭塞，造成末梢肺叶和肺段不张、阻塞性感染、肺通气功能不良，给予全身抗结核化学治疗，有介入治疗指征患者加强气道内局部介入治疗，仍不能取得满意疗效者；气道狭窄、闭塞造成末梢肺毁损，反复阻塞性感染，合并支气管扩张伴反复咯血者",
      "action": "外科手术切除，术式由外科医生决定",
      "contraindication": null,
      "evidence": "外科手术切除指征：气管支气管结核合并所属气道狭窄、闭塞，造成末梢肺叶和肺段不张、阻塞性感染、肺通气功能不良，给予全身抗结核化学治疗，有介入治疗指征患者加强气道内局部介入治疗，仍不能取得满意疗效者；气道狭窄、闭塞造成末梢肺毁损，反复阻塞性感染，合并支气管扩张伴反复咯血者。外科手术前应进行规范抗结核药物化学治疗。术式应视不同情况，严格按照结核病外科治疗原则，由外科医生决定。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，患者存在气管支气管结核后遗症引发的气道闭塞、反复咯血、阻塞性感染及肺功能严重受损等多重并发症。作为专科专家，我将全网扫描药物相互作用、禁忌症及共病风险（如贫血、感染和低氧血症对治疗的影响），并优先确保安全（安全 > 疗效），再评估疗效优化。\nStep 2: 临床解码 (Clinical Decoding) - 患者34岁女性，有气管支气管结核病史，导致右侧中间段支气管2.5 cm完全闭塞（CT显示管壁钙化），引发右肺中叶及下叶背段不张、囊状支气管扩张伴黏液嵌塞，这是反复阻塞性感染（每年住院2次，WBC 11.4×10⁹/L、CRP 78 mg/L、ESR 52 mm/h提示活动性感染）和反复咯血（近3个月加重，血红蛋白降至92 g/L）的根本原因。肺功能严重障碍（FEV₁ 38%预计值，阻塞性通气不良），低氧血症（PaO₂ 64 mmHg），活动耐力差（6分钟步行试验280 m）。多次支气管镜球囊扩张+冷冻消融失败（术后48小时内咯血加重），说明介入治疗无效且可能加重出血风险。患者焦虑状态和贫血需优先处理。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition明确指征为“气管支气管结核合并气道狭窄闭塞，造成末梢肺毁损、反复阻塞性感染和咯血，给予抗结核和介入治疗后仍无效者”，患者符合所有条件：结核病史、介入治疗失败、反复感染和咯血、肺毁损（CT显示不张和支气管扩张）。Contraindication为null，但安全扫描显示共病风险：贫血（Hb 92 g/L）增加手术出血风险，低氧血症（PaO₂ 64 mmHg）和感染（WBC/CRP升高）影响麻醉耐受性；无药物相互作用报告（未提及当前用药），但需排除活动性结核（痰GeneXpert阴性）。优先级安全：需术前纠正贫血和控制感染。\nStep 4: 决策生成 (Decision Making) - 根据指南Action“外科手术切除，术式由外科医生决定”，决定推荐右肺中叶及下叶背段切除手术以根治病变。术式由外科团队评估，但术前需优化状态：纠正贫血、控制感染和改善氧合，确保手术安全。",
    "medical_order": "请外科急会诊评估右肺中叶及下叶背段切除手术指征；予悬浮红细胞2U静脉输注纠正贫血；予头孢哌酮舒巴坦3.0g静脉滴注q8h抗感染；予鼻导管吸氧2-4 L/min维持SpO₂ >95%；监测生命体征q4h、血常规及C反应蛋白每日；术前完善胸部CT三维重建、心电图及肺功能复查评估手术风险。",
    "patient_dialogue": "王女士，我知道您这段时间反复出血，心里很害怕，尤其每次做完那个镜子治疗后都出血更多，让您更焦虑了。咱们别担心，我仔细看了您的检查结果，也理解您不想再做内镜了——确实，试了三次效果都不好，再折腾可能风险更大。现在的情况是，您肺里那个堵塞的地方已经造成感染和反复出血，像水管堵死了一样，光靠清理表面解决不了问题。我建议咱们考虑手术切除病变的那块肺叶，这样才能彻底止住血和感染。不过，手术前我们会先帮您输血补血、用抗生素控制感染，还会给您吸氧，让身体更稳定些，确保整个过程安全。等外科医生来详细评估，他们会和您商量具体方案。您看这样安排行吗？"
  }
]