[
  {
    "id": 1732,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者52岁，建筑工人，因“咳嗽、低热3周”2周前在本院启动HRZE四联抗结核治疗。今日复诊，家属用轮椅推入，诉今晨咯血3次，每次约半痰盂鲜红色，伴血块，最后一次咯血后突发呼吸困难、面色青紫，持续约2分钟。查体：T 37.8℃，P 132次/分，R 34次/分，BP 86/54 mmHg，SpO₂ 78%（未吸氧），大汗，颈静脉怒张，右肺叩诊浊音，呼吸音消失，可闻及喘鸣，左肺散在湿啰音；四肢湿冷，甲床发绀。心电监护提示窦性心动过速，ST段普遍压低。家属补充：昨夜患者自行停用利福平，因“胃难受”，今晨未进食，仅喝两口凉水。昨夜至今尿量约100 ml，呈浓茶色。无高血压、糖尿病史，但10年前因车祸脾切除。今日凌晨曾出现一次短暂意识丧失，约30秒，自行恢复。患者目前躁动，反复问“我是不是要憋死了？”",
    "reference_rule": {
      "condition": "存在较严重的合并症或并发症：大气道狭窄有窒息风险者；短时间内出现呼吸、循环系统衰竭症状及体征者；发生大咯血、生命体征不稳定者；或治疗中出现严重不良反应和脏器功能衰竭：急性肝衰竭、急性肾衰竭、严重皮肤过敏反应、严重骨髓抑制或明显出血倾向等",
      "action": "1. 立即进行紧急抢救; 2. 转到县级以上医院的传染科或结核病科积极抢救; 3. 待病情稳定后及时转诊到县结核病防治所或结核病定点医院继续治疗管理",
      "contraindication": null,
      "evidence": "紧急转诊建议：(1) 存在较严重的合并症或并发症：大气道狭窄有窒息风险者；短时间内出现呼吸、循环系统衰竭症状及体征者；发生大咯血、生命体征不稳定者；(2) 治疗中出现严重不良反应和脏器功能衰竭：急性肝衰竭、急性肾衰竭、严重皮肤过敏反应、严重骨髓抑制或明显出血倾向等。"
    },
    "thought": {
      "Step 1: 场景定义 (Scenario Definition)": "本案例属于分级诊疗与随访场景。作为守门人(Gatekeeper)，核心任务是评估患者当前状态是否符合转诊标准，重点关注生命体征稳定性、急症处理优先级及是否符合指南规定的紧急转诊条件。",
      "Step 2: 临床解码 (Clinical Decoding)": {
        "关键危重征象": "1) 大咯血（3次半痰盂鲜红血+血块）→ 窒息/失血性休克风险；2) 急性呼吸衰竭（SpO₂ 78%、发绀、右肺呼吸音消失+喘鸣→ 可能血块堵塞气道或张力性气胸？）；3) 循环衰竭（BP 86/54 mmHg, P 132次/分, 四肢湿冷→ 休克）；4) ST段压低+大汗→ 心肌缺血/低灌注；5) 浓茶色尿+少尿（100ml）→ 急性溶血或肝肾损伤（利福平副作用？）；6) 意识丧失史+躁动→ 脑缺氧",
        "治疗相关风险": "1) 自行停利福平（药物依从性差）；2) 脾切除史→ 感染风险↑；3) 未进食+凉水诱发→ 胃肠反应加重停药"
      },
      "Step 3: 规则对齐与安全检查 (Alignment & Safety)": {
        "指南匹配": "完全符合Condition条件：①大咯血伴生命体征不稳定（BP↓, P↑, SpO₂↓）；②呼吸循环衰竭（呼吸困难、青紫、休克）；③潜在严重不良反应（浓茶尿→溶血/肝损？）。无Contraindication。",
        "安全警报": "窒息风险（血块堵塞）、休克恶化、多器官衰竭（心/肾/脑）需立即干预"
      },
      "Step 4: 决策生成 (Decision Making)": "严格遵循指南Action：1) 立即就地抢救稳定生命体征；2) 启动转诊流程至上级医院传染科ICU；3) 后续转结核定点医院管理。决策依据：患者处于急性生命威胁状态，远超基层处理能力。"
    },
    "medical_order": "【紧急处置】1. 立即面罩高流量吸氧（目标SpO₂>90%），备吸引器于床旁；2. 建立两条静脉通路，快速输注晶体液500ml扩容，紧急配血；3. 心电监护，监测尿量；4. 紧急联系转诊医院传染科ICU，告知\"疑似结核大咯血窒息、失血性休克、急性溶血？需呼吸循环支持\"。\n【初步检查】急查：血常规、凝血功能、肝肾功能、电解质、动脉血气、心电图、床旁胸片。\n【药物调整】暂停所有抗结核药；予维生素K1 10mg肌注；吗啡3mg IV缓推（镇静+降低肺动脉压）。\n【转运准备】气管插管包、急救药品随行，医护陪同转运。",
    "patient_dialogue": "（蹲下身平视患者，握其手，语速快而沉稳）张师傅，我是王医生，您现在确实喘得厉害，但别怕！我们马上做三件事：第一，给您戴个面罩大力供氧，很快就能喘顺些；第二，打上点滴快速补液，把血压拉上来；第三，已经联系好XX医院急救团队，救护车5分钟就到——那里有专门的隔离抢救室和顶尖专家等着您！您刚才咯的血块可能堵住气管了，去大医院才能用高级设备清理干净。坚持住，我们全程陪着您！"
  },
  {
    "id": 1715,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "午后，乡镇卫生院儿保室。奶奶抱着4岁半的孙子小浩（体重18 kg）进门，着急地说：“大夫，孩子这俩礼拜一到下午就烧到38 ℃左右，夜里出汗多，还总咳，听着空空的。”孩子缩在奶奶怀里，偶尔轻咳，右颈可触及一枚1.5 cm淋巴结，轻压痛。奶奶补了一句：“他舅舅前阵子在大医院查出来肺上有空洞，说是痰里带菌，一直住家里，娃总黏着他。”护士量腋温37.9 ℃，听诊右肺上野呼吸音略低。今天外面下雨，候诊走廊地面湿滑。医生追问疫苗史，奶奶说卡介苗出生时就种了，但具体复查情况记不清。目前未行任何影像或结核菌检查，家长只带了上周村卫生室开的止咳糖浆空瓶。",
    "reference_rule": {
      "condition": "符合下列条件之一者：1. 有肺结核可疑症状的5岁以下儿童，同时伴有与痰涂片阳性肺结核患者密切接触史或TST强阳性或IGRA阳性；2. 仅胸部影像学检查结果显示有与活动性肺结核相符的病变",
      "action": "1. 按乙类传染病疫情报告要求进行网络直报; 2. 完整填写《肺结核病例登记报告卡》; 3. 填写《肺结核患者转诊单》并及时转诊至县级以上结核病防治所或有条件诊治结核病的综合医院",
      "contraindication": null,
      "evidence": "疑似病例：符合下列条件之一者为疑似病例：① 有肺结核可疑症状的5岁以下儿童，同时伴有与痰涂片阳性肺结核患者密切接触史或TST强阳性或IGRA阳性；② 仅胸部影像学检查结果显示有与活动性肺结核相符的病变。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于行政与伦理场景。作为管理者，我的关注重点在于流程合规性（传染病报告制度）、文书完整性（法定报告卡填写）及公共卫生责任（结核病防控的及时干预和家庭隔离指导）。需确保所有操作符合《传染病防治法》及结核病管理规范。\n\nStep 2: 临床解码 (Clinical Decoding) - ① 核心症状：午后低热（37.9℃）、盗汗、空洞样咳嗽提示肺结核可疑症状；② 体征：右颈淋巴结肿大（1.5cm伴压痛）、右肺上野呼吸音减低符合结核性淋巴炎或肺实质病变；③ 高危暴露：与痰涂片阳性肺结核患者（舅舅）同住密切接触史；④ 年龄风险：4.5岁儿童属5岁以下高危人群；⑤ 疫苗保护不确定性：卡介苗接种史但未确认是否成功（无疤痕/PCR复查记录）；⑥ 环境风险：候诊区湿滑需防跌倒，但非医疗优先项。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 完全匹配指南Condition 1：有肺结核可疑症状（发热+咳嗽+盗汗）的5岁以下儿童，且存在与痰涂片阳性患者的明确密切接触史。Contraindication为null，无安全禁忌。需特别警示：未进行影像学/TST/IGRA检查不影响当前疑似病例判定（依据指南证据条款①）。\n\nStep 4: 决策生成 (Decision Making) - 严格遵循指南Action：立即启动传染病网络直报流程，完整填写《肺结核病例登记报告卡》及《转诊单》，紧急转诊至县级及以上结核病定点医院。同步添加伦理干预：指导家庭接触者隔离措施。",
    "medical_order": "1. 初步诊断：儿童肺结核疑似病例（依据密切接触史+典型症状群）。\n2. 传染病管理：即刻按乙类传染病要求完成网络直报，填报《肺结核病例登记报告卡》。\n3. 转诊处置：开具《肺结核患者转诊单》，优先转诊至县结核病防治所；转运前嘱家属避免使用公共交通工具。\n4. 感染控制：书面告知家庭隔离要求（患儿与舅舅分室居住，接触者佩戴医用口罩，居室每日通风≥2次）。\n5. 安全警示：候诊区湿滑，通知后勤处置防跌倒风险。\n6. 待完善：转诊机构需行胸部CT、结核菌素试验、痰/胃液抗酸染色。",
    "patient_dialogue": "老人家您别急，听我跟您仔细说。小浩这个反复发烧、夜里出汗还有咳嗽的情况，加上孩子舅舅正在家养病，咱们得特别重视。这很可能是被传染了肺结核——这种病在孩子身上发展快，但早发现能治好。\n\n现在必须做三件事：第一，我马上联系县里的结核病专科医院，您今天就带娃过去，他们设备更全，能查清楚肺里情况。记住打车去，别坐公交，减少传染风险。第二，回家后让孩子和舅舅分开房间住，家里人照顾时都戴好口罩，屋里多开窗通风。这病通过咳嗽飞沫传人，不注意的话全家都可能染上。第三，您自己也去卫生院查下身体，照顾病人最容易被传染。\n\n止咳糖浆治标不治本，咱得找到病根。您放心，县医院会给孩子做详细检查，国家有免费治结核的政策。走廊地滑您抱孩子慢点走，我让护士扶您出去。"
  },
  {
    "id": 1726,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者20天前无明显诱因出现阵发性干咳，晨起重，夜间伴盗汗，自测体温波动37.6-38.2℃，口服阿莫西林5天无缓解。3天前痰中带血丝一次，量约1ml，鲜红色，无胸痛气促。吸烟史15年，约20支/日，近1周因工期紧张仍坚持高空作业。查体：T 38.0℃，右上肺呼吸音稍低，未闻及干湿啰音；余心肺腹（-）。门诊胸片示右上肺尖后段斑片、结节影伴小空洞，直径约1.5cm，边缘模糊；左肺清晰。今日留取即时痰与晨痰各1份送检，抗酸染色镜检回报：即时痰找到抗酸杆菌（+），晨痰结果待报；HIV抗体筛查（-）。患者自述昨晚夜班后疲惫，担心耽误工期，询问能否先开口服药回家观察。",
    "reference_rule": {
      "condition": "符合下列条件之一者：1. 痰涂片阳性肺结核（2份痰标本直接涂片抗酸杆菌镜检阳性；或1份痰标本直接涂片抗酸杆菌镜检阳性+肺部影像学检查符合活动性肺结核影像学表现；或1份痰标本直接涂片抗酸杆菌镜检阳性+1份痰标本结核菌培养阳性）；2. 仅培养阳性肺结核（痰涂片阴性，肺部影像学检查符合活动性肺结核影像学表现+1份痰标本结核菌培养阳性）；3. 肺部影像学检查符合活动性肺结核影像学表现，分子生物学检测阳性（如PCR、Xpert MTB/RIF）；4. 肺或胸膜病变标本病理学诊断为结核病变者",
      "action": "1. 立即开始标准抗结核化学治疗; 2. 按乙类传染病疫情报告要求进行网络直报; 3. 完整填写《肺结核病例登记报告卡》; 4. 在结核病定点医疗机构进行门诊或住院治疗",
      "contraindication": null,
      "evidence": "确诊病例：符合下列条件之一者为确诊病例：① 痰涂片阳性肺结核。符合下列3项之一者：a. 2份痰标本直接涂片抗酸杆菌镜检阳性；b. 1份痰标本直接涂片抗酸杆菌镜检阳性+肺部影像学检查符合活动性肺结核影像学表现；c. 1份痰标本直接涂片抗酸杆菌镜检阳性+1份痰标本结核菌培养阳性；② 仅培养阳性肺结核。同时符合下列2项者：a. 痰涂片阴性；b. 肺部影像学检查符合活动性肺结核影像学表现+1份痰标本结核菌培养阳性；③ 肺部影像学检查符合活动性肺结核影像学表现，分子生物学检测阳性（如PCR、Xpert MTB/RIF）；④ 肺或胸膜病变标本病理学诊断为结核病变者。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（例如排除肺结核、肺癌或肺炎等危急重症），并基于证据给出直接的治疗指令，避免延误病情。\nStep 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者有阵发性干咳（晨重）、盗汗、低热（37.6-38.2℃），提示感染性症状；痰中带血丝和右上肺呼吸音稍低，结合吸烟史（15年，20支/日），增加肺结核或肺癌风险；胸片显示右上肺尖后段斑片、结节影伴小空洞（直径1.5cm，边缘模糊），符合活动性肺结核影像学特征；即时痰抗酸杆菌阳性（+），HIV抗体阴性。这些转化为医学术语：高度怀疑活动性肺结核（痰涂片阳性），需排除其他如细菌性肺炎或恶性肿瘤。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 将解码信息与指南 Condition 匹配：患者已有1份痰涂片阳性（即时痰）和肺部影像学符合活动性肺结核表现，因此满足指南中的‘b. 1份痰标本直接涂片抗酸杆菌镜检阳性+肺部影像学检查符合活动性肺结核影像学表现’条件，可确诊肺结核。指南中 Contraindication 为 null，无禁忌症（如无药物过敏或严重肝肾功能不全报告），安全。\nStep 4: 决策生成 (Decision Making) - 根据指南 Action，生成决策：立即开始标准抗结核化学治疗（以控制传播和病情），按乙类传染病要求进行疫情报告，填写登记报告卡，并在结核病定点医疗机构治疗（确保专业监测），拒绝患者提出的‘开口服药回家观察’请求（因需隔离和规范管理）。",
    "medical_order": "诊断：肺结核（痰涂片阳性）。处理：1. 立即开始标准抗结核化学治疗（方案：2HRZE/4HR）；2. 按乙类传染病疫情报告要求完成网络直报；3. 填写《肺结核病例登记报告卡》；4. 收入结核病定点医疗机构治疗（门诊或住院）；5. 完善痰培养及分子生物学检测（如Xpert MTB/RIF）；6. 监测肝肾功能、血常规。",
    "patient_dialogue": "王先生，您的检查结果出来了，显示您得了肺结核，这是一种传染性很强的肺部疾病。您最近咳嗽、盗汗和痰中带血，都是这个病引起的。现在必须马上开始治疗，不能再拖了——我们会安排您在专门医院吃药，同时监测您的身体反应。我知道您担心工作，但如果不治疗，病情会恶化，还可能传染给家人或同事。您先别急着回家观察，治疗期间需要休息和隔离，等稳定了再考虑工作的事。我会帮您联系医院，一切以您的健康为重。"
  },
  {
    "id": 1728,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者42岁，建筑工，因“咳嗽伴低热3周”于10天前在本院拍胸片提示“双上肺斑片影”，当日连续两次痰涂片均找到抗酸杆菌（4+）。已按指南启动HRZE四联抗结核治疗，并上报传染病卡。今日复诊，患者仍咳黄脓痰、夜间盗汗明显，体温37.8℃，体重较首诊下降2kg；复查肝功ALT 112 U/L（正常<40），外周血白细胞3.1×10⁹/L。患者抱怨“吃药后胃胀、恶心，一天只能喝粥”，并担心耽误工地工期。诊室窗外正下小雨，他脚穿沾满泥浆的高帮胶鞋，反复看表，生怕错过下午回工地的班车。",
    "reference_rule": {
      "condition": "临床疑似肺结核者；直接涂片抗酸杆菌镜检阳性者；肺结核治疗过程中出现明显不良反应者；抗肺结核治疗效果不佳者",
      "action": "1. 填写《肺结核患者转诊单》，及时将患者转诊至县级以上结核病防治所或有条件诊治结核病的综合医院进行确诊或治疗; 2. 在非结核病定点医疗机构确诊的肺结核患者，转诊到当地结核病定点医疗机构进行门诊或住院治疗; 3. 在定点医疗机构确诊的肺结核患者，可在确诊机构治疗，或将患者转诊到其居住地定点医疗机构继续治疗",
      "contraindication": null,
      "evidence": "普通转诊建议：(1) 临床疑似肺结核者；(2) 直接涂片抗酸杆菌镜检阳性者；(3) 肺结核治疗过程中出现明显不良反应者；(4) 抗肺结核治疗效果不佳者。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于分级诊疗与随访场景。作为守门人，重点评估抗结核治疗10天后症状缓解程度、药物耐受性及实验室指标，判断是否触发转诊条件。\nStep 2: 临床解码 - 关键点：①治疗反应差（持续黄脓痰、盗汗、低热、体重下降）②药物不良反应（ALT显著升高示肝损伤，白细胞减少示骨髓抑制，胃肠道症状影响营养摄入）③依从性风险（患者因工期焦虑可能自行停药）④环境线索（潮湿工作环境不利结核康复）。\nStep 3: 规则对齐 - 完全匹配指南条件：'肺结核治疗过程中出现明显不良反应者'（肝损+骨髓抑制）及'抗结核治疗效果不佳者'（症状未缓解）。无禁忌症。\nStep 4: 决策生成 - 根据指南action 2条，必须立即转诊至结核病定点机构：治疗反应不佳+多重不良反应需调整方案，肝损伤需专业监测。",
    "medical_order": "1. 立即填写《肺结核患者转诊单》，转诊至区结核病防治所（定点机构）\n2. 转诊前急查：肝功能（含AST、ALP、TBIL）、凝血功能、肝炎病毒标志物\n3. 暂停HRZE方案，临时予：\n   - 异甘草酸镁注射液 150mg ivgtt qd 保肝\n   - 维生素B6 20mg tid po 缓解胃肠道反应\n4. 开具全休证明（建议休息≥2周）\n5. 传染病报告系统补充当前实验室异常结果",
    "patient_dialogue": "李师傅，您先坐下听我说。现在有两个关键问题：第一，结核药对肝脏损伤有点大，这个转氨酶升高必须马上处理；第二，咳嗽发烧这些症状还没压下去，说明治疗方案得调整了。\n\n咱们得立即转去区结核病防治所——他们是专门对付结核的专家，会给您换更安全的药，还能随时监测肝功能。今天先把这些伤肝的药暂停，打上保肝针，再开点缓解胃胀的药。\n\n工地的事儿您千万不能硬扛！这病就像房子打地基，基础不治好，后面要出大问题。我给您开两周病假条，养好了才能长久干活不是？班车赶不上也别急，防治所离这儿就三站路，我让护士帮您叫个车，保管不耽误治疗。"
  },
  {
    "id": 1745,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者42岁，男性，身高168 cm，体重59 kg，既往体健，吸烟史20年（约15支/日）。2年前因咳嗽、低热被确诊为“继发性肺结核（痰涂片阳性）”，接受2HRZE/4HR方案治疗，疗程结束后自行停药，未复查痰菌。近1个月再发咳嗽、午后低热（37.6 ℃）、盗汗，伴少量白色黏痰，偶有血丝。今日上午来社区卫生服务中心复诊，门诊测体温37.4 ℃，HR 88次/分，BP 118/72 mmHg，SpO₂ 96%（室内空气）。查体：右肺上野叩诊稍浊，呼吸音减弱，可闻及细湿啰音；余肺呼吸音清。实验室检查：血常规WBC 7.8×10⁹/L，NE% 68%，Hb 132 g/L；肝肾功能正常；空腹血糖5.2 mmol/L。痰涂片抗酸染色阳性（3+），GeneXpert MTB/RIF检测提示结核分枝杆菌阳性，利福平敏感。胸片示右肺上叶尖后段斑片、结节影伴小空洞形成，与2年前旧片比较病灶进展。患者自述因工地赶工期，近3周仍坚持高空作业，偶有轻度气促，未向工头报告病情。无药物过敏史，未合并糖尿病或其他慢病，近期体重下降约3 kg。",
    "reference_rule": {
      "condition": "复治活动性肺结核（含痰涂片阳性和阴性）",
      "action": "1. 使用常用方案为2HRZSE/6HRE，3HRZE/6HR，或2HRZSE/1HRZE/5HRE; 2. 进行药敏试验; 3. 对上述方案治疗无效的复治肺结核，参考耐多药结核可能，按耐药或耐多药结核治疗",
      "contraindication": null,
      "evidence": "复治活动性肺结核（含痰涂片阳性和阴性）：常用方案为2HRZSE/6HRE，3HRZE/6HR，2HRZSE/1HRZE/5HRE。复治结核应进行药敏试验，对上述方案治疗无效的复治肺结核应参考耐多药结核可能，需按耐药或耐多药结核治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（排除其他危急重症如肺炎或肺癌），并基于现有证据给出直接、高效的治疗指令。Step 2: 临床解码 (Clinical Decoding) - 患者为42岁男性，既往肺结核治疗史（2年前2HRZE/4HR方案，但自行停药未复查），现出现复发症状（咳嗽、午后低热、盗汗、偶有血丝痰），体重下降3kg提示消耗状态。查体右肺上野叩诊浊音、呼吸音减弱及湿啰音，结合痰涂片阳性（3+）、GeneXpert MTB/RIF检测结核阳性且利福平敏感、胸片示病灶进展（右肺上叶斑片结节影伴空洞），诊断为复发性活动性肺结核。吸烟史20年（15支/日）是潜在风险因素，无药物过敏或合并症。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为'复治活动性肺结核'，患者情况完全匹配（痰涂片阳性、复发史）。指南Contraindication为null，患者无禁忌症（肝肾功能正常、无过敏、无糖尿病），治疗方案安全。Step 4: 决策生成 (Decision Making) - 根据指南Action，优先选择常用复治方案2HRZSE/6HRE（2个月强化期：异烟肼、利福平、吡嗪酰胺、链霉素、乙胺丁醇；6个月巩固期：异烟肼、利福平、乙胺丁醇），并强制进行药敏试验（尽管GeneXpert已做利福平敏感，但需全面药敏以排除其他耐药）。同时，需启动随访监测，若治疗无效再考虑耐药方案。",
    "medical_order": "1. 予2HRZSE/6HRE抗结核治疗方案：异烟肼0.3 g qd、利福平0.6 g qd、吡嗪酰胺1.5 g qd、链霉素0.75 g im qd、乙胺丁醇0.75 g qd（强化期2个月）；续以异烟肼0.3 g qd、利福平0.6 g qd、乙胺丁醇0.75 g qd（巩固期6个月）。2. 完善痰培养及药敏试验（包括一线抗结核药物）。3. 予呼吸道隔离，避免交叉感染。4. 戒烟教育及支持。5. 定期随访：每2周复查痰涂片至阴性，每月监测肝肾功能、血常规，治疗2个月后复查胸片评估病灶变化。6. 若出现药物不良反应（如肝功能异常），立即调整方案。",
    "patient_dialogue": "王先生，您好。检查结果出来了，您之前的肺结核复发了，就是肺里的细菌感染又活跃了，这解释了您的咳嗽、低热和体重下降。别担心，这病现在可以控制住，但我们得立刻开始治疗。我会给您开一个强效的药物组合，需要坚持吃8个月——头两个月打针加吃药，后面六个月吃药就行。为什么这么长时间？因为肺结核细菌很顽固，上次停药让它没彻底清除，这次一定要完整疗程，否则容易再复发。同时，您得做个痰液培养测试，确保药物有效。还有啊，您必须戒烟了！抽烟会让肺更弱，影响恢复。另外，您得在家休息隔离两周，别去上班了——高空作业太危险，而且咳嗽会传染给同事或家人。治疗期间，我们会每两周检查痰液，每月抽血看看药物有没有副作用。这次咱们一起努力，好吗？坚持下来，您就能恢复健康了。"
  },
  {
    "id": 1710,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者近3周来反复干咳，夜间加重，伴38℃左右低热、盗汗，晨起需换一件湿透的背心；体重自测下降约4kg，食欲差，常靠两包泡面撑到收工。今日咳出少量带血丝痰，遂趁工地调休骑电动车30分钟来诊。既往体健，吸烟指数800，偶尔饮酒。查体：T 37.8℃，P 92次/分，R 20次/分，BP 118/74 mmHg；右上肺叩诊略浊，呼吸音减低。门诊胸片示右肺上野斑片、结节影，边缘模糊，其内疑似小空洞。患者自述近半年同住宿舍的表哥也有“长期咳嗽”，但未曾就医。",
    "reference_rule": {
      "condition": "具有结核中毒症状（低热、乏力、盗汗、食欲减退、体重减轻等），或伴呼吸道症状者（咳嗽、咳痰2周以上，或伴咯血、痰中带血），或通过健康体检发现的肺部阴影疑似肺结核者",
      "action": "1. 进一步完善相关检查明确是否为肺结核; 2. 在门诊日志标注疑似肺结核病例; 3. 按乙类传染病疫情报告要求进行网络直报; 4. 完整填写《肺结核病例登记报告卡》; 5. 填写《肺结核患者转诊单》并及时转诊至县级以上结核病防治所或有条件诊治结核病的综合医院",
      "contraindication": null,
      "evidence": "具有结核中毒症状（低热、乏力、盗汗、食欲减退、体重减轻等），或伴呼吸道症状者（咳嗽、咳痰2周以上，或伴咯血、痰中带血），或通过健康体检发现的肺部阴影疑似肺结核者，应考虑为肺结核可疑者，需进一步完善相关检查明确是否为肺结核。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（排除肺癌、肺炎或严重感染等危急重症），并基于初步证据给出直接指令，确保患者安全。\nStep 2: 临床解码 (Clinical Decoding): 患者表现包括：干咳 >2周（伴夜间加重）、低热（37.8-38℃）、盗汗（晨起湿透背心）、体重减轻（4kg）、食欲减退及咳血丝痰；查体右上肺叩诊浊音、呼吸音减低；胸片示右肺上野斑片、结节影伴模糊边缘及疑似小空洞；风险因素有高吸烟史（吸烟指数800）、营养状态差（常食泡面）、同住暴露（表哥长期咳嗽未就医）。医学转化：符合肺结核典型三联征（咳嗽、低热、盗汗），影像提示浸润性病变伴空洞形成，高度可疑活动性肺结核；需排除肺癌、社区获得性肺炎或真菌感染。\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 患者症状（结核中毒症状：低热、盗汗、体重减轻、食欲差；呼吸道症状：咳嗽>2周伴咯血）和影像（肺部阴影疑似肺结核）完全匹配指南的Condition。指南Contraindication为null，无禁忌症；安全检查：排除急症（如大咯血或呼吸衰竭风险低，生命体征稳定），但需注意吸烟史可能增加肺癌风险，影像未提示急症，优先考虑肺结核。\nStep 4: 决策生成 (Decision Making): 根据指南Action，决策如下：1. 完善检查以确诊肺结核；2. 门诊日志标注疑似肺结核；3. 进行网络直报；4. 填写报告卡；5. 转诊至专科机构。",
    "medical_order": "1. 完善相关检查：痰涂片抗酸染色（连续3天晨痰）、痰培养（含药敏）、PPD试验、胸部CT平扫；血常规、ESR、CRP、肝肾功能。2. 门诊日志标注“疑似肺结核病例”。3. 按《传染病防治法》乙类传染病要求，立即网络直报。4. 填写《肺结核病例登记报告卡》。5. 填写《肺结核患者转诊单》，转诊至县结核病防治所；予临时隔离建议（戴外科口罩）、营养支持（高蛋白饮食）、戒烟宣教。",
    "patient_dialogue": "王先生，我看您最近咳嗽得挺厉害，晚上还发热、出大汗，衣服都湿透了，体重也掉了不少，这肯定让您很难受。刚才的检查结果提示，这可能是肺结核——一种会传染的肺部疾病。您表哥也有类似症状，这说明需要赶紧处理，不然容易传给家人或工友。接下来，我们要做几个检查确认一下：需要您连续三天早起咳痰来化验，再抽点血、做个更详细的肺部扫描。另外，按国家规定，这种病必须上报和转到专门的结核病医院治疗，我会帮您开好转诊单，安排好后您直接过去就行。这几天，记得戴口罩、别对着别人咳嗽，饭菜多吃点鸡蛋、鱼肉补补身子，烟也得尽量戒掉，这对恢复很重要。别太担心，咱们一步步来，我会全程跟进，您有什么问题现在就可以问我。"
  },
  {
    "id": 1733,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者29岁，建筑工人，因“咳嗽伴血丝痰3个月、午后低热1个月”今日首次来社区卫生服务中心。近两周出现活动后气短，体重下降约6 kg。查体：T 37.8 ℃，右肺上野叩诊浊音，呼吸音明显减弱；未闻及干湿啰音。胸片示右肺上叶尖后段大片致密影伴空洞形成，直径约4 cm，内壁不规则；左肺清晰。痰涂片抗酸杆菌（+++），GeneXpert MTB/RIF 检出结核分枝杆菌且利福平耐药。已规范四联抗结核（HRZE）治疗5个月，复查痰菌仍阳性，病灶无吸收且空洞增大至5 cm，伴反复咯血2次（每次约30 ml）。患者无糖尿病、HIV及其他慢性病史，肝肾功能正常。今日步行来院途中抱怨“胸口像压着石头”，并随口提到“昨晚工地加班到凌晨两点”。",
    "reference_rule": {
      "condition": "药物治疗失败或威胁生命的单侧肺结核特别是局限性病变",
      "action": "1. 考虑外科治疗作为可选用的重要治疗方法",
      "contraindication": null,
      "evidence": "对于药物治疗失败或威胁生命的单侧肺结核特别是局限性病变，外科治疗是可选用的重要治疗方法。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)** 本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（包括排除危及生命的重症如大咯血或肺功能衰竭），并基于现有证据给出最直接的治疗指令。**Step 2: 临床解码 (Clinical Decoding)** 患者为29岁建筑工人，关键信息包括：咳嗽伴血丝痰3个月、午后低热1个月、活动后气短和体重下降6 kg（提示慢性消耗性疾病）；查体示T 37.8 ℃、右肺上野叩诊浊音及呼吸音减弱（符合肺实变体征）；胸片显示右肺上叶尖后段大片致密影伴4 cm空洞（后增大至5 cm，内壁不规则），左肺清晰（确认单侧局限性病变）；痰涂片抗酸杆菌（+++）和GeneXpert MTB/RIF检测证实结核分枝杆菌感染且利福平耐药（诊断为耐多药肺结核，MDR-TB）；HRZE治疗5个月后痰菌仍阳性、病灶无吸收、空洞增大，并出现反复咯血（每次30 ml），表明药物治疗失败和疾病进展；患者无慢性病史及肝肾功能异常（排除了常见禁忌）；隐式线索包括“胸口像压着石头”（可能为气短或胸痛加剧，需警惕咯血或呼吸衰竭风险）和“昨晚工地加班到凌晨两点”（暗示过度劳累，可能加重病情或影响治疗依从性）。整体评估：药物治疗失败、空洞增大及咯血构成威胁生命的单侧局限性肺结核。**Step 3: 规则对齐与安全检查 (Alignment & Safety)** 患者情况与指南条件“药物治疗失败或威胁生命的单侧肺结核特别是局限性病变”完全匹配（药物治疗失败5个月、空洞增大、咯血、单侧病变），且指南中禁忌症（contraindication）为null，经检查无糖尿病、HIV或肝肾功能异常等禁忌风险，安全评估通过。**Step 4: 决策生成 (Decision Making)** 基于指南action“考虑外科治疗作为可选用的重要治疗方法”，决策为优先评估外科干预，同时安排紧急转诊以处理咯血风险。",
    "medical_order": "诊断：耐多药肺结核（MDR-TB）治疗失败，右肺上叶空洞性病变伴反复咯血。予一级护理，监测生命体征及咯血情况。完善术前评估：包括胸部CT、肺功能测试、凝血功能及心电图。考虑外科治疗（如肺叶切除术），紧急转诊至结核专科或胸外科中心。继续二线抗结核方案（根据药敏调整），予止血药物（如氨甲环酸）预防咯血。严格隔离措施，避免传染。",
    "patient_dialogue": "李先生，我知道您最近过得很辛苦——咳嗽带血、胸口发闷，还瘦了不少。检查结果告诉我们，之前的抗结核药没能控制住感染，那个肺上的空洞还在变大，这导致了您咯血和呼吸困难。如果不尽快处理，空洞可能破掉引起大出血，或者让健康的肺也受牵连。现在，我们需要考虑做手术来切除病变的部分，就像清理坏掉的砖块一样，这样才能彻底治好。我会马上安排您转到专科医院，那里的专家会帮您评估手术方案。同时，得先止血和保护您的呼吸，给您用些药。记住，工作再忙也要休息好——过度劳累会让病情加重。别担心，我们会一步步帮您度过难关。"
  },
  {
    "id": 1727,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者因“断断续续低烧、夜里出汗3周，咳黄痰带血丝2天”来乡镇卫生院门诊。T 37.8 ℃，消瘦明显（BMI 18.2 kg/m²），右锁骨上听诊可闻细小湿啰音。胸片提示右肺上叶斑片影伴小空洞，PPD 硬结18 mm，γ-干扰素释放试验阳性；痰涂片抗酸杆菌（+）。患者自述每天抽1包烟，工期紧常通宵加班，既往无慢性病史，青霉素过敏。今日由工友陪同步行就诊，外面正下小雨，他还担心工地老板嫌请假时间长。",
    "reference_rule": {
      "condition": "诊断为活动性肺结核",
      "action": "1. 遵循早期、规律、全程、适量、联合的治疗原则; 2. 整个治疗方案分强化期和巩固期两个阶段; 3. 化学治疗的主要作用为杀菌和灭菌、防止耐药菌产生、减少结核菌的传播",
      "contraindication": null,
      "evidence": "结核病化学治疗的基本原则是早期、规律、全程、适量、联合。整个治疗方案分强化期和巩固期两个阶段。化学治疗的主要作用为杀菌和灭菌、防止耐药菌产生、减少结核菌的传播。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)\n本案例属于常规诊断与治疗场景，重点关注快速建立鉴别诊断（排除如肺炎、肺癌等危急重症），并基于证据直接给出治疗指令。思维重点在于高效识别核心问题，避免延误，确保治疗及时启动。\n\nStep 2: 临床解码 (Clinical Decoding)\n患者表现为典型结核症状：低热（T 37.8℃）、盗汗（夜里出汗）、咯血（咳黄痰带血丝）、消瘦（BMI 18.2 kg/m²）及肺部体征（右锁骨上细小湿啰音）。影像学（胸片右肺上叶斑片影伴小空洞）和实验室结果（PPD硬结18mm、γ-干扰素释放试验阳性、痰涂片抗酸杆菌阳性）强支持活动性肺结核诊断。隐式线索包括：吸烟史（每日1包烟，加重肺部损伤）、过度劳累（常通宵加班，削弱免疫力）、青霉素过敏（虽不直接影响结核治疗，但需注意药物过敏风险）及社会因素（经济压力、担心工作请假，可能影响治疗依从性）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)\n病例证据（症状、体征、影像和实验室结果）完全符合指南的Condition（活动性肺结核）。指南Contraindication为null，无绝对禁忌；青霉素过敏不影响标准抗结核药物，但需监测潜在药物不良反应（如肝毒性）。安全优先级：确保治疗不加重现有风险（如避免使用β-内酰胺类抗生素），并强调全程规律服药以防耐药。\n\nStep 4: 决策生成 (Decision Making)\n基于指南Action，决策为立即启动标准抗结核化疗：分强化期（杀菌为主）和巩固期（灭菌防复发）。具体方案包括联合用药、全程管理，并整合非药物干预（如隔离、戒烟）以优化效果。排除其他危急重症（如无急性呼吸衰竭或大咯血，无需紧急处理），但需转诊上级机构确保规范治疗。",
    "medical_order": "诊断：活动性肺结核（右肺上叶）。予标准抗结核化学治疗：强化期2个月，口服异烟肼300mg每日一次、利福平450mg每日一次、吡嗪酰胺1500mg每日一次、乙胺丁醇1000mg每日一次；巩固期4个月，口服异烟肼300mg每日一次、利福平450mg每日一次。监测肝肾功能及痰涂片每月一次。建议呼吸道隔离至痰涂片转阴。戒烟宣教。营养支持：高蛋白饮食，监测体重。转诊至县结核病防治所规范管理。青霉素过敏，禁用相关抗生素。",
    "patient_dialogue": "老李啊，先别着急工作的事，咱们聊聊您的身体。您这是得了肺结核，一种传染性肺病——您最近发烧、晚上出汗、咳血都和它有关。这病得赶紧治，不然会越来越严重，还可能传染给工友或家人。治疗很简单：从今天起，您得按时吃几种药，头两个月每天吃，后四个月减点药，坚持半年就能好透。吃药时必须规律，一顿都不能落，否则细菌会变‘聪明’，药就不管用了。同时，您得注意几点：第一，戴口罩、单独住几天，避免传给他人；第二，必须戒烟！抽烟会让肺更难恢复；第三，多吃点鸡蛋、肉，补补身子。工头那边别担心，我开个证明，您先专心治病。药很安全，但如果有恶心或皮肤痒，立刻告诉我。咱们先去县里专科医院办手续，好吗？"
  },
  {
    "id": 1729,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者20天前无明显诱因出现阵发性干咳，近1周转为少量白黏痰，伴午后低热（37.5–37.8 ℃）、夜间盗汗及明显乏力，无胸痛、咯血。自行服用阿莫西林及甘草片5天无缓解。今日至镇卫生院门诊，查体：消瘦，右肩胛间区可闻及细湿啰音；SpO₂ 96%（室温空气）。门诊胸片示：右肺上叶尖后段斑片、结节影伴小空洞，边缘模糊，直径约2.1 cm，空洞壁薄，周围可见卫星灶。痰涂片抗酸染色已连送3次，结果均回报“未检出抗酸杆菌”。患者诉近3个月体重下降4 kg，常年在粉尘环境作业，吸烟指数400支年。无糖尿病、无HIV高危史。查血WBC 6.8×10⁹/L，CRP 28 mg/L，ESR 55 mm/h；结核菌素试验（PPD 5 IU）48 h硬结18 mm×19 mm，局部水疱。今日为明确下一步处理，患者再次来到诊室。",
    "reference_rule": {
      "condition": "符合下列条件之一者：1. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且伴有咳嗽、咳痰、咯血等肺结核可疑症状；2. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且TST强阳性；3. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且结核抗体检查阳性；4. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且肺外组织病理检查证实为结核病变；5. 痰涂片3次阴性的疑似肺结核病例，经诊断性治疗或随访观察可排除其他肺部疾病者；6. 支气管镜检查符合气管、支气管结核改变；7. 单侧或双侧胸腔积液，胸水检查提示渗出液，胸水ADA明显升高，伴有TST阳性或IGRA阳性",
      "action": "1. 开始抗结核治疗; 2. 按乙类传染病疫情报告要求进行网络直报; 3. 完整填写《肺结核病例登记报告卡》; 4. 填写《肺结核患者转诊单》并及时转诊至结核病定点医疗机构",
      "contraindication": null,
      "evidence": "临床诊断病例：符合下列条件之一者为临床诊断病例：① 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且伴有咳嗽、咳痰、咯血等肺结核可疑症状；② 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且TST强阳性；③ 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且结核抗体检查阳性；④ 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且肺外组织病理检查证实为结核病变；⑤ 痰涂片3次阴性的疑似肺结核病例，经诊断性治疗或随访观察可排除其他肺部疾病者；⑥ 支气管镜检查符合气管、支气管结核改变；⑦ 单侧或双侧胸腔积液，胸水检查提示渗出液，胸水ADA明显升高，伴有TST阳性或IGRA阳性。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我将聚焦于快速建立鉴别诊断（优先排除肺癌、真菌感染等危急重症），并基于直接证据给出果断的治疗指令。Step 2: 临床解码 (Clinical Decoding) – 患者症状（干咳转白黏痰、午后低热、盗汗、乏力、体重下降4kg）、影像学特征（右肺上叶尖后段斑片结节影伴薄壁空洞及卫星灶）、PPD试验强阳性（硬结18×19mm伴水疱）、炎症标志物升高（ESR 55 mm/h, CRP 28 mg/L），以及粉尘暴露和吸烟史（400支年），高度提示活动性肺结核。痰涂片3次阴性需考虑为假阴性（可能与痰样本质量或早期病变相关），鉴别诊断包括尘肺相关感染或恶性肿瘤，但结核可能性最高。Step 3: 规则对齐与安全检查 (Alignment & Safety) – 患者符合指南条件①（痰涂片3次阴性 + 影像学活动性病变 + 肺结核可疑症状）和②（痰涂片3次阴性 + 影像学病变 + TST强阳性）。无禁忌症（无糖尿病/HIV/药物过敏史），患者SpO₂正常、无咯血/胸痛，排除急性呼吸衰竭等危急状态。Step 4: 决策生成 (Decision Making) – 基于指南Action，决策为立即启动抗结核治疗、执行传染病报告及转诊至定点机构，避免延误。",
    "medical_order": "1. 开始标准抗结核治疗：予异烟肼300 mg qd、利福平450 mg qd、吡嗪酰胺1500 mg qd、乙胺丁醇1000 mg qd，口服。2. 按乙类传染病管理要求：立即网络直报疫情，完整填写《肺结核病例登记报告卡》。3. 开具《肺结核患者转诊单》，转诊至结核病定点医疗机构进一步评估与管理。4. 完善痰培养及药敏试验、胸部CT检查。5. 戒烟宣教，避免粉尘暴露。",
    "patient_dialogue": "您好，检查结果出来了，情况是这样的：您这咳嗽、低烧和盗汗的症状，加上肺部的影像学变化，我们高度怀疑是肺结核。虽然之前痰检没查到细菌，但其他指标都指向这个方向，所以我们需要马上行动。接下来，我会开一些抗结核药给您吃，这是专门针对这种病的治疗，必须按时服药才能有效控制。同时，因为肺结核是传染病，我们要按规定上报和转到专门的医院管理，这样他们能给您更全面的检查和随访，防止传染给家人或加重病情。另外，您吸烟多又在粉尘环境工作，这会让肺更脆弱——我强烈建议您戒烟，工作时戴口罩保护自己。别担心，这病是可治的，咱们一步步来，您先吃药，转诊后专家会详细指导。"
  },
  {
    "id": 1731,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "28岁男性，建筑工人，因“间断低热、盗汗、咳嗽3周”于今日上午来社区卫生服务中心。患者3周前起每日傍晚体温37.6–38.1℃，夜间明显盗汗，干咳伴少量白黏痰，偶有血丝，无胸痛气短。自行服用“感冒药”无缓解。既往体健，无慢病史，吸烟6年约10支/日。查体：消瘦，BMI 18.4 kg/m²，右上肺听诊可闻及细湿啰音，余无异常。今日门诊胸片示右上肺野斑片及小结节影，边缘模糊；痰涂片抗酸染色报告待回。患者自述工期紧，希望尽快明确诊断并拿到口服药后返回工地。外头正下小雨，他脚边沾满泥浆的解放鞋已浸湿。",
    "reference_rule": {
      "condition": "初治活动性肺结核（含痰涂片阳性和阴性）",
      "action": "1. 使用2HRZE/4HR方案：强化期使用异烟肼、利福平、吡嗪酰胺、乙胺丁醇，1次/d，共2个月；巩固期使用异烟肼、利福平1次/d，共4个月; 2. 若强化期第2个月末痰涂片仍阳性，强化方案可延长1个月，总疗程6个月不变; 3. 对粟粒型肺结核或结核性胸膜炎，强化期为3个月，巩固期6~9个月，总疗程9~12个月; 4. 在异烟肼高耐药地区，可选择2HRZE/4HRE方案",
      "contraindication": null,
      "evidence": "初治活动性肺结核（含痰涂片阳性和阴性）：通常选用2HRZE/4HR方案，即强化期使用异烟肼、利福平、吡嗪酰胺、乙胺丁醇，1次/d，共2个月；巩固期使用异烟肼、利福平1次/d，共4个月。若强化期第2个月末痰涂片仍阳性，强化方案可延长1个月，总疗程6个月不变。对粟粒型肺结核或结核性胸膜炎上述疗程可适当延长，强化期为3个月，巩固期6~9个月，总疗程9~12个月。在异烟肼高耐药地区，可选择2HRZE/4HRE方案。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（优先排除肺炎、肺癌或真菌感染等危急重症），并根据临床表现和初步检查结果给出直接的治疗指令，避免延误病情。Step 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：患者表现为典型结核中毒症状（持续低热、盗汗、消瘦BMI 18.4 kg/m²）、呼吸系统症状（咳嗽带血丝、右上肺细湿啰音）及影像学改变（胸片示右上肺斑片状及结节影，边缘模糊）。职业（建筑工人）和吸烟史（10支/日 × 6年）暗示粉尘暴露和免疫功能风险，痰涂片抗酸染色待回是确诊关键。隐式线索包括患者工期紧迫（需快速口服方案）和营养不良（需营养支持），鉴别诊断需排除社区获得性肺炎或恶性肿瘤。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 解码信息高度匹配指南Condition（初治活动性肺结核），痰涂片无论结果均适用该方案。指南Contraindication为null，无绝对禁忌症（如肝肾功能异常未报告）；需评估异烟肼耐药风险（病例未提及地区耐药性，默认标准方案）。安全优先级：确保无药物过敏史（患者既往体健，暂假设安全）。Step 4: 决策生成 (Decision Making) - 根据指南Action，启动2HRZE/4HR方案作为初始治疗；强化期使用异烟肼、利福平、吡嗪酰胺、乙胺丁醇（1次/d × 2个月），后续巩固期基于痰涂片结果调整（若2月末阳性，延长强化期1个月）。鉴于患者需求，优先口服给药并安排紧急随访；同时完善痰涂片复查和基础检查（如肝功能），排除其他病因。",
    "medical_order": "诊断：疑似初治活动性肺结核。予2HRZE/4HR抗结核方案：强化期（异烟肼300mg/d、利福平450mg/d、吡嗪酰胺1500mg/d、乙胺丁醇1200mg/d，口服1次/d × 2个月）。完善痰涂片抗酸染色复查及肝功能、肾功能、血常规检查。建议戒烟宣教，加强营养支持（高蛋白饮食），安排2周后社区门诊随访评估症状及痰涂片结果。若痰涂片阳性或症状无改善，转诊至上级结核病专科医院。",
    "patient_dialogue": "王先生，您好，我看了您的检查结果和症状。您这低烧、晚上出汗、咳嗽带点血丝的情况，加上胸片显示肺部有阴影，很可能是肺结核——这是一种细菌感染，会传染给别人，但别担心，它完全可以治好。我建议马上开始吃药治疗：给您开四种药片，每天吃一次，先吃两个月，之后再看情况调整。这药必须按时吃，不能停，哪怕您工期再紧也得坚持，否则细菌会耐药，治疗就难了。同时，咱们得做个痰的复查确认结果，两周后您再来复查一次。另外，您得注意：抽烟会加重病情，尽量戒掉；多吃鸡蛋、牛奶这些高蛋白食物补营养；咳嗽时捂住嘴，避免传染家人。工地活儿辛苦，但健康第一，咱们争取让您尽快康复回去工作，好吗？"
  },
  {
    "id": 1742,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者28岁，货车司机，因“间断低热、盗汗、体重下降3周”前来就诊。体温37.8℃，夜间盗汗明显，近1个月体重下降4 kg。既往史：确诊HIV感染2年，CD4 180 cells/μL，规律服用替诺福韦/拉米夫定/多替拉韦，病毒载量<50 copies/mL；无结核病史。个人史：每日吸烟15支，无吸毒；父亲5年前因痰涂片阳性肺结核去世，生前与其共同居住。查体：消瘦，右锁骨上区可触及1枚1.2 cm质韧淋巴结，无压痛；双肺呼吸音清，未闻及啰音。辅助检查：血常规WBC 4.1×10⁹/L，LY 0.9×10⁹/L；空腹血糖5.3 mmol/L；胸片示右肺尖条索状及小结节影，边缘较清晰，未见空洞；结核菌素试验硬结直径18 mm。今日门诊，患者自述症状持续，担心传染家中2岁女儿。",
    "reference_rule": {
      "condition": "高危人群：HIV感染者、痰涂片阳性肺结核的密切接触者、肺部硬结纤维病灶（无活动性）、矽肺、糖尿病、长期使用糖皮质激素或免疫抑制剂者、吸毒者、营养不良者、35岁以下结核菌素试验硬结直径≥15 mm者等",
      "action": "1. 使用预防性抗结核化学治疗; 2. 常用异烟肼300 mg/d，顿服6-8个月，儿童每日用量为4~8 mg/kg；或者利福平和异烟肼联用3个月，每日顿服或每周3次",
      "contraindication": null,
      "evidence": "高危人群使用预防性抗结核治疗可减少肺结核发病率。预防性化学治疗主要应用于受结核菌感染易发病的高危人群。包括HIV感染者、痰涂片阳性肺结核的密切接触者、肺部硬结纤维病灶（无活动性）、矽肺、糖尿病、长期使用糖皮质激素或免疫抑制剂者、吸毒者、营养不良者、35岁以下结核菌素试验硬结直径≥15 mm者等。常用异烟肼300 mg/d，顿服6-8个月，儿童每日用量为4~8 mg/kg；或者利福平和异烟肼联用3个月，每日顿服或每周3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规门诊诊疗场景，作为急诊/门诊医生，我的关注重点在于快速建立鉴别诊断（排除活动性结核病、淋巴瘤或其他危急感染），基于现有证据给出直接治疗指令，避免延误高危患者的病情进展。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者关键信息包括：28岁男性，HIV感染伴CD4 180 cells/μL（免疫抑制状态），规律ART治疗但病毒控制良好；症状（低热37.8℃、盗汗、体重下降4kg）提示慢性感染；个人史（父亲痰涂片阳性肺结核密切接触史）和辅助检查（胸片右肺尖条索状/小结节影、结核菌素试验硬结18mm强阳性、右锁骨上淋巴结肿大）强烈支持结核分枝杆菌感染可能；淋巴细胞计数低（0.9×10⁹/L）强化免疫缺陷风险；隐式线索包括吸烟习惯可能加重呼吸道负担，及患者对家庭传播（2岁女儿）的担忧。医学术语转化：该病例符合潜伏性结核感染（LTBI）高危表现，需优先排除活动性结核病。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 对照指南Condition，患者属于高危人群（HIV感染者、痰涂片阳性肺结核密切接触者、结核菌素试验≥15 mm）。指南Contraindication为null，无绝对禁忌，但需安全筛查：患者服用多替拉韦（整合酶抑制剂），利福平可能通过CYP3A4诱导降低其浓度，存在药物相互作用风险；优先选择异烟肼单药方案（安全 > 疗效）。同时，患者症状和胸片异常提示需排除活动性结核，否则预防性治疗无效。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action，决策为：先完善活动性结核排除检查（确保预防治疗适用），然后启动异烟肼300 mg/d顿服6个月预防方案（避免利福平联用以防药物交互）；附加戒烟干预以减少呼吸并发症风险。",
    "medical_order": "1. 诊断：潜伏性结核感染（LTBI）高危状态，需排除活动性肺结核。2. 完善检查：立即行痰涂片抗酸染色、痰培养及药敏、胸部CT平扫；监测肝功能、血常规基线。3. 治疗：若排除活动性结核，予异烟肼300 mg/d口服顿服，疗程6个月；监测药物不良反应（如肝酶升高、周围神经炎）。4. 辅助干预：建议戒烟；定期随访（每2周复诊，评估症状及药物耐受性）。5. 公共卫生：指导家庭隔离预防（患者与幼儿分室居住，佩戴口罩），上报疾控中心备案。",
    "patient_dialogue": "您好，我看了您的检查结果，您最近有低烧、晚上出汗多和体重下降的情况，这可能和结核感染有关——就像您父亲当年得的病。别太担心，咱们发现的早，还没到严重阶段。您的HIV控制得不错，但免疫力偏低，加上和父亲住过，感染风险高。所以，咱们先做个痰液检查和CT，确认不是活动性结核。如果没问题，我会让您吃一种叫异烟肼的药，每天一片，连续吃半年，能有效预防结核发作。这药安全，但要注意肝功能和手脚麻木感，我会定期给您复查。另外，为了家人健康，特别是您女儿，在家尽量单独睡一个房间，戴好口罩，减少接触。您抽烟的习惯得改改，戒烟能保护肺，我会帮您找戒烟资源。别紧张，咱们一步步来，这病可防可控。"
  },
  {
    "id": 1740,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "38岁男性，外来务工人员，因“咳嗽、低热3周”于20天前在本中心确诊涂阳肺结核，已启动2HREZ/4HR方案。今日为第3次复诊，患者步行前来，面色尚可，但自述“上周有两天晚上跑车太晚，没赶上卫生站关门，就把药带回去自己吃了”。查体：T 36.8 ℃，R 18次/分，HR 82次/分，SpO₂ 97%。听诊右上肺仍可闻及少量湿啰音。胸片示右上肺斑片影较初诊时稍有吸收，但空洞仍存。痰涂片抗酸染色：阳性（+）。患者烟瘾未戒，每天仍吸10支左右。今日空腹到诊，尚未服药。患者问：“医生，我能不能一次性把下周的药都领回去？跑夜班实在赶不过来。”窗外正下小雨，患者鞋底沾满泥浆，裤脚湿透。",
    "reference_rule": {
      "condition": "肺结核患者在治疗过程中",
      "action": "1. 每次用药都必须在医务人员的直接监督下进行; 2. 因故未用药时必须采取补救措施以保证按医嘱规律用药",
      "contraindication": null,
      "evidence": "直接面视下短程督导治疗：直接面视下短程督导治疗是指肺结核患者在治疗过程中，每次用药都必须在医务人员的直接监督下进行，因故未用药时必须采取补救措施以保证按医嘱规律用药。督导治疗可以提高治疗依从性，保证规律用药，从而显著提高治愈率，降低复发率和死亡率，同时降低结核病的患病率和多耐药发生率。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于分级诊疗与随访场景。作为守门人 (Gatekeeper)，我将重点关注患者当前治疗状态与肺结核治疗达标标准的对比，包括依从性、临床响应和公共卫生风险，以判断是维持原治疗计划还是触发升级干预（如强化监督或转诊）。\nStep 2: 临床解码 (Clinical Decoding)：患者为38岁男性，诊断涂阳肺结核（痰涂片阳性），已启动标准2HREZ/4HR方案（异烟肼、利福平、乙胺丁醇、吡嗪酰胺）。第3周复诊时，临床指标显示部分改善（斑片影吸收），但未达标（空洞未闭、痰涂片仍阳性、湿啰音持续），提示治疗响应不足。隐式线索：患者自述上周自行服药两天（违反直接督导治疗原则），工作属性（夜班务工）导致依从性风险增加，吸烟习惯（10支/天）可能延缓肺部恢复，环境因素（淋雨、湿衣）暗示潜在健康脆弱性。患者请求一次性领药，但需与指南对齐。\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南Condition为“肺结核患者在治疗过程中”，完全匹配。Action要求每次用药必须在医务人员监督下进行，因故未用药需补救；患者自行服药事件构成违反，需立即纠正。Contraindication为null，无禁忌。安全检查：痰涂片阳性表明持续传染性风险；依从性差和吸烟可能增加治疗失败、多耐药结核或并发症风险；工作压力和环境因素需纳入干预。\nStep 4: 决策生成 (Decision Making)：基于指南Action，决策为维持原治疗方案但强化监督机制（拒绝一次性领药请求），实施补救措施（教育并确保未来规律用药），同时加强监测。作为守门人，现状未达标（依从性差、响应不足），但暂未触发转诊；需密切随访，如后续无改善则升级（如痰培养或药敏测试）。",
    "medical_order": "继续2HREZ/4HR抗结核方案。实施直接面视下督导治疗（DOT），每日必须在卫生站监督服药；对上周未监督用药事件记录在案，并教育患者确保依从性。予戒烟干预宣教。监测：每2周复查痰涂片抗酸染色；4周后复查胸片评估空洞变化。如痰涂片持续阳性，考虑行痰培养及药敏测试排除耐药。安排每周复诊随访。",
    "patient_dialogue": "大哥，看你跑夜班这么辛苦，全身都淋湿了，真不容易啊！我得跟你聊聊这吃药的事。上周你没赶上卫生站关门，自己拿药回去吃，这我能理解，但咱得小心点——肺结核这病，药必须在我们医护人员眼皮子底下吃才管用。为啥呢？因为这样能保证药效，早点治好你的咳嗽和低烧。如果自己乱吃，万一漏了或者时间不对，病菌可能变‘顽固’，更难治，还容易传染给家人。所以啊，一次性把药领回去可不行，咱得坚持每天来站里吃。这样，我跟卫生站说说，帮你调个方便的时间，比如夜班前后过来，保证不耽误你干活。另外，看你还在抽烟，这烟可伤肺啊！咱试着减减量，慢慢戒掉，肺恢复快了，你也能少受罪。今天药还没吃吧？咱现在就去服上，下周我等你准时来。别担心，咱们一起努力，把病治好！"
  },
  {
    "id": 1737,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者27岁，男性，外卖骑手，连续3周午后至夜间发热38.5–39.8℃，伴盗汗、乏力。昨日晨起咳出鲜红色血痰约20 ml，遂来中心。既往体健，无慢病史，吸烟6年约10支/日。查体：T 39.4 ℃，P 110次/分，R 24次/分，SpO₂ 94%（室内空气）。右上肺叩诊浊音，呼吸音减弱，可闻及细湿啰音。胸片示双肺弥漫性粟粒样结节，右上肺野可见片絮状影；门诊快检血常规WBC 9.8×10⁹/L，NE% 72%，CRP 56 mg/L，HIV抗体阴性。患者自述因担心收入减少，已自行服用对乙酰氨基酚退热4天，效果越来越差，仍持续高热，今晨体温峰值达40.1 ℃。患者询问：“医生，我这是不是普通肺炎？能不能先打退烧针继续跑单？”",
    "reference_rule": {
      "condition": "肺结核所致发热",
      "action": "1. 有效抗结核治疗后大多在1周内消退; 2. 少数发热不退者应用小剂量非类固醇类退热剂，如布洛芬; 3. 急性血行播散性肺结核或伴有高热等严重毒性症状或高热持续不退者，在抗结核药物治疗基础上使用类固醇糖皮质激素，一般每日20~30 mg泼尼松",
      "contraindication": "必须在充分有效抗结核药物的前提下使用糖皮质激素，否则可能禁忌",
      "evidence": "发热：有效抗结核治疗后肺结核所致的发热大多在1周内消退，少数发热不退者可应用小剂量非类固醇类退热剂，如布洛芬。急性血行播散性肺结核或伴有高热等严重毒性症状或高热持续不退者，可在抗结核药物治疗基础上使用类固醇糖皮质激素，一般每日20~30 mg泼尼松。糖皮质激素可能有助于改善症状，但必须在充分有效抗结核药物的前提下使用。"
    },
    "thought": "场景定义：本案例属于常规急诊诊疗场景，需快速排除危及生命的急症并启动针对性治疗。临床解码：青年男性外卖员，典型午后高热+盗汗+咯血+粟粒样结节胸片，符合急性血行播散性肺结核；吸烟史为危险因素，自行服用退热药无效提示病情进展。规则对齐：患者符合指南'肺结核所致发热'条件，需立即抗结核治疗；高热40.1℃伴粟粒样病变符合糖皮质激素使用指征，但必须先启动抗结核治疗。安全检查：绝对禁忌在抗结核治疗前使用激素。决策生成：立即住院隔离，启动四联抗结核治疗+泼尼松，同步完善确诊检查。",
    "medical_order": "1. 立即收治隔离病房，一级护理，绝对卧床；2. 启动抗结核治疗：异烟肼 300mg qd + 利福平 600mg qd + 吡嗪酰胺 1500mg qd + 乙胺丁醇 1200mg qd；3. 泼尼松 25mg qd po（抗结核首剂后开始）；4. 布洛芬 400mg prn（T>38.5℃）；5. 完善：痰抗酸染色×3、痰培养+药敏、结核菌素试验、胸部CT；6. 监测：体温q4h、氧饱和度、咯血量、肝肾功能。",
    "patient_dialogue": "小伙子，你的情况比较特殊，不是普通肺炎。从发烧时间、咳血和胸片来看，我们高度怀疑是肺结核的一种严重类型，叫'粟粒性肺结核'。这病传染性强，必须马上住院隔离治疗！今天就得开始用四种特效药，至少需要半年疗程。我们会加小剂量激素帮你快速退烧，但必须在抗结核药起效后才能用。现在绝对不能继续送外卖了——第一会传染给顾客，第二剧烈活动可能引发大咯血。我知道你担心收入，但命比钱重要！住院期间我们会帮你申请职业病补助，先把烧退下来、把传染链切断。"
  },
  {
    "id": 1735,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "夜间22:10，患者独自步入抢救室，右手捂着口，指缝间可见鲜红色血沫。自诉当日下午开始阵咳，傍晚突然咳出两口‘全血’，量约半茶杯，无食物残渣，伴胸骨后灼热感。既往确诊‘双上肺继发型肺结核’4个月，一直在村医处服HRZE组合板装药，但近两周因农忙常漏服。T 37.4 ℃，BP 118/76 mmHg，R 26次/分，SpO₂ 94%（室内空气）。听诊双上肺散在细湿啰音，左肩胛区可闻及局限性哮鸣音。急诊床边胸片示‘双上肺斑片影并左肺尖薄壁空洞，对比旧片空洞略增大’。患者神情紧张，反复问：‘医生，我还会不会大口吐血？’同时抱怨昨夜开始‘解小便有点痛’，自述白天自行服用‘三金片’两次。",
    "reference_rule": {
      "condition": "肺结核所致咯血（少量或大咯血）",
      "action": "1. 少量咯血时以安慰和消除紧张情绪、卧床休息为主，可用氨基己酸、凝血酶、卡洛磺等药物止血; 2. 大咯血时迅速畅通气道，包括体位引流、负压吸引、气管插管; 3. 使用垂体后叶素8~10 U缓脉静脉推注（血压正常者可使用酚妥拉明10~20 mg加入生理盐水250 ml中缓慢静脉滴注）; 4. 对于药物难以控制的大咯血，在保证气道通畅的情况下紧急转诊至有条件的专科或综合医院进行手术治疗或支气管动脉栓塞术",
      "contraindication": null,
      "evidence": "咯血：少量咯血时多以安慰和消除紧张情绪、卧床休息为主，可用氨基己酸、凝血酶、卡洛磺等药物止血。大咯血可危及生命，应特别警惕和尽早发现窒息先兆征象。迅速畅通气道是抢救大咯血窒息的首要措施，包括体位引流、负压吸引、气管插管。大咯血者可使用垂体后叶素8~10 U缓脉静脉推注，血压正常者可使用酚妥拉明10~20 mg加入生理盐水250 ml中缓慢静脉滴注。对于药物难以控制的大咯血，在保证气道通畅的情况下应紧急转诊至有条件的专科或综合医院进行手术治疗或支气管动脉栓塞术。"
    },
    "thought": "本案例属于常规急诊诊疗场景（患者夜间步入抢救室，主诉咯血），作为急诊医生，我的关注重点是快速建立鉴别诊断、排除危急重症（如大咯血窒息），并给出直接指令以稳定患者。\n\n从患者病例中解码关键临床信息：患者咯血量约100-150ml（半茶杯），属少量至中等量咯血，无食物残渣或窒息征象（生命体征稳定，SpO2 94%），结合既往活动性肺结核病史（空洞增大提示疾病进展，因近两周漏服HRZE药物）、胸骨后灼热感和肺部听诊异常（细湿啰音和局限性哮鸣音），主要鉴别诊断为肺结核相关咯血；尿路症状（解小便痛）和自行服用三金片提示可能合并尿路感染。\n\n与指南规则对齐：指南条件'肺结核所致咯血（少量或大咯血）'匹配患者情况（咯血量未达大咯血标准，无窒息风险）；无禁忌症（Contraindication null），血压正常（118/76 mmHg），可安全使用酚妥拉明止血方案；安全重点为监测咯血量变化，预防大咯血恶化。\n\n决策生成：基于指南行动1（少量咯血处理优先），给予安慰、卧床休息和止血药物（如卡洛磺）；同时强化抗结核治疗（因空洞增大需纠正漏服），并评估尿路感染；若咯血加重则触发转诊（行动4）。",
    "medical_order": "予一级护理，绝对卧床休息；立即静脉推注卡洛磺10mg止血；监测生命体征（每30分钟记录BP、R、SpO2及咯血量），警惕大咯血或窒息；完善血常规、凝血功能、痰涂片抗酸染色及尿液分析检查；继续HRZE抗结核方案（异烟肼、利福平、吡嗪酰胺、乙胺丁醇），强化依从性教育；若咯血加重或药物控制不佳，准备转诊至结核专科医院行支气管动脉栓塞术评估；予酚妥拉明10mg加入生理盐水250ml缓慢静脉滴注（血压正常适用）。",
    "patient_dialogue": "别紧张，先慢慢坐下——您咳的血量不算太大，我们会马上给您用药止血，防止它再加重。您先躺好休息，千万别乱动，这样能帮身体更快恢复。另外，您说小便时有点痛，这可能是尿路有点感染，我们会做个简单检查确认一下，别自己乱吃药了。您的肺结核药必须按时吃，不能再漏了，农忙再忙也要抽空服药，不然空洞会变大，病情就容易反复。记住，有什么不舒服立刻告诉我，我们会一直盯着您的状况。"
  },
  {
    "id": 1730,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者近6周出现午后低热（Tmax 38.1℃）、夜间盗汗伴体重下降4kg，干咳无痰，偶有血丝。自诉3年前患肺结核，规律服药半年后停药，未复查。吸烟10年，每天1包。查体：消瘦，右上肺呼吸音减弱，可闻及细湿啰音。胸片示右上肺尖后段不规则浸润影伴空洞形成，直径约2.5cm。痰涂片抗酸染色阳性（3+），GeneXpert MTB/RIF提示结核分枝杆菌阳性且对利福平耐药。患者担心再次治疗失败，询问基层医生下一步如何处理。",
    "reference_rule": {
      "condition": "耐药结核和耐多药结核（对至少包括异烟肼和利福平在内的2种以上药物产生耐药）",
      "action": "1. 强化期包含至少5种有效抗结核药物：包括吡嗪酰胺及4个核心二线抗结核药物（A组1个：氟喹诺酮类如高剂量左氧氟沙星≥750 mg/d、莫西沙星或加替沙星；B组1个：二线注射类药物如阿米卡星、卷曲霉素、卡那霉素或链霉素；C组2个：其他二线核心药物如乙硫异烟胺或丙硫异烟胺、环丝氨酸或特立齐酮、利奈唑胺和氯法齐明）; 2. 如果以上选择不能组成有效方案，加入1种D2组药物（贝达喹啉或德拉马尼），再从D3组选择其他有效药物（对氨基水杨酸、亚胺培南西司他丁、美罗培南、阿莫西林克拉维酸、氨硫脲）; 3. 组成含5种有效抗结核药物的方案",
      "contraindication": null,
      "evidence": "耐药结核和耐多药结核：对至少包括异烟肼和利福平在内的2种以上药物产生耐药的结核为耐多药结核（multi-drug resistance tuberculosis, MDR-TB）。WHO根据药物的有效性和安全性将治疗耐药结核的药物分为A、B、C、D 4组，其中A、B、C组为核心二线药物，D组为非核心的附加药物。A组：氟喹诺酮类，包括高剂量左氧氟沙星（≥750 mg/d）、莫西沙星及加替沙星；B组：二线注射类药物，包括阿米卡星、卷曲霉素、卡那霉素、链霉素；C组：其他二线核心药物，包括乙硫异烟胺（或丙硫异烟胺）、环丝氨酸（或特立齐酮）、利奈唑胺和氯法齐明；D组：可以添加的药物，但不能作为MDR-TB治疗的核心药物，分为3个亚类：D1组包括吡嗪酰胺、乙胺丁醇和高剂量异烟肼；D2组包括贝达喹啉和德拉马尼；D3组包括对氨基水杨酸、亚胺培南西司他丁、美罗培南、阿莫西林克拉维酸、氨硫脲。注：耐药结核治疗的强化期应包含至少5种有效抗结核药物，包括吡嗪酰胺及4个核心二线抗结核药物：A组1个，B组1个，C组2个。如果以上的选择仍不能组成有效方案，可以加入1种D2组药物，再从D3组选择其他有效药物，从而组成含5种有效抗结核药物的方案。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（排除其他危急重症如肺部肿瘤或细菌性肺炎），并基于现有证据给出直接、果断的治疗指令。患者表现为活动性肺结核复发，需优先处理耐药性问题以避免延误治疗。\n\nStep 2: 临床解码 (Clinical Decoding): 患者关键信息包括：午后低热（Tmax 38.1℃）、盗汗、体重下降4kg、干咳带血丝，提示活动性感染；查体示消瘦、右上肺呼吸音减弱和细湿啰音，结合胸片右上肺浸润影伴空洞（直径2.5cm），支持肺结核空洞性病变；痰涂片抗酸染色阳性（3+）和GeneXpert MTB/RIF阳性证实结核分枝杆菌感染，且利福平耐药。病史：3年前肺结核治疗半年后停药未复查，吸烟10年（每天1包），增加复发风险和肺损伤。患者担忧治疗失败，隐式线索包括停药后未复查可能导致耐药积累，吸烟为治疗干扰因素。医学术语总结：复发性肺结核，利福平耐药，高度怀疑耐多药结核（MDR-TB），需进一步确认异烟肼耐药状态；吸烟史为肺功能恶化风险因子。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南condition为'耐药结核和耐多药结核（对至少利福平和异烟肼等2种以上药物耐药）'。患者利福平耐药匹配该条件，虽异烟肼状态未知（GeneXpert仅检测利福平），但利福平耐药高度提示MDR-TB风险，需启动指南action。Contraindication为null，无绝对禁忌。安全检查：吸烟可能加剧药物毒性（如利奈唑胺骨髓抑制），但无直接禁忌；需监测药物副作用（如注射剂耳毒性），确保方案安全优先。\n\nStep 4: 决策生成 (Decision Making): 根据指南action，生成MDR-TB强化期方案：包含吡嗪酰胺及4个核心二线药物。选择A组莫西沙星（高效氟喹诺酮类）、B组阿米卡星（二线注射剂）、C组利奈唑胺和氯法齐明（其他核心药物），组成5种有效药物方案（吡嗪酰胺 + 莫西沙星 + 阿米卡星 + 利奈唑胺 + 氯法齐明）。若后续药敏显示更多耐药，可添加D2组贝达喹啉。辅助决策：安排呼吸道隔离、戒烟干预，并完善异烟肼药敏测试。",
    "medical_order": "诊断：复发性肺结核，利福平耐药，高度怀疑耐多药结核（MDR-TB）。治疗：启动WHO推荐MDR-TB强化期方案，予吡嗪酰胺1500mg qd + 莫西沙星400mg qd + 阿米卡星750mg IM qd + 利奈唑胺600mg q12h + 氯法齐明100mg qd。监测：完善异烟肼等药敏测试、每周评估肝肾功能、听力、血常规及胸部影像。辅助措施：呼吸道隔离、戒烟教育、营养支持。随访：每周复诊评估治疗反应和副作用。",
    "patient_dialogue": "您好，检查结果出来了，您的肺结核又复发了，而且这次的细菌对之前的药物有抵抗力，不能再像上次那样简单用药了。别担心，我们有专门针对这种情况的强效方案：您需要每天吃五种不同的药，包括药片和打针，来彻底清除这些细菌。我会给您详细解释每种药怎么用，可能有哪些不舒服的地方，比如耳朵响或头晕，但这些我们会密切盯着。同时，为了避免传染给家人，您得暂时住隔离病房或戴口罩在家。我知道您上次治疗后停药没复查，这次咱们一定要坚持到底，按时吃药，我会一直帮您。另外，吸烟会让您的肺更糟，影响恢复，我建议您从现在开始戒烟，咱们可以一起想办法。记住，这个方案成功率很高，您不是一个人在战斗。"
  },
  {
    "id": 1741,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者6个月前因“咳嗽3周、低热”初诊，痰涂片阳性（3+），胸片示右上肺空洞，HIV抗体阴性，无合并糖尿病。县定点医院予以2HREZ/4HR标准方案，全程督导服药，第2、5月末痰涂片已转阴。今日为疗程结束第180天复诊，患者自述近1周夜雨降温后略有咳白痰，无血，无发热、盗汗；仍每日吸1包烟，体重较治疗前增加3 kg。查体：T 36.4 ℃，R 18次/分，右上肺偶闻细湿啰音。卫生院仅能做痰涂片，患者晨起未漱口即留取一份合格痰标本，实验室回报：抗酸染色阴性。因患者担心“工地老板催返工”，询问能否开“痊愈证明”立即离乡。门诊医生需根据《肺结核基层诊疗指南（2018年）》判定其治疗结局并决定后续管理。",
    "reference_rule": {
      "condition": "肺结核患者完成治疗后",
      "action": "1. 根据疗效判断标准评估：治愈（痰涂片阳性肺结核患者完成规定疗程，连续2次痰涂片结果阴性，其中1次是治疗末）；完成疗程（痰涂片阴性肺结核患者完成规定的6个月标准疗程，疗程末痰涂片检查结果阴性或未痰检者；痰涂片阳性肺结核患者完成规定的6-12个月疗程，最近一次痰检结果阴性，完成疗程时无痰检结果）；结核死亡（活动性肺结核患者因病变进展或并发咯血、自发性气胸、肺心病、全身衰竭或肺外结核等原因死亡）；非结核死亡（结核病患者因结核病以外的原因死亡）；失败（痰涂片阳性肺结核患者治疗至第6个月末或疗程结束时痰涂片检查仍阳性）；丢失（肺结核患者在治疗过程中中断治疗超过2个月，或由结核病防治机构转出后，虽经医生努力追访，2个月内仍无信息或已在其他地区重新登记）",
      "contraindication": null,
      "evidence": "疗效判断标准如下：(1) 治愈：痰涂片阳性肺结核患者完成规定疗程，连续2次痰涂片结果阴性，其中1次是治疗末；(2) 完成疗程：痰涂片阴性肺结核患者完成规定的6个月标准疗程，疗程末痰涂片检查结果阴性或未痰检者；痰涂片阳性肺结核患者完成规定的6-12个月疗程，最近一次痰检结果阴性，完成疗程时无痰检结果；(3) 结核死亡：活动性肺结核患者因病变进展或并发咯血、自发性气胸、肺心病、全身衰竭或肺外结核等原因死亡；(4) 非结核死亡：结核病患者因结核病以外的原因死亡；(5) 失败：痰涂片阳性肺结核患者治疗至第6个月末或疗程结束时痰涂片检查仍阳性；(6) 丢失：肺结核患者在治疗过程中中断治疗超过2个月，或由结核病防治机构转出后，虽经医生努力追访，2个月内仍无信息或已在其他地区重新登记。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于分级诊疗与随访场景，作为严谨的守门人，我的关注重点是对比患者当前状态与治疗结束达标标准（如痰涂片阴性），并判断是否应维持原状（如常规随访）或触发转诊/升级治疗（如出现可疑症状时）。Step 2: 临床解码 (Clinical Decoding)：患者为初始痰涂片阳性肺结核（3+），已完成6个月标准方案（2HREZ/4HR），全程督导服药，治疗期间第2、5月末痰涂片转阴，提示治疗有效。当前为疗程结束第180天，痰涂片阴性（标本虽未漱口但实验室报告合格），但新发咳白痰1周（可能与降温相关）且查体右上肺细湿啰音，提示潜在肺部异常（如复发或残留病变）；持续吸烟（每日1包）为复发风险因素，体重增加3kg可能反映营养改善。隐式线索包括卫生院资源有限（仅能痰涂片），患者急于返工可能影响依从性。Step 3: 规则对齐与安全检查 (Alignment & Safety)：指南Condition为'肺结核患者完成治疗后'，Action中疗效标准显示患者痰涂片阳性肺结核完成6个月疗程，第5月末及治疗末（今日）痰涂片均阴性，符合'治愈'定义（连续2次阴性，其中1次为治疗末）。Contraindication为null，无禁忌。但安全检查发现症状（咳白痰和啰音）可能表示未完全康复或复发，标本未漱口虽报告合格，仍存在潜在误差风险，需排除并发症以确保安全。Step 4: 决策生成 (Decision Making)：基于指南，技术符合治愈标准，但症状可疑且卫生院无法做进一步检查，触发转诊至上级医院（如县定点医院）行胸片和痰培养以确认是否复发；不开具痊愈证明，建议戒烟和定期随访。",
    "medical_order": "评估患者为肺结核治疗后状态，符合治愈标准（痰涂片连续阴性，包括治疗末）。但新发咳白痰及右上肺细湿啰音可疑复发或残留病变。予戒烟宣教，建议转诊至县定点医院行胸部X线检查及痰培养以排除活动性结核。暂不开具痊愈证明。安排2周后卫生院随访复查痰涂片。",
    "patient_dialogue": "王先生，您好。看了您的检查结果，痰液检测是阴性的，这说明之前的治疗效果不错，是个好消息。不过，您提到最近有点咳嗽，还有白痰，我听诊时肺部也发现一点杂音，这可能是肺部还没完全恢复好，也可能是其他小问题。为了确保万无一失，我建议您去县医院做个胸片检查，这样能看得更清楚，确认是不是真的痊愈了。抽烟对肺部恢复有影响，您尽量少抽或戒烟，这样恢复得更快。我知道老板催您返工，但身体是根本，等检查没问题了，我们立刻开证明让您安心回去。别担心，这是常规流程，咱们稳当点来，好吗？"
  },
  {
    "id": 1751,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "case_input": "患者29岁，女性，电子厂质检员，因“咳嗽伴活动后喘促3月余”今日复诊。3个月前在外院诊为“肺结核”，HRZE四联抗结核治疗至今，但近2周出现上楼即喘、夜间阵发性呼吸困难。既往体健，无慢病史。查体：T 37.2 ℃，HR 112 次/分，R 28 次/分，SpO₂ 90%（室内空气），右肺中部及下部呼吸音明显减弱，可闻及散在哮鸣音。实验室：WBC 7.8×10⁹/L，CRP 28 mg/L，ESR 55 mm/h；痰涂片抗酸杆菌阳性（2+）。胸片：右肺门上移，右中下肺体积缩小，纹理聚拢；胸部高分辨率CT示右中间支气管及右下叶支气管管壁增厚、管腔重度狭窄（约3 mm），远端肺组织膨胀不全。血气分析（未吸氧）：PaO₂ 56 mmHg，PaCO₂ 48 mmHg，pH 7.34。患者自述近1周需半卧位入睡，说话断续，不能完成日常流水线作业。今日由社区医生陪同转诊至本院结核专科门诊，随身携带的抗结核药物记录显示规律服药，无漏服。门诊候诊区室温32 ℃，患者仍感畏寒，手持塑料风扇持续吹面。",
    "reference_rule": {
      "condition": "气管支气管结核导致叶及叶以上支气管明显狭窄，影响呼吸功能或导致呼吸衰竭",
      "action": "1. 在全身抗结核化学治疗基础上; 2. 同时给予冷冻、球囊扩张等气道介入治疗",
      "contraindication": null,
      "evidence": "气管支气管结核所致气道狭窄：气管支气管结核导致叶及叶以上支气管明显狭窄时常影响患者呼吸功能，严重者有呼吸衰竭，需在全身抗结核化学治疗基础上，同时给予冷冻、球囊扩张等气道介入治疗。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于复杂合并症治疗场景，患者患有肺结核（活动性感染）合并气管支气管结核导致的重度气道狭窄和呼吸衰竭。作为专科专家，我将重点关注全网扫描药物相互作用、禁忌症及共病风险，优先确保患者安全（安全 > 疗效），包括评估现有抗结核治疗的有效性、介入治疗的潜在风险，以及急性呼吸衰竭的管理。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例中提取关键信息：患者为29岁女性，肺结核抗结核治疗（HRZE方案）3个月，近期恶化提示治疗失败或并发症。关键医学术语：活动性肺结核（痰涂片抗酸杆菌阳性2+）、气管支气管结核（CT显示右中间及右下叶支气管重度狭窄约3mm）、II型呼吸衰竭（血气分析PaO₂ 56 mmHg、PaCO₂ 48 mmHg、pH 7.34，提示高碳酸血症和酸中毒）、肺膨胀不全（影像学证据）。隐式线索包括：规律服药但症状进展（上楼喘促、夜间阵发性呼吸困难、需半卧位入睡），可能因气道狭窄导致通气障碍；畏寒（尽管高温环境，提示炎症或感染未控）；活动耐力下降（不能工作），显示功能状态恶化；实验室炎症指标（CRP 28 mg/L、ESR 55 mm/h）支持活动性结核或继发感染风险。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南条件“气管支气管结核导致叶及叶以上支气管明显狭窄，影响呼吸功能或导致呼吸衰竭”完全匹配患者情况（CT证实狭窄、血气分析示呼吸衰竭）。行动建议为“在全身抗结核化学治疗基础上；同时给予冷冻、球囊扩张等气道介入治疗”。禁忌症为null，但强制安全检查：\n- 药物相互作用：HRZE方案（异烟肼、利福平、吡嗪酰胺、乙胺丁醇）无其他药物提及，但介入治疗需注意麻醉或镇静剂潜在肝毒性（利福平诱导肝酶）。\n- 禁忌症：介入治疗禁忌包括严重心肺功能不全（患者当前呼吸衰竭，需先稳定）、出血倾向（WBC正常，无凝血异常提示）。\n- 共病风险：患者既往体健，但急性呼吸衰竭优先处理；需警惕结核播散或继发感染（畏寒、低热T 37.2°C）。安全优先级：先纠正呼吸衰竭，再计划介入，避免操作中缺氧加重风险。\n\n**Step 4: 决策生成 (Decision Making)**\n根据指南行动，决策为：在继续全身抗结核治疗（HRZE）基础上，立即启动气道介入治疗（如球囊扩张），但需优先稳定呼吸状态。具体：安排住院，予氧疗支持，完善支气管镜检查后行介入治疗，同时监测安全参数。\n\n**Overall Reasoning Chain**: 患者气道狭窄已致呼吸衰竭，介入治疗是核心，但安全第一。优先氧疗改善缺氧，再行介入；继续抗结核治疗；无禁忌症，但需谨慎执行。",
    "medical_order": "1. 立即入院，一级护理，持续监测生命体征（心率、呼吸、SpO₂）、血气分析。\n2. 继续HRZE抗结核治疗（异烟肼、利福平、吡嗪酰胺、乙胺丁醇），确保规律服药。\n3. 予面罩吸氧，目标SpO₂ >92%，根据血气调整氧流量；必要时考虑无创通气支持。\n4. 完善急诊支气管镜检查，评估气道狭窄程度及粘膜状况。\n5. 请呼吸介入科会诊，拟行球囊扩张术（优先）或冷冻治疗，术前评估心肺功能。\n6. 监测肝肾功能、血常规、电解质，警惕药物性肝损伤；复查痰涂片及培养。\n7. 予半卧位体位管理，避免平卧加重呼吸困难。",
    "patient_dialogue": "张女士，您好！我看您呼吸很费力，上楼都喘，晚上也睡不好觉，这确实让人着急。检查结果显示，您的气管因为结核病变得很窄了，像水管堵住一样，这让氧气进不去，二氧化碳出不来，所以您会感觉憋气、说话断断续续的。我们现在得马上帮您解决这个问题——首先，让您住院观察，我们会给您吸氧，就像给您戴个面罩帮助呼吸，这样您会舒服些。接着，我们需要做个检查，用一根细管子从鼻子进去看看气管的情况（这叫支气管镜），如果可能的话，我们会用个小气球把狭窄的地方撑开，这样呼吸就能顺畅多了。别担心，这手术风险不大，我们会全程盯着您的安全。同时，您得继续按时吃结核药，这是治根儿的，千万别停。我知道您还觉得冷，这是身体在发炎的反应，我们会一起处理。您现在最要紧的是放松，配合我们，很快就能好转的！"
  }
]