[
  {
    "id": 285,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "患者，女，72岁，退休小学教师，因‘腰背痛半年、加重伴翻身困难1周’由女儿陪同前来骨质疏松专病门诊。半年内身高自觉‘矮了3 cm’，晨起穿袜需人辅助。无外伤史，但3月前曾在浴室滑坐跌倒，尾骨淤青，未拍片。既往高血压10年（氨氯地平5 mg qd，BP控制130/80 mmHg），否认糖尿病、甲亢及风湿病史；50岁绝经，未行激素替代。母亲80岁髋部骨折史。日常饮奶少（约100 ml/日），日晒不足（每日户外＜10 min），口味清淡，不抽烟不喝酒。查体：BMI 19.2 kg/m²，胸椎T11–L2轻压痛，脊柱前屈轻度受限，指地距18 cm，平衡试验可单脚站5 s。门诊便携超声跟骨T-score −2.9。今日空腹血Ca 2.28 mmol/L（正常），P 1.12 mmol/L，ALP 78 U/L，25-OH-D 18 ng/mL，Cr 72 µmol/L，eGFR 75 ml/min；血常规、甲功正常。DXA预约排队中，预计一周后完成。患者同时抱怨近两天因降温出现双侧膝部酸胀，但无红肿。女儿担心再次跌倒，急切询问是否立即需要打针吃药。",
    "reference_rule": {
      "condition": "老年性骨质疏松症患者",
      "action": "1. 西医辨病，中医辨证，病证结合：先结合患者骨质疏松及骨折风险评估、临床症状及辅助检查结果明确西医诊断，在此基础上进行分证论治；2. 针对重点，中西结合，突出优势：西医在改善骨密度、降低骨折发生率方面优势突出，中医在缓解疼痛，促进骨折愈合及改善患者症状方面效果更好；对于骨量减少患者：若症状及中医证候不明显者，在干预生活方式的基础上使用西医基础治疗（钙及维生素 D）；若症状或（和）中医证候明显者，在正确辨证的前提下增加中医治疗",
      "contraindication": null,
      "evidence": "中西医结合治疗老年性骨质疏松症患者，应先结合患者骨质疏松及骨折风险评估、临床症状及辅助检查结果明确西医诊断，在此基础上，谨守“西医辨病，中医辨证，病证结合”的原则，进行分证论治。中西医结合治疗的目的在于取长补短，优势互补。西医在改善骨密度、降低骨折发生率方面优势突出，而中医在缓解疼痛，促进骨折愈合及改善患者症状方面效果更好，中西医结合治疗在增强疗效的同时，能够弥补各疗法的薄弱方面。对于骨量减少患者，若症状及中医证候不明显者，可在干预生活方式的基础上使用西医基础治疗（钙及维生素 D）；若症状或（和）中医证候明显者，则应在正确辨证的前提下增加中医治疗。"
    },
    "thought": "本案例属于常规诊断与治疗场景。作为果断的门诊医生，我的关注重点是快速建立鉴别诊断（排除急性骨折或感染等危急重症），并基于现有证据给出直接的治疗指令。Step 1: 场景定义 – 患者以慢性腰背痛主诉就诊，无急症体征（如无外伤史、无红肿、生命体征稳定），属常规门诊管理范畴，需优先处理疼痛和跌倒风险。Step 2: 临床解码 – 关键医学术语转化：患者为72岁绝经后女性，具骨质疏松高危因素（低BMI 19.2 kg/m²、维生素D缺乏18 ng/mL、日晒不足、家族骨折史）；症状提示椎体压缩性骨折风险（身高缩短3 cm、翻身困难、胸椎压痛）；跟骨T-score -2.9表明骨量减少；膝部酸胀可能与骨关节炎或骨质疏松相关（需排除风湿病，但甲功正常）；隐式线索包括跌倒高风险（平衡试验单脚仅5秒）、生活功能受限（穿袜需辅助），需警惕未诊断的椎体骨折（3月前跌倒未拍片）。Step 3: 规则对齐与安全检查 – 指南Condition为‘老年性骨质疏松症患者’，患者符合骨量减少标准（T-score -2.9）且症状明显（疼痛、功能受限），需应用Action：西医基础治疗（钙和维生素D）加中医辨证论治。Contraindication为null，安全检查通过：无药物冲突（氨氯地平与钙/维生素D无交互）、eGFR 75 ml/min正常（维生素D补充安全），排除急症（无发热、红肿或神经症状）。Step 4: 决策生成 – 依据指南，立即启动西医基础治疗（补钙和维生素D），因症状明显增加中医辨证；同时强化生活方式干预和跌倒预防；待DXA结果后评估是否升级抗骨质疏松药物。",
    "medical_order": "1. 诊断：老年性骨质疏松症（骨量减少期），维生素D缺乏症。2. 治疗：予碳酸钙D3片（含钙500 mg + 维生素D 200 IU）口服，每日一次；补充维生素D3 800 IU/日口服。3. 中医会诊：建议中医科辨证论治（考虑肾虚血瘀证），予中药汤剂或中成药。4. 生活干预：指导高钙饮食（每日饮奶≥300 ml）、增加日晒（每日户外活动≥30分钟）、居家防跌倒措施（安装扶手、穿防滑鞋）。5. 随访：完善胸腰椎X线或MRI（排除隐匿性骨折），等待DXA结果后复诊；若疼痛加重或新发跌倒，急诊评估。",
    "patient_dialogue": "阿姨您好，听了您的描述，我理解您这半年腰背疼得厉害，最近翻身都困难，还担心再跌倒，咱们女儿也着急。别担心，咱们一步步来。首先，检查显示您骨头有点‘疏松’，就像房子久了砖头变脆，主要是因为年纪大了，加上平常喝奶少、晒太阳不足，维生素D不够。这会让骨头变弱，容易疼或骨折——就像您3个月前那次摔倒。所以，我给您开点钙片和维生素D药，每天吃一次，帮骨头‘补钙加固’。另外，您说膝盖这两天酸胀，可能和天气凉有关，咱们先观察，如果肿了或更疼了随时告诉我。其次，为了减轻疼痛和防止再跌倒，我建议您：一是多喝牛奶、吃豆制品，骨头汤也行；二是每天抽半小时出门散步晒太阳，促进钙吸收；三是家里厕所、床边装上扶手，穿防滑鞋，别让女儿太操心。最后，下周骨密度检查出来，咱们再看要不要加其他药。中医那边我也推荐去一下，他们能用中药帮您缓解疼痛、强筋壮骨。记住，这些措施都是为了保护您，减少摔倒风险，让您生活更轻松。如果有任何不舒服，马上给我打电话！"
  },
  {
    "id": 275,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "78岁女性，身高152 cm，体重42 kg。主诉近半年腰背部酸胀加重，夜间翻身痛醒，行走200米即需停下休息。无外伤史。既往高血压15年，血压控制可；2型糖尿病10年，HbA1c 6.8%。已绝经28年。查体：驼背明显，胸腰段压痛（+），双下肢肌力4级。今日骨密度（DXA）：L1-L4 T值 -3.2，左髋T值 -2.7；血Ca 2.3 mmol/L、P 1.1 mmol/L、ALP 110 U/L，25-OH-VD 18 ng/mL，PTH 68 pg/mL，Cr 78 μmol/L。舌淡偏暗、苔薄白，脉沉细。患者自诉平日怕热、口干，夜间小腿抽筋，偶有头晕。今晨空腹，准备抽血复查后开药。",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为肝肾不足证者",
      "action": "1. 治法：补肝益肾；2. 推荐方剂：六味地黄汤（药物组成为熟地，山茱萸肉，丹皮，泽泻，山药，茯苓）或壮骨止痛胶囊联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为肝肾不足证者，推荐选用六味地黄汤（《小儿药证直诀》）（证据水平 B，推荐等级：弱推荐），药物组成为熟地，山茱萸肉，丹皮，泽泻，山药，茯苓；或壮骨止痛胶囊（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗。"
    },
    "thought": "本案例属于常规诊断与治疗场景，重点关注快速建立鉴别诊断以排除危急重症（如急性骨折或恶性肿瘤），并给出直接治疗指令。Step 2: 临床解码：患者为78岁老年女性，骨密度显著降低（L1-L4 T值 -3.2，左髋T值 -2.7，符合骨质疏松症诊断标准）；维生素D缺乏（25-OH-VD 18 ng/mL <30 ng/mL）伴PTH轻度升高（68 pg/mL），提示继发性甲状旁腺功能亢进；症状包括腰背痛、夜间痛醒、行走受限、肌力下降（双下肢4级），结合舌淡偏暗、脉沉细及怕热口干等表现，中医辨证为肝肾不足证；隐式线索包括低体重（BMI≈18.17 kg/m²）、绝经后状态及慢性病（高血压、糖尿病控制尚可），增加骨折风险。Step 3: 规则对齐与安全检查：指南针对‘老年性骨质疏松症中医辨证为肝肾不足证者’，患者完全匹配；无禁忌症（contraindication null）; 安全：肾功能正常（Cr 78 μmol/L），无药物相互作用风险（抗骨质疏松药与当前降压/降糖药无冲突）。Step 4: 决策生成：基于指南Action，直接推荐补肝益肾中药联合标准抗骨质疏松药物治疗，优先选择六味地黄汤或壮骨止痛胶囊，并加用钙剂、维生素D及双膦酸盐以降低骨折风险。",
    "medical_order": "诊断：老年性骨质疏松症（肝肾不足证）。治疗计划：1. 中药治疗：予六味地黄汤（熟地15g、山茱萸肉10g、丹皮10g、泽泻10g、山药15g、茯苓15g）每日一剂，水煎分两次服；或壮骨止痛胶囊0.5g tid po。2. 抗骨质疏松药物：予碳酸钙500mg tid po，骨化三醇0.25μg qd po；加用阿仑膦酸钠70mg po qw（服药后30分钟内保持直立，避免躺卧）。3. 生活方式干预：避免负重及跌倒风险，增加日晒（每日15-20分钟）。4. 监测：3个月后复查骨密度、血钙磷、25-OH-VD、PTH及肾功能；HbA1c及血压按原方案控制。",
    "patient_dialogue": "老太太，您好！从检查结果看，您的背痛和腿抽筋主要是因为骨头变脆弱了，这叫骨质疏松症。这和您年纪大了、肝肾有点虚有关，别担心，咱们有办法。我会给您开些中药，比如六味地黄汤，它能补肝肾、强筋骨；再加点西药，像钙片和维生素D，帮您把骨头补结实些，另外每周吃一次预防骨折的药。平时啊，走路要小心点，避免摔跤，多吃点牛奶、鸡蛋这些营养食物，每天晒会儿太阳——就像散步时在阳台站一站，这样骨头吸收钙更好。坚持下来，您的背痛和抽筋就能慢慢好转。要是吃药时有啥不舒服，随时跟我说！"
  },
  {
    "id": 271,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "患者由女儿陪同坐轮椅进入诊室，主诉‘腰像断了一样疼，夜里翻不了身’。既往确诊重度老年性骨质疏松症（T值-3.4，L2椎体新发压缩性骨折）。今日复诊，女儿抢先抱怨：‘老太太就是不听劝，每顿咸菜就半碗，说嘴里没味；红烧肉一顿能吃三大块，牛奶嫌腥碰都不碰。’患者本人插话：‘医生，我一辈子口味重，少盐吃不下。’追问运动史，女儿摇头：‘天晴也懒得下楼，说怕晒黑，最多屋里挪两步。’查体可见上臂皮肤菲薄、皮下淤斑，驼背明显。患者小声补充：‘对了，我晚上还得来一小杯白酒才睡得着，大概二两。’今日天气阴，室外紫外线指数3，患者戴宽檐帽、穿长袖外套就诊。",
    "reference_rule": {
      "condition": "老年性骨质疏松症患者",
      "action": "1. 饮食控制：摄入富含钙、低盐和适量蛋白质的均衡膳食；保证充足的日照，以促进体内维生素 D 的合成，但要根据季节等因素避免强烈的日光照射，以防晒伤；2. 运动：进行规律的运动，包括负重运动及抗阻运动，如重量训练、行走、慢跑等；建议每周至少进行 150~300 min 中等强度运动，或者每周 85~150 min 高强度有氧运动；运动应循序渐进、持之以恒，跌倒风险高的患者应在医师或康复治疗师等专业指导下进行；3. 生活习惯：改变不良的生活习惯，包括饮酒、吸烟等；尽量避免或少用影响骨代谢的药物",
      "contraindication": null,
      "evidence": "1.  饮食控制： 加强营养，均衡膳食，建议摄入富含钙、低盐和适量蛋白质的均衡膳食。保证充足的日照，以促进体内维生素 D 的合成，但要根据季节等因素避免强烈的日光照射，以防晒伤。（证据水平 A，推荐等级：强推荐）2.  运动： 进行规律的运动，运动可改善机体敏捷性、力量、姿势及平衡等，减少跌倒风险，运动还有助于增加骨密度，适合于老年性骨质疏松症患者的运动包括负重运动及抗阻运动，推荐规律的负重及肌肉力量练习，以减少跌倒和骨折风险，包括重量训练、行走、慢跑等。运动应循序渐进、持之以恒，跌倒风险高的患者应在医师或康复治疗师等专业指导下进行，建议每周至少进行 150~300 min 中等强度运动，或者每周 85~150 min 高强度有氧运动。（证据水平 B，推荐等级：强推荐）3.  生活习惯： 改变不良的生活习惯，包括饮酒、吸烟等，尽量避免或少用影响骨代谢的药物。（证据水平 D，推荐等级：弱推荐）"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于生活方式与风险干预场景，关注重点为识别患者隐式的不良生活习惯（如高盐饮食、运动缺乏和酒精摄入），并关联长期风险（如骨折风险增加、骨密度进一步恶化），以循证方式提出非药物干预建议。Step 2: 临床解码 (Clinical Decoding): 患者为老年女性，诊断为重度老年性骨质疏松症（T值-3.4）伴L2椎体新发压缩性骨折，主诉严重腰疼和活动受限；隐式线索包括营养失衡（高钠、低钙、高脂饮食，表现为咸菜和红烧肉偏好、拒绝牛奶）、运动缺乏（户外活动不足，仅室内轻微活动）、不良习惯（每晚饮酒二两）；查体显示皮肤菲薄、皮下淤斑和驼背，提示营养不良和跌倒高风险；环境因素（阴天，紫外线指数3）加剧维生素D缺乏风险。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition '老年性骨质疏松症患者'与病例高度匹配；Contraindication为null，无直接安全禁忌，但需注意跌倒风险和饮酒对骨代谢的潜在危害；行动需优先对齐证据A级的饮食和运动干预（低盐、高钙、适量蛋白质、规律负重运动）及证据D级的生活习惯调整（戒酒）。Step 4: 决策生成 (Decision Making): 基于指南Action，生成具体决策：强化饮食管理（低盐、高钙膳食），制定运动计划（适度户外活动结合室内训练），戒酒建议，并教育患者风险以提升依从性。",
    "medical_order": "诊断：重度老年性骨质疏松症（T值-3.4），L2椎体压缩性骨折。干预：1. 饮食调整：予低盐饮食（每日钠摄入<2g），增加钙和维生素D摄入（如每日500ml牛奶或钙剂1000mg/d，维生素D3 800IU/d），限高脂食物。2. 运动处方：起始每日户外散步20-30分钟（利用UV指数<5时段），渐增至每周150min中等强度负重运动（如行走）；跌倒高风险下，转介康复科指导抗阻训练。3. 生活习惯干预：戒酒（避免乙醇摄入）；监测营养状态（血清钙、维生素D水平）。4. 随访：4周后复诊评估疼痛和依从性，必要时加用抗骨质疏松药物。",
    "patient_dialogue": "阿姨，您女儿刚才提到您爱吃咸菜和红烧肉、不爱喝牛奶，还每天喝点酒，我理解您习惯这样口味重的饮食，但咱们得为您的骨头健康着想啊。您这腰疼和翻身困难，就是因为骨质疏松严重，再这样下去，骨头会越来越脆，容易再骨折。咱得一步步调整：第一，做菜少放盐，咸菜少吃点，换成新鲜蔬菜；红烧肉可以偶尔吃一小块，但牛奶不腥的，试试加点蜂蜜温着喝，补钙让骨头结实。第二，天气好时下楼走走，晒晒太阳（戴帽子就行），能强健骨骼；先从每天10分钟开始，慢慢加时间。第三，那杯小酒最好别喝了，酒会让骨头更脆弱，影响睡眠质量。您女儿也在这儿，咱们一起帮您坚持，好吗？这样您就能少疼点，活动更自如了。"
  },
  {
    "id": 283,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "今日门诊，78岁王奶奶由孙女搀扶步入诊室，弯腰驼背明显。主诉近半年晨起腰背酸痛，活动后稍缓，久坐起立需扶墙，夜尿3-4次，偶发足底抽筋。无外伤史，但上周搬花盆时自觉‘闪了腰’。查体：身高较年轻时缩短6 cm，T11-L1轻叩痛(+)，舌偏红少津、裂纹可见，脉细数。DXA示腰椎L1-L4 T值-2.9，左髋-2.6；血Ca 2.3 mmol·L⁻¹、P 1.0 mmol·L⁻¹，ALP 110 U·L⁻¹，25(OH)D₃ 18 ng·mL⁻¹，PTH 68 pg·mL⁻¹，eGFR 58 mL·min⁻¹，尿Ca 215 mg/24 h。既往高血压15年，近3年服用缬沙坦80 mg qd，BP控制于135/78 mmHg；无DM、无脆性骨折史。平日饮食清淡但奶制品摄入少，每天户外散步不足10分钟。今日天气阴冷，她进门时抱怨‘腰像灌了冷风’。",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为肝肾阴虚证者",
      "action": "1. 治法：滋补肝肾，填精壮骨；2. 推荐方剂：左归饮或左归丸（药物组成为熟地、山药、枸杞、炙甘草、茯苓、山茱萸）或金天格胶囊联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为肝肾阴虚证者，推荐选用左归饮（《景岳全书》）；或左归丸（证据水平 C，推荐等级：弱推荐），药物组成为熟地、山药、枸杞、炙甘草、茯苓、山茱萸；或金天格胶囊（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，作为果断的门诊医生，我的关注重点是快速建立鉴别诊断以排除危急重症（如急性骨折、肾衰竭或严重电解质紊乱），并基于现有信息给出直接的治疗指令。患者的主诉和检查结果无急危提示（如无外伤相关骨折、生命体征稳定），因此聚焦于核心问题的诊断与干预。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：患者78岁女性，表现为慢性腰背酸痛（活动后缓解，久坐起立困难）、身高缩短6 cm（提示椎体压缩），伴夜尿增多和足底抽筋（肌肉痉挛）。查体T11-L1叩痛(+)结合DXA（腰椎T值-2.9，左髋-2.6）确诊骨质疏松症；实验室异常包括低血钙（2.3 mmol·L⁻¹）、低血磷（1.0 mmol·L⁻¹）、低25(OH)D₃（18 ng·mL⁻¹，维生素D不足）、高PTH（68 pg·mL⁻¹，提示继发性甲状旁腺功能亢进）、高尿钙（215 mg/24 h）和肾功能减退（eGFR 58 mL·min⁻¹，CKD stage 3a）。舌象（偏红少津、裂纹）和脉象（细数）符合中医肝肾阴虚证。隐式线索包括生活方式不良（奶制品摄入少、户外活动不足）和高血压控制稳定（BP 135/78 mmHg），但高尿钙和肾功能不全需警惕药物安全风险。整体解码为原发性骨质疏松伴维生素D缺乏和继发性甲状旁腺功能亢进，排除其他病因（如骨软化症或恶性疾病）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition为“老年性骨质疏松症中医辨证为肝肾阴虚证者”，与病例高度匹配（基于骨密度、症状及中医体征）。指南action推荐滋补肝肾中药联合抗骨质疏松治疗，contraindication为null，但强制安全检查：患者eGFR 58 mL·min⁻¹（CKD stage 3a）和高尿钙可能增加肾损伤风险，需避免高剂量钙剂；高血压药物缬沙坦无相互作用。无绝对禁忌，但需优先安全策略（如选择肾安全药物）。\n\nStep 4: 决策生成 (Decision Making) - 根据指南action（滋补肝肾、填精壮骨，联合抗骨质疏松治疗），决策包括：使用左归饮或金天格胶囊（中医治疗），同时启动标准抗骨质疏松方案（补充维生素D和钙，选择双膦酸盐类，但调整剂量）；结合患者情况，补充生活方式干预和监测计划，确保安全优先。",
    "medical_order": "诊断：老年性骨质疏松症（肝肾阴虚证）、维生素D缺乏症、继发性甲状旁腺功能亢进、慢性肾病stage 3a。治疗：1. 中药：予左归饮（熟地、山药、枸杞、炙甘草、茯苓、山茱萸）每日一剂口服，或金天格胶囊0.6g tid口服。2. 补充治疗：予骨化三醇0.25μg qd口服（纠正维生素D不足），碳酸钙500mg qd口服（监测尿钙，避免高钙风险）。3. 抗骨质疏松药物：予阿仑膦酸钠70mg qw口服（eGFR>35适用，注意空腹服用）；如耐受不佳，考虑转诊评估特立帕肽。4. 基础疾病管理：继续缬沙坦80mg qd控制高血压。5. 生活方式：予高钙饮食教育（增加奶制品摄入），每日户外活动≥15分钟。6. 监测：完善血钙、磷、PTH、25(OH)D₃、尿钙及肾功能复查于1月后；DXA随访6-12月。7. 教育：预防跌倒指导。",
    "patient_dialogue": "王奶奶，您孙女带您来真是太好了！听您说腰背酸痛半年了，早上起来特别难受，活动一下就好些，但坐久了站起来还得扶墙，晚上还常抽筋、起夜好几次，这都说明您的骨头有点变脆了，咱们叫骨质疏松。检查结果也显示，您身体里缺维生素D和钙，这会让骨头更弱，容易疼。别担心，这不是大问题，咱们一起调养就能改善。\n\n我给您开点中药调养一下身体，帮助骨头强壮起来，像炖汤用的药材一样温和。另外，还要吃点维生素D和钙片来补补营养，但我会选安全的量，免得您肾不舒服。您的高血压药继续吃，控制得很好！\n\n平时生活中啊，您得多喝点牛奶或酸奶，做菜少放盐，咸菜也别碰——这能保护骨头和血压。每天出去晒晒太阳，10到15分钟就行，不用太久，就像散步那样轻松。天气冷时，腰不舒服是正常的，穿暖点就好。\n\n咱们一个月后回来复查一下血，看看效果。您孙女在家多帮您看着点，别搬重东西，防跌倒。坚持一下，慢慢就会好起来的，好吗？"
  },
  {
    "id": 280,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "患者因‘腰背酸痛半年，加重伴夜间翻身困难1周’前来就诊。自述半年前起出现持续性钝痛，劳累及久站后明显，近1周夜间翻身痛醒，需手扶床栏方能坐起。无外伤史，否认发热、体重下降。日常饮食偏咸，喜腌菜，每日盐摄入量约10 g；晨起习惯喝浓茶，牛奶摄入不足。50岁绝经，既往无激素替代史。查体：身高155 cm，体重48 kg，BMI 20.0 kg/m²；胸椎T11～L2棘突压痛（+），直腿抬高试验（-），双下肢肌力Ⅴ级，病理征未引出。上臂围26 cm，护士测量血压时标准袖带可正常包裹。今日门诊DXA示：腰椎L1-L4 T值 -2.9，左髋T值 -2.6；血常规、肝肾功能正常，血清钙2.28 mmol/L，磷1.12 mmol/L，ALP 98 U/L；25-OH-D 18 ng/mL。患者神情焦虑，反复询问‘是不是骨头空了？会不会瘫？’，同时抱怨最近天气潮湿，膝关节也隐隐作痛。",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为肾虚血瘀证者",
      "action": "1. 治法：补肾强骨、活血化瘀；2. 推荐方剂：补肾活血汤（药物组成为熟地、破故纸、菟丝子、杜仲、枸杞、归尾、山萸肉、苁蓉、没药、独活、红花）或仙灵骨葆胶囊或骨疏康颗粒（胶囊）联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为肾虚血瘀证者，推荐选用补肾活血汤（《伤科大成》）（证据水平 C，推荐等级：弱推荐），药物组成为熟地、破故纸、菟丝子、杜仲、枸杞、归尾、山萸肉、苁蓉、没药、独活、红花；或仙灵骨葆胶囊（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗；或骨疏康颗粒（胶囊）（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规诊断与治疗场景，需快速排除骨折/恶性肿瘤等危急情况，聚焦骨质疏松症治疗。重点：鉴别诊断、指南依从性及患者焦虑管理。\nStep 2: 临床解码 - 关键信息：①绝经后女性（高危人群）②DXA证实骨质疏松（腰椎T-2.9，髋T-2.6）③维生素D缺乏（18 ng/mL）④典型肾虚血瘀证表现（固定性腰背痛、夜间加重）⑤生活方式危险因素（高盐、低钙摄入）⑥排除红旗征象（无发热/体重下降/神经损害）。\nStep 3: 规则对齐 - 患者完全匹配指南条件（老年性骨质疏松症+肾虚血瘀证），无禁忌证（肝肾功能正常）。需注意：维生素D缺乏需同步纠正。\nStep 4: 决策生成 - 按指南采取中西医结合方案：基础抗骨松药物+补肾活血类中药，同步强化生活方式干预。",
    "medical_order": "1. 诊断：重度骨质疏松症（T值≤-2.5），维生素D缺乏。\n2. 药物治疗：\n   - 抗骨松基础治疗：阿仑膦酸钠70mg每周一次口服 + 碳酸钙D3片500mg bid + 骨化三醇0.25μg qd\n   - 中药：骨疏康颗粒12g bid（补肾活血化瘀）\n3. 生活方式干预：\n   - 限盐饮食（<5g/日）\n   - 增加牛奶/豆制品摄入（≥300ml/日牛奶）\n   - 每日日光暴露15-30分钟（10:00-15:00）\n   - 停饮浓茶，改淡茶或白水\n4. 随访：3个月复查25-OH-D及钙磷，12个月复查DXA。\n5. 教育：发放防跌倒手册，教授翻身起身技巧。",
    "patient_dialogue": "大姐，您这腰背疼的原因咱们查清楚了，主要是骨质疏松引起的——简单说就是骨头密度变低了，但您别担心，这就像房子墙体有点空，咱们好好修补就结实了！\n\n治疗分三部分：\n第一，给您开两种药片：一个是每周吃一次的‘护骨药’，专门阻止骨头里的钙流失；另一个是每天补钙和维生素D的药片，就像给墙补水泥。\n\n第二，配合这个中成药冲剂（展示骨疏康），一天冲服两次，这是中医专门针对您这种腰痛的方子，能强健筋骨、疏通淤堵。\n\n第三，生活习惯要调整：\n- 做菜少放盐，咸菜腌货暂时别碰了，盐吃多了钙就留不住\n- 每天喝杯牛奶或豆浆，早晚各晒15分钟太阳（避开大中午）\n- 浓茶改成淡茶，不然影响钙吸收\n\n您担心的瘫痪风险非常低，咱们及时治疗就能避免。晚上翻身疼的话，我教您个技巧：翻身前先把腿弯起来，用手撑着慢慢转。下次复查咱们看骨头改善情况，您放宽心配合治疗就好！"
  },
  {
    "id": 264,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "患者68岁，退休教师，身高155 cm，体重48 kg。今日由女儿搀扶步入诊室，主诉‘弯腰晾衣服时突然腰背剧痛，休息两天不缓解’。追问病史：5年前绝经，平日每天喝淡茶两大壶，牛奶偶尔喝，日晒不足；否认长期激素服用史。查体：驼背明显，胸腰段棘突压痛（+），骨盆挤压试验（-）。外院急诊X线报告‘T12椎体压缩性改变’。今日门诊天气阴沉，患者抱怨‘最近雨天多，腰腿更酸’。拟进一步评估骨量并明确病因。",
    "reference_rule": {
      "condition": "在 ≥ 65 岁女性和 ≥ 70 岁男性前提下",
      "action": "1. 基于 DXA 测量结果诊断：骨密度值低于同性别、同种族健康成人的骨峰值 1 个标准差及以内属正常；降低 1~2.5 个标准差为骨量低下（或低骨量）；降低等于和超过 2.5 个标准差为骨质疏松；骨密度降低程度符合骨质疏松诊断标准，同时伴有一处或多处脆性骨折为严重骨质疏松；2. 基于脆性骨折的诊断：当患者出现髋部或椎体的脆性骨折，不依赖于骨密度测定，临床上即可诊断骨质疏松症；而患者为肱骨近端、骨盆或前臂远端发生的脆性骨折，即使骨密度测定显示低骨量（-2.5 < T-值 < -1.0），也可诊断骨质疏松症",
      "contraindication": null,
      "evidence": "在 ≥ 65 岁女性和 ≥ 70 岁男性前提下：1.  基于 DXA 测量结果诊断： 骨密度值低于同性别、同种族健康成人的骨峰值 1 个标准差及以内属正常；降低 1~2.5 个标准差为骨量低下（或低骨量）；降低等于和超过 2.5 个标准差为骨质疏松；骨密度降低程度符合骨质疏松诊断标准，同时伴有一处或多处脆性骨折为严重骨质疏松。2.  基于脆性骨折的诊断： 脆性骨折是指受到轻微创伤或日常活动中即发生的骨折。当患者出现髋部或椎体的脆性骨折，不依赖于骨密度测定，临床上即可诊断骨质疏松症；而患者为肱骨近端、骨盆或前臂远端发生的脆性骨折，即使骨密度测定显示低骨量（-2.5 < T-值 < -1.0），也可诊断骨质疏松症。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（包括排除危急重症如骨折并发症、脊髓损伤或感染），并基于直接证据给出高效的诊疗指令，确保患者安全。\nStep 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者为68岁绝经后女性（高危人群），主诉轻微创伤（弯腰晾衣服）后突发腰背剧痛，休息无缓解；查体驼背明显、T12椎体压痛阳性，外院X线示T12椎体压缩性改变，符合脆性骨折定义。隐式线索：日晒不足、高茶饮（可能干扰钙吸收）、低钙摄入（牛奶偶尔喝）和绝经状态，均指向骨质疏松风险；骨盆挤压试验阴性帮助排除部分骨折并发症；天气抱怨提示疼痛敏感性，但不影响核心诊断。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition（≥65岁女性）完全匹配患者年龄；Action明确指出椎体脆性骨折可直接诊断骨质疏松症，无需依赖DXA骨密度测定。Contraindication为null，无禁忌；安全检查：患者无神经症状（如肢体麻木或无力），排除急性危急重症，但需进一步评估骨量以指导治疗。\nStep 4: 决策生成 (Decision Making) - 基于指南Action，可直接诊断骨质疏松症（伴T12椎体脆性骨折）；决策包括：1) 完善DXA和实验室检查以量化骨密度和营养状态；2) 启动标准治疗（钙剂、维生素D补充和抗骨质疏松药物）；3) 建议生活方式干预；4) 安排随访确保安全。",
    "medical_order": "诊断：骨质疏松症伴T12椎体压缩性骨折。予完善DXA骨密度检测；检查血清钙、磷、碱性磷酸酶、25-羟基维生素D、甲状旁腺激素；必要时胸腰椎MRI评估骨折稳定性。治疗：予钙剂1000 mg/日口服、维生素D3 800 IU/日口服；启动双膦酸盐类（如阿仑膦酸钠70 mg/周口服）抗骨质疏松治疗；疼痛管理：予非甾体抗炎药（如布洛芬400 mg 每日三次）对症。生活方式：建议增加日晒（每日15-30分钟）、高钙饮食、限制高草酸饮料（如浓茶）。随访：安排1周后门诊复诊评估疼痛和依从性；转骨科会诊排除手术指征。",
    "patient_dialogue": "大妈，您这腰背痛是因为晾衣服时不小心把脊椎骨头压伤了，这叫压缩性骨折。这年纪大了，骨头容易变脆，就像老房子砖头松了一样，得好好治一治。别担心，咱们一步一步来：首先，给您开点止痛药缓解不适（拿药时问问药师怎么吃）；同时，补点钙片和维生素D，就像给骨头加料，让它结实点。建议您多吃牛奶、豆腐这类高钙食物，少喝浓茶，因为茶可能影响钙吸收；天气好时多晒晒太阳，每天晒个十几分钟就行——阳光能帮身体造维生素D，让骨头更健康。另外，安排您做个骨头密度检查（不疼，就是躺机器上扫一下），再抽血查查营养水平。过一周咱们再见面看看恢复情况，确保骨头慢慢长好。疼得厉害随时来医院，别硬扛，咱们一起把这问题解决好！"
  },
  {
    "id": 277,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "患者，女，74岁，因“腰背隐痛3月，晨起翻身困难”由家人陪同前来门诊。既往史：2型糖尿病15年（口服二甲双胍+格列美脲）、高血压20年（氨氯地平5 mg qd），否认骨折史。绝经年龄52岁，无激素替代史。近半年无腹泻、甲亢症状，无长期糖皮质激素使用史。查体：身高156 cm（较年轻时缩短4 cm），体重49 kg，BMI 20.1 kg/m²；脊柱轻度后凸，胸12-腰2棘突压痛（+），无肋骨压痛。今日外院DXA：L1-L4 T-score −3.1，左髋T-score −2.8；血Ca 2.32 mmol/L、P 1.12 mmol/L、ALP 78 U/L（正常）、Cr 82 µmol/L、eGFR 67 mL/min；血常规、甲功、血清蛋白电泳未见异常。患者自述平日饮奶少，日晒不足，无烟酒嗜好；职业为退休图书管理员，近期因雨天路滑几乎不出门。家属担心骨质疏松病因，询问“是否就是老年性的，要不要查别的？”",
    "reference_rule": {
      "condition": "老年性骨质疏松症患者需进行鉴别诊断",
      "action": "1. 与绝经后骨质疏松症鉴别：绝经后骨质疏松症主要发生于绝经后妇女（发病年龄一般在 51~65 岁），发生原因与体内雌激素水平下降有关，为高转换型，临床上的骨折部位多见于椎体和桡骨远端；老年性骨质疏松症发病年龄在 70 岁以上，发生原因与细胞、组织、器官的老化与功能衰退有关，为低转换型，骨丢失速率慢，皮质骨与小梁骨均丟失，临床上骨折部位多见于椎体和髋部；2. 与继发性骨质疏松症鉴别：需详细了解患者病史，评价可能导致骨质疏松症的各种病因、危险因素及药物，特别强调部分导致继发性骨质疏松症的疾病可能缺少特异的症状和体征，有赖于进一步辅助检查",
      "contraindication": null,
      "evidence": "参考中华医学会骨质疏松和骨矿盐疾病分会《原发性骨质疏松症诊疗指南》（2022 版）、中国老年学和老年医学学会骨质疏松分会《中国老年骨质疏松症诊疗指南》（2023 版），老年性骨质疏松症主要与绝经后骨质疏松症、继发性骨质疏松症相鉴别。老年性骨质疏松症与绝经后骨质疏松症鉴别。 绝经后骨质疏松症主要发生于绝经后妇女，发病年龄一般在 51~65 岁。发生原因与体内雌激素水平下降有关，为高转换型，临床上的骨折部位多见于椎体和桡骨远端。老年性骨质疏松症发病年龄在 70 岁以上。发生原因与细胞、组织、器官的老化与功能衰退有关，为低转换型，骨丢失速率慢，皮质骨与小梁骨均丟失，临床上骨折部位多见于椎体和髋部。老年性骨质疏松症及继发性骨质疏松症的鉴别。 需详细了解患者病史，评价可能导致骨质疏松症的各种病因、危险因素及药物，特别强调部分导致继发性骨质疏松症的疾病可能缺少特异的症状和体征，有赖于进一步辅助检查。包括影响骨代谢的内分泌疾病、类风湿关节炎等免疫疾病、影响钙和维生素 D 吸收和代谢的消化系统和肾脏疾病、长期服用糖皮质激素或其他影响骨代谢药物等。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于常规门诊诊疗场景，重点关注快速建立鉴别诊断（Differential Diagnosis），排除危急重症（如恶性肿瘤或严重代谢紊乱），并直接给出诊疗指令。核心任务包括识别骨质疏松的病因类型（原发性 vs. 继发性），并制定初步干预措施。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例提取关键信息并转化为医学术语：患者74岁女性，主诉腰背痛伴晨僵3月，提示椎体受累；体征包括身高缩短（4 cm）、脊柱后凸及棘突压痛，符合骨质疏松性椎体压缩骨折风险；DXA显示L1-L4 T-score -3.1（骨质疏松诊断标准）及左髋T-score -2.8（骨量减少），骨折部位以椎体和髋部为主（倾向老年性骨质疏松）。实验室检查：血钙正常高值（2.32 mmol/L）、ALP正常（78 U/L）提示低骨转换型；eGFR降低（67 mL/min）表示轻度肾功能不全，可能影响骨代谢；血常规、甲功等正常初步排除内分泌或血液系统继发因素。隐式线索：年龄>70岁、BMI偏低（20.1 kg/m²）、低钙摄入（饮奶少）、维生素D不足（日晒少）及活动减少（久坐），共同构成老年性骨质疏松风险；但eGFR异常及血钙偏高需警惕继发性病因（如肾脏病或甲状旁腺功能异常）。家属疑问强调需病因鉴别。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南Condition要求老年性骨质疏松症需与绝经后型（发病年龄51-65岁、高转换型）及继发性型鉴别。当前病例年龄74岁>70岁、骨折部位（椎体和髋部）及ALP正常（低转换）符合老年性特征；但绝经后因素（绝经22年）可能共存，且eGFR降低、血钙偏高提示继发性风险（如肾性骨病或维生素D缺乏）。指南Action强调详细病史评估及辅助检查（排除内分泌、消化/肾脏疾病）。Contraindication为null，无禁忌；安全检查：无危急重症（如高钙危象或骨折），但药物二甲双胍/格列美脲/氨氯地平无直接骨代谢影响，肾功能不全（eGFR 67）需避免肾毒性抗骨吸收药物。\n\n**Step 4: 决策生成 (Decision Making)**\n基于指南Action，优先排除继发性病因：1. 完善血清25(OH)D、PTH、骨转换标志物（如β-CTX）及24小时尿钙/肌酐检查，评估维生素D状态及甲状旁腺功能；2. 启动基础治疗（钙和维生素D补充）；3. 考虑抗骨吸收药物（双膦酸盐类），但需肾功能评估；4. 强化生活干预及跌倒预防。最终决策：确诊骨质疏松症，进行病因鉴别后启动治疗。",
    "medical_order": "诊断：骨质疏松症（基于DXA T-score ≤ -2.5）。\n鉴别诊断：老年性骨质疏松症（主因年龄>70岁、低转换型） vs. 继发性骨质疏松症（需排除肾脏疾病、维生素D缺乏等）。\n检查：完善血清25(OH)D、PTH、β-CTX（骨转换标志物）、24小时尿钙/肌酐；评估跌倒风险（Berg平衡量表）。\n治疗：予钙剂1000 mg qd + 维生素D3 800 IU qd口服；考虑阿仑膦酸钠70 mg qw口服（需评估eGFR，若<35 mL/min改用唑来膦酸静脉滴注）。\n生活方式：增加日晒（每日15-30分钟）、高钙饮食（奶制品、绿叶菜）、适度负重运动（如步行）。\n随访：4周后复诊复查血钙、PTH、25(OH)D及肾功能；3-6月复查DXA。",
    "patient_dialogue": "阿姨，您好！我先跟您和家属说说您的情况。您的腰背痛和早上翻身困难，主要是因为骨头变脆弱了，检查显示骨密度偏低，属于骨质疏松。这不是单纯年纪大的问题——咱们得查查其他可能的原因，比如肾脏功能有点下降或者维生素D不足，这样才能对症下药。今天先给您开点钙片和维生素D，帮助骨头强壮起来；同时，我会安排几个血检和尿检，看看有没有隐藏的毛病。您平时在家，记得多晒晒太阳（每天15分钟就行），喝点牛奶或酸奶补钙，天气好时慢慢走走，防跌倒最重要。别担心，咱们一步步来，下个月复查我再跟您细聊结果。"
  },
  {
    "id": 284,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "患者由平车推入示教室，驼背明显，静息时仍诉‘腰里像有绳子捆着，喘气都疼’。查体：舌淡暗、边有齿痕，苔薄白，脉细涩；VAS 7/10，翻身困难需两人协助。骨密度T值-3.4（髋部）。血常规Hb 96 g/L，ESR 42 mm/h，β-CTX 1.28 ng/mL↑，P1NP 33.2 ng/mL↓；凝血D-二聚体 1.1 mg/L↑。追问病史：近2年身高‘缩水’6 cm，平日少气懒言，走50米需停歇，家务后手指发绀、晨僵约10分钟。否认激素、抗凝药使用史，但自服‘钙片+维D’断断续续。今日阴天，患者额外主诉‘膝盖酸沉像灌了铅’。家属急切询问：‘西医让打地舒单抗，可老人又虚又瘀，中药能不能一起用？’",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为气虚血瘀证者",
      "action": "1. 治法：补气、活血、通络；2. 推荐方剂：补阳还五汤（药物组成为黄芪、当归尾、赤芍、地龙、川芎、红花、桃仁）联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为气虚血瘀证者，推荐选用补阳还五汤（《医林改错》）（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗，药物组成为黄芪、当归尾、赤芍、地龙、川芎、红花、桃仁。"
    },
    "thought": "本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我需快速聚焦于建立鉴别诊断，排除危急重症（如急性骨折、血栓或感染），并给出直接诊疗指令。\n\n- **Step 1: 场景定义**：当前场景为常规门诊诊疗，重点关注快速鉴别诊断（如排除椎体压缩骨折、深静脉血栓或炎症性关节炎），并基于指南制定治疗方案。\n- **Step 2: 临床解码**：患者关键信息包括：驼背伴身高缩水6 cm提示椎体压缩骨折；腰痛（VAS 7/10）、翻身困难显示活动受限；舌淡暗、脉细涩、少气懒言符合中医气虚血瘀证；Hb 96 g/L示贫血，ESR 42 mm/h提示炎症可能，β-CTX↑和P1NP↓证实骨质疏松活动期，D-二聚体↑增加血栓风险；手指发绀、晨僵10分钟暗示微循环障碍或早期关节炎；钙片+维D依从性差加剧骨质流失；膝盖酸沉加重可能与骨质疏松相关。隐式线索：ESR升高需排除类风湿关节炎或感染，D-二聚体↑需警惕深静脉血栓风险，贫血可能源于慢性病或营养不良。鉴别诊断：优先排除急性骨折（需影像学确认）和血栓事件（D-二聚体↑），但无发热或急喘提示非危急重症。\n- **Step 3: 规则对齐与安全检查**：患者符合指南条件（老年性骨质疏松症中医辨证为气虚血瘀证），指南无禁忌症（Contraindication null）。但需安全检查：D-二聚体↑提示血栓风险（需监测凝血），ESR升高需排查炎症性共病，但无激素或抗凝药史，安全可控。方案与指南对齐：推荐补阳还五汤联合抗骨质疏松药物（如地舒单抗）。\n- **Step 4: 决策生成**：基于指南Action，直接决策：启动补阳还五汤（黄芪、当归尾、赤芍、地龙、川芎、红花、桃仁）和地舒单抗治疗；同时完善检查以排除共病（如X线查骨折、类风湿因子筛查），处理贫血和炎症风险。",
    "medical_order": "诊断：老年性骨质疏松症（中医辨证：气虚血瘀证）。\n治疗：\n1. 予补阳还五汤（黄芪30g、当归尾10g、赤芍10g、地龙10g、川芎10g、红花6g、桃仁10g），每日一剂，水煎分两次口服。\n2. 联合抗骨质疏松药物：地舒单抗60mg，皮下注射，每6个月一次。\n3. 完善胸腰椎X线或MRI，排除椎体压缩骨折；复查全血细胞计数、凝血功能、类风湿因子及抗CCP抗体，评估贫血及炎症原因。\n4. 监测D-二聚体水平，警惕血栓事件。\n5. 一级护理：防跌倒措施，卧床时协助翻身。\n6. 停用自服钙片+维D，改为标准化钙剂1000mg/日 + 维生素D3 800IU/日口服。",
    "patient_dialogue": "老人家，您的情况我都仔细看了。您这腰疼得像被绳子捆着，喘气都费劲，主要是骨质疏松导致的骨头变脆了，加上您平时感觉没力气、手指发紫，这在中医里叫‘气虚血瘀’，就是身体的气血不足、血流不畅啊。别担心，西医建议的那个地舒单抗针剂，确实能帮您强健骨头，我会给您打上，每半年一次就好。同时，咱们配上中药调理——用补阳还五汤来补气和活血，这样双管齐下，能缓解您的虚和瘀，让您翻身、走路轻松些。这个汤药每天喝两次，味道不算苦，我会让护士帮您准备好。另外，您自吃的钙片不太规律，咱们换成标准的钙和维生素D，每天按时吃，骨头才不容易继续变脆。还有，您膝盖沉甸甸的、手指早上僵硬，可能是骨头问题连带引起的，我会安排做个腰部X光和血液检查，看看有没有其他小问题需要处理。您躺着时翻身困难，家人帮忙是对的，但一定要小心别摔着，咱们加强防护。安心养病，这个方案安全有效，我经常用，您会慢慢好起来的。"
  },
  {
    "id": 278,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "患者由女儿搀扶步入诊室，步态小碎且驼背明显。主诉近半年‘腰像断了一样酸’，夜间翻身疼醒，晨起需扶墙缓行。追问得知去年11月下雪天滑倒后胸椎轻度压缩骨折，卧床2月，此后身高‘缩了3厘米’。平日畏寒，厚衣早穿；食欲差，半碗米饭即饱，进食后易腹胀；夜尿3-4次，色清长。舌淡胖边有齿痕，苔白滑，脉沉迟。今日骨密度回报：L1-L4 T值-3.1，左髋T值-2.7；血Ca 2.25 mmol/L、P 0.9 mmol/L、ALP 110 U/L、25-OH-VD 18 ng/mL、PTH 68 pg/mL。患者退休前为小学语文教师，仍坚持每日阅读，但自述‘记性不如从前’。本次就诊希望‘开点止痛药’，并咨询能否不再‘一天天佝偻下去’。诊室空调26 ℃，患者仍双手抱热水杯取暖。",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为脾肾阳虚证者",
      "action": "1. 治法：补益脾肾，强筋壮骨；2. 推荐方剂：补中益气汤合金匮肾气丸（药物组成为黄芪、白术、陈皮、升麻、柴胡、人参、甘草、当归、地黄、山药、山茱萸、茯苓、牡丹皮、泽泻、桂枝、附子）或全杜仲胶囊或金匮肾气丸联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为脾肾阳虚证者，推荐选用补中益气汤（《脾胃论》）合金匮肾气丸（《金匮要略》）（证据水平 C，推荐等级：弱推荐），药物组成为黄芪、白术、陈皮、升麻、柴胡、人参、甘草、当归、地黄、山药、山茱萸、茯苓、牡丹皮、泽泻、桂枝、附子；或全杜仲胶囊（证据水平 C，推荐等级：弱推荐）；或金匮肾气丸（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规门诊诊疗场景（Context指定为‘常规诊断与治疗’）。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断以排除危急重症（如急性骨折、感染或代谢危象），并基于现有证据给出直接的诊疗指令。优先确保患者安全，同时高效处理主诉（疼痛和驼背进展）。Step 2: 临床解码 (Clinical Decoding)：从病例提取关键信息：患者症状（腰酸、夜间痛醒、驼背、身高缩短3cm）结合病史（胸椎压缩骨折史）和体征（畏寒、食欲差、腹胀、夜尿清长、舌淡胖齿痕苔白滑脉沉迟）强烈提示骨质疏松症。检查数据（骨密度T值L1-L4 -3.1/左髋 -2.7、25-OH-VD 18 ng/mL低、PTH 68 pg/mL稍高、P 0.9 mmol/L低、ALP 110 U/L高）证实重度骨质疏松伴维生素D缺乏和继发性甲状旁腺功能亢进。隐式线索包括畏寒和脾胃症状（食欲差、腹胀）符合中医脾肾阳虚证；驼背和身高缩短暗示骨密度严重流失；记忆减退可能与年龄或骨质疏松相关，但无急性神经症状。转化为医学术语：老年性骨质疏松症（ICD-10: M81.0）、脾肾阳虚证（TCM）、维生素D缺乏症（E55.9）、继发性甲状旁腺功能亢进（E21.1）。Step 3: 规则对齐与安全检查 (Alignment & Safety)：指南Condition‘老年性骨质疏松症中医辨证为脾肾阳虚证者’与患者表现高度匹配（畏寒、脾胃功能低下等）。Contraindication为null，无禁忌；安全检查确认无高钙血症（血Ca正常）、无药物过敏史（病例未提及）、无急性骨折风险（步态稳但需防跌倒），PTH稍高但继发于VitD缺乏，优先补充VitD可缓解。Step 4: 决策生成 (Decision Making)：根据指南Action‘补益脾肾，强筋壮骨’，直接采用推荐方案：中药选用补中益气汤合金匮肾气丸（证据水平C，弱推荐），并联合西医抗骨质疏松治疗（钙剂、VitD补充和双膦酸盐）。添加对症止痛（避免阿片类），强调生活方式干预和随访。决策基于安全>疗效原则，排除危急（无发热、急性痛或神经缺陷），确保方案高效。",
    "medical_order": "诊断：老年性骨质疏松症（脾肾阳虚证）；维生素D缺乏症；继发性甲状旁腺功能亢进。治疗方案：1. 予钙剂500mg口服每日两次；维生素D3 1000IU口服每日一次。2. 抗骨质疏松药物：阿仑膦酸钠70mg口服每周一次（空腹，直立30分钟）。3. 中药治疗：补中益气汤合金匮肾气丸，每日一剂（组分：黄芪15g、白术10g、陈皮6g、升麻3g、柴胡6g、人参6g、甘草3g、当归10g、地黄12g、山药12g、山茱萸10g、茯苓10g、牡丹皮6g、泽泻6g、桂枝6g、附子3g）。4. 止痛处理：对乙酰氨基酚500mg口服按需，每日不超过4次。5. 生活方式：增加日晒每日15-30分钟；防跌倒宣教（避免湿滑地面，使用助行器）；适度负重运动如散步每日30分钟。6. 随访：3个月后复查骨密度、血Ca、P、ALP、PTH、25-OH-VD；若疼痛无缓解或驼背进展，转骨科评估。",
    "patient_dialogue": "阿姨，您好！我看您走路有点不稳，腰背疼得厉害，晚上都睡不好，这确实让人难受。您去年摔跤后骨头受了伤，现在查出来是骨质疏松——就是骨头变脆了，所以身高矮了些，腰也弯了。别担心，我们有办法帮您缓解疼痛，还能尽量让驼背不再加重。首先，我给您开点止痛药，这个药叫‘扑热息痛’，疼的时候吃一片就行，但别多吃，一天最多四次。更重要的是，我们要从根上治：给您补钙和维生素D，就像给骨头‘加营养’，让它们结实起来；再加个中药方子，里面有人参、黄芪这些，能温补您的脾胃和肾气，帮您少怕冷、胃口好点。您还得每天晒晒太阳，简单散散步，走路时小心点别滑倒。坚持治疗，三个月后咱们再查查骨头情况。我知道您爱看书，但记性差可能跟年纪有关，别太急。慢慢来，咱们一起努力，好吗？"
  },
  {
    "id": 292,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "case_input": "患者李秀兰，76岁，身高148 cm，体重42 kg，BMI 19.2 kg/m²。既往史：2型糖尿病15年（空腹血糖最近半年7.8–9.4 mmol/L，HbA1c 8.1%）、高血压18年（晨起收缩压波动150–165 mmHg）、慢性肾功能不全（eGFR 45 ml/min·1.73 m²，肌酐132 μmol/L）、5年前T12椎体脆性骨折行椎体成形术。主诉：近1个月翻身及起坐时腰背钝痛明显加重，夜间痛醒2–3次，无下肢放射痛。DXA（腰椎L1–L4）：T值 −3.4；血清25-OH-D 18 ng/ml，β-CTX 0.68 ng/ml↑，PINP 68 μg/L↑。今晨自行扶步行器步入诊室，驼背明显，胸腰段后凸顶点T11–T12处压痛（++），局部肌痉挛呈条索状。患者自述因“胃不好”已自行停用阿仑膦酸钠3个月，仅偶尔服钙片。家属补充：老人怕跌倒，白天多卧床，饮食以粥、咸菜为主，近期出现双踝轻度浮肿。无发热、无肉眼血尿。目前用药：二甲双胍500 mg bid、氨氯地平5 mg qd、骨化三醇0.25 μg qd。今复诊，社区医生需评估下一步抗骨质疏松方案并处理多重合并症。",
    "reference_rule": {
      "condition": "老年性骨质疏松症患者",
      "action": "1. 针灸治疗：针灸主穴选择局部阿是穴、肾俞穴、足三里、悬钟、大杼；根据不同证型选择相应的配穴（肝肾阴虚型配肝俞、太冲、太溪、三阴交；脾肾阳虚型配脾俞、命门、中脘、关元；肾虚血瘀型配膈俞、血海、太溪、三阴交；气虚血瘀型配膈俞、关元、血海、太冲）；建议针灸每天 1 次，10 d 1 疗程，根据病情可适当增加疗程；针刺适用于所有证型，但对于肝肾阴虚有热的患者要谨慎使用灸法；2. 针刀疗法：体位取俯卧位（俯卧困难者可取侧卧位）；定点寻找脊柱后凸畸形最明显处，在该节段选择棘间点及相应上下两个肋横突关节/腰椎小关节点及横突尖点（双侧），再仔细按压寻找肌痉挛及压痛最明显点；用龙胆紫标定后常规消毒铺巾；1% 利多卡因局部浸润麻醉；以 4 号针刀操作，先松解棘间点，再松解肋横突关节/腰椎小关节点、横突尖点及肌痉挛、压痛最明显点；横向快速刺入，松解棘间点时横向刺入棘上韧带、棘间韧带，切割 2~3 刀后出针，其余各点横向进针入肌层后需掉转刀口成纵向，肌痉挛及压痛明显点纵向切割 2~3 刀后出针，肋横突关节/腰椎小关节及横突尖点纵向铲切剥离 2~3 刀后出针；出针后压迫止血；无菌纱布敷盖，出血明显者需加压包扎；3. 穴位贴敷：贴敷药物可选择肉桂、淫羊藿、杜仲等；贴敷穴位参考针灸选穴，也可选择阿是穴",
      "contraindication": "针灸对于肝肾阴虚有热的患者要谨慎使用灸法；针刀和穴位贴敷的禁忌证应符合 GB/T 21709.3-2021 和 GB/T 21709.9-2021 中的规定",
      "evidence": "推荐意见：（1）针灸治疗（证据水平 C，推荐等级：弱推荐）；（2）针刀疗法（证据水平 C，推荐等级：弱推荐）；（3）穴位贴敷（证据水平 C，推荐等级：弱推荐）。方法：针灸： 针灸主穴选择局部阿是穴、肾俞穴、足三里、悬钟、大杼。根据不同证型选择相应的配穴，肝肾阴虚型主要为足厥阴肝经、足少阴肾经穴，配肝俞、太冲、太溪、三阴交等；脾肾阳虚型主要为任脉、督脉穴，配脾俞、命门、中脘、关元等；肾虚血瘀型主要为冲脉、足少阴肾经穴，配膈俞、血海、太溪、三阴交等；气虚血瘀型主要为任脉、足少阴肾经穴，配膈俞、关元、血海、太冲等。针刺适用于所有证型，但对于肝肾阴虚有热的患者要谨慎使用灸法。根据患者的证型选择合适的补泻手法，建议针灸每天 1 次，10 d 1 疗程，根据病情可适当增加疗程。注意事项与禁忌证应符合 GB/T 21709.3-2021 中的规定。针刀： (1) 体位：患者取俯卧位，俯卧困难者可取侧卧位。(2) 定点：先寻找脊柱后凸畸形最明显处，在该节段选择棘间点及相应上下两个肋横突关节/腰椎小关节点及横突尖点 (双侧)，再仔细按压寻找肌痉挛及压痛最明显点。部分病变节段较多，疼痛较广泛者，应分次定点及操作，以便控制单次麻药用量，减少操作时间，从而控制操作风险。寻找上述点后用龙胆紫标定。(3) 常规消毒铺巾。(4) 1% 利多卡因局部浸润麻醉。(5) 小针刀操作：以 4 号针刀操作，先松解棘间点，再松解肋横突关节/腰椎小关节点、横突尖点及肌痉挛、压痛最明显点。横向快速刺入，松解棘间点时横向刺入棘上韧带、棘间韧带，切割 2~3 刀后出针，其余各点横向进针入肌层后需掉转刀口成纵向，肌痉挛及压痛明显点纵向切割 2~3 刀后出针，肋横突关节/腰椎小关节及横突尖点纵向铲切剥离 2~3 刀后出针，各点操作完毕出针后需压迫止血。(6) 无菌纱布敷盖，出血明显者需加压包扎。穴位贴敷： 穴位贴敷药物多种，可根据临床协定方等自行选择，临床常用的药物有肉桂、淫羊藿、杜仲等；贴敷穴位参考针灸选穴，也可选择阿是穴。注意事项与禁忌证应符合 GB/T 21709.9-2021 中的规定。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于复杂合并症治疗场景，重点关注多重疾病（骨质疏松症加重、糖尿病、高血压、慢性肾功能不全）的相互作用和药物安全。需全网扫描药物禁忌、共病风险，优先级为安全 > 疗效。",
      "Step 2: 临床解码": {
        "核心问题": "骨质疏松症活动期（疼痛加重+骨标志物↑+维生素D缺乏）伴多重合并症",
        "关键风险点": [
          "肾损伤（eGFR 45 ml/min）限制药物选择",
          "糖尿病控制不佳（HbA1c 8.1%）+营养不良（BMI 19.2）加重骨质疏松",
          "自行停药史（阿仑膦酸钠）及不良生活习惯（高盐饮食、卧床）",
          "针刀操作风险：肾功能不全影响利多卡因代谢，驼背体位增加操作难度"
        ],
        "隐式线索": "踝部水肿提示容量负荷/低蛋白；咸菜饮食加剧高血压；卧床加速骨流失"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "符合老年性骨质疏松症条件（年龄>65岁+骨折史+低T值）",
        "禁忌证核查": [
          "针灸灸法：无潮热盗汗等阴虚火旺表现，可谨慎使用",
          "针刀：eGFR 45 ml/min属相对禁忌（GB/T 21709.3），需减量麻醉药；驼背体位需侧卧位操作",
          "穴位贴敷：药物（肉桂/杜仲）无肾毒性，皮肤完整可实施"
        ],
        "安全优先级": "禁用静脉双膦酸盐（肾毒性）；优选肾代谢率低的抗骨松药"
      },
      "Step 4: 决策生成": {
        "抗骨质疏松方案": "1. 重启双膦酸盐（阿仑膦酸钠减量联用胃保护剂） 2. 强化钙剂+维生素D 3. 针灸主穴+气虚血瘀配穴（疼痛管理） 4. 暂缓针刀（肾风险） 5. 贴敷辅助",
        "合并症干预": "1. 糖尿病：调整降糖方案 2. 高血压：限盐+药物滴定 3. 肾病：蛋白摄入优化",
        "转诊指征": "内分泌科（血糖骨代谢联动）、营养科（膳食重建）、康复科（防跌倒训练）"
      }
    },
    "medical_order": "1. 抗骨质疏松治疗：阿仑膦酸钠 35 mg 口服 每周一次（联用泮托拉唑 20 mg 口服 每日一次）；碳酸钙D3 600 mg 口服 每日一次；骨化三醇增至 0.5 μg 口服 每日一次。\n2. 非药物干预：针灸取阿是穴（T11-T12）、肾俞（双）、足三里（双）、悬钟（双）、大杼（双），配膈俞（双）、关元、血海（双）、太冲（双）；每日1次×10天；肉桂-杜仲贴敷肾俞/足三里 每晚×14天。\n3. 合并症管理：二甲双胍维持 500 mg bid；加用恩格列净 10 mg 口服 每日一次；氨氯地平增至 10 mg 口服 每日一次；限钠盐<5 g/日。\n4. 监测：急查血钙/血磷（48h）；尿蛋白/肌酐比值；疼痛VAS评分每日记录。\n5. 转诊：内分泌科（骨质疏松-糖尿病综合管理）、临床营养科（高蛋白膳食方案制定）。",
    "patient_dialogue": "李阿姨，您这腰背痛加重的情况咱们得从几方面一起解决：\n\n1. **治骨头**：\n   - 之前停掉的护骨药需要重新吃，但剂量调低了（每周只吃1次），同时加个护胃药，这样不会伤胃。\n   - 钙片要天天吃，您手上这个维生素D药量不够，我给您加一点，这样钙才能补进骨头里。\n   - 咱们用针灸来缓解疼痛，主要扎您说最痛的腰背位置和腿上几个穴位，再配上中药贴，晚上贴不耽误睡觉。\n\n2. **其他毛病**：\n   - 您脚肿和咸菜有关系，以后咱做菜少放盐，咸菜也别吃了。血压药给您加了一点量，记得每天早晨量血压记下来。\n   - 您总喝粥营养不够，我请营养科专家教您做些既养胃又补蛋白的饭菜。\n   - 糖尿病药给您加了个新药，还能顺带保护肾脏。\n\n3. **康复关键**：\n   - 老躺着骨头更脆弱，康复科会教您一套安全起床和坐姿锻炼的方法，用步行器慢慢练，预防再摔倒。\n   - 两天后先来抽血看看钙和肾指标，疼得厉害随时打我电话。咱们一步步来，您别太担心！"
  }
]