[
  {
    "id": 1130,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "患者今日步行入院，主诉“近一周嘴里像被开水烫，吃什么都咸苦”。查体：舌背、软腭及颊黏膜满布乳凝状白斑，用力擦拭后露出鲜红渗血创面；双侧颌下淋巴结可触及黄豆大、轻压痛。体温37.4℃，CD4 156/μL，HIV-RNA 4.8×10⁵ copies/mL，空腹血糖5.3 mmol/L。患者为外卖骑手，自称“每天靠冰红茶提神”，否认吸烟饮酒，但近3个月体重下降6 kg。今日因疼痛难忍，连粥都难以下咽，希望医生尽快帮他解决吃饭问题。",
    "reference_rule": {
      "condition": "HIV 感染者合并 OPC",
      "action": "1. 咪康唑口腔贴片 50 mg/片，放置于上颌切牙上方牙龈处，1 次/d，疗程为 7~14 d; 2. 制霉菌素 50 万单位/片，口内含化，3 次/d，疗程为 14~28 d，或制成“制霉菌素甘油混悬液”涂抹于口腔黏膜（特别注意擦洗真菌好发部位，保留 3~5 min，30 min 内禁食禁饮，4 次/d，持续 7~14 d）; 3. 辅以 2%~4% NaHCO3 漱口液漱口，每天使用数次",
      "contraindication": "null",
      "evidence": "OPC 患者在充分的口腔护理支持下，首选局部抗真菌治疗。局部药物治疗可减少全身药物暴露，降低药物相互作用和全身不良事件的风险，并可降低抗真菌耐药性产生的可能性。1. 咪康唑口腔贴片：50 mg/片，放置于上颌切牙上方牙龈处，1 次/d，疗程为 7~14 d。咪康唑为人工合成的广谱抗真菌药，在体外对念珠菌有很好的抗真菌活性，与其他抗真菌药物使用后 OPC 的复发率差异无统计学意义。咪康唑口腔贴片 1 h 起效，维持唾液中 >1 μg/mL 咪康唑高浓度时间长，局部使用极少入血，患者使用时耐受性良好。2. 制霉菌素：50 万单位/片，口内含化，3 次/d，疗程为 14~28 d。本品不良反应小，偶有发生恶心、腹泻或食欲减退者。鉴于单片制剂局部应用口感较差，部分患者难以耐受，可制成“制霉菌素甘油混悬液”，涂抹于口腔黏膜，特别注意擦洗真菌好发部位，保留 3~5 min，30 min 内禁食禁饮，4 次/d，持续 7~14 d。3. 其他治疗：2%~4% NaHCO3 漱口液在清洁口腔的同时，可以提高口腔内 pH 值，从而抑制念珠菌生长繁殖的作用，同时可激活溶菌酶，起到协同抑菌作用。每天使用 NaHCO3 漱口液数次，推荐作为 OPC 的辅助治疗。研究表明，中药含漱液可以改善口腔状态，治疗艾滋病口腔念珠菌感染效果明显。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规门诊诊疗场景（患者步行入院，主诉非急症但影响生活功能）。作为急诊/门诊医生思维，关注重点是快速建立鉴别诊断（排除坏死性龈口炎、口腔癌等），优先解决患者疼痛性进食障碍这一迫切需求。Step 2: 临床解码 - 关键线索包括：①典型鹅口疮体征（可拭去白斑+渗血创面）符合口腔念珠菌病（OPC）；②CD4 156/μL+高病毒载量证实HIV免疫抑制状态；③“冰红茶依赖”暗示高糖摄入（念珠菌生长促进因素），体重下降6kg提示营养不良风险；④颌下淋巴结反应性肿大与感染相符，低热为继发炎症表现。核心诊断：HIV相关OPC（B37.0）。Step 3: 规则对齐与安全检查 - 指南condition与患者OPC表现完全匹配。查contraindication为null，患者无肝肾疾病史/药物过敏史（病例未提及），空腹血糖正常可安全用药。需注意制霉菌素含化片口感差可能引发恶心，与患者进食困难存在冲突。Step 4: 决策生成 - 优先选择起效快的咪康唑贴片（1次/日操作简便），联合制霉菌素混悬液（规避含化片口感问题），辅以NaHCO3漱口。同步处理营养支持及HIV专科转诊。",
    "medical_order": "1. 抗真菌治疗：①咪康唑口腔贴片50mg qd 局部应用于上颌切牙龈，疗程14天；②制霉菌素混悬液（50万单位/10ml甘油）涂布口腔黏膜病变区（重点擦拭舌背/颊粘膜/软腭），保留≥3分钟，qid，用药后禁食水30分钟，疗程14天；③4% NaHCO3溶液漱口 tid-qid。2. 营养支持：予流质/半流质饮食，必要时开具肠内营养制剂。3. 转诊：即刻转感染科门诊优化抗逆转录病毒治疗（ART）。4. 监测：每日评估口腔疼痛VAS评分及摄食量，每周复查CD4+病毒载量。",
    "patient_dialogue": "王先生，您这嘴里火烧火燎的疼，连喝粥都受罪，真是遭罪了！检查发现您口腔里长的这些白斑是真菌感染，就跟东西发霉似的，咱们得重点治这个。我给您开两种药：第一种是药膏贴片，像个小创可贴，早上刷牙后贴在门牙上边的牙龈那儿，一天一次就行，能慢慢止疼杀菌。第二种是药水，用棉签蘸着涂在疼的地方，涂完含着别咽，坚持3分钟再吐掉，半小时内别吃喝，每天涂4次——这比含药片舒服些。另外每天用小苏打水当漱口水，多漱几次，让嘴里环境不适合霉菌生长。关键是您得把冰红茶戒了，糖分太高反而养病菌，这几天改喝温凉的豆浆、米汤，我让营养科给您配点营养粉补充体力。您这免疫力有点低，我已经联系感染科专家，下周带您过去调HIV的药。坚持治疗两周，吃饭应该能慢慢好起来，但体重变化要每周告诉我！"
  },
  {
    "id": 1128,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "患者自述过去两周口腔灼痛明显，晨起刷牙时常在镜中看到舌面覆着一层‘奶皮样’白斑，用牙刷轻刮会出血。他承认平时靠外卖度日，偏爱麻辣香锅和奶茶，几乎不吃蔬菜；熬夜改稿到凌晨两三点是常态，每天抽半包烟‘找灵感’。今日长沙室外34℃，候诊时他仍戴着厚口罩，说‘嘴里火辣辣，一吹空调更痛’。查体：口咽黏膜弥漫白色伪膜，拭去后露出充血糜烂面；下颌角可触及两枚1cm质韧淋巴结。实验室：HIV RNA 4.8×10⁴ copies/mL，CD4 160/μL。患者抱怨体重近一个月掉了4kg，‘吃什么都没味儿’，但否认腹泻或发热。",
    "reference_rule": {
      "condition": "HIV 感染者合并 OPC",
      "action": "1. 保持口腔卫生，及时治疗口腔疾病，减少口腔内的菌群交叉污染; 2. 合理膳食、加强营养，增强机体免疫力; 3. 必要时辅以胸腺法新等免疫调节剂",
      "contraindication": "null",
      "evidence": "HIV 感染者由于其免疫功能的特殊性，在有效 ART 和治疗合并疾病的同时，保持口腔卫生，及时治疗口腔疾病，减少口腔内的菌群交叉污染。合理膳食、加强营养，增强机体免疫力，必要时辅以胸腺法新等免疫调节剂，增强机体免疫功能。"
    },
    "thought": "本案例属于生活方式与风险干预场景，重点关注识别患者隐式的不良生活习惯（如高糖高脂饮食、睡眠剥夺、吸烟），并将其与HIV免疫抑制状态下的长期风险（如口腔念珠菌病进展、体重下降）关联起来，以共情但坚定的语气提出非药物干预建议。在临床解码中，患者口腔灼痛、白色伪膜和糜烂面提示口腔念珠菌病（OPC），下颌角淋巴结肿大表明炎症反应，实验室结果（HIV RNA 4.8×10⁴ copies/mL，CD4 160/μL）确认免疫抑制，体重下降4kg和味觉丧失反映营养不良；隐式线索包括饮食偏好（麻辣香锅和奶茶导致高糖高脂摄入）、蔬菜缺乏、睡眠不足（熬夜）、吸烟（半包/日）及环境因素（高温戴口罩加重不适），这些习惯加剧免疫功能低下和口腔症状。规则对齐显示病例完全匹配指南条件 'HIV 感染者合并 OPC'，无禁忌症（contraindication 为 null），因此安全应用指南建议。决策生成基于指南 action：优先强化口腔卫生和营养干预，具体包括抗真菌治疗、饮食调整、戒烟和睡眠改善，必要时辅以免疫调节剂以增强免疫力。",
    "medical_order": "诊断：HIV相关口腔念珠菌病（OPC）。予氟康唑 150mg 口服 qd 抗真菌治疗，疗程7天；加强口腔护理，bid 漱口（0.9%生理盐水），避免刺激性食物。营养干预：建议高蛋白、高维生素饮食，增加蔬菜水果摄入；必要时转营养科评估，予维生素B族及锌补充。生活方式管理：戒烟咨询（NRT支持），保证每日7-8小时睡眠，避免熬夜。免疫支持：评估后予胸腺法新 1.6mg 皮下注射 biw，增强免疫功能。随访：1周复查口腔症状及CD4计数，监测体重变化；若症状无改善，升级抗反转录病毒治疗（ART）。",
    "patient_dialogue": "王先生，您最近口腔火辣辣的疼和舌头上那层白膜，是因为免疫力下降了，这种问题在您这种情况下很常见。我知道您工作忙，常吃外卖和熬夜改稿，但麻辣香锅和奶茶太辣太甜了，会刺激伤口更难好，蔬菜吃得少也让身体缺营养，恢复得慢。抽烟更是雪上加霜——烟里的有害物会让嘴里发炎更严重，还削弱抵抗力。从今天起，咱们试试做些小改变：先戒掉烟，我给您开点戒烟贴帮助过渡；饮食上，多选清淡的饭菜，比如蒸鱼和青菜，奶茶换成白开水或柠檬水，既能解渴又不刺激口腔；晚上尽量11点前睡，让身体好好修复。这样坚持下来，口腔疼痛会缓解，体重也能慢慢回升，整个人更有精神。别担心，一步步来，我支持您！"
  },
  {
    "id": 1127,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "患者32岁，男，自由插画师，今日独自来HIV门诊复诊。主诉：过去10天自觉舌头像被热水烫过，吃辣泡面时刺痛明显，早上刷牙吐出白色小块像‘豆腐渣’。昨夜熬夜赶稿，晨起声音发哑。既往：确诊HIV感染4个月，尚未启动ART，CD4 135 cells/μL。无发热、无咳嗽。查体：舌背中后部及软腭可见乳白色伪膜，擦之露出充血面，轻微渗血；口角裂隙伴红斑。护士正准备用一次性木制压舌板取分泌物送检，患者突然问：‘医生，我嘴里这些白膜是不是上火？能不能先喷点西瓜霜？’窗外暴雨，诊室内灯管嗡嗡作响。",
    "reference_rule": {
      "condition": "OPC 诊断",
      "action": "1. 主要依据口咽部病变涂片镜检或分泌物培养阳性; 2. 必要时结合血清学和分子生物学方法明确诊断",
      "contraindication": "null",
      "evidence": "OPC 病原学诊断主要依据口咽部病变涂片镜检或分泌物培养阳性，必要时结合血清学和分子生物学方法明确诊断。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如急性感染或免疫衰竭并发症），并基于直接证据给出高效指令。患者症状提示口腔问题，结合HIV病史，需优先排除机会性感染。\n\nStep 2: 临床解码 (Clinical Decoding): 患者主诉舌头灼痛、吃辣刺痛、刷牙吐白块（'豆腐渣'）及声音发哑，查体见舌背和软腭乳白色伪膜（擦除后充血渗血）、口角裂隙红斑。隐式线索：HIV感染未治疗（CD4 135 cells/μL，免疫抑制状态）增加机会感染风险；'豆腐渣'描述典型口腔念珠菌伪膜；声音发哑可能与喉部念珠菌扩展或熬夜相关；无发热咳嗽排除肺炎等急危呼吸系统疾病；患者'上火'认知显示文化误解，需教育。综上，核心医学术语为疑似口腔念珠菌病（oral candidiasis），需病原学证实。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition为OPC（口腔念珠菌病）诊断，Action要求分泌物涂片镜检或培养作为主要依据。病例中伪膜、免疫抑制高度匹配该Condition。Contraindication为null，无禁忌。安全检查：CD4低提示免疫缺陷，但分泌物采样安全，无操作风险；需后续考虑ART启动以预防复发。\n\nStep 4: 决策生成 (Decision Making): 依据指南Action，立即进行分泌物涂片镜检和培养以确诊；结合HIV状态，同步评估ART启动必要性。排除急危（如无系统感染），决策聚焦病原学检查。",
    "medical_order": "完善口腔分泌物涂片镜检及真菌培养以确诊口腔念珠菌病。评估启动抗逆转录病毒治疗（ART），监测CD4和病毒载量。予口腔护理指导：避免辛辣刺激食物，保持口腔卫生。",
    "patient_dialogue": "您说的这些白膜和刺痛不是'上火'，是一种常见的口腔感染，和您的免疫系统有关。喷西瓜霜可能暂时缓解，但治标不治本，咱们得先查清楚原因。护士马上取点嘴巴里的样本来检测一下，就像化验一样，这能帮我们确认是不是真菌感染。别担心，这个感染在HIV患者中很常见，完全可以治好。另外，您CD4水平偏低，建议尽快开始吃HIV的药，这能预防更多问题。最近做菜别放辣椒，少熬夜，刷牙时轻一点，免得刺激伤口。雨这么大，您回去路上小心，结果出来我们会第一时间通知您。"
  },
  {
    "id": 1139,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "患者今日独自来复诊，手里拎着一袋外卖盒饭，说“刚下班赶来，路上顺便买了点粥”。主诉：两周前因口咽白斑、灼痛明显住院，确诊口咽念珠菌病（OPC），给予氟康唑首日400 mg、之后200 mg qd×14 d，出院时疼痛已缓解。出院医嘱要求今天（第14天）回门诊复查并评估停药1周后真菌转阴情况。患者自述“这两天嗓子又有点干”，但无白斑、无进食痛。查体：口咽黏膜轻度充血，未见明显白斑；舌背中央可见散在乳头萎缩。今日CD4 110/μL（半月前95），HIV-RNA 3.2×10⁴ copies/mL。患者担心“是不是又要住院”，并随口提到“最近外卖多，晚上常熬夜打游戏”。",
    "reference_rule": {
      "condition": "OPC 患者",
      "action": "1. 出院时评估 OPC 风险; 2. 2 周后随访并再次评估; 3. 抗真菌治疗停药 1 周后复查口咽念珠菌是否转阴; 4. 痊愈后转为 ART 常规随访，定期检测 CD4+ T 淋巴细胞计数、HIV 病毒载量",
      "contraindication": "null",
      "evidence": "OPC 通常预后良好，但仍需密切随访。出院时评估 OPC 风险，2 周后随访并再次评估，加强宣教，根据评估结果制订下一次随访计划。抗真菌治疗停药 1 周后复查口咽念珠菌是否转阴，痊愈后转为 ART 常规随访，定期检测 CD4+ T 淋巴细胞计数、HIV 病毒载量以评估机体免疫功能和 ART 疗效，为引导患者积极参与降低 OPC 再发风险提供及时、有效的策略指导。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于分级诊疗与随访场景。作为守门人 (Gatekeeper)，我的关注重点是对比患者当前状况（如 OPC 症状缓解程度、免疫指标变化）与指南设定的达标标准（停药 1 周后真菌转阴、痊愈后转 ART 常规随访），判断是维持当前随访计划还是触发转诊或升级治疗。\nStep 2: 临床解码 (Clinical Decoding) - 患者为 HIV 感染相关 OPC 治疗后复诊：症状上，主诉嗓子干但无白斑或进食痛，提示炎症缓解但潜在轻微粘膜刺激；查体示口咽黏膜轻度充血（轻度炎症反应）、未见白斑（真菌活动控制）、舌背乳头萎缩（可能为念珠菌后遗症或营养缺乏）。免疫指标：CD4 110/μL（较前上升，提示 ART 部分起效但仍低于 200/μL 的免疫缺陷阈值），HIV-RNA 3.2×10⁴ copies/mL（高病毒载量，ART 效果不佳）。隐式线索：患者提到“外卖多、熬夜打游戏”暗示不良生活方式（高糖高脂饮食、睡眠不足），可能削弱免疫力、增加 OPC 复发风险；独自复诊且焦虑住院，需心理支持。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南 Condition 为“OPC 患者”，患者状态匹配；Action 要求停药 1 周后复查真菌转阴、痊愈后转 ART 常规随访。Contraindication 为 null，无禁忌或安全风险（如药物相互作用或共病）。对齐重点：当前为出院后 2 周随访点，需确认真菌转阴状态；CD4 和 HIV-RNA 数据支持 ART 优化必要性。\nStep 4: 决策生成 (Decision Making) - 基于指南 Action：1. 立即复查口咽念珠菌转阴情况（无白斑支持好转，但需涂片确认）；2. 如转阴，转为 ART 常规随访（定期监测 CD4/HIV-RNA）；3. 针对风险（病毒载量高、生活方式差），加强宣教。决策：维持原状（不升级住院），触发强化随访（ART 调整和教育），因现状达标（症状缓解）但未痊愈（免疫缺陷持续）。",
    "medical_order": "予复查口咽念珠菌直接涂片，评估真菌转阴情况；优化 ART 方案以降低 HIV-RNA；健康教育：建议均衡饮食、避免高糖外卖、确保充足睡眠；安排定期随访：每 4 周监测 CD4+ T 淋巴细胞计数及 HIV 病毒载量，评估免疫恢复及 ART 疗效。",
    "patient_dialogue": "王先生，别担心，您的情况比之前好多了——嗓子干是有点轻微炎症，但白斑已经完全消失了，说明真菌感染控制得不错，这是个好消息！咱们今天做个简单的小检查（比如用棉签轻轻刮一下喉咙），确认一下真菌是不是彻底清除了。另外，您的免疫指标 CD4 有上升，这是好事，但病毒量还有点高，所以咱们得坚持吃药，把抗病毒治疗调整得更有效些。您提到常点外卖和熬夜打游戏，这我特别理解，工作忙嘛，但这些习惯会让身体抵抗力下降，容易让感染复发。建议您尽量自己做饭，多吃点蔬菜水果，晚上早点休息，游戏可以周末玩。以后您就定期来门诊检查，不用住院，我会帮您盯紧点，咱们一起把身体养好！"
  },
  {
    "id": 1119,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "患者31岁，男性，自由插画师，近两周因赶稿熬夜频繁。主诉“嘴里像被开水烫了一样疼，吃辣更受不了”，晨起时白色斑块明显，刷不掉。既往确诊HIV感染1年，目前尚未启动ART，CD4 180 cells/μL。口咽检查：软腭及咽后壁散在乳白色伪膜，拭之易出血，留下鲜红糜烂面，伴轻度口角裂。今日气温骤降，患者顺带提到“最近手指关节有点酸痛，不过不厉害”。无发热、无吞咽困难、无体重骤降。门诊护士已采外周血送检，但培养结果需3天后回报。",
    "reference_rule": {
      "condition": "疑似 OPC 的 HIV 感染者",
      "action": "1. 进行经验性抗真菌治疗; 2. 必要时完善病原学、细胞学/组织病理学等检查",
      "contraindication": "null",
      "evidence": "疑似 OPC 的 HIV 感染者可进行经验性抗真菌治疗，必要时完善病原学、细胞学/组织病理学等检查。"
    },
    "thought": "本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如急性侵袭性真菌感染或全身性并发症），并给出直接、高效的诊疗指令。Step 2: 临床解码 – 患者主诉口腔疼痛、白色斑块刷不掉、吃辣加重，结合口咽检查见乳白色伪膜、拭之易出血，符合口腔念珠菌病（Oral Candidiasis, OPC）的典型表现；既往HIV感染（CD4 180 cells/μL，未启动ART）表示免疫抑制状态，是OPC高危因素；隐式线索包括熬夜（可能加重免疫抑制）和手指关节酸痛（非特异性，可能因气温骤降诱发轻微炎症，但无发热、吞咽困难或体重骤降，排除急症如败血症）。Step 3: 规则对齐与安全检查 – 指南Condition为'疑似 OPC 的 HIV 感染者'，病例完全匹配（HIV感染伴典型OPC症状）；Contraindication为null，无禁忌（如无药物过敏史或肝肾损伤）；安全优先，CD4低提示免疫缺陷，但无危急症状，经验性治疗风险低。Step 4: 决策生成 – 根据指南Action，立即启动经验性抗真菌治疗（为首选方案），同时培养结果待回报，必要时再完善病原学检查；决策包括处方抗真菌药、ART启动评估和生活方式干预。",
    "medical_order": "诊断：口腔念珠菌病（OPC）。处理：1. 予氟康唑口服150mg单剂经验性抗真菌治疗；2. 继续等待外周血培养结果回报，必要时完善口腔涂片病原学检查；3. 建议启动ART治疗评估；4. 嘱患者保持口腔卫生，避免刺激性食物。",
    "patient_dialogue": "你好！从你描述的情况和刚才检查来看，你嘴里这些白色斑块，像被烫伤一样疼，是一种常见的口腔感染，叫做'口腔霉菌感染'，这和你HIV感染后免疫力降低有关。别担心，我们马上给你开一种药，叫氟康唑，吃一次就能缓解疼痛，这两天应该就舒服多了。另外，护士已经抽血做检查了，结果3天后出来，咱们到时候再看具体是什么病菌。你提到最近熬夜赶稿，这会让身体更累，容易生病，以后尽量保证睡眠，让免疫力恢复起来。还有，你HIV的治疗还没开始，这很关键——下周再来门诊，我们讨论启动抗病毒药物，它能保护你的免疫系统，减少这类感染。至于手指关节酸痛，可能是天气转冷引起的，如果不严重，先观察一下。有任何不适，随时联系我。"
  },
  {
    "id": 1120,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "患者38岁，自由翻译，常年出差东南亚。此次因“舌头火辣两周、吃辣更痛”来复诊。两周前自测HIV抗体阳性，今日首次查CD4：180个/μL（本院流式）。舌背中部及两颊黏膜满布乳白色伪膜，棉签轻拭可剥脱，露出鲜红渗血面；无溃疡、无白斑增厚。无发热、无吞咽痛、无声音嘶哑。否认既往类似病史，否认抗生素/激素近期使用。体温36.6℃，血压118/74 mmHg，BMI 19.8 kg/m²。患者抱怨“昨晚赶稿到凌晨，今早地铁空调太冷，喉咙干”，但无咳嗽、流涕。实验室其余待回报。",
    "reference_rule": {
      "condition": "CD4+ T 淋巴细胞计数 <200 个/μL",
      "action": "常规进行口咽黏膜检查",
      "contraindication": "null",
      "evidence": "医护人员应重视 HIV 感染者 OPC 风险评估，包括一般状况、HIV 感染状况和口腔状况。对于 CD4+ T 淋巴细胞计数 <200 个/μL 患者建议常规进行口咽黏膜检查。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规诊断与治疗场景，需采用急诊/门诊医生的思维模式。重点关注：快速建立鉴别诊断（口腔念珠菌病 vs 其他口腔黏膜病变），排除危急重症（如急性喉梗阻），并基于指南给出直接诊疗指令。\n\nStep 2: 临床解码 - 关键信息：① CD4+ 180个/μL（重度免疫抑制） ② 舌颊乳白色伪膜可拭除伴渗血（典型鹅口疮体征） ③ 辛辣刺激诱发痛（黏膜敏感性增高） ④ 近期熬夜+受凉史（免疫抑制诱因） ⑤ 无发热/吞咽痛（排除深部真菌感染）。隐式线索：职业特性（频繁出差）提示药物依从性风险。\n\nStep 3: 规则对齐与安全检查 - 完全匹配指南条件（CD4<200个/μL），指南要求常规口咽黏膜检查已执行（伪膜描述充分）。无禁忌症（contraindication null），安全核查：病变未累及喉部（无声嘶/吞咽痛），无全身感染征象。\n\nStep 4: 决策生成 - 核心行动：立即启动抗真菌治疗+ART准备。优先处理疼痛性黏膜感染，预防播散性念珠菌病，同步推进HIV分期治疗。",
    "medical_order": "1. 诊断：口腔念珠菌病（B37.0）；HIV感染伴CD4+<200个/μL（B20）\n2. 治疗：\n   a. 抗真菌：氟康唑 200mg 口服 qd×14天\n   b. 局部护理：4%碳酸氢钠溶液含漱 tid\n   c. 疼痛管理：利多卡因黏附凝胶 局部涂抹 prn\n3. 紧急措施：\n   a. 预约明日HIV病毒载量检测+肝肾功能\n   b. 启动ART用药前教育（今日）\n4. 预防：复方磺胺甲噁唑 480mg 口服 qd（肺孢子菌预防）\n5. 随访：3日后复诊评估黏膜反应，7日后复查CD4+",
    "patient_dialogue": "王先生，您舌头和口腔里这些白膜是典型的'鹅口疮'，就像潮湿墙角长的霉斑一样，是真菌过度生长导致的。好消息是这种感染很好治，我给您开三种药：第一种口服药片专门杀灭真菌，第二种漱口水让口腔环境不适合真菌生长，第三种止痛凝胶随时涂抹缓解火烧感——记住先用棉签轻轻擦掉白膜再涂凝胶，效果更好。\n\n您现在免疫力比较弱（CD4只有180，正常500以上），就像城墙守卫不足，真菌才会乘虚而入。除了用药，要特别注意：避免辛辣/过热饮食刺激伤口，保证7小时睡眠，空调房带条围巾护住脖子。下周复查时我们讨论抗HIV药物，这些药能重建免疫防线，以后就不容易长鹅口疮了。今天先别急着赶稿，好好休息，好吗？"
  },
  {
    "id": 1132,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "患者进门时一股辛辣烧烤味混着廉价漱口水味扑面而来。他摘下头盔，露出因夜间熬夜而浮肿的脸，张口即见舌背与硬腭满布乳凝状白斑，一抹就出血。主诉近两周每送完一单就啃辣条“提神”，一天至少3包；收工后和工友啤酒+烧烤宵夜，凌晨2点才睡。晨起口苦，自行含高度白酒漱口“杀菌”，结果越漱越疼。两天前开始连白粥都吞不下，体重掉了3kg。检查可见义齿边缘亦被白斑波及，义齿夜间就泡在床头矿泉水瓶里。患者搓着手小声问：“医生，我这是不是上火？能不能开点下火药？”",
    "reference_rule": {
      "condition": "OPC 患者",
      "action": "1. 口腔护理：正确刷牙，及时更换牙刷，养成使用牙线的习惯；每日漱口 3~5 次（三餐后和睡前），每次含漱 2~3 min，使药液与口腔黏膜充分接触，避免吞咽；活动性义齿护理（餐后清洁和消毒义齿，夜间将义齿浸泡于 2%~4% NaHCO3 溶液中，或用微波、激光照射灭菌，定期专科调整咬合度）; 2. 饮食与营养：制订富含高蛋白、维生素的膳食计划，控制甜食，忌食辛辣刺激食物，宜少量多餐，戒除烟酒；当口服营养摄入需求无法满足时，需增加肠内外营养; 3. 用药指导：规范使用局部及全身抗真菌药物，观察药物不良反应，提高依从性",
      "contraindication": "null",
      "evidence": "HIV 感染者合并 OPC 患者应加强口腔护理。指导患者养成良好的口腔卫生习惯，包括以下 3 个方面：1. 一般口腔护理，包括正确刷牙，及时更换牙刷，养成使用牙线的习惯；2. 养成漱口习惯，指导正确漱口：每日漱口 3~5 次，建议三餐后和睡前漱口，每次含漱 2~3 min，使药液与口腔黏膜充分接触，避免吞咽；3. 活动性义齿护理，建议餐后清洁和消毒义齿，夜间将义齿浸泡于 2%~4% NaHCO3 溶液中，或用微波、激光照射灭菌，定期专科调整咬合度。制订富含高蛋白、维生素的膳食计划，控制甜食，忌食辛辣刺激食物，宜少量多餐，戒除烟酒。当口服营养摄入需求无法满足时，需增加肠内外营养。指导规范使用局部及全身抗真菌药物，观察药物不良反应，提高依从性。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于生活方式与风险干预场景。作为健康管理师，我的关注重点在于识别患者隐式的不良生活习惯（如高辣饮食、睡眠不足、错误口腔护理），关联其长期健康风险（如营养不良、感染加重或慢性疾病），并用共情但坚定的语气提出非药物干预建议，强调行为改变的重要性。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者病例显示：1. 口腔黏膜满布乳凝状白斑且一抹出血，提示口腔念珠菌病（oral candidiasis，OPC）；2. 主诉高辣零食（如辣条）、啤酒烧烤宵夜、睡眠不足（凌晨2点睡）等不良生活方式；3. 错误自疗（高度白酒漱口）加重疼痛；4. 吞咽困难、体重下降3kg，表明营养不良；5. 义齿护理不当（泡矿泉水瓶），增加感染风险；6. 患者误解为‘上火’，需纠正认知。关键医学术语包括：假膜型口腔念珠菌病、营养缺乏、义齿相关感染风险。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为‘OPC 患者’，患者症状高度匹配（口腔白斑、吞咽困难）。指南Action涵盖口腔护理、饮食营养和用药指导；Contraindication为‘null’，无禁忌症，可安全应用指南。安全检查确认无药物相互作用或禁忌风险（患者无其他共病描述）。\n\nStep 4: 决策生成 (Decision Making) - 基于指南Action，生成决策：1. 口腔护理：指导正确刷牙、牙线使用、漱口规范及义齿消毒；2. 饮食营养：调整膳食为高蛋白高维生素，忌辛辣刺激食物，必要时营养支持；3. 用药指导：规范抗真菌治疗，确保依从性。同时，关联长期风险：若不干预，可能导致感染扩散、慢性营养不良或全身性健康问题，需优先非药物干预。",
    "medical_order": "诊断：口腔念珠菌病（OPC）。\n\n1. 口腔护理：指导正确刷牙（Bass法），每日更换牙刷；养成牙线使用习惯；予氯己定漱口水，每日3~5次（三餐后及睡前），每次含漱2~3分钟，避免吞咽；活动性义齿餐后清洁消毒，夜间浸泡于2%~4% NaHCO3溶液灭菌，定期专科调整咬合度。\n2. 饮食与营养：制订高蛋白、高维生素膳食计划（如瘦肉、蔬菜），控制甜食摄入，严格忌食辛辣刺激食物；宜少量多餐；立即戒酒；评估营养状态，若吞咽困难持续，予肠内外营养支持。\n3. 用药指导：予局部抗真菌药物（如制霉菌素悬液，每日4次涂抹患处）；考虑全身抗真菌治疗（如氟康唑150mg口服，每日1次）；监测药物不良反应（如肝功能），提高患者依从性。\n4. 其他：完善HIV筛查（虽未提及，但指南针对HIV相关OPC）；生活方式咨询（戒烟酒、睡眠调整）。",
    "patient_dialogue": "老弟，看你这情况挺不舒服的啊，脸上都肿了，还疼得吃不下东西，我理解你着急问是不是‘上火’，但这不是简单上火，是口腔里有真菌感染了，叫念珠菌病。别担心，咱们一步步来，很快能好转。\n\n先说口腔卫生：你得改掉那些坏习惯，比如用白酒漱口——这反而加重刺激，越漱越疼。以后每天刷牙要仔细点，用软毛牙刷轻轻刷，饭后记得用牙线清洁牙缝；我开个专用漱口水给你，早中晚饭后和睡前用，含嘴里两三分钟再吐掉，别咽下去。假牙也别随便泡矿泉水瓶了，晚上取下来放小苏打水里泡着杀菌，这样能防感染反复。\n\n饮食上得大调整：辣条、烧烤和啤酒不能再碰了！这些辣的和酒精刺激口腔，让你更疼，还伤胃。换成清淡点的，多吃鸡蛋、鱼肉和蔬菜水果，补充营养。粥喝不下就先吃点软的，像蒸蛋羹，少量多餐。酒必须戒掉，你看体重都掉了，再不注意可能拖垮身体。\n\n我给你开点药膏涂在嘴里，杀菌消炎，坚持用几天就缓解疼痛。另外，早点休息，别熬夜到凌晨——睡眠不足免疫力下降，容易生病。这些改变看起来小，但能预防以后更严重的毛病，比如营养不良或感染扩散。相信我，配合治疗，很快就能吃东西了。有啥不明白的，随时问我！"
  },
  {
    "id": 1148,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "夜间急诊。患者坐在输液椅上，手边是一杯刚拿起的温水，却迟迟不敢入口，一咽就痛得皱眉。陪诊志愿者提到，他昨天开始连抗逆转录病毒药片都吞不下，只能把药碾碎混在酸奶里勉强咽下。查体：口咽后壁及软腭布满乳白色奶酪样斑片，拭去后露出鲜红渗血黏膜；舌背中央亦见融合伪膜。体温37.8℃，心率104次/分，血压108/66 mmHg，呼吸20次/分。指尖血氧97%（空气）。实验室：CD4 42/μL，HIV RNA 86 000 copies/mL；昨日外周血白细胞3.1×10⁹/L，中性粒细胞1.4×10⁹/L；肝功能ALT 52 U/L，TBil 14 μmol/L，ALB 28 g/L；肌酐71 μmol/L。胸片未见明显浸润。患者既往有2次口咽念珠菌病史，均口服氟康唑100 mg 7天后缓解，但本次自行加量至200 mg已3天仍无改善，疼痛反而加重，并出现胸骨后烧灼样不适，夜间常被呛醒。无呕吐、咯血，无皮疹。职业为夜班网约车司机，今晨收班后直接来医院，略显疲惫。患者轻声询问：“医生，这次会不会已经下到食道了？我怕连饭都吃不了，体重又掉。”",
    "reference_rule": {
      "condition": "需要全身用药的 OPC 患者（如进展至念珠菌性食道炎等侵袭性念珠菌病）",
      "action": "1. 氟康唑：初治患者可给予氟康唑 100 mg/d，疗程 7 d；如病情严重或对氟康唑敏感但复发的患者，可增加剂量至 200~400 mg/d，并酌情延长疗程至 2 周; 2. 伊曲康唑混悬液：100 mg/次，1 次/d，进餐时服用可改善吸收，总疗程一般为 7~14 d",
      "contraindication": "伊曲康唑与氟康唑相比，生物利用度较差，药物间相互作用较大。",
      "evidence": "HIV 感染者 OPC 进展至念珠菌性食道炎等侵袭性念珠菌病时，应给予全身抗真菌治疗，若伴随念珠菌性败血症、皮肤、呼吸道、消化道及泌尿生殖道等念珠菌病时，则须相关专科协助综合治疗。全身抗真菌治疗需注意真菌药物与 HIV 药物的相互作用（DDI）。1. 氟康唑：是最常用且可口服吸收的三唑类抗真菌药物，对于唑类敏感的中重度症状 OPC 患者，氟康唑是一线治疗的首选用药。初治患者可给予氟康唑 100 mg/d，疗程 7 d，如病情严重或对氟康唑敏感但复发的患者，可增加剂量至 200~400 mg/d，并酌情延长疗程至 2 周。2. 伊曲康唑：对于氟康唑难治性/不敏感的病例可选择伊曲康唑混悬液，该药为推荐用于 OPC 全身抗真菌治疗的二线药物。伊曲康唑与氟康唑相比，生物利用度较差，药物间相互作用较大。推荐治疗剂量：100 mg/次，1 次/d，进餐时服用可改善吸收，总疗程一般为 7~14 d。"
    },
    "thought": "本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，确保安全优先于疗效。\n- **Step 1: 场景定义 (Scenario Definition)**：患者为HIV感染者（CD4 42/μL，严重免疫抑制）合并进展性念珠菌感染，出现吞咽痛、胸骨后不适及伪膜病变，高度提示念珠菌性食道炎（Candida esophagitis），属于侵袭性真菌病。作为专科专家，我将全网扫描药物相互作用（尤其抗真菌药与抗逆转录病毒药）、禁忌症（如肝毒性）及共病风险（中性粒细胞减少、营养不良）。\n- **Step 2: 临床解码 (Clinical Decoding)**：\n  - 关键隐式线索：患者自行加量氟康唑至200mg/d三天无效且症状加重，提示氟康唑耐药或治疗失败；胸骨后烧灼感及夜间呛醒高度怀疑念珠菌性食道炎；CD4极低（42/μL）和中性粒细胞减少（1.4×10⁹/L）增加感染风险；肝功能轻度异常（ALT 52 U/L）和白蛋白低下（ALB 28 g/L）提示营养缺乏和潜在肝损伤；职业疲劳和体重下降风险需营养干预；抗逆转录病毒药（ART）服用中，但具体药物未明，需警惕药物相互作用（DDI）。\n  - 医学术语转化：诊断念珠菌性食道炎（基于症状和体征）；合并AIDS相关免疫缺陷；中性粒细胞减少症；轻度肝细胞损伤；营养不良状态。\n- **Step 3: 规则对齐与安全检查 (Alignment & Safety)**：\n  - 对齐指南Condition：患者符合“需要全身用药的OPC进展至念珠菌性食道炎”，指南推荐氟康唑或伊曲康唑全身治疗。\n  - 强制禁忌症检查：伊曲康唑生物利用度差且DDI风险高（指南强调），患者ART未指定类型（如含蛋白酶抑制剂可能加重相互作用），且肝功能异常（ALT升高）增加肝毒性风险，故伊曲康唑相对禁忌；氟康唑较安全，但需监测DDI和肝酶。安全优先：避免伊曲康唑，首选氟康唑高剂量静脉给药（确保吸收），并严密监控。\n- **Step 4: 决策生成 (Decision Making)**：根据指南Action（氟康唑可增至200-400mg/d，疗程延长至14天），患者氟康唑200mg口服无效，升级至静脉氟康唑400mg/d以绕过吞咽障碍；疗程14天；同时优化ART、营养支持及监测。排除伊曲康唑因安全风险。",
    "medical_order": "予静脉氟康唑400 mg每日一次；疗程14天。监测肝功能（ALT、AST）每48小时；完善食道内镜检查以确诊念珠菌性食道炎；评估抗逆转录病毒药物类型以排查药物相互作用；予营养支持（高蛋白口服营养补充剂或必要时肠外营养）；一级护理监测生命体征、体重变化及吞咽功能；复查血常规（关注中性粒细胞计数）及HIV病毒载量。",
    "patient_dialogue": "先生，您好，我理解您现在吞咽东西很痛苦，连药片都难以下咽——这说明感染可能已经从喉咙扩散到食道了，这就像伤口发炎更深了，需要更强的治疗来控制。别担心，我们会给您打针（静脉输液），这样药物能直接进入血液起效，避免您再吞咽的痛苦。同时，我们会检查您的肝功能和血液情况，因为这些药物可能影响肝脏，就像机器需要定期保养一样。另外，您体重在下降，我们建议补充高蛋白营养粉或流食，帮助身体恢复力气。记住，您不是一个人，我们会全程监控，确保安全有效。如果胸骨后烧灼感加重或出现发烧，马上告诉我们。"
  },
  {
    "id": 1141,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "患者近10天来舌面及软腭持续灼痛，进食辣味即加重，自觉‘像含着沙子’。自诉已按上次医嘱用完14天氟康唑胶囊（首日400 mg，此后200 mg qd），但白色斑膜反而向咽弓蔓延。既往：①HAART方案（TDF/3TC/DTG）已4年，最近一次病载<50 cp/mL；②CD4+ T细胞连续半年波动于34–48/μL；③20个月内因‘反复口腔白膜’已4次服用氟康唑、2次伊曲康唑口服液。查体：口咽黏膜满布不易刮除的白色奶酪样斑膜，拭去后基底部鲜红渗血；舌背中央可见裂纹伴轻度出血。今日实验室：CD4 42/μL（占比4.1%），血常规WBC 3.1×10⁹/L，肝肾功能正常，空腹血糖5.8 mmol/L。患者补充：‘外卖多、常熬夜剪片子’，无烟酒嗜好。此刻他焦虑地追问：‘医生，这回是不是得换更厉害的药？我嘴里实在疼得睡不着。’",
    "reference_rule": {
      "condition": "抗真菌治疗失败（正规抗真菌治疗 7~14 d 后体征或症状持续存在），CD4+ T 淋巴细胞计数 <50 个/μL 并且反复暴露于唑类抗真菌药物",
      "action": "1. 泊沙康唑口服混悬液 400 mg，2 次/d，持续 28 d; 2. 伏立康唑用于难治性或耐药菌株所致的 OPC 病例; 3. 当出现唑类药耐药或不能耐受时，选择棘白菌素类治疗",
      "contraindication": "null",
      "evidence": "HIV 感染者 OPC 经正规的抗真菌治疗 7~14 d，体征或症状持续存在要考虑抗真菌治疗失败，难治性 OPC 发生率约 4%~5%，好发于 CD4+ T 淋巴细胞计数 <50 个/μL 并且反复暴露于唑类抗真菌药物的患者。对于氟康唑、伊曲康唑等唑类抗真菌药治疗失败的难治性 OPC 患者，可选择泊沙康唑口服混悬液，400 mg，2 次/d，持续 28 d，对 75% 的难治性 OPC 有效。伏立康唑推荐用于难治性或耐药菌株所致的 OPC 病例，其对念珠菌属的抗菌活性高于氟康唑及伊曲康唑，克柔念珠菌对其敏感，光滑念珠菌对其呈剂量依赖性耐药。当出现唑类药耐药或不能耐受时，可选择棘白菌素类治疗。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于复杂合并症治疗场景。重点关注：患者HIV免疫抑制状态（CD4持续<50/μL）、反复唑类暴露史、抗真菌治疗失败进展的交互作用与耐药风险。优先级：排查药物相互作用 > 优化抗真菌方案 > 免疫重建管理。",
      "Step 2: 临床解码": {
        "核心问题": "难治性口腔念珠菌病（OPC）",
        "关键线索": [
          "治疗失败证据：氟康唑规范治疗14天，白膜向咽弓蔓延+疼痛加剧",
          "高危因素：CD4持续<50/μL（当前42/μL）+6次唑类暴露史（符合指南难治性OPC标准）",
          "黏膜损伤体征：斑膜刮除后渗血+舌背裂纹（提示重度感染）",
          "免疫抑制根源：虽HAART病载控制，但CD4未重建（需排查ART方案优化空间）",
          "生活风险：熬夜/外卖（潜在营养缺陷及免疫抑制加重）"
        ]
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "完全符合指南condition：抗真菌治疗失败+CD4<50/μL+反复唑类暴露",
        "禁忌核查": {
          "泊沙康唑": "无绝对禁忌（肝肾功能正常），但需注意：①与DTG存在CYP3A4介导的潜在相互作用（需监测头痛/失眠）②避免与高脂餐同服（降低吸收）",
          "伏立康唑": "备选方案，但光敏性风险（患者熬夜可能户外暴露增加）",
          "棘白菌素": "当前无需静脉用药（保留至唑类完全耐药）"
        },
        "共病风险": "WBC 3.1×10⁹/L（轻度减低），提示需监测抗真菌药骨髓抑制效应"
      },
      "Step 4: 决策生成": {
        "主线方案": "泊沙康唑口服混悬液400mg bid×28d（指南首选，75%难治OPC有效）",
        "辅助治疗": "5%碳酸氢钠漱口液（机械清洁+黏膜修复）",
        "免疫管理": "强化HAART依从性+感染科会诊评估CD4重建方案",
        "风险管控": "①用药7天复诊评估疗效 ②每2周监测肝功能 ③教育避光/限脂饮食"
      }
    },
    "medical_order": "1. 诊断：难治性口腔念珠菌病（B37.01），HIV感染伴重度免疫抑制（B20）\n2. 治疗：\n   - 泊沙康唑口服混悬液 400 mg 口服 每日2次（餐前1h或餐后2h服用） 疗程28天\n   - 5%碳酸氢钠溶液 10 mL 漱口 每日4次\n3. 监测：\n   - 用药第7天复诊评估口腔黏膜病变范围及疼痛VAS评分\n   - 每2周检测肝功能（ALT/AST）、血常规\n4. 会诊：申请感染科会诊评估HAART方案优化（CD4持续<50/μL）\n5. 护理：宣教口腔清洁规范操作及药物服用要点",
    "patient_dialogue": "王先生，您这口腔溃疡加重的情况我们已经找到原因了——是上次用的抗真菌药效果不够强，真菌有些‘耐药’了。别担心，咱们立刻换一种专门对付这种情况的新药！这个药水叫泊沙康唑，您每天早饭前1小时和晚饭后2小时各喝一次，一定要坚持28天才能彻底清除顽固真菌。同时我给您配了苏打水漱口（护士会教您调配），一天四次，能减轻疼痛、帮助修复嘴里破溃的地方。\n\n您免疫力低（CD4细胞只有42）是反复发作的关键，所以抗艾滋病毒的药（TDF/3TC/DTG）必须雷打不动每天按时吃。另外啊，熬夜剪片子和吃外卖这些事得调整：睡眠不足会让免疫力‘雪上加霜’，外卖尽量选清淡的粥面，辛辣的千万避开——您现在嘴里就像有伤口，吃辣就像往伤口上撒盐啊！\n\n这药水用一周后咱们复查看看效果。要是出现皮肤发黄或者恶心，随时联系我。咱们双管齐下，既杀菌又护免疫力，一定能打赢这场仗！"
  },
  {
    "id": 1133,
    "file_name": "HIV感染者口咽念珠菌病管理专家共识.json",
    "case_input": "患者自述近3周口腔灼热、进食辛辣即痛，体重下降4 kg。查体见软腭及舌背覆乳白色伪膜，拭去后黏膜鲜红渗血；口角伴裂隙状糜烂。无发热、吞咽困难及胸骨后疼痛。既往史：2个月前诊断肺孢子菌肺炎，已口服复方新诺明预防；肝功能Child-Pugh A级，eGFR 92 ml/min。实验室：CD4 110/μL，HIV-RNA 4.8 log10 copies/mL；空腹血糖6.2 mmol/L，未诊断糖尿病。近两周自行使用含激素的“复方口腔贴片”每日2片，症状短暂缓解后复发。患者为外卖骑手，担心请假影响收入，希望“尽量只用含片解决问题”。今日复诊，要求医生评估口腔情况并调整用药。",
    "reference_rule": {
      "condition": "HIV 感染者合并 OPC",
      "action": "1. 去除诱发因素; 2. 保持口腔卫生; 3. 根据口咽部黏膜病变程度以及食道或其他深部组织感染情况选择抗真菌治疗方案; 4. 尽早启动 ART",
      "contraindication": "在 HIV 感染者中并不推荐使用抗真菌药物进行 OPC 的一级预防。",
      "evidence": "针对患者口咽部黏膜病变程度以及食道或其他深部组织感染情况选择抗真菌治疗方案。局部抗真菌治疗是 OPC 一线治疗方案，当需要全身抗真菌治疗时应同时进行。全身抗真菌治疗适用于局部治疗效果不佳、对局部治疗不耐受的患者，以及合并食道等其他组织感染风险增加的患者。在 HIV 感染者中并不推荐使用抗真菌药物进行 OPC 的一级预防。OPC 通常预后良好，但临床上，OPC 治疗失败或复发并不少见，原因包括诊断不正确、未能纠正潜在的易感因素，或抗真菌药物治疗不规范。在治疗过程中，去除易感因素和保持口腔卫生是预防 OPC 复发或治疗失败的重中之重。有效的 ART 治疗可以显著减少由念珠菌引起的口腔定植以及 OPC 的发生，因此 HIV 感染者应尽早启动 ART 治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及HIV感染者合并口腔念珠菌病（OPC）。作为专科专家，我将进行全网扫描，重点关注药物相互作用、禁忌症及共病风险，确保安全优先于疗效。Step 2: 临床解码 (Clinical Decoding) - 患者症状（口腔灼热、伪膜拭去后渗血、口角糜烂）和体征（无食道累及迹象如吞咽困难）符合典型OPC表现；体重下降4kg提示营养不良或HIV相关消耗；实验室数据（CD4 110/μL，HIV-RNA 4.8 log10）显示严重免疫抑制和未控制HIV感染；既往史（肺孢子菌肺炎预防用复方新诺明）及空腹血糖6.2 mmol/L指示糖尿病前期风险；隐式线索包括自行使用含激素口腔贴片（可能加重真菌感染并导致复发）和患者职业背景（外卖骑手经济压力），暗示治疗依从性挑战。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 病例与指南Condition（HIV感染者合并OPC）完美匹配；强制检查Contraindication（HIV感染者不推荐抗真菌药用于OPC一级预防），但本案例为治疗场景，无直接违反；安全扫描发现含激素贴片禁忌（激素可抑制免疫，恶化OPC），潜在药物相互作用（如氟康唑可能增加复方新诺明中的磺胺浓度，需剂量调整），共病风险（空腹血糖升高增加糖尿病风险，低CD4升高感染扩散概率）。Step 4: 决策生成 (Decision Making) - 基于指南Action：1. 去除诱发因素（停用含激素贴片）；2. 保持口腔卫生（教育指导）；3. 选择抗真菌方案（局部治疗为一线，但患者复发史提示效果不佳，升级全身治疗）；4. 尽早启动ART（控制HIV根本原因）。决策优先级安全：避免激素，选择氟康唑但监测药物浓度，启动ART并监测血糖。",
    "medical_order": "1. 诊断：HIV感染合并口腔念珠菌病（OPC）。2. 予停用含激素口腔贴片。3. 启动局部抗真菌治疗：克霉唑10mg口腔片，每日5次。4. 鉴于症状复发，予全身抗真菌治疗：氟康唑100mg口服，每日一次，疗程7天；监测复方新诺明浓度以预防药物相互作用。5. 尽早启动抗逆转录病毒治疗（ART）。6. 完善空腹血糖监测及随访。7. 教育患者保持口腔卫生。",
    "patient_dialogue": "王先生，您好！我看您口腔里的白膜和裂口问题挺严重的，咱们得好好处理。首先，您用的那个激素贴片得停掉——它可能让真菌感染更顽固，反而帮倒忙。我会给您换一种专门的抗真菌药片，您含在嘴里慢慢融化，每天几次，这能直接对付感染。另外，您的HIV感染是根本原因，咱们得开始吃ART药了，这能提升免疫力，防止口腔问题再复发。还有，您的血糖有点偏高，平时注意少吃甜食，我会帮您定期查查。我知道您送外卖工作忙，担心请假，但这些治疗能帮您更快恢复，工作起来更轻松。咱们一步步来，好吗？"
  }
]