[
  {
    "id": 1246,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者38岁，男性，自由插画师，独居。8年前确诊HIV-1感染，基线CD4 18/μL，一直未规律抗病毒治疗。近1个月出现午后低热（37.6–38.2℃）、盗汗、干咳伴少量白黏痰，体重下降6kg。外院胸CT示双肺散在结节影及右中叶斑片渗出，痰抗酸染色阳性，Gene-Xpert MTB/RIF阴性，分枝杆菌培养初步报告为鸟-胞内分枝杆菌复合群（MAC）。今日门诊复诊，患者仍诉乏力明显，无胸痛气促，但提及“最近画图熬夜多，咖啡一天4杯”。查体：T 37.8℃，P 94次/分，R 20次/分，BP 118/72mmHg，SpO₂ 96%（RA），口腔黏膜可见轻度鹅口疮；右锁骨上可触及1枚1cm可移动淋巴结，无压痛。实验室：CD4 32/μL，HIV-RNA 185000copies/mL，Hb 102g/L，ALT 38U/L，Cr 0.9mg/dL，TB 0.8mg/dL。胸片与CT对比，病灶略进展。已计划启动抗NTM治疗：克拉霉素500mg bid + 乙胺丁醇15mg/kg qd + 利福布汀300mg qd，并同步启动ART。患者关心药物是否会影响他“接私单赶稿的精力”，并询问“听说抗结核药会和HIV药冲突，我需要调剂量吗？”",
    "reference_rule": {
      "condition": "HIV/AIDS患者合并NTM病且抗NTM方案中含有利福布汀",
      "action": "1. ART方案选择含蛋白酶抑制剂或整合酶抑制剂的方案; 2. 根据药物间相互作用调整利福布汀的剂量",
      "contraindication": null,
      "evidence": "如抗NTM方案中含有利福布汀，可选择含蛋白酶抑制剂或整合酶抑制剂的ART方案，并根据药物间相互作用调整利福布汀的剂量。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于复杂合并症治疗场景，涉及HIV/AIDS合并鸟-胞内分枝杆菌（MAC）肺病及免疫重建问题。重点关注药物相互作用（尤其利福布汀与ART）、免疫抑制状态优化及生活方式风险。Step 2: 临床解码 - 关键医学线索：①严重免疫缺陷（CD4 32/μL，HIV-RNA 18.5万copies/mL）提示ART紧迫性；②MAC肺病活动期（发热、影像进展、培养阳性）；③隐式风险：咖啡因过量（4杯/天）可能加重药物心脏毒性，熬夜及营养不良（体重降6kg）影响治疗耐受性；④鹅口疮警示真菌感染风险。Step 3: 规则对齐与安全检查 - 完全匹配指南条件（HIV+NTM+利福布汀方案），无禁忌症。但需全网扫描：利福布汀是强CYP3A4诱导剂，可降低非核苷类逆转录酶抑制剂（NNRTI）血药浓度；克拉霉素与蛋白酶抑制剂（PI）联用增加QT间期延长风险。Step 4: 决策生成 - 依据指南action：①ART选用整合酶抑制剂（INSTI）方案（避免与利福布汀冲突）；②利福布汀剂量需下调（因INSTI可能升高其血药浓度）。同时需管理合并症：抗真菌治疗鹅口疮、纠正贫血、限制咖啡因。",
    "medical_order": "1. 启动ART方案：比克替拉韦/恩曲他滨/丙酚替诺福韦（BIC/FTC/TAF）每日1片（优选INSTI基础方案，规避利福布汀相互作用）。2. 调整抗NTM方案：克拉霉素500mg bid + 乙胺丁醇15mg/kg qd + 利福布汀150mg qd（原300mg减量，因与INSTI联用需防蓄积）。3. 予氟康唑200mg qd×7天治疗口腔念珠菌病。4. 监测：治疗第2周复查肝肾功能、CD4/HIV-RNA；每月胸片评估NTM病灶。5. 生活方式干预：严格限制咖啡因（≤1杯/天），保持规律作息。6. 营养支持：高蛋白口服营养补充剂每日2次。",
    "patient_dialogue": "王先生，咱们的治疗方案需要微调一下，就像给精密仪器做校准。第一，您的HIV药会换成一种叫'比克替拉韦'的新组合，每天一片就行。这药和抗分枝杆菌的利福布汀配合更安全，但利福布汀得从每天300mg降到150mg——因为两药相遇时，剂量太高可能让您头晕或关节疼。第二，您嘴里的白膜是真菌感染，需要加一周抗真菌药片。第三，您提的精力问题特别重要！刚开始吃药一两周可能会有点累，就像手机充电初期反应慢点，但坚持规律服药后精力反而会改善。不过您每天4杯咖啡得减到1杯，咖啡因和这些药叠加可能让心跳过快或失眠，咱们可不能让您赶稿时手抖呀！最后，您这一个月瘦了6公斤，我给您开点营养粉，睡前冲一杯，帮您把创作体力补回来。两周后咱们再聊聊感觉如何，随时打我电话！"
  },
  {
    "id": 1217,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者2周前右手背出现一无痛性紫红色结节，逐渐扩大并沿前臂内侧呈“孢子丝菌样”条索状蔓延，伴低热（最高37.8℃）、夜间盗汗。无咳嗽、咯血、体重下降。既往HIV感染8年，CD4 110/μL，病毒载量<50 cp/mL，规律服用比克替拉韦/恩曲他滨/丙酚替诺福韦。否认海鲜养殖或鱼缸清洁史，但回忆3个月前洗车时手背曾被金属刮破，未处理。查体：右手背2.5 cm质韧结节，表面无破溃，沿前臂静脉走向可触及3枚串珠样皮下结节，最大1.2 cm，局部皮温不高，无波动感。今日门诊胸片未见异常，CRP 18 mg/L，ESR 52 mm/h。门诊护士小声提醒：‘老师，他结节样子像龟分枝杆菌，但培养还没出。’患者焦急追问：‘医生，我这是不是癌？还能开车养家吗？’",
    "reference_rule": {
      "condition": "海洋分枝杆菌病患者",
      "action": "1. 克拉霉素或米诺环素或多西环素或复方磺胺甲噁唑或利福平 + 乙胺丁醇共3个月",
      "contraindication": "对异烟肼和吡嗪酰胺耐药",
      "evidence": "克拉霉素或米诺环素或多西环素或复方磺胺甲噁唑或利福平 + 乙胺丁醇共3个月。对异烟肼和吡嗪酰胺耐药。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景，我的关注重点是快速建立鉴别诊断（如非结核分枝杆菌感染 vs. 孢子丝菌病 vs. 恶性肿瘤），排除危急重症（如播散性感染或癌症转移），并给出直接的诊疗指令。Step 2: 临床解码 (Clinical Decoding): 患者为HIV感染者伴免疫抑制（CD4 110/μL），ART治疗有效（病毒载量<50 cp/mL），皮肤表现为无痛性紫红色结节伴条索状蔓延，呈‘孢子丝菌样’特征，结合外伤史（3个月前金属刮破）、低热（37.8℃）、夜间盗汗及炎症标志物升高（CRP 18 mg/L，ESR 52 mm/h），提示非结核分枝杆菌感染（如海洋分枝杆菌或龟分枝杆菌）；胸片正常排除了肺部分散病变，无体重下降或咯血进一步排除恶性肿瘤或结核播散。隐式线索：免疫抑制增加非典型感染风险，护士提示‘龟分枝杆菌’强化此方向。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南条件‘海洋分枝杆菌病患者’与患者表现高度匹配（外伤相关皮肤感染）；行动为克拉霉素、米诺环素、多西环素、复方磺胺甲噁唑或利福平+乙胺丁醇共3个月；强制检查禁忌：指南明确对异烟肼和吡嗪酰胺耐药，患者无相关用药史，故安全；但需安全检查：患者ART（比克替拉韦/恩曲他滨/丙酚替诺福韦）可能与利福平有相互作用（利福平降低ART浓度），优先选择无相互作用方案（如克拉霉素或多西环素）。Step 4: 决策生成 (Decision Making): 基于指南行动，选择克拉霉素经验性治疗（避免利福平潜在风险），疗程3个月；同时等待分枝杆菌培养以确诊，排除其他如孢子丝菌病。",
    "medical_order": "诊断：皮肤非结核分枝杆菌感染（疑似海洋分枝杆菌或龟分枝杆菌）。治疗：予口服克拉霉素 500 mg bid（每日两次），疗程3个月；监测炎症标志物（每2周复查CRP、ESR）；完善分枝杆菌培养及药敏试验以确认病原体；继续抗逆转录病毒治疗（比克替拉韦/恩曲他滨/丙酚替诺福韦）。随访：每2周门诊复诊评估结节消退情况，如培养结果异常需调整方案。",
    "patient_dialogue": "别太担心，您这个情况不是癌症，而是一种细菌感染，很可能是三个月前洗车时刮伤引起的。我们会给您开一种叫克拉霉素的抗生素，每天吃两次，坚持三个月就能治好。您现在的症状像低烧和盗汗，都是感染引起的，等治疗开始后就会好转。开车养家没问题，只要按时吃药，您就能完全康复。记住，有任何不舒服随时告诉我，我们一起处理好。"
  },
  {
    "id": 1239,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者近4个月出现晨起咳黄脓痰夹血丝，伴盗汗及每月2kg的体重下降。胸部CT（2024-03-15）示右中叶2.1cm厚壁空洞，周围斑片影，痰GeneXpert MTB阴性，但NTM PCR回报“鸟-胞内分枝杆菌复合群阳性”，培养已第3次长出同一菌株。抗分枝杆菌三联方案（阿奇500mg/d+乙胺丁醇15mg/kg/d+利福布丁300mg/d）已足量使用11个月，最近一次痰培养转阴记录为2024-02-28，但复查CT空洞直径反而增至2.7cm，壁增厚并邻近胸膜牵拉。患者目前氧合指数正常，但走10米即感气促；实验室：Hb 94g/L，Alb 28g/L，Cr 72μmol/L，ALT 46U/L。既往：AIDS（HAART方案：TAF/FTC+DTG，依从性>95%），乙肝小三阳（HBV DNA<20IU/ml），无糖尿病及心血管病史。患者为夜班网约车司机，担心术后无法继续工作。胸外科会诊意见尚未形成，家属对“手术是否值得”意见分歧。",
    "reference_rule": {
      "condition": "首次诊断为NTM肺病或疾病进展为难治性肺病的患者",
      "action": "1. 考虑行肺切除术; 2. 肺切除术适用于病灶局限的重症NTM肺病患者; 3. 肺切除术应通过多学科专家讨论评估后进行; 4. 在NTM肺病肺切除术前，首先进行抗菌药物治疗，持续治疗至培养转阴12个月后",
      "contraindication": "若患者为孤立NTM结节、无其他NTM肺病特征，外科手术切除后，无需抗菌药物治疗",
      "evidence": "当患者首次诊断为 NTM 肺病或疾病进展为难治性肺病时，可考虑行肺切除术。肺切除术适用于病灶局限的重症 NTM 肺病患者。肺切除术应通过多学科专家讨论评估后进行。在 NTM 肺病肺切除术前，首先进行抗菌药物治疗，持续治疗至培养转阴 12 个月后。若患者为孤立 NTM 结节、无其他 NTM 肺病特征，外科手术切除后，无需抗菌药物治疗。"
    },
    "thought": "本案例属于复杂合并症治疗场景。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保患者安全（安全 > 疗效）。\n\n**Step 1: 场景定义 (Scenario Definition)**\n本案例涉及AIDS、乙肝和进展性NTM肺病（鸟-胞内分枝杆菌复合群）的复杂合并症，属于复杂合并症治疗场景。重点关注药物相互作用（如抗分枝杆菌药与HAART的潜在冲突）、禁忌症（如手术风险因素）和共病管理（如免疫抑制和营养不良），以确保决策的安全性优先。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例中提取关键信息：患者为进展性NTM肺病（痰培养第3次阳性，CT示右中叶空洞从2.1cm增至2.7cm，壁增厚伴胸膜牵拉，提示治疗失败），伴活动性症状（咳黄脓痰夹血丝、盗汗、体重下降每月2kg、气促10米即发）。合并症包括AIDS（HAART：TAF/FTC+DTG，依从性>95%）和乙肝小三阳（HBV DNA<20IU/ml），实验室显示贫血（Hb 94g/L）、低蛋白血症（Alb 28g/L）和轻度肝损伤（ALT 46U/L）。隐式线索：体重下降和盗汗暗示消耗状态；Hb和Alb低提示营养不良，可能影响手术耐受性；合并HIV和乙肝增加药物肝毒性风险；CT进展（空洞增大）表明抗菌治疗无效，需升级干预。社会因素：家属对手术分歧，患者职业依赖体力（网约车司机），担忧术后失业。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南Condition适用于“首次诊断为NTM肺病或疾病进展为难治性肺病的患者”，本案例CT进展符合“疾病进展为难治性肺病”。强制检查Contraindication：指南指出“若患者为孤立NTM结节、无其他NTM肺病特征，外科手术切除后无需抗菌治疗”，但本例非孤立结节（CT示周围斑片影和空洞，伴全身症状），故Contraindication不适用。安全扫描：药物相互作用风险高（利福布丁可降低HAART中DTG的浓度，可能导致HIV控制失败）；共病风险包括AIDS免疫抑制（增加感染和愈合延迟风险）、乙肝（HAART保护但需监测）、贫血和低蛋白血症（增加手术并发症风险）；优先级安全：继续当前抗菌治疗风险高（CT进展），但手术前需优化营养和药物交互管理。\n\n**Step 4: 决策生成 (Decision Making)**\n根据指南Action：1. 考虑肺切除术（病灶局限在右中叶，符合重症NTM肺病）；2. 肺切除术需多学科讨论评估；3. 术前应抗菌治疗至培养转阴12个月，但患者培养转阴仅1个月（2024-02-28）且CT进展，提示治疗失败，需调整方案。决策：鉴于安全优先，建议立即组织多学科会诊（胸外科、感染科、呼吸科）评估手术适应症，同时优化抗菌治疗和支持治疗，以降低风险。不直接手术，因术前条件未达标（培养转阴不足12个月）。",
    "medical_order": "1. 予多学科会诊（胸外科、感染科、呼吸科）评估肺切除术适应症及风险。2. 优化抗分枝杆菌治疗：复查痰培养及药敏试验，考虑调整方案（如替换利福布丁以降低与HAART相互作用）。3. 支持治疗：予营养支持（高蛋白饮食，必要时静脉补充白蛋白），纠正贫血（铁剂补充，监测Hb）。4. 监测：完善肝功能（ALT）、HIV病毒载量及HBV DNA检测，每周随访症状及氧合指数。5. 暂缓手术决策，待会诊后定。",
    "patient_dialogue": "您好，我看了一下您的检查结果，咱们得好好谈谈。您的肺CT显示那个空洞有点变大了，说明现在的药可能不太管用，需要换种方式处理。不过别担心，我们不会急着开刀——您目前的身体状况，像贫血和营养不足，会让手术风险增加。另外，您吃的HIV药和肺药可能互相影响，我们需要专家团队一起讨论：胸外科医生看看手术是否安全有效，感染科医生调调药，呼吸科医生监测肺功能。同时，您得加强营养，多吃鸡蛋、瘦肉这些高蛋白食物，帮助身体恢复力气；我们还会检查肝功能和病毒情况，确保一切稳定。我知道您担心工作，手术确实可能影响开车，但咱们一步步来，专家会帮您评估最安全的方案。家属有不同意见很正常，等讨论出结果，我会详细解释给您听。现在重点是稳住身体，好吗？"
  },
  {
    "id": 1212,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者近6周出现午后低热（37.6–38.3℃）、盗汗及体重下降5kg，伴干咳无痰。胸部CT示右肺上叶斑片影伴空洞，痰涂片抗酸染色阳性，GeneXpert MTB/RIF阴性，分枝杆菌培养回报：堪萨斯分枝杆菌，rpoB基因测序确认利福平耐药。血常规：WBC 3.1×10⁹/L，Hb 98g/L；肝肾功能：ALT 42U/L，Cr 76μmol/L。既往：依非韦伦/替诺福韦/拉米夫定抗病毒方案，依从性可；糖尿病前期，未用药。今日复诊，患者自述服药后恶心明显，仍每日傍晚发热，夜间需换两件汗湿T恤。诊室空调26℃，他仍抱着羽绒服喊冷。其母陪同，小声嘀咕‘是不是结核又犯了’，患者本人更关心‘能不能换点不伤肝的药’。",
    "reference_rule": {
      "condition": "利福平耐药的堪萨斯分枝杆菌病患者",
      "action": "1. 异烟肼900mg口服，1次/d + 维生素B6 50mg口服，1次/d + 乙胺丁醇25mg·kg⁻¹·d⁻¹ + 磺胺甲噁唑1g，3次/d 或联用大环内酯类药物; 2. 疗程至培养阴性后15个月; 3. 疗效不佳者可加用左氧氟沙星或莫西沙星等其他敏感药物",
      "contraindication": null,
      "evidence": "对利福平耐药的堪萨斯分枝杆菌病患者，建议异烟肼（900 mg口服，1次/d）、维生素B6（50 mg口服，1次/d）、乙胺丁醇（25 mg·kg-1·d-1）加磺胺甲噁唑（1 g，3次/d）或联用大环内酯类药物。疗程至培养阴性后 15 个月。疗效不佳者可加用左氧氟沙星或莫西沙星等其他敏感药物。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为专科专家，重点关注全网扫描药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。需仔细评估患者HIV感染、糖尿病前期等合并症对治疗方案的影响，确保用药安全。Step 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者症状（午后低热、盗汗、体重下降、干咳）和检查结果（CT示肺空洞、痰涂片阳性、培养确诊利福平耐药堪萨斯分枝杆菌）提示非结核分枝杆菌感染未控制；实验室异常（WBC 3.1×10⁹/L提示白细胞减少，Hb 98g/L提示贫血）可能源于感染或药物副作用；HIV背景（依非韦伦/替诺福韦/拉米夫定抗病毒治疗依从可）增加免疫抑制风险；糖尿病前期未干预可能加重感染；患者主诉服药后恶心、持续发热盗汗，反映当前治疗无效或副作用显著。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition匹配（利福平耐药的堪萨斯分枝杆菌病患者），无明确Contraindication。但安全检查：异烟肼与依非韦伦可能相互作用增加肝毒性风险（尽管ALT正常）；磺胺甲噁唑可能导致骨髓抑制（WBC已低）；乙胺丁醇剂量需基于体重计算；患者恶心症状需对症处理；糖尿病前期需监测血糖以避免恶化。Step 4: 决策生成 (Decision Making) - 基于指南Action，选用异烟肼+维生素B6+乙胺丁醇+磺胺甲噁唑方案；因疗效不佳（持续发热盗汗），加用左氧氟沙星；为安全计，添加止吐药缓解恶心，加强监测；管理糖尿病前期；疗程设定至培养阴性后15个月，但需先确认当前培养状态。",
    "medical_order": "1. 予抗感染治疗：异烟肼900mg口服每日一次 + 维生素B6 50mg口服每日一次 + 乙胺丁醇25mg/kg/d口服（患者体重约70kg，予1750mg每日一次） + 磺胺甲噁唑1g口服每日三次。2. 因症状持续，加用左氧氟沙星500mg口服每日一次。3. 对症处理：予昂丹司琼4mg口服每日三次缓解恶心。4. 监测：每周复查血常规、肝肾功能；每月复查痰培养；完善空腹血糖及HbA1c评估糖尿病前期。5. 生活方式干预：建议糖尿病饮食及适度运动。",
    "patient_dialogue": "王先生，我完全理解您的担心——您说吃药后恶心难受，还担心伤肝，这很正常。咱们先解决这些不适：我会给您换一种止吐药，帮助减轻恶心感。您的感染（就是那个导致发热和盗汗的病菌）需要几种药物联合治疗，我会选对肝脏影响最小的方案，同时每周抽血检查肝功能和血象，确保一切安全。您母亲提到的‘结核’其实是一种类似但不同的病菌，现在我们已经确认了，所以我会调整药物组合，加上一种新药来控制发烧和出汗。另外，您有糖尿病前期，咱们得注意饮食，多吃蔬菜、少糖少油，每天散步30分钟，这能帮您恢复更快。坚持治疗，几周后症状会好转的；我们一起努力，好吗？"
  },
  {
    "id": 1233,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者近3个月仅表现为间断低热（最高37.6℃）与轻微干咳，无咯血、盗汗或体重下降。胸部HRCT：右中叶外侧段一1.3 cm薄壁空洞，周围少许条索影，与6个月前外院片对比空洞径线无变化。痰GeneXpert MTB/RIF×2次阴性，分枝杆菌培养回报：Mycobacterium avium复合群，药敏显示对克拉霉素、利福布汀、乙胺丁醇、阿米卡星均高度耐药（MIC>32 μg/mL）。血肌酐96 μmol/L，ALT 58 U/L，白细胞2.9×10^9/L。患者自述高龄母亲需照顾，担心抗NTM药物副作用，尤其顾虑「打针会走不动路」。今日门诊气温骤降，他顺便提到「左膝有点酸胀，可能是老痛风」。",
    "reference_rule": {
      "condition": "NTM肺病患者且符合以下情况之一：症状较轻微；胸部影像学检查提示病灶较局限；经动态随访变化不明显；药敏试验结果为广泛高度耐药；仅用目前的药物难以取得理想的疗效；耐受性较差的高龄患者",
      "action": "1. 不进行抗分枝杆菌治疗",
      "contraindication": null,
      "evidence": "对以下几种情况的 NTM 肺病患者可不进行抗分枝杆菌治疗：(1)症状较轻微；(2)胸部影像学检查提示病灶较局限；(3)经动态随访变化不明显；(4)药敏试验结果为广泛高度耐药；(5)仅用目前的药物难以取得理想的疗效；(6)耐受性较差的高龄患者。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为专科专家，我将进行全网扫描，重点关注药物相互作用、禁忌症及共病风险（如痛风、肝肾功能异常），优先级确保安全大于疗效。Step 2: 临床解码 (Clinical Decoding) - 患者临床表现轻微（间断低热37.6℃、轻微干咳，无结核典型症状），影像学稳定（右中叶1.3 cm薄壁空洞6个月无变化），微生物学提示鸟分枝杆菌复合群感染且广泛高度耐药（对克拉霉素等MIC>32 μg/mL），实验室异常（白细胞减少2.9×10^9/L提示免疫抑制风险、ALT升高58 U/L暗示肝损伤、肌酐96 μmol/L提示轻度肾功能不全），共病包括痛风发作（左膝酸胀）和患者因素（高龄、照顾责任、担忧药物副作用如阿米卡星注射可能导致行动障碍）。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 与指南Condition匹配：症状轻微、病灶局限稳定、随访无变化、药敏广泛耐药、难以取得理想疗效、耐受性较差（高龄+实验室异常），完全符合“不进行抗分枝杆菌治疗”条件；指南Contraindication为null，无直接禁忌；全网扫描：药物相互作用（无治疗药物，故无风险），共病风险（痛风需对症处理、肝肾功能异常需监测），安全优先级确保避免潜在副作用。Step 4: 决策生成 (Decision Making) - 基于指南Action，决定不启动抗分枝杆菌治疗，但需监测共病和症状变化。",
    "medical_order": "1. 不予抗分枝杆菌治疗。2. 随访观察：每3个月复查胸部HRCT、血常规、肝肾功能（ALT、Cr）及症状评估。3. 对症处理：左膝酸胀疑痛风发作，予非甾体抗炎药（如布洛芬）口服缓解疼痛，监测尿酸水平。4. 生活方式指导：避免高嘌呤饮食，戒烟酒，适量饮水。5. 急诊指征：若出现高热、咯血或行动障碍加重，立即就诊。",
    "patient_dialogue": "张先生，我看您最近主要是有点低烧和干咳，但不算严重，CT检查也显示肺里的那个小空洞很稳定，半年都没变化。这次化验发现是一种叫鸟分枝杆菌的细菌，但有个问题——它对常用药物都很耐药，治疗效果可能不太理想。考虑到您还要照顾母亲，而且您担心打针会腿脚不便，我们如果强行治疗，副作用风险很大，比如可能伤肝伤肾或让您更虚弱。所以，我建议咱先别用那些抗菌药，定期复查就行。另外，您说左膝盖酸胀，这可能是老痛风犯了，我可以开点止痛药帮您缓解。平时注意多喝水、少吃海鲜和内脏，别喝酒。如果咳嗽加重、发高烧或膝盖疼得厉害，一定马上来医院看看，好吗？"
  },
  {
    "id": 1231,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者38岁，男性，自由插画师，因“持续低热、盗汗、咳嗽伴进行性气短3周”第三次回到感染科门诊。既往：确诊HIV感染6年，抗病毒治疗（TDF/FTC/DTG）依从性尚可，但近半年失访；2个月前因“右前臂皮下结节”在外院行切开引流，术后病理提示肉芽肿性炎症，培养回报“偶然分枝杆菌”。今日查体：T 37.9 °C，HR 102次/分，RR 24次/分，SpO₂ 92%（未吸氧），右上臂可见3 cm愈合瘢痕，局部无渗出；双肺基底部可闻散在爆裂音。实验室：WBC 3.2×10⁹/L，Hb 96 g/L，ALB 28 g/L，Scr 78 μmol/L；痰AFB涂片阴性，GeneXpert MTB/RIF阴性，但7日前痰培养（BACTEC MGIT）报警，今日初步鉴定为偶然分枝杆菌，药敏正在进行。胸CT：双肺多发结节伴树芽征，右中肺薄壁空洞直径1.6 cm。患者诉夜间盗汗明显，需每日更换睡衣，轻微活动即感气促，无法完成平素绘图工作。今日门诊药房来电提醒：患者上次未领取阿米卡星，询问是否继续开具。",
    "reference_rule": {
      "condition": "偶然分枝杆菌病患者",
      "action": "1. 阿米卡星 + 头孢西丁 + 丙磺舒共2～6周; 2. 然后口服复方磺胺甲噁唑或多西环素共2～6个月; 3. 对于肺部感染，至少用2种经药敏试验检测敏感的药物治疗，直至痰培养阴性持续12个月",
      "contraindication": "偶然分枝杆菌对所有标准抗结核药物耐药",
      "evidence": "可选择阿米卡星+头孢西丁+丙磺舒共2～6周，然后口服复方磺胺甲噁唑或多西环素共2～6个月。2种敏感药物口服治疗6～12个月通常有效。偶然分枝杆菌对所有标准抗结核药物耐药。对偶然分枝杆菌肺部感染，至少用2种经药敏试验检测敏感的药物治疗，直至痰培养阴性持续12个月。"
    },
    "thought": "本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，优先确保患者安全。Step 1: 场景定义 – 患者合并HIV感染和偶然分枝杆菌肺部感染，涉及多重药物管理、免疫功能低下和营养状态不良，需全网扫描潜在风险。Step 2: 临床解码 – 关键信息：38岁男性，HIV感染者（抗病毒治疗TDF/FTC/DTG，依从性差致失访半年），偶然分枝杆菌感染（右臂病理及痰培养确认，肺部CT示结节、树芽征和空洞），症状包括低热、盗汗、气短（活动耐量下降）；实验室异常：白细胞减少（WBC 3.2×10⁹/L）、贫血（Hb 96 g/L）、低蛋白血症（ALB 28 g/L）；药敏未出但培养阳性；药房提示阿米卡星未领取。解码：免疫缺陷宿主合并机会性感染（偶然分枝杆菌肺炎），需评估药物交叉影响和共病（如贫血加重药物毒性）。Step 3: 规则对齐与安全检查 – 指南Condition '偶然分枝杆菌病患者'匹配；Contraindication '对所有标准抗结核药物耐药'确认，故禁用异烟肼等结核药。安全检查：HIV抗病毒药物DTG与阿米卡星（氨基糖苷类）无显著相互作用，但头孢西丁和丙磺舒可能轻微影响肾排泄（患者Scr 78 μmol/L正常，仍需监测）；丙磺舒或增加DTG浓度，需警惕；共病风险：低蛋白血症可能增强药物毒性，贫血和白细胞减少提示免疫抑制需支持；优先级安全>疗效，药敏未出但症状急迫，可启动经验治疗。Step 4: 决策生成 – 基于指南Action，启动阿米卡星+头孢西丁+丙磺舒静脉方案；同时恢复HIV治疗，加强营养支持；待药敏结果调整口服阶段。",
    "medical_order": "1. 抗感染治疗：予阿米卡星静脉滴注（剂量按体重计算），头孢西丁静脉滴注，丙磺舒口服，共2～6周；密切监测肾功能、电解质及耳毒性。2. HIV管理：恢复抗病毒治疗（TDF/FTC/DTG），评估依从性并安排定期随访。3. 支持治疗：予营养支持（高蛋白饮食），必要时低流量吸氧维持SpO₂ >95%；完善痰培养药敏试验，后续根据结果调整至口服复方磺胺甲噁唑或多西环素，目标痰培养阴性持续12个月。4. 监测：每周复查血常规、肝肾功能、痰培养；胸CT复查于治疗4周后。",
    "patient_dialogue": "张先生，您好！看到您这段时间一直受低烧、盗汗和喘气困扰，还影响了画画工作，真是辛苦了。别担心，我们一起来解决这个问题。您肺部和手臂的感染是一种特殊细菌引起的，不是普通结核，所以需要一种强效的注射治疗来对付它——我们会给您打两种抗生素针（阿米卡星和头孢西丁），再加一种口服药（丙磺舒），连续用几周。打针期间，我们会检查您的肾功能和听力，因为这些药可能有点刺激，但早期监控就能避免问题。同时，您之前的HIV药得重新开始吃，这很重要，因为它能保护您的免疫力，帮助身体打败感染。另外，您血里的蛋白有点低，说明营养不足，建议多吃鸡蛋、瘦肉或蛋白粉，这样身体才有力气康复。等化验结果出来，我们再换成口服药片，坚持几个月就能好转。现在，您先休息好，少活动防止气喘加重；药房那边我已经安排好了，今天就能拿药开始治疗。坚持下来，您一定能恢复画画工作的！"
  },
  {
    "id": 1225,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者38岁，男性，网约车司机，今日因“咳嗽伴低热6周”到感染与免疫门诊复诊。既往：HIV-1感染11年，基线CD4 18 cells/μL，病毒载量>1×10⁶ copies/mL；3个月前痰分枝杆菌培养回报鸟-胞内分枝杆菌复合群阳性，已按《共识》启动抗NTM治疗（利福平600 mg qd + 克拉霉素500 mg bid + 乙胺丁醇15 mg/kg qd）。目前体温37.6 ℃，体重较上月下降3 kg，伴夜间盗汗，无咯血。实验室：CD4升至62 cells/μL，HIV-RNA 2.4×10⁴ copies/mL；ALT 48 U/L，Cr 92 μmol/L，Hb 102 g/L。患者自诉跑车常忘服药，担心药物“冲突”，但尚未向医生具体咨询ART调整。今日门诊需评估下一步抗病毒方案。",
    "reference_rule": {
      "condition": "HIV/AIDS患者合并NTM病且抗NTM方案中含有利福平",
      "action": "1. ART方案选择齐多夫定（AZT）/替诺福韦（TDF）/阿巴卡韦（ABC）+拉米夫定（3TC）+依非韦伦（EFV）; 2. EFV使用标准剂量600mg/d",
      "contraindication": null,
      "evidence": "如果抗NTM方案中含有利福平，ART方案可选择齐多夫定（AZT）/替诺福韦（TDF）/阿巴卡韦（ABC）+拉米夫定（3TC）+依非韦伦（EFV）。研究证实，利福平与EFV合用，利福平对EFV的影响不大，EFV仍使用标准剂量（600 mg/d）。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于复杂合并症治疗场景，重点关注HIV合并鸟-胞内分枝杆菌复合群感染的双重治疗。需全网扫描药物相互作用，优先级：药物安全性 > 疗效优化 > 依从性管理。",
      "Step 2: 临床解码": {
        "核心问题": "1. 持续免疫抑制状态（CD4 62/μL）伴NTM治疗反应不足（6周低热+盗汗+体重下降） 2. HIV病毒抑制失败（RNA 2.4×10⁴） 3. 关键药物冲突风险（利福平诱导CYP450） 4. 依从性障碍（漏服+职业限制） 5. 贫血（Hb 102）及肝功轻度异常（ALT 48）",
        "隐式风险": "利福平显著降低NNRTI/PI类ART血药浓度；克拉霉素可能增强EFV神经毒性；漏服加速耐药突变"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "完全符合'HIV合并含利福平NTM方案'条件",
        "安全筛查": {
          "禁忌症排除": "指南无绝对禁忌，但需规避：①AZT（加重贫血）②TDF（需监测肾功）③大剂量EFV（肝功能预警）",
          "个体化调整": "优先ABC方案（无骨髓抑制/肾毒性），EFV 600mg/d维持（利福平诱导效应已纳入指南）",
          "交互作用": "克拉霉素+EFV需监测神经精神症状"
        }
      },
      "Step 4: 决策生成": "执行指南推荐方案（ABC+3TC+EFV），同步启动：①NTM疗效评估 ②依从性强化 ③肝功/贫血监测"
    },
    "medical_order": "1. 调整ART方案：阿巴卡韦（ABC）600mg qd + 拉米夫定（3TC）300mg qd + 依非韦伦（EFV）600mg qn（睡前服） 2. 维持当前抗NTM方案（利福平600mg qd + 克拉霉素500mg bid + 乙胺丁醇15mg/kg qd） 3. 完善检查：痰抗酸杆菌涂片+培养、胸部CT、HLA-B*5701基因检测（ABC用药前） 4. 监测：治疗4周复查CD4/HIV-RNA、肝功能、血常规 5. 营养支持：予高蛋白口服营养补充剂",
    "patient_dialogue": "王师傅，咱们今天重点解决两个事：第一是调整抗艾滋病毒的药，第二是帮您更好坚持用药。您现在的退烧药（利福平）会影响某些抗病毒药效果，我给您换成三种更匹配的药：早上吃两片白药丸（ABC和3TC），睡前吃一粒黄药丸（EFV）。这样和您现有的退烧药不会'打架'，也不用额外加量。不过EFV可能让人做梦多，您开车前如果觉得头晕一定告诉我。另外您说常忘记吃药，我特别理解，跑车确实不方便。咱们试试两个办法：①把药盒放水杯边，每次喝水就吃药 ②我让护士帮您设手机用药提醒。您体重掉了3公斤，我开点营养粉，您泡在保温杯里随时喝。两周后咱们再聊聊用药感受，好吗？"
  },
  {
    "id": 1237,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者近6周出现非刺激性咳嗽，少量白黏痰，无血；每日午后低热37.6–38.1 ℃，盗汗明显；4 kg体重下降。自诉在社区医院按‘细菌性肺炎’口服阿奇霉素5天、左氧氟沙星7天，症状无改善。今日步行至门诊，天气寒冷，他仍穿薄外套，咳嗽频繁，语音稍颤。体格检查：口唇轻度发绀，右下肺听诊可闻少量爆裂音；心率96次/分，SpO₂ 94%（室内空气）。胸片示右肺下野斑片影伴小结节，未见空洞。患者职业为外卖骑手，担心收入，反复询问‘能不能只做抽血，不做那些复杂检查？’。目前仍在自行服用复方磺胺甲噁唑（2片bid）‘预防卡肺’，未停药。无咯血、胸痛及气促加重，无禽类或土壤接触史，近期无旅行。",
    "reference_rule": {
      "condition": "疑似NTM感染患者",
      "action": "1. 检测痰液、诱导痰、支气管冲洗液、支气管肺泡灌洗液或支气管活组织标本; 2. 尽可能选择无创或微创方法采样; 3. 呼吸道标本在采集24小时内进行检测（若不能及时处理，应4℃保存）; 4. 不应使用口咽拭子培养或血清学检测; 5. 若痰培养阴性但临床高度怀疑NTM感染，应用纤维支气管镜行支气管灌洗获取肺泡灌洗液检测; 6. 在留置标本前，停用氨基糖苷类、大环内酯类、四环素、复方磺胺甲噁唑、利奈唑胺等抗菌药物2周",
      "contraindication": "不应使用口咽拭子培养或血清学检测来诊断NTM肺部感染",
      "evidence": "对于疑似 NTM 肺病患者，可检测痰液、诱导痰、支气管冲洗液、支气管肺泡灌洗液或支气管活组织标本，应尽可能选择无创或微创方法采样以降低操作风险，呼吸道标本应在采集 24 h 内进行检测（若不能及时处理，应 4℃ 保存）。不应使用口咽拭子培养或血清学检测来诊断 NTM 肺部感染。若痰培养阴性，但临床高度怀疑 NTM 感染的可能时，可应用纤维支气管镜行支气管灌洗获取肺泡灌洗液进行检测，条件许可情况下，在 B 型超声或 CT 引导下进行病灶穿刺，获取穿刺液标本。服用抗菌药物（氨基糖苷类、大环内酯类、四环素、复方磺胺甲 唑、利奈唑胺）会影响 NTM 生长。若考虑患者有 NTM 感染可能，在留置标本前，应停用上述抗菌药物 2 周。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于常规门诊诊疗场景，因患者主动步行至门诊就诊，无急性危及生命的症状（如气促加重、胸痛或咯血）。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如肺结核、非结核分枝杆菌（NTM）感染、真菌感染或结节病），优先排除危急重症（如活动性肺结核进展），并给出直接、高效的检查和处理指令。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例中提取关键信息并转化为医学术语：患者症状（慢性咳嗽6周、午后低热37.6–38.1℃、盗汗、4kg体重下降）提示慢性炎症或感染；抗细菌治疗无效（阿奇霉素和左氧氟沙星）表明可能非典型病原体；体格检查（口唇发绀、右下肺爆裂音、SpO₂ 94%）提示轻度缺氧和肺部病变；胸片（右下肺斑片影伴小结节，无空洞）支持肺部感染或间质性疾病，如NTM感染或肺结核。隐式线索：患者自行服用复方磺胺甲噁唑可能抑制NTM生长，干扰诊断；职业（外卖骑手）暴露于空气污染，但无特定接触史，增加非特异性感染风险；经济顾虑可能影响依从性。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n病例与指南Condition“疑似NTM感染患者”高度匹配：症状、胸片和治疗无效均符合NTM感染特征。强制检查Contraindication：必须避免口咽拭子或血清学检测（指南明确禁止）。安全风险：患者正在服用复方磺胺甲噁唑（指南列出的干扰药物），可能影响标本培养结果；SpO₂ 94%显示轻度低氧，但无急性恶化，暂不需紧急干预。\n\n**Step 4: 决策生成 (Decision Making)**\n基于指南Action：优先无创方法（痰液检测），确保标本24小时内处理；停用干扰药物2周；若痰培养阴性，升级至支气管镜。决策：立即停用复方磺胺甲噁唑，收集痰标本进行分枝杆菌培养和抗酸染色；密切监测生命体征；若结果阴性，则计划支气管肺泡灌洗以确诊NTM感染。",
    "medical_order": "诊断：疑似非结核分枝杆菌（NTM）肺部感染。\n处理：1. 立即停用复方磺胺甲噁唑。2. 收集晨痰标本3份，行分枝杆菌培养及抗酸染色（AFB stain），标本4℃保存并24小时内送检。3. 监测生命体征（心率、SpO₂），予鼻导管低流量氧疗（1-2L/min）维持SpO₂ >95%。4. 若痰培养阴性，预约纤维支气管镜行支气管肺泡灌洗（BAL）检测。5. 暂缓其他抗菌药物使用。",
    "patient_dialogue": "李师傅，您先坐稳，别着急。我看了您的症状——咳嗽、下午发烧、晚上出汗多，还有体重掉了不少，这些情况持续一个多月了，之前的抗生素没效果，说明可能不是普通肺炎。咱们得查清楚是什么原因，比如一种叫NTM的细菌感染。为了准确诊断，您得先停掉那个预防药（复方磺胺甲噁唑），因为它会影响检查结果。然后，咱们做个简单的痰液检查：您早上咳点痰出来，我们送去化验，这样不会太麻烦，也不用复杂设备。我知道您跑外卖工作忙，担心耽误收入，但这个检查很重要，能帮我们找准病根，避免乱吃药白花钱。要是结果出来还不清楚，我们再商量下一步。现在您的血氧有点低，我先给您吸点氧，让呼吸舒服些。您觉得这样安排行吗？"
  },
  {
    "id": 1223,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者6周前左小腿外侧被竹片划伤，初为黄豆大丘疹，随后中央破溃形成边缘潜行的深溃疡，基底部呈黄色坏死，无明显疼痛。自行外用草药后溃疡扩大至4×6 cm，伴轻度渗液，夜间低热37.8℃。既往：10年前确诊HIV，抗病毒治疗依从性尚可；2年前曾患肺结核，已完成标准疗程。无糖尿病、无肝病。查体：消瘦，左小腿溃疡边缘呈特征性“烧瓶样”下潜，周围皮肤发绀，可触及条索状结节沿淋巴管向膝部延伸，左腹股沟可触及1枚1.5 cm质韧淋巴结。实验室：CD4 42/μl，HIV RNA <20 cp/ml；CRP 42 mg/L，ESR 78 mm/h；空腹血糖5.1 mmol/L，肝肾功能正常。溃疡边缘活检PCR检出溃疡分枝杆菌DNA，抗酸染色阳性，培养待报。胸片未见活动性结核。患者诉近期因雨季道路泥泞，每日需赤足涉水往返工地搬运水泥，担心“这口子是不是又要像上次结核一样吃一年药”。",
    "reference_rule": {
      "condition": "溃疡分枝杆菌病患者",
      "action": "1. WHO推荐利福平 + 链霉素共8周; 或 2. 利福平 + 环丙沙星作为替代治疗",
      "contraindication": null,
      "evidence": "WHO推荐利福平 + 链霉素共 8 周。利福平 + 环丙沙星可作为替代治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，优先确保治疗方案的安全性（安全 > 疗效）。患者存在HIV感染伴严重免疫抑制（CD4 42/μl），以及既往结核病史，需全网扫描潜在药物冲突和共病影响。\nStep 2: 临床解码 (Clinical Decoding) - 关键信息包括：溃疡分枝杆菌感染确诊（活检PCR阳性、抗酸染色阳性），伴淋巴管播散（条索状结节、腹股沟淋巴结肿大）和全身炎症（低热、CRP 42 mg/L、ESR 78 mm/h）；HIV免疫抑制控制良好（RNA <20 cp/ml），但CD4低增加感染风险；无糖尿病或肝肾功能异常；患者暴露于环境水源（赤足涉水）可能加剧感染，并表达对长期治疗的焦虑（类似既往结核经历）。隐式线索：免疫缺陷可能延长愈合，需警惕继发感染或药物毒性。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南针对溃疡分枝杆菌病推荐利福平 + 链霉素8周或利福平 + 环丙沙星替代。无禁忌症（contraindication null），但安全扫描：利福平可能降低部分抗HIV药物浓度（如依非韦伦），需协调ART；链霉素有肾毒性/耳毒性风险（尽管肝肾功能正常，仍需监测）；环丙沙星QT延长风险低，但患者无心脏病史。优先级安全：避免药物相互作用，优选利福平+链霉素，并强化监测。\nStep 4: 决策生成 (Decision Making) - 基于指南和安全性，启动利福平 + 链霉素8周方案；协调抗HIV治疗优化；同时管理伤口和炎症，确保治疗依从性。",
    "medical_order": "诊断：溃疡分枝杆菌感染（左小腿），HIV感染伴免疫抑制。\n治疗：\n1. 抗菌治疗：予利福平 600mg 口服 每日一次 + 链霉素 1g 肌注 每日一次，疗程8周。\n2. ART协调：咨询传染病科，评估并优化抗逆转录病毒治疗方案，监测潜在药物相互作用。\n3. 伤口护理：外科清创溃疡基底部，予湿敷换药 每日一次，观察边缘愈合及渗液。\n4. 监测：每周复查CRP、ESR；基线及每2周检测肾功能（肌酐、尿素氮）、听力；随访溃疡培养及抗酸染色结果；体温监测每日。\n5. 随访：门诊复诊每1周，评估治疗反应及副作用。",
    "patient_dialogue": "王先生，您好，咱们先说说您腿上的这个伤口。检查结果出来了，这是由一种叫溃疡分枝杆菌的细菌引起的感染，和您之前的结核不一样，所以治疗方式也会不同。别担心，这次我们计划用两种药——一种口服的利福平和一种打针的链霉素，大约8周时间，比您上次结核治疗短得多。如果不及时治，这个感染可能顺着腿往上走，变得更严重。我们会帮您清创伤口，每天换药，您需要按时打针吃药。同时，您的HIV药物控制得不错，但我们得确保这两种药不会互相影响，所以会调整一下方案。我知道您担心长期吃药，但这次疗程短，咱们一起加油，争取早日好起来。工作中尽量穿鞋保护伤口，好吗？"
  },
  {
    "id": 1228,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者2个月前发现右颈一黄豆大皮下结节，伴轻微胀痛，未发热。自行外敷中草药后结节迅速增大至鸽蛋大小，表面皮肤发红，中心软化破溃，持续流出稀薄奶酪样分泌物，无明显臭味。当地诊所予头孢+左氧氟沙星口服10天无改善，转诊至我院感染科。\n\n查体：消瘦，BMI 18.4 kg/m²；右颈胸锁乳突肌前缘可见3 cm×2 cm溃疡，基底呈暗红色肉芽，边缘潜行，轻压有稀薄脓液自窦道溢出；同侧颌下及颈深可触及2枚1.5 cm质韧淋巴结，活动度差，轻触痛。口腔黏膜可见白斑，双肺呼吸音清，未及啰音。\n\n既往史：8年前确诊HIV感染，曾间断服用替诺福韦+拉米夫定+依非韦伦，自行停药2年；无结核及乙肝病史。实验室：CD4 42/μL，HIV-RNA 5.8×10⁵ cp/mL；WBC 3.8×10⁹/L，Hb 102 g/L，ALB 28 g/L；ALT/AST 正常；Cr 72 μmol/L。颈部超声示多发低回声团块，最大2.3 cm，中央液化。窦道脓液抗酸染色阳性（2+），GeneXpert MTB/RIF阴性；分枝杆菌培养4周报阳，初步鉴定为瘰疠分枝杆菌（M. scrofulaceum），药敏待回。\n\n干扰信息：患者为夜班出租车司机，担心“破相”影响工作，反复询问能否只做小切口引流尽快愈合。",
    "reference_rule": {
      "condition": "瘰疠分枝杆菌病患者",
      "action": "1. 手术切除; 2. 很少需要药物治疗，但可选择克拉霉素 + 氯法齐明，加用或不加用乙胺丁醇",
      "contraindication": "体外试验对异烟肼、利福平、乙胺丁醇、阿米卡星、环丙沙星耐药",
      "evidence": "手术切除。很少需要药物治疗。体外试验对异烟肼、利福平、乙胺丁醇、阿米卡星、环丙沙星耐药，对克拉霉素、链霉素、红霉素敏感，可选择克拉霉素 + 氯法齐明，加用或不加用乙胺丁醇。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于复杂合并症治疗场景，患者同时存在瘰疠分枝杆菌感染、HIV/AIDS（CD4极低、病毒载量高）、营养不良（低BMI、低白蛋白）及潜在药物依从性问题。作为博学的专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。需评估手术可行性、药物选择与HIV治疗的整合，并考虑患者社会因素（如工作压力影响治疗决策）。\n\n**Step 2: 临床解码 (Clinical Decoding)**：关键信息包括：1. 显性线索：右颈溃疡伴潜行边缘、稀薄脓液、淋巴结肿大（提示慢性分枝杆菌感染），窦道脓液培养确诊为瘰疠分枝杆菌；免疫抑制（CD4 42/μL）、消瘦（BMI 18.4 kg/m²）、贫血（Hb 102 g/L）、低白蛋白（ALB 28 g/L）表明严重营养不良和HIV进展期。2. 隐性线索：HIV自行停药史暗示依从性差；口腔白斑提示潜在机会性感染风险；社会因素（夜班工作）可能加剧伤口愈合延迟和治疗中断；GeneXpert MTB/RIF阴性排除了结核，但需警惕其他机会感染。整体转化为医学术语：AIDS相关免疫缺陷性瘰疠分枝杆菌皮肤淋巴结感染、慢性溃疡伴窦道形成、蛋白质-能量营养不良综合征。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南Condition为瘰疠分枝杆菌病患者，与患者脓液培养阳性高度匹配。Contraindication明确对异烟肼、利福平、乙胺丁醇、阿米卡星、环丙沙星耐药，需避免使用。全网扫描风险：1. 药物相互作用：克拉霉素（CYP3A4抑制剂）可能影响HIV抗病毒药（如依非韦伦），需选整合酶抑制剂（如多替拉韦）；氯法齐明有皮肤色素沉着风险，但无绝对禁忌。2. 禁忌症：患者Cr正常，无肝损伤（ALT/AST正常），药物方案可行。3. 共病风险：免疫抑制增加术后感染风险；低白蛋白（<30 g/L）延迟伤口愈合；HIV未控制需紧急重启治疗；社会因素可能影响手术接受度。安全优先：手术切除为首选，但需优化营养和HIV控制以降低风险。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南Action（手术切除为主，药物治疗为辅），生成决策：1. 立即手术切除病灶（安全优先，避免小切口引流以防复发）。2. 药物治疗选择克拉霉素 + 氯法齐明（药敏待回前作为经验治疗），不加乙胺丁醇（因指南为可选且耐药风险）。3. 整合HIV治疗重启（换用低相互作用方案）和营养支持。决策依据：手术根除感染源，药物治疗辅助清除残余菌，同时管理共病以确保整体安全。",
    "medical_order": "1. 手术切除右颈部溃疡及受累淋巴结，确保完整病灶清除，术后予换药及引流护理。2. 药物治疗：予克拉霉素 500 mg PO BID + 氯法齐明 100 mg PO QD，待药敏结果回示后调整。3. 重启HIV抗病毒治疗：予替诺福韦 + 拉米夫定 + 多替拉韦 PO QD（避免依非韦伦以减药物相互作用）。4. 营养支持：予肠内营养补充（高蛋白口服营养剂），目标ALB >35 g/L。5. 监测：术后每日伤口评估；每周复查WBC、Hb、ALB及CD4；4周后复查分枝杆菌培养。",
    "patient_dialogue": "老张啊，我理解您担心伤口影响工作，但咱们得一步步来，才能彻底解决问题。首先，您脖子上的这个感染，光靠小切口引流不行——它像树根一样藏在里面，不做彻底清除的话，容易反复发作，反而耽误您更久的工作。我建议做个手术，把整个感染区域切干净，这样愈合后疤痕不会太明显，而且恢复快。手术前，我们会给您用两种口服药（克拉霉素和氯法齐明），专门针对这个病菌，帮助防止它再长出来。另外，您HIV的药也得重新开始吃，这次我们换了个更安全的组合，避免和新药冲突。您身体有点虚弱，我们会加些营养补充剂，帮您长点肉，这样伤口好得快，也能早点回去开车。别太担心，咱们一起努力，争取让您尽快康复上岗！"
  },
  {
    "id": 1226,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者34岁男性，因“间断低热、盗汗、体重下降8 kg”来诊。近3周出现咳嗽伴少量白黏痰，无明显胸痛。既往：确诊HIV感染1年，从未启动ART，CD4 42 cells/μL，HIV-RNA 4.8 log10 copies/mL。一周前外院CT示双肺多发结节伴空洞，痰抗酸染色阳性，结核PCR阴性，分枝杆菌培养初步报告为鸟-胞内分枝杆菌复合群（MAC）。今日查体：T 37.8 ℃，P 98次/分，R 22次/分，SpO₂ 93%（室内空气），BMI 18 kg/m²，口腔白斑明显。实验室：Hb 98 g/L，ALB 28 g/L，CRP 46 mg/L，肝肾功能正常。胸片提示病灶较外院略有进展。患者诉近期经营夜市烧烤摊，熬夜频繁，否认吸烟饮酒。无头痛、颈强直或视觉障碍，但自诉偶有双拇指麻木。目前尚未使用任何抗分枝杆菌或抗病毒药物，等待本次门诊制定治疗方案。",
    "reference_rule": {
      "condition": "确诊NTM病且还未接受ART的患者",
      "action": "1. 在抗NTM治疗后2周后开始ART; 2. 合并播散性及中枢神经系统NTM病患者，建议在抗NTM治疗至少4周后开始ART",
      "contraindication": "不建议同时或早期ART",
      "evidence": "确诊NTM病且还未接受ART的患者，可以考虑在抗NTM治疗后2周后开始ART，以减少药物间相互作用，减少药物负担和降低免疫重建炎性综合征（Immune reconstitution inflammatory sydrome, IRIS）的发生。合并播散性及中枢神经系统NTM病患者ART的最佳时机尚待研究，临床研究提示早期ART可能增加不良反应和病死率，故不建议同时或早期ART，建议在抗NTM治疗至少4周后开始。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，焦点是处理HIV感染合并鸟-胞内分枝杆菌复合群（MAC）感染。作为专科专家，我将全网扫描药物相互作用、禁忌症及共病风险，优先确保安全（安全 > 疗效），包括评估ART启动时机、潜在IRIS风险、药物负担和共病管理。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者34岁男性，关键症状（低热、盗汗、体重下降8kg）和影像（CT双肺多发结节伴空洞）提示播散性感染；痰培养MAC确诊NTM病；HIV感染（CD4 42 cells/μL，高病毒载量）导致严重免疫抑制；口腔白斑指示口腔念珠菌病；实验室异常（Hb 98 g/L贫血、ALB 28 g/L低蛋白血症、CRP 46 mg/L炎症）反映营养不良和慢性炎症；胸片进展显示病情恶化；职业暴露（夜市烧烤摊、熬夜）可能加剧感染风险；双拇指麻木需评估HIV相关周围神经病变。隐式线索包括：CD4极低增加机会感染风险，BMI 18 kg/m²提示营养不足需干预，痰抗酸染色阳性但结核PCR阴性强化MAC诊断，无CNS症状（如头痛）排除了中枢神经系统播散。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为‘确诊NTM病且还未接受ART的患者’，病例匹配（MAC确诊、未ART）。无播散性及中枢神经系统NTM证据（无CNS症状，仅偶有双拇指麻木），故适用Action 1（抗NTM治疗后2周开始ART）。强制检查Contraindication：指南明确‘不建议同时或早期ART’，以避免IRIS和药物相互作用风险；安全扫描发现ART与抗NTM药物（如大环内酯类）可能产生相互作用（如QT间期延长），需监测；共病风险包括口腔念珠菌病、贫血和神经病变。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action 1，决策为：立即启动抗NTM治疗针对MAC；在抗NTM治疗2周后启动ART；同时管理共病（口腔念珠菌病抗真菌治疗、营养支持、神经病变评估）。优先安全：避免ART早启，减少IRIS风险。",
    "medical_order": "1. 立即启动抗分枝杆菌治疗针对鸟-胞内分枝杆菌复合群（MAC），予克拉霉素500 mg口服每日2次 + 乙胺丁醇15 mg/kg口服每日1次 + 利福布汀300 mg口服每日1次，监测肝肾功能和药物不良反应。2. 计划在抗NTM治疗2周后启动抗逆转录病毒治疗（ART），方案待定（需基线CD4和病毒载量评估）。3. 予氟康唑100 mg口服每日1次治疗口腔念珠菌病，疗程7天。4. 营养支持：高蛋白饮食，补充维生素，必要时肠内营养干预。5. 完善周围神经病变评估：肌电图检查。6. 监测生命体征、痰培养及胸片，每2周随访。7. 生活方式建议：避免烟雾暴露，保证充足睡眠。",
    "patient_dialogue": "先生，你好。咱们先聊聊你的情况：你最近发烧、出汗多、体重下降，还有咳嗽，这些检查都显示你肺部有一种叫MAC的细菌感染，而且你的HIV感染也需要处理。现在咱们的治疗计划是：第一步，我会给你开一些药，专门对付这个肺部感染，你得按时吃，这样能控制住症状。等吃上两周后，咱们再开始HIV的药物，因为如果一起开始，身体可能反应太大，容易出副作用，这样更安全。另外，你嘴里那些白斑，是种真菌感染，我给你开点药涂抹，很快会好起来。营养方面，你体重掉得不少，一定要多吃鸡蛋、瘦肉这些高蛋白食物，喝点牛奶，别太累。你提到手指偶尔发麻，这可能是神经问题，咱们需要做个简单检查看看原因。最后，你晚上摆摊熬夜，这身体吃不消啊，尽量调整下时间，多休息，少吸油烟，对恢复很重要。咱们一步一步来，别担心，我会陪你一起搞定。"
  },
  {
    "id": 1245,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者3周前无明显诱因出现38.5–39.8 ℃弛张热，伴黄绿脓痰及左胸钝痛；1周前双上肢与腹部陆续出现黄豆至鸽蛋大疼痛性皮下结节，色暗红，局部皮温升高。外院曾予头孢曲松–阿奇霉素5天无改善。入院查体：T 39.2 ℃，P 112 次/分，R 24 次/分，BP 105/60 mmHg；消瘦，BMI 18 kg/m²；左下肺叩浊、呼吸音低；腹部及四肢可触及12枚1–3 cm皮下结节，部分中央波动感。实验室：WBC 3.4×10⁹/L，Hb 92 g/L，CRP 146 mg/L，PCT 0.9 ng/mL；CD4 42/μL，HIV-RNA 180 000 cp/mL；肝肾功能正常。胸部CT：左下叶后基底段厚壁空洞2.8 cm，周围磨玻璃影，并右侧少量胸腔积液；腹部CT：皮下脂肪层多发环形强化灶，部分伴液化。痰及皮下脓液抗酸涂片阳性（3+），TB-DNA GeneXpert阴性；分枝杆菌快速培养4天报阳，初步鉴定为脓肿分枝杆菌，药敏提示克拉霉素MIC 0.25 mg/L（敏感），erm(41)基因测序显示T28序列型（可诱导耐药）。患者目前仍高热，每日峰值39.5 ℃，咳脓痰量约100 mL/日，皮下结节最大已增至4 cm并自行破溃渗脓。护士记录其夜间因疼痛需坐睡，食欲差，24 h尿量正常，无腹泻。患者职业为酒吧驻唱，担心面部留疤影响工作，反复询问“是不是结核？会不会传染朋友？”",
    "reference_rule": {
      "condition": "肺或播散性脓肿分枝杆菌病患者，且对克拉霉素敏感或证实为诱导型大环内酯类耐药",
      "action": "1. 起始阶段：静脉应用阿米卡星、替加环素、亚胺培南（若耐受），口服克拉霉素或阿奇霉素（若耐受）联合治疗4周; 2. 维持阶段：阿米卡星雾化治疗和口服大环内酯类（阿奇霉素或克拉霉素），同时根据药敏试验及患者耐受度联合使用下列1～3种口服药物：氯苯吩嗪、利奈唑胺、米诺环素或强力霉素、莫西沙星或环丙沙星、复方磺胺甲噁唑; 3. 培养转阴12个月后，继续抗菌药物治疗至少12个月",
      "contraindication": "若阿米卡星耐药或存在16S rRNA基因突变，应停用阿米卡星",
      "evidence": "肺或播散性：起始抗菌药物治疗阶段（包括静脉和口服抗菌药物）和维持抗菌药物治疗阶段。起始阶段：对克拉霉素敏感的脓肿分枝杆菌分离菌株感染或证实为诱导型大环内酯类耐药患者，起始阶段静脉应用阿米卡星、替加环素、亚胺培南（若耐受），口服克拉霉素或阿奇霉素（若耐受）联合治疗 4 周。应根据感染严重程度、治疗反应和对药物的耐受程度决定静脉治疗时间。为了减少治疗相关的恶心和呕吐，在应用替加环素和（或）亚胺培南时，可加用止吐药昂丹司琼和（或）阿瑞吡坦。若无法注射应用氨基糖苷类药物、存在注射禁忌或需长期使用氨基糖苷类药物的脓肿分枝杆菌肺病患者，可考虑阿米卡星雾化治疗。对阿米卡星耐药的脓肿分枝杆菌或脓肿分枝杆菌分离株中存在可导致耐药的 16S rRNA 基因突变，应停用阿米卡星，改用其他抗菌药物。维持阶段：对克拉霉素敏感的脓肿分枝杆菌感染或证实为诱导型大环内酯类耐药患者，维持阶段使用阿米卡星雾化治疗和口服大环内酯类（阿奇霉素或克拉霉素），同时根据药敏试验及患者耐受度联合使用下列1～3种口服药物：氯苯吩嗪、利奈唑胺、米诺环素或强力霉素、莫西沙星或环丙沙星、复方磺胺甲噁唑。培养转阴12个月后，脓肿分枝杆菌病患者应继续应用抗菌药物治疗至少12个月。若培养无法转阴，患者也能从长期抑菌治疗中获益。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。患者存在播散性脓肿分枝杆菌感染（累及肺部和皮下组织），并合并未控制的HIV感染、营养不良及免疫抑制状态。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全性（如避免肾毒性、药物交互），再优化疗效。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：① 感染特征：弛张热、黄绿脓痰、胸痛、皮下结节破溃，CT示左下肺厚壁空洞及皮下环形强化灶，提示肺和播散性脓肿分枝杆菌感染；药敏显示克拉霉素敏感但erm(41)基因T28序列型（诱导型耐药）。② 合并症：HIV阳性未控制（CD4 42/μL, HIV-RNA 180 000 cp/mL），免疫抑制风险高；WBC 3.4×10⁹/L和Hb 92 g/L指示贫血和白细胞减少；消瘦（BMI 18 kg/m²）与食欲差提示营养不良；职业相关焦虑（担心面部留疤和传染）。隐式线索：HIV未抗病毒治疗可能加剧感染，营养状态差影响药物耐受；皮下结节破溃增加传播风险；疼痛管理需求（夜间坐睡）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition匹配：患者为播散性脓肿分枝杆菌病，克拉霉素敏感且证实诱导型耐药。指南Action适用起始阶段静脉联合治疗。安全检查：① 药物相互作用：阿米卡星（肾毒性风险，需监测肾功能）；替加环素（恶心呕吐风险，需止吐药）；克拉霉素与潜在HIV抗逆转录病毒药物（如蛋白酶抑制剂）可能交互，需协调ART。② 禁忌症：无阿米卡星耐药或16S rRNA突变（药敏未提示），但HIV免疫抑制增加感染复发风险；肝肾功能正常但需基线监测。③ 共病风险：HIV未控制需启动ART；营养不良需营养支持；疼痛需管理；传染风险低（非结核，但破溃伤口需隔离）。优先级安全：先评估药物耐受，避免叠加毒性。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action：起始阶段静脉阿米卡星、替加环素、亚胺培南（耐受前提下），口服克拉霉素联合4周；维持阶段过渡到阿米卡星雾化+口服克拉霉素+1-2种口服药（基于药敏）。针对共病：添加HIV抗逆转录病毒治疗（ART）、营养支持、疼痛控制及伤口护理；监测指标包括培养转阴（目标维持治疗≥12个月）。确保方案安全：首剂量前评估肾功能，加用止吐药预防副作用。",
    "medical_order": "1. 起始抗菌治疗：静脉阿米卡星 10 mg/kg/d、替加环素 50 mg q12h、亚胺培南 500 mg q6h；口服克拉霉素 500 mg bid；持续4周。予昂丹司琼 8 mg iv q8h 预防恶心呕吐。2. 支持治疗：予高热量肠内营养支持；皮下结节伤口清创换药 qd；疼痛管理予对乙酰氨基酚 650 mg q6h prn。3. HIV管理：启动抗逆转录病毒治疗（如TDF/FTC/DTG方案），监测CD4和病毒载量。4. 监测：每日体温、出入量；每周血常规、肝肾功能、CRP；每2周痰及脓液培养、药敏；胸部及腹部影像复查 q4w。5. 感染控制：接触隔离，指导伤口覆盖。6. 后续：4周后评估转维持阶段（阿米卡星雾化 500 mg bid + 口服克拉霉素 500 mg bid + 根据药敏加口服药如莫西沙星 400 mg qd）。",
    "patient_dialogue": "王先生，您好。我先说说咱们的诊断结果：这不是结核病，而是一种叫脓肿分枝杆菌的感染，它导致了您的高烧、咳嗽和皮肤上的肿块。好消息是，这种细菌对某些药物敏感，我们可以控制它。不过，您同时有HIV感染，这需要我们一并处理。\n\n接下来，治疗计划是：我们会给您打几种针剂和口服药连续4周，主要是杀灭细菌、退烧和止痛。打针时可能会有点恶心，我们会给您加药预防；口服药您按时吃就行。皮肤上的破溃伤口，护士会每天帮您清洁包扎，减少留疤风险——我知道您在酒吧工作担心这个，咱们会尽量用温和的方法处理。\n\n关于传染性：这细菌不像结核那样容易传给别人，但破溃的伤口还是有点风险，所以请盖好伤口、勤洗手，避免直接接触他人。您朋友的感染风险很低，别太担心。\n\n另外，您的HIV需要开始吃药控制，这能帮您身体更好对抗感染。我们会给您营养品补充体力，帮助恢复。现在您还疼得厉害吧？我们给您止痛药，晚上能睡安稳些。\n\n这病治疗时间会较长，可能超过一年，但配合得好，预后不错。咱们一步一步来，您有疑问随时问我，好吗？"
  },
  {
    "id": 1221,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者今日复诊，右前臂外侧可见两处相邻紫红色结节，中心溃破伴稀薄脓性渗出，边缘呈潜行性，触痛（+）。自述6周前结节仅米粒大，近两周迅速增大并破溃，夜间低热37.8℃。无咳嗽、气促。既往：确诊HIV感染7年，目前服多替拉韦+拉米夫定+替诺福韦，CD4 42 cells/μL，VL<20 cp/mL；2年前曾患皮肤龟分枝杆菌感染，当时未规范治疗，自行停药。实验室：WBC 3.1×10⁹/L，Hgb 102 g/L，CRP 18 mg/L，ESR 65 mm/h；肝肾功能正常。胸部CT未见异常。今日气温骤降，患者仍骑电动车往返工地做焊工，未佩戴护袖。",
    "reference_rule": {
      "condition": "皮肤龟分枝杆菌病患者",
      "action": "1. 克拉霉素500mg口服，2次/d，共6个月",
      "contraindication": null,
      "evidence": "皮肤龟分枝杆菌病：克拉霉素（500 mg口服，2次/d）共6个月。"
    },
    "thought": "本案例属于复杂合并症治疗场景，因为患者同时存在HIV感染（免疫缺陷状态）和疑似复发性皮肤龟分枝杆菌感染，涉及多重共病风险和潜在药物相互作用。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全性。\n\n从病例中提取关键信息：患者右前臂皮肤病变（紫红色结节、溃破伴脓性渗出、潜行性边缘、触痛）结合2年前龟分枝杆菌感染未规范治疗史，提示可能为龟分枝杆菌感染复发；HIV感染（CD4 42 cells/μL、VL<20 cp/mL）导致严重免疫缺陷，增加感染难治性风险；实验室指标（WBC 3.1×10⁹/L提示中性粒细胞减少风险、Hgb 102 g/L提示轻度贫血、CRP 18 mg/L和ESR 65 mm/h提示炎症活动）支持活动性感染；隐式线索包括患者暴露于寒冷环境和工作污染（焊工未护袖），可能加重伤口感染，以及既往自行停药史，反映依从性问题。\n\n将解码信息与指南Condition（皮肤龟分枝杆菌病患者）对齐：当前病变和病史高度匹配该条件。指南Action为克拉霉素500mg口服，2次/d，共6个月。Contraindication为null，无明确禁忌症。强制安全检查：克拉霉素作为大环内酯类抗生素，与患者当前HIV药物（多替拉韦+拉米夫定+替诺福韦）相互作用风险较低（多替拉韦与克拉霉素无显著药动学冲突），但需警惕克拉霉素可能轻度增加QT间期延长风险，且患者免疫缺陷状态要求强化感染控制措施。\n\n基于指南Action生成决策：启动克拉霉素治疗500mg口服，2次/d，疗程6个月；同时添加辅助措施以管理共病风险，包括伤口护理、实验室监测和生活干预，确保安全优先。",
    "medical_order": "予克拉霉素500mg口服，每日两次，疗程6个月；加强伤口局部护理：生理盐水清洗，无菌敷料覆盖，每日换药；监测血常规（重点关注WBC）、CRP、ESR，每2周复查；评估HIV治疗依从性，维持多替拉韦+拉米夫定+替诺福韦方案；建议避免皮肤暴露，穿长袖防护服；1月后复诊评估疗效。",
    "patient_dialogue": "张先生，我看您手臂上的伤口又复发了，这很可能是您以前那个龟分枝杆菌感染的问题又回来了。您有HIV感染，身体抵抗力比较弱，所以咱们得抓紧治疗。我给您开一种叫克拉霉素的药，每天吃两次，每次一粒500mg的，要坚持吃半年，这样才能彻底杀死细菌，防止它再反复发作。这个药和您现在的HIV药物配合起来是安全的，我会定期检查您的血象，确保没有副作用。\n\n另外，您每天骑电动车去工地，天气冷还光着胳膊，这伤口容易沾灰感染，会更难好。下次出门一定穿上长袖衣服或者戴个护袖，保护好伤口。平时清洗伤口时用点温水轻轻冲，再用干净纱布包好，别让它碰脏东西。您之前自己停药可能让这次复发更严重了，这回咱们得一起坚持下去，好吗？坚持治疗，伤口很快会好转的，别担心！"
  },
  {
    "id": 1218,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者因“间断低热、盗汗、体重下降9 kg”第三次入院。查体：消瘦，右颈部及锁骨上可触及2枚2 cm质韧淋巴结，表面皮肤暗红，无破溃；双肺底细湿啰音；SpO₂ 92%（室内空气）。实验室：Hb 89 g/L，CRP 78 mg/L，ESR 95 mm/h；痰AFB涂片阳性，GeneXpert MTB/RIF阴性；分枝杆菌培养初步报告：革兰阳性棒状杆菌，45 ℃生长，对硝基苯甲酸（PNB）耐受。胸腹CT：双肺多发结节伴空洞，肝脾低密度小结节。肾功正常。已予复方磺胺甲噁唑预防PCP。患者自述因工地赶工常漏服抗病毒药，近期雨季宿舍潮湿，关节疼痛但可忍受。今日查房，护士提醒他昨天夜间仍37.8 ℃低热，希望医生尽快给出抗感染方案以便出院回工地。",
    "reference_rule": {
      "condition": "戈登分枝杆菌病患者",
      "action": "1. 利福平 + 乙胺丁醇、卡那霉素或环丙沙星、利奈唑胺",
      "contraindication": "戈登分枝杆菌对异烟肼耐药",
      "evidence": "可考虑利福平 + 乙胺丁醇、卡那霉素或环丙沙星、利奈唑胺。戈登分枝杆菌通常为寄生菌，并不致病，对异烟肼耐药。"
    },
    "thought": "本案例属于复杂合并症治疗场景。作为专科专家，我将全网扫描药物相互作用、禁忌症和共病风险，优先确保治疗安全性（安全 > 疗效）。Step 1: 场景定义 – 患者存在多重问题：戈登分枝杆菌感染（基于培养结果）、潜在HIV免疫抑制（从PCP预防和抗病毒药漏服推断）、肺部空洞病变伴低氧血症（SpO₂ 92%）、贫血（Hb 89 g/L）及依从性差，需综合评估药物选择和风险管理。Step 2: 临床解码 – 关键信息：① 分枝杆菌培养显示革兰阳性棒状杆菌、45°C生长、PNB耐受，明确为戈登分枝杆菌感染（非结核分枝杆菌）；② 痰AFB阳性但GeneXpert阴性，排除结核和利福平耐药；③ 患者自述漏服抗病毒药，结合PCP预防用药，提示潜在HIV阳性伴免疫低下；④ 环境因素（雨季潮湿）和关节疼痛可能加剧感染风险；⑤ SpO₂降低、肺底啰音及体重下降，表明活动性感染伴呼吸功能不全；⑥ 贫血和炎症标志物升高（CRP、ESR）支持慢性炎症状态；⑦ 患者依从性差（常漏服药物）及急于出院，增加治疗失败风险。Step 3: 规则对齐与安全检查 – 指南Condition匹配戈登分枝杆菌病，Action为利福平 + 乙胺丁醇 + 卡那霉素或环丙沙星或利奈唑胺。强制检查Contraindication：戈登分枝杆菌对异烟肼耐药，故必须避免异烟肼。全网扫描风险：① 药物相互作用：利福平是CYP3A4强诱导剂，若患者服用HIV抗病毒药（如蛋白酶抑制剂），可能降低其疗效，需调整剂量或选择替代；卡那霉素有肾毒性风险，但肾功正常，可谨慎使用；环丙沙星可能引起QT间期延长或肌腱炎；利奈唑胺有骨髓抑制和神经毒性风险。② 共病风险：HIV免疫抑制增加感染播散可能；低氧血症需氧疗支持；贫血需营养干预；依从性差可能导致治疗失败。优先级：安全第一，选择口服药物以提升依从性，避免高风险选项。Step 4: 决策生成 – 基于指南Action，选择利福平 + 乙胺丁醇 + 环丙沙星方案（避免卡那霉素注射以减少毒性，环丙沙星口服更利于依从性），同时加入支持治疗（氧疗、营养）并强化HIV管理。暂不加利奈唑胺，以降低不良反应风险；需密切监测药物水平和副作用。",
    "medical_order": "1. 抗感染方案：予利福平 600 mg 口服 每日一次 + 乙胺丁醇 15 mg/kg 口服 每日一次 + 环丙沙星 750 mg 口服 每日一次，疗程至少6个月；避免异烟肼。2. 支持治疗：予鼻导管吸氧 2 L/min（维持SpO₂ >95%），监测血气分析；予铁剂和维生素B12补充（针对Hb 89 g/L），评估营养状态；继续复方磺胺甲噁唑预防PCP。3. 监测与随访：每日监测体温、SpO₂和关节症状；每周查血常规、肝肾功能；2周后复查痰培养和胸片；确认HIV状态，优化抗病毒治疗并加强依从性教育。4. 住院管理：暂缓出院，一级护理，观察热退和氧合改善；若3日内热不退或SpO₂<90%，升级为呼吸支持。",
    "patient_dialogue": "您好，看到您急着回工地，但咱们得先确保您的身体恢复安全。首先，检查结果显示您感染了一种叫戈登分枝杆菌的细菌，它导致您发烧、出汗和体重下降。我们计划用三种药：利福平、乙胺丁醇和环丙沙星，都是口服的，这样方便您服用。这些药需要每天按时吃至少半年，不能漏服——因为如果中断，细菌可能会变强更难治，就像您之前漏服抗病毒药那样，容易让病情反复。您关节疼和宿舍潮湿可能加重感染，所以治疗期间要尽量保持环境干燥。另外，您血氧有点低，我们得给您吸点氧，这样呼吸会更舒服，防止肺部问题恶化。还有，您贫血了，我们会给补铁和维生素，帮助您恢复体力。现在您还有点低烧，出院太危险，万一回去工地劳累或下雨天潮湿，病情可能加重。咱们在医院观察几天，等烧退了、身体稳定了再安排出院。我会教您怎么记着吃药，出院后每两周来复查一次，确保一切顺利。别担心，咱们一步步来，您好好配合，很快就能好起来！"
  },
  {
    "id": 1224,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者因“右前臂红肿疼痛3周”第三次就诊。3周前搬运钢筋时被金属丝划伤，伤口未处理，随后出现搏动性疼痛及进行性红肿，自行口服头孢无缓解。1周前门诊行切开引流，脓液涂片抗酸染色阳性，培养报告今日回示：脓肿分枝杆菌（M. abscessus subsp. massiliense）。查体：右前臂背侧10 cm×6 cm紫红色浸润斑块，中央2 cm破溃口，可见黄白色分泌物；近端可触及3枚1 cm质韧淋巴结，无瘘道。体温37.8 ℃，WBC 9.8×10⁹/L，CRP 46 mg/L，ESR 78 mm/h；肝肾功能正常，乙肝表面抗原阴性。既往史：2019年患肺脓肿分枝杆菌病，曾用克拉霉素+阿米卡星+亚胺培南/西司他丁治疗6个月后因听力下降停药，之后失访。患者诉近期工地赶工期，常加班至夜间，睡眠仅4 h；吸烟15年，约15支/d，未戒烟意愿。无药物过敏记录。今日复诊，伤口换药护士发现纱布浸透速度较前加快，患者焦虑询问是否又要住院。",
    "reference_rule": {
      "condition": "皮肤脓肿分枝杆菌病患者",
      "action": "1. 克拉霉素500mg口服，2次/d，共6个月",
      "contraindication": "需警惕克拉霉素诱导性耐药产生",
      "evidence": "皮肤脓肿分枝杆菌病治疗：克拉霉素（500 mg口服，2次/d）共 6 个月。需警惕克拉霉素诱导性耐药产生。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于复杂合并症治疗场景，因患者当前皮肤脓肿分枝杆菌感染与2019年肺脓肿分枝杆菌病史相关联，涉及既往治疗失败（听力下降停药）和潜在耐药风险。作为博学的专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先级：安全 > 疗效。需警惕克拉霉素诱导性耐药、既往阿米卡星毒性影响及生活方式因素对治疗的干扰。\n\n**Step 2: 临床解码 (Clinical Decoding)**：从病例提取关键信息：患者为右前臂皮肤脓肿分枝杆菌感染（M. abscessus subsp. massiliense），表现为进行性炎症（紫红色浸润斑块、破溃口分泌物、淋巴结肿大）、伤口恶化（纱布浸透加快）和全身炎症反应（体温37.8℃、WBC/CRP/ESR升高）。既往史：2019年肺脓肿分枝杆菌病，曾用克拉霉素+阿米卡星+亚胺培南治疗6个月，因阿米卡星相关耳毒性（听力下降）停药，之后失访。隐式线索：既往治疗不完整和失访提示潜在依从性差及耐药风险；吸烟（15支/天）和睡眠不足（仅4小时/天）可能削弱免疫力并影响伤口愈合；肝肾功能正常和无药物过敏降低直接禁忌风险，但脓肿分枝杆菌易产生克拉霉素诱导性耐药，需强化监测。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南condition为“皮肤脓肿分枝杆菌病患者”，患者当前感染完全匹配。Action建议“克拉霉素500mg口服，2次/d，共6个月”。但contraindication强调“需警惕克拉霉素诱导性耐药产生”。安全检查：无绝对禁忌（肝肾功能正常、无过敏），但既往治疗使用过克拉霉素，且失访史增加耐药风险（安全优先级高）；药物相互作用方面，无其他用药记录，风险低；共病风险包括吸烟和疲劳可能降低疗效，既往阿米卡星毒性（听力下降）提示避免氨基糖苷类药物。需优先确保安全：决策需强化耐药监测和多学科管理。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南action，启动克拉霉素为基础的治疗，但针对高风险（既往治疗失败、耐药警告），添加住院观察、伤口管理和生活方式干预。安全措施包括：定期监测炎症指标和耐药测试；避免阿米卡星（因耳毒性史）；强调戒烟和休息以支持疗效。最终决策：克拉霉素治疗为核心，结合伤口护理和监测计划。",
    "medical_order": "诊断：右前臂皮肤脓肿分枝杆菌感染（M. abscessus subsp. massiliense）。\n治疗：\n1. 予克拉霉素500mg口服，每日2次，疗程6个月；定期监测药物不良反应及耐药性（每2周复查WBC、CRP、ESR，必要时行脓液培养及药敏测试）。\n2. 建议住院观察：一级护理，每日伤口换药，评估渗液情况；若伤口恶化，考虑外科清创。\n3. 生活方式干预：戒烟咨询，强调吸烟对免疫抑制影响；保证充足休息。\n4. 随访：出院后每周门诊复诊，监测听力（避免阿米卡星等耳毒性药物）；若疗效不佳或耐药迹象，请感染科会诊。",
    "patient_dialogue": "张先生，我看您伤口渗液变多了，您担心又要住院是吧？别急，咱们一步步来。这次感染是您胳膊上的一种特殊细菌引起的，和几年前您肺部那个感染类似，但别怕，我们有办法对付。给您开一种叫克拉霉素的药片，每天早晚各吃一片，得坚持半年，这样才能彻底清除细菌。不过，这种细菌容易‘习惯’药物，所以咱们得经常检查血和伤口，防止药效变差。另外，您伤口现在渗得厉害，我建议您住院几天，我们护士每天给您换药，观察变化，这样更安全，也能早点好。还有，烟一定得戒掉——我知道这难，但抽烟会让伤口更难愈合；工作再忙也得保证睡够觉，身体休息好了，药才起效。您别担心，我会一直在这儿帮您的，咱们一起把这个感染控制住。"
  },
  {
    "id": 1243,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者38岁，确诊HIV感染7年，CD4 42/μL，病毒载量2.3×10⁵ copies/mL，目前未启动ART。4个月前出现低热、盗汗、体重下降10 kg，外院痰抗酸染色阳性但MTB-DNA阴性，经验性抗结核四联治疗2个月无效。1周前咳嗽加剧，少量白色黏痰，无咯血。今日查房，住院医师汇报：昨日送检的BALF培养回报“非结核分枝杆菌阳性”，但实验室只报告“NTM未进一步分型”。患者今日体温37.8 ℃，SpO₂ 94%（RA），听诊右下肺少许湿啰音。血常规：WBC 4.1×10⁹/L，Hb 89 g/L；肝肾功能正常。胸部CT示右肺中叶及下叶多发结节伴树芽征，与2个月前比较病灶进展。患者职业为夜班网约车司机，抱怨“最近油价涨得厉害，住院耽误跑单”。家属追问：“既然不是结核，是不是可以停原来的四联药？”",
    "reference_rule": {
      "condition": "NTM阳性样本患者",
      "action": "1. 通过可靠的分子或质谱技术进行菌种鉴定; 2. 根据菌种鉴定结果选择性进行药敏试验; 3. 治疗无效或培养转阴后再次转阳时，再次进行相关药物的敏感试验",
      "contraindication": null,
      "evidence": "所有 NTM 阳性样本应通过可靠的分子或质谱技术，分离至少达到菌株水平。可在菌种鉴定结果后选择性进行药敏试验，特别是针对性方案治疗效果不佳时强烈推荐，药敏试验的检测和报告均应遵循临床实验室标准协会指南进行。若治疗无效或培养转阴后再次转阳时，应再次进行相关药物的敏感试验。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，确保安全优先于疗效。患者同时存在HIV感染（CD4极低，未ART）和进展性NTM肺部感染，需全网扫描潜在风险，如ART与NTM治疗的相互作用、免疫抑制状态下的感染控制，以及社会因素对治疗依从性的影响。Step 2: 临床解码 (Clinical Decoding)：从病例中提取关键信息：患者HIV感染7年，CD4 42/μL（严重免疫抑制），病毒载量2.3×10⁵ copies/mL（高病毒活动），未启动ART；4个月前出现低热、盗汗、体重下降10 kg（提示消耗性症状），经验性抗结核四联治疗2个月无效（排除结核可能）；1周前咳嗽加剧伴少量白色黏痰，BALF培养NTM阳性但未分型（需进一步鉴定）；血常规示WBC 4.1×10⁹/L（正常偏低，提示感染或免疫低下）、Hb 89 g/L（中度贫血）；胸部CT示右肺中叶及下叶多发结节伴树芽征进展（活动性肺部感染）；职业为夜班网约车司机，抱怨经济负担（隐式线索：潜在治疗依从性差风险）。Step 3: 规则对齐与安全检查 (Alignment & Safety)：指南Condition为“NTM阳性样本患者”，Action要求立即进行菌种鉴定和选择性药敏试验。病例中BALF培养NTM阳性但未分型，需对齐Action 1（分子或质谱技术鉴定）；治疗无效（抗结核失败）需对齐Action 2（药敏试验）。Contraindication为null，强制安全扫描：ART启动可能与NTM药物（如大环内酯类或氨基糖苷类）相互作用（如利福平影响某些ART药效）；共病风险包括HIV免疫抑制加重NTM感染、贫血可能影响氧气输送（SpO₂ 94%稍低）、职业压力致依从性下降，优先级安全>疗效。Step 4: 决策生成 (Decision Making)：基于指南Action，决策为：1. 完善NTM菌种鉴定（分子或质谱技术）；2. 立即启动ART治疗HIV（选择低相互作用方案）；3. 停止经验性抗结核治疗；4. 菌种鉴定后行药敏试验以针对性治疗；5. 加强支持性护理（如氧疗、营养支持）。",
    "medical_order": "1. 停止经验性抗结核四联治疗（无效）。2. 立即完善非结核分枝杆菌（NTM）菌种鉴定，采用可靠分子或质谱技术（如PCR或MALDI-TOF MS）。3. 启动抗逆转录病毒治疗（ART），方案选择基于CD4<50/μL及病毒载量高，优先考虑含整合酶抑制剂（如BIC/TAF/FTC）以最小化药物相互作用风险。4. 待菌种鉴定结果后，行选择性药敏试验（针对常见NTM菌种如鸟胞内分枝杆菌复合群）。5. 予低流量氧疗（SpO₂ 94%），监测生命体征q4h。6. 完善贫血评估（网织红细胞计数、铁代谢检查），必要时输注浓缩红细胞（Hb<90 g/L）。7. 胸部CT随访（4周后复查）。8. 营养支持（高热量高蛋白饮食）。",
    "patient_dialogue": "医生：大哥，检查结果出来了，我们仔细看了下，您肺里的感染不是结核菌，而是另一种叫非结核分枝杆菌的细菌。所以啊，之前那些治结核的药咱们得停掉，因为对您这情况没效果，再吃还可能增加身体负担。现在最重要的是两件事：一是给您做个更详细的细菌检测，确定到底是哪种类型，这样我们才能选对药；二是马上开始吃HIV的药，这能帮您身体恢复抵抗力，不然感染会越来越重。您提到油价涨了住院耽误跑车，我特别理解这压力——赚钱养家不容易，但身体是根本啊！您看，现在肺里感染在加重，要是拖下去不光咳嗽更厉害，还可能影响呼吸，到时候更耽误工作。咱先把病控制住，我能帮您联系社工看看有没有经济补助。家属问停药的事，放心停吧，不是结核了，换新方案更对症。咱们一步一步来，好吗？"
  },
  {
    "id": 1210,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "今日感染科门诊。患者右腋下肿物2个月，伴夜间低热、盗汗，体重下降4kg。查体：右腋窝可触及3cm×4cm质韧包块，表面皮肤微红，轻压痛，无波动感；余浅表淋巴结未及明显肿大。胸片未见异常。外院超声提示“淋巴结结构紊乱，可见液化”。血常规：WBC 3.1×10⁹/L，Hb 102g/L，CRP 38mg/L；肝肾功能正常。既往史：HIV/AIDS（CD4最低28个/μL），现用TDF/FTC+DTG，病毒载量<40copies/mL；无糖尿病、无结核史。患者诉曾养仓鼠，半年前被宠物抓伤后局部结痂。今日气温32℃，候诊时抱怨候诊区空调过冷，伴轻微干咳，无痰。",
    "reference_rule": {
      "condition": "嗜血分枝杆菌病患者",
      "action": "1. 环丙沙星 + 利福布汀 + 克拉霉素; 2. 对于局部的淋巴结炎，外科清创可能是必要的",
      "contraindication": null,
      "evidence": "可选择环丙沙星 + 利福布汀 + 克拉霉素。对于局部的淋巴结炎，外科清创可能是必要的。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，患者合并HIV/AIDS免疫缺陷状态，涉及机会性感染风险。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全性（安全 > 疗效）。Step 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者有右腋下肿物、夜间低热、盗汗、体重下降，结合仓鼠抓伤史（半年前结痂），提示慢性感染可能；超声示淋巴结结构紊乱、液化，支持化脓性炎症；实验室显示WBC降低（3.1×10⁹/L，免疫抑制相关）、贫血（Hb 102g/L）、CRP升高（38mg/L，炎症）；HIV控制良好（病毒载量<40），但CD4曾低（28个/μL），增加机会性感染风险；干咳和空调抱怨或为环境因素，无直接关联。隐式线索包括仓鼠暴露史指向巴尔通体病（猫抓病），需鉴别结核或淋巴瘤。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南针对嗜血分枝杆菌病（如巴尔通体病），与患者暴露史和表现高度匹配。指南Action推荐环丙沙星 + 利福布汀 + 克拉霉素及外科清创评估，Contraindication为null，但强制安全检查：当前ART方案（TDF/FTC+DTG）中，利福布汀为CYP3A4诱导剂，可能降低DTG浓度，增加治疗失败风险；克拉霉素和环丙沙星无显著相互作用，但WBC低可能加重骨髓抑制。无绝对禁忌症，优先级安全要求ART剂量调整或监测。Step 4: 决策生成 (Decision Making) - 基于指南Action，生成决策：启动经验性抗生素三联治疗，评估外科清创，并监测药物相互作用；同时完善诊断检查以确认。",
    "medical_order": "1. 诊断：疑似巴尔通体淋巴结炎（基于仓鼠暴露史及临床表现）。2. 治疗：予环丙沙星500mg口服bid + 利福布汀300mg口服qd + 克拉霉素500mg口服bid；请外科会诊评估右腋窝包块清创必要性。3. 监测：每周复查血常规、肝功能；监测多替拉韦（DTG）血药浓度（因利福布汀潜在相互作用）。4. 完善检查：行右腋窝淋巴结活检及病理检查；送巴尔通体血清学PCR。5. 抗逆转录病毒治疗（ART）继续，方案为TDF/FTC+DTG，但需感染科随访调整。",
    "patient_dialogue": "王先生，您好！看您腋下这个肿块有段时间了，还伴有发烧、出汗和体重减轻，结合您之前养仓鼠被抓伤的经历，我们怀疑这可能是细菌感染引起的，就像猫抓病那种情况。别担心，您的HIV控制得挺好，但咱们得小心处理这个感染。我建议先用三种抗生素一起治疗，这样能更有效地杀灭细菌。同时，我让外科医生来看看肿块，如果里面有脓，可能需要个小手术引流出来，这样好得快些。另外，因为您在吃HIV药物，我们会抽血检查一下药物浓度，确保一切安全。治疗期间，我会安排您定期复查血项，帮我们监控恢复情况。咱们一步步来，这感染是可以治好的，您放松点，有问题随时问我。"
  },
  {
    "id": 1227,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者因“反复低热、盗汗、咳黄脓痰伴体重下降4周”第3次入住感染科。查体：T 37.8 ℃，P 96次/分，R 22次/分，SpO₂ 92%（室内空气），右下肺叩浊、可闻及细湿啰音；肝肋下2 cm、质韧、轻触痛。实验室：WBC 11.4×10⁹/L、NE% 82%、Hb 89 g/L、ALP 178 U/L、ALT 56 U/L、Cr 93 μmol/L；CD4 42/μL、HIV RNA <20 cp/mL。胸部增强CT：右肺下叶团片影伴多发小空洞，纵隔淋巴结肿大，脾内多发低密度灶。两次痰AFB涂片阳性，GeneXpert MTB/RIF阴性；痰分枝杆菌培养回报：脓肿分枝杆菌（M. abscessus），大环内酯类耐药（erm(41) T28 sequevar，克拉霉素MIC>32 mg/L）。血培养同样分离出脓肿分枝杆菌。患者自述近3个月在社区多次接受口服阿奇霉素+左氧氟沙星，症状反复。今日查房，患者仍低热，咳痰量未见减少，对下一步治疗表示焦虑，并担心静脉用药的肾毒性。",
    "reference_rule": {
      "condition": "肺或播散性脓肿分枝杆菌病患者，且大环内酯类耐药",
      "action": "1. 起始阶段：静脉应用阿米卡星、替加环素和亚胺培南（若耐受）联合治疗4周; 2. 维持阶段：阿米卡星雾化治疗，同时根据药敏试验及患者耐受度联合使用下列1～3种口服药物：氯苯吩嗪、利奈唑胺、米诺环素或强力霉素、莫西沙星或环丙沙星、复方磺胺甲噁唑; 3. 培养转阴12个月后，继续抗菌药物治疗至少12个月",
      "contraindication": "若阿米卡星耐药或存在16S rRNA基因突变，应停用阿米卡星",
      "evidence": "大环内酯类耐药的脓肿分枝杆菌复合体患者，起始阶段静脉应用阿米卡星、替加环素和亚胺培南（若耐受）联合治疗 4 周。应根据感染严重程度、治疗反应和对药物的耐受程度决定静脉治疗时间。为了减少治疗相关的恶心和呕吐，在应用替加环素和（或）亚胺培南时，可加用止吐药昂丹司琼和（或）阿瑞吡坦。若无法注射应用氨基糖苷类药物、存在注射禁忌或需长期使用氨基糖苷类药物的脓肿分枝杆菌肺病患者，可考虑阿米卡星雾化治疗。对阿米卡星耐药的脓肿分枝杆菌或脓肿分枝杆菌分离株中存在可导致耐药的 16S rRNA 基因突变，应停用阿米卡星，改用其他抗菌药物。维持阶段：大环内酯类耐药的脓肿分枝杆菌复合体患者，维持阶段阿米卡星雾化治疗，同时根据药敏性试验及患者耐受度联合使用下列1～3种口服药物：氯苯吩嗪、利奈唑胺、米诺环素或强力霉素、莫西沙星或环丙沙星、复方磺胺甲噁唑。对阿米卡星耐药的脓肿分枝杆菌或脓肿分枝杆菌分离株中存在可导致耐药的16S rRNA基因突变，应停用阿米卡星，改用其他口服抗菌药物。培养转阴12个月后，脓肿分枝杆菌病患者应继续应用抗菌药物治疗至少12个月。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险。患者合并HIV感染（免疫功能低下）、贫血、轻度肝损伤与播散性脓肿分枝杆菌感染，需全网扫描治疗风险，优先确保安全（如肾毒性、药物叠加风险），再追求疗效。\n\n**Step 2: 临床解码 (Clinical Decoding)**：患者核心诊断为播散性脓肿分枝杆菌感染（基于痰和血培养阳性、影像学显示肺部和脾脏病灶），大环内酯类耐药（既往口服阿奇霉素+左氧氟沙星无效）。隐式线索包括：1. 免疫抑制（CD4 42/μL），增加感染进展风险；2. 轻度肝损伤（ALT升高）和贫血（Hb 89 g/L），可能影响药物代谢；3. 肾功能正常但患者担忧肾毒性，需预防性监测；4. HIV控制良好（RNA<20 cp/mL），但需避免抗感染药物与HIV治疗的潜在相互作用；5. 症状持续（低热、咳痰），提示既往治疗失败，需强化方案。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：病例完全符合指南条件（肺/播散性脓肿分枝杆菌病，大环内酯类耐药）。强制检查禁忌：指南contraindication要求排除阿米卡星耐药（如16S rRNA突变），但病例未提供相关测试结果，故必须优先安排耐药检测以规避风险。安全检查发现：1. 药物相互作用风险（如替加环素可能加重肝损或与HIV药物冲突）；2. 共病风险（贫血可能因药物副作用恶化，肝损伤需监测）；3. 患者焦虑和肾毒性担忧，需个体化剂量调整。优先级为安全 > 疗效，确保治疗可行。\n\n**Step 4: 决策生成 (Decision Making)**：依据指南action，制定方案：起始阶段静脉阿米卡星、替加环素和亚胺培南联合4周（若耐受），监测副作用；维持阶段阿米卡星雾化加口服药（基于药敏选择氯苯吩嗪和莫西沙星，兼顾耐受性）；培养转阴后持续治疗至少24个月。关键调整：1. 强制加入阿米卡星耐药测试；2. 针对肝损和贫血，优化剂量并加强监测；3. 管理焦虑，解释监测计划以减轻担忧。",
    "medical_order": "1. **起始治疗阶段（4周）**：静脉注射阿米卡星（剂量根据体重调整，监测肾功能和听力）、替加环素（首剂后维持量，加用昂丹司琼预防呕吐）和亚胺培南（若耐受，监测肝酶）。予一级护理，监测生命体征、SpO₂及每日尿量。2. **完善检查**：立即送检阿米卡星耐药测试（16S rRNA基因突变分析）；每周复查血常规、肝肾功能（ALT、Cr）、血培养及痰培养。3. **维持治疗阶段**：起始阶段结束后，启动阿米卡星雾化治疗（每日剂量），联合口服氯苯吩嗪和莫西沙星（根据药敏及耐受度调整）；定期评估感染标志物。4. **长期管理**：痰培养转阴后12个月起，继续抗菌药物治疗至少12个月；每月随访，复查影像学及实验室指标。5. **支持治疗**：纠正贫血（予铁剂及营养支持），保护肝功能（避免肝毒性药物），监测HIV状态。",
    "patient_dialogue": "您好，我完全理解您的担心——反复发烧、咳嗽和体重下降确实让人焦虑，尤其您还提到了对打针药物的肾毒性顾虑。别担心，我们会一步步来，确保治疗安全有效。首先，您的感染需要更强力的药物来控制，所以我们计划先用静脉注射的方式给药几周，包括几种抗生素，这样能更直接地杀灭细菌。我们会密切监测您的肾功能，比如每天检查尿液和血液，确保药物不会伤害肾脏，同时帮您管理任何不适，比如恶心的话我们就用点止吐药。之后，我们会换成吸入药物和口服药，这样更方便，也更适合长期使用。另外，因为您以前用的口服药效果不好，我们会做个额外的测试，确保新药对您有效。记住，这个治疗需要时间——可能一年半左右，但我们会定期检查，一起调整方案。您有家人支持吗？他们也可以帮您记录症状，我们一起努力，让您早日康复。"
  },
  {
    "id": 1229,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "昨日夜班收到呼吸科急会诊：患者持续发热38.7℃、干咳伴活动后气促，SpO₂ 92%（鼻导管3 L/min）。胸片示双肺弥漫性网状结节影，右上肺尖后段新现薄壁空洞。痰液GeneXpert MTB/RIF阴性，但分枝杆菌培养报警阳性，初步质谱鉴定为“蟾分枝杆菌”。既往：10年前确诊AIDS，曾自行中断ART 2年；2个月前因“左颈部淋巴结炎”在外院切开引流，病理仅报“慢性肉芽肿性炎”，未进一步培养。实验室：WBC 3.1×10⁹/L，Hb 89 g/L，ALP 178 U/L，Scr 96 μmol/L（eGFR 72 mL/min），ALT 52 U/L；乙肝表面抗原阴性，丙肝抗体阴性。当前用药：替诺福韦+拉米夫定+多替拉韦，复方新诺唑预防PCP，氟康唑200 mg qd（曾患食管念珠菌病）。患者诉近3周体重下降4 kg，夜间盗汗明显；职业为夜班出租车司机，昨日凌晨仍出车，自述“车内空调霉味重”。无结核接触史，但回忆1年前替友照顾过一只患“龟烂甲病”的宠物巴西龟。查房时患者最关心：“听说这菌和结核不一样，能不能用治结核的免费药？我肝肾功能不好，怕药太多扛不住。”",
    "reference_rule": {
      "condition": "蟾分枝杆菌病患者",
      "action": "1. 大环内酯类药物 + 利福平或利福布汀 + 乙胺丁醇和（或）链霉素方案; 或 2. 利福平 + 异烟肼和（或）乙胺丁醇方案",
      "contraindication": "多数艾滋病患者不需治疗",
      "evidence": "推荐大环内酯类药物 + 利福平或利福布汀 + 乙胺丁醇和（或）链霉素方案或利福平 + 异烟肼和（或）乙胺丁醇方案。研究表明，多数艾滋病患者不需治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，作为专科专家，关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。需全面评估当前用药、肝肾功能异常及AIDS背景下的免疫抑制状态，确保治疗方案安全可行，避免药物叠加毒性。\n\nStep 2: 临床解码 (Clinical Decoding): 患者为AIDS合并蟾分枝杆菌肺病（基于分枝杆菌培养阳性及肺部影像学特征），表现为发热、干咳、气促、盗汗及体重下降，提示活动性感染。关键隐式线索包括：免疫抑制（CD4计数未提供但ART中断史暗示风险）、环境暴露（车内霉味及宠物龟照顾史，可能为感染源）、多重用药（ART、抗真菌及PCP预防药物）、肝肾功能轻度异常（ALT升高、eGFR轻度减退）。需转化为医学术语：非结核分枝杆菌感染、HIV相关免疫缺陷、药物性肝损伤风险、慢性肾病G2期。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition '蟾分枝杆菌病患者' 匹配，但Contraindication '多数艾滋病患者不需治疗' 不适用，因患者有症状及影像学进展，需积极治疗。安全检查聚焦药物相互作用：利福平类（指南方案）为CYP3A4诱导剂，可降低多替拉韦（ART药物）浓度，增加治疗失败风险；乙胺丁醇有肾毒性，需调整剂量；大环内酯类与氟康唑（当前用药）可能增加QT间期延长风险。肝肾功能异常（ALT 52 U/L, eGFR 72 mL/min）要求起始低剂量并密切监测。无绝对禁忌，但需优选相互作用少的方案。\n\nStep 4: 决策生成 (Decision Making): 根据指南Action，选择方案1（大环内酯类 + 利福平或利福布汀 + 乙胺丁醇），避免方案2（利福平 + 异烟肼）因异烟肼肝毒性高。具体调整：用利福布汀替代利福平（与ART相互作用较小），避免链霉素（肾毒性风险高），起始阿奇霉素 + 利福布汀 + 乙胺丁醇。剂量基于体重和肾功能优化，同时维持ART及预防用药，确保安全优先。",
    "medical_order": "诊断：蟾分枝杆菌肺病；AIDS合并免疫抑制状态。\n治疗：1. 启动抗分枝杆菌方案：阿奇霉素 500 mg 口服 每日一次 + 利福布汀 300 mg 口服 每日一次 + 乙胺丁醇 15 mg/kg 口服 每日一次（基于体重60 kg调整至800 mg）。2. 维持当前ART（替诺福韦 300 mg + 拉米夫定 300 mg + 多替拉韦 50 mg 每日一次）、复方新诺唑 960 mg 口服 每日一次（PCP预防）、氟康唑 200 mg 口服 每日一次（抗真菌预防）。\n监测：每周肝功能（ALT、ALP）、肾功能（Scr、eGFR）、全血细胞计数；4周后复查胸部CT；每日SpO₂监测。\n生活方式干预：避免环境暴露（如霉变空调）；营养支持（高蛋白饮食）。\n随访：2周内门诊复诊评估耐受性；若肝功能恶化或症状无改善，升级至感染科专科治疗。",
    "patient_dialogue": "张先生，我明白您担心肝肾功能和药物太多扛不住，咱们一步步来。首先，检查显示您感染了一种叫蟾分枝杆菌的细菌，它导致了发烧、咳嗽和盗汗，不是结核菌，所以免费结核药效果不好，用了反而可能伤肝伤肾，咱们不能冒险。\n\n治疗方案上，我会开三种专门对付这种细菌的药：阿奇霉素、利福布汀和乙胺丁醇。它们搭配起来更有效，而且我特意选了对您肝肾功能影响小的剂量——我们会从小量开始，每周抽血检查，确保安全。您现在的抗艾滋药和预防药都继续吃，别停，我会调整搭配，避免它们'打架'。\n\n另外，您提到车内空调霉味重，这可能是细菌来源，建议先清洗空调或尽量少接触，对恢复有帮助。体重掉了不少，咱们得多补充营养，比如鸡蛋、瘦肉，帮助身体扛住治疗。别怕，我会全程盯着，坚持下来症状会慢慢好转的。"
  },
  {
    "id": 1240,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者今日独自骑共享电动车来社区门诊，雨披下还滴着水。他先把3个药盒排在桌上：必妥维、克拉霉素、乙胺丁醇，然后掏出手机里的Excel表——“护士，我按您说的每天晨起称体重，可过去4周又掉了1.8 kg，现在62.4 kg，BMI 19.2。”他说话间歇轻咳两声，没有痰。体温36.8℃，指尖SpO₂ 94%（室温空气）。复查血常规：WBC 4.1×10⁹/L，中性粒细胞1.9，CRP 12 mg/L（↑），ESR 35 mm/h；肝肾功能正常。CD4 142/μL，HIV-RNA <20 copies/mL。胸片报告提示“右中叶条索影较前略有吸收”，但患者仍抱怨“爬两层楼就喘”，过去一周夜间盗汗两次。护士追问咳痰情况，他耸肩：“还是干咳，实在咳不出东西。”门诊病历显示：距离上次痰分枝杆菌培养已10周，结果仍为阴性；但治疗6个月时的BALF培养阳性（MAC，+），药敏同前。",
    "reference_rule": {
      "condition": "NTM肺病患者",
      "action": "1. 每隔4～12周进行痰分枝杆菌培养; 2. 治疗完成后12个月也应进行痰分枝杆菌培养; 3. 若不能自主咳痰，在治疗6个月和12个月时通过肺泡灌洗获取标本评估; 4. 治疗前及治疗结束后进行影像学随访评估; 5. 每次随访评估肺部、淋巴结和全身症状（如体质量、肺功能和全身炎性标志物）",
      "contraindication": null,
      "evidence": "对于 NTM 肺病每隔 4～12 周应进行痰分枝杆菌培养；治疗完成后 12 个月也应进行痰分枝杆菌培养。若患者不能自主咳痰，可在治疗 6 个月和 12 个月时通过肺泡灌洗获取标本来评估治疗的微生物学反应。在 NTM 治疗前及治疗结束后必须进行影像学随访评估，以了解治疗的影像学改变。每次临床随访时，都应详细评估患者肺部、淋巴结等和全身症状，如体质量、肺功能和全身炎性标志物（红细胞沉降率和 C-反应蛋白）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于分级诊疗与随访场景。作为守门人 (Gatekeeper)，我将重点对比患者当前状况与NTM治疗达标标准，判断是否需要维持社区门诊管理或触发转诊至上级医院进行升级评估和治疗。关键关注点是症状未缓解、微生物学评估困难是否超出社区处理能力。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者为HIV合并NTM肺病（鸟分枝杆菌复合群阳性），当前使用克拉霉素和乙胺丁醇治疗；免疫抑制风险高（CD4 142/μL）；治疗反应不足：持续症状（干咳、劳力性呼吸困难、盗汗）、体重下降（BMI 19.2）、炎症标志物升高（CRP 12 mg/L，ESR 35 mm/h）；胸片示部分吸收但未完全缓解；痰标本获取困难（干咳无痰），上次痰培养阴性但6个月前BALF阳性；需警惕治疗失败或进展风险。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件为NTM肺病患者，匹配患者状况。无禁忌症（Contraindication null）。与指南Action对齐：Action 3要求对不能自主咳痰者在治疗6个月和12个月时通过BALF评估；患者当前症状持续、炎症未控，且6个月BALF阳性后未再评估（门诊记录显示痰培养困难），需升级微生物学评估；Action 5强调症状和标志物随访，现状未达标。\n\nStep 4: 决策生成 (Decision Making) - 患者治疗反应不足，社区无法解决痰标本获取问题，触发转诊。决策：转诊至上级医院呼吸内科，行BALF检查评估微生物学反应；维持当前抗NTM和抗逆转录病毒治疗；加强症状和炎症监测；4周内复诊评估转诊后结果。",
    "medical_order": "予转诊上级医院呼吸内科，行支气管肺泡灌洗（BALF）获取标本，评估鸟分枝杆菌复合群（MAC）治疗微生物学反应及药敏。继续当前抗NTM方案（克拉霉素、乙胺丁醇）及抗逆转录病毒治疗（必妥维）。监测体重、肺功能（如爬楼试验）、症状（咳嗽、气促、盗汗）及炎性标志物（CRP、ESR）。预约4周后社区门诊复诊，评估转诊结果及治疗调整需求。",
    "patient_dialogue": "您好，看到您冒雨赶来还这么详细记录数据，真的很用心！虽然胸片显示肺部感染比之前好了一点点，但您还在咳嗽、爬楼喘气、晚上出汗，体重也往下掉，这些情况告诉我们，治疗可能没完全到位。因为您咳不出痰，咱们在社区没法做更准的检查。我会帮您转到大医院，做个简单的小操作——用一根细软的管子轻轻取点肺部液体，这样能看清楚病菌有没有被药物压住。别担心，这很安全，专家会仔细处理。您继续按时吃现在的药，注意别着凉；4周后咱们再见面，看看检查结果怎么样，好吗？"
  },
  {
    "id": 1219,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "夜班查房，住院医汇报：患者近48h体温高峰38.4℃，咳少量鲜红血丝痰，无胸痛。既往抗病毒方案为TDF/3TC/DTG，依从性自述>95%。入院查体：消瘦，BMI 18.2 kg/m²，右下肺散在湿啰音；实验室：WBC 3.1×10⁹/L，Hb 92 g/L，CRP 46 mg/L，ESR 102 mm/h；肝功能ALT 52 U/L、TBil 18 μmol/L，肌酐74 μmol/L；胸CT示右下叶斑片影伴小空洞。两次痰AFB涂片阳性（2+），GeneXpert MTB/RIF阴性，分枝杆菌培养初步报告为“堪萨斯分枝杆菌”，药敏提示利福平敏感。患者同时合并口腔念珠菌感染，已予氟康唑200 mg/d口服。今晨护士反映患者因长期腹泻（3–4次/日，水样便）拒绝额外口服药物，担心“药太多伤胃”。窗外暴雨，病房湿度高，患者情绪焦虑，反复询问“是不是结核？会不会传染给家人？”",
    "reference_rule": {
      "condition": "利福平敏感的堪萨斯分枝杆菌病患者",
      "action": "1. 利福平600mg口服，1次/d + 异烟肼300mg口服，1次/d + 乙胺丁醇25mg·kg⁻¹·d⁻¹ 使用2个月; 2. 然后改为乙胺丁醇15mg·kg⁻¹·d⁻¹ + 大环内酯类药物（克拉霉素或阿奇霉素）; 3. 疗程至培养阴性后15个月",
      "contraindication": "堪萨斯分枝杆菌对吡嗪酰胺均耐药",
      "evidence": "利福平敏感的堪萨斯分枝杆菌病患者应联合使用利福平（600 mg口服，1次/d）、异烟肼（300 mg口服，1次/d）、乙胺丁醇（25 mg·kg-1·d-1）使用 2 个月，然后改为15 mg·kg-1·d-1）加大环内酯类药物（克拉霉素或阿奇霉素）。疗程至培养阴性后 15 个月。堪萨斯分枝杆菌对吡嗪酰胺均耐药。"
    },
    "thought": "本案例属于复杂合并症治疗场景。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保安全。\n\n- **Step 1: 临床解码**: 患者诊断为利福平敏感的堪萨斯分枝杆菌肺病（非结核分枝杆菌），伴HIV感染（当前方案TDF/3TC/DTG）、口腔念珠菌感染、慢性腹泻（3–4次/日水样便）、营养不良（BMI 18.2 kg/m²）、轻度贫血（Hb 92 g/L）和肝功能轻度异常（ALT 52 U/L）。隐式线索包括：腹泻可能源于HIV相关机会性感染（如隐孢子虫）或抗病毒药物副作用（如TDF致胃肠道反应）；BMI低和消瘦提示营养缺乏，需支持；焦虑情绪可能影响治疗依从性；湿度高环境增加感染风险；GeneXpert MTB/RIF阴性排除结核，但患者误认传染风险需澄清。\n\n- **Step 2: 规则对齐与安全检查**: 病例匹配指南条件（利福平敏感堪萨斯分枝杆菌）。强制检查禁忌症：吡嗪酰胺禁用（指南明确耐药），方案中无该药，安全。全网扫描风险：利福平是强CYP3A4诱导剂，可能降低DTG浓度（HIV治疗需调整），并与氟康唑（CYP抑制剂）相互作用（降低氟康唑疗效）；乙胺丁醇有视神经炎风险（需视力监测）；腹泻可能影响口服药物吸收；肝功能异常增加药物肝毒性风险；贫血和营养不良加重治疗耐受性。优先级安全：避免药物叠加导致不良反应。\n\n- **Step 3: 决策生成**: 基于指南action，启动利福平+异烟肼+乙胺丁醇方案，但需调整：1. 计算乙胺丁醇剂量（基于体重，假设60kg为1500mg/d）；2. 因药物相互作用，与HIV专科会诊调整DTG剂量（如增至50mg bid）；3. 监测副作用（视力、肝肾功能）；4. 处理共病：优化腹泻管理（排查感染原因），加强营养支持，维持氟康唑治疗；5. 隔离预防（空气传播风险低但需谨慎）；6. 安抚焦虑以提高依从性。",
    "medical_order": "诊断：堪萨斯分枝杆菌肺病（利福平敏感），合并HIV感染、口腔念珠菌感染、营养不良、慢性腹泻。\n\n1. 启动抗分枝杆菌治疗：利福平600mg口服每日一次 + 异烟肼300mg口服每日一次 + 乙胺丁醇25mg/kg/d口服（基于体重计算，如60kg予1500mg/d）。疗程按指南：2个月后调整为乙胺丁醇15mg/kg/d + 克拉霉素500mg口服每日两次（或阿奇霉素500mg口服每日一次），持续至培养阴性后15个月。\n2. 继续氟康唑200mg口服每日一次治疗口腔念珠菌。\n3. 与HIV专科会诊：调整抗病毒方案，考虑增加DTG剂量（如50mg口服每日两次）或替代方案，监测HIV病毒载量。\n4. 评估腹泻原因：完善粪便常规、培养及寄生虫检查（如隐孢子虫）；暂停非必要口服药，必要时予止泻支持（如洛哌丁胺）。\n5. 营养支持：予高热量高蛋白肠内营养补充，监测体重及白蛋白。\n6. 隔离措施：单间空气隔离，定期环境消毒。\n7. 监测计划：每日体温、出入量；每周肝功能（ALT、TBil）、肾功能（肌酐）、血常规（WBC、Hb）；每月视力检查（乙胺丁醇相关）；复查痰培养及胸CT。",
    "patient_dialogue": "张先生，我理解您很担心，尤其现在天气不好让您更焦虑了。别急，我慢慢给您解释清楚。首先，检查结果出来了，您感染的是一种叫堪萨斯分枝杆菌的细菌，不是结核病，传染性很低，家人不容易被传染——我们会安排您单独住一间房，这样更安心。\n\n关于治疗，我们需要用三种药：利福平、异烟肼和乙胺丁醇，这些是专门对付这种细菌的，效果好。我知道您怕药多伤胃，还拉肚子，咱们这样办：腹泻可能和您之前的药有关，我会先查查原因，帮您减少不适；同时，这些新药我会从小剂量开始，教您饭后吃减轻胃部负担。您口腔的感染还得继续用氟康唑，我们保持原样。\n\n另外，您HIV的药可能需要调一下剂量，我会和专科医生商量，确保所有药配合好。营养也很关键——您太瘦了，我让护士给您加些高蛋白的流食，比如鸡蛋羹或营养粉，帮您快点恢复力气。别担心，咱们一步一步来，我会盯着您的反应，有任何不舒服随时告诉我。您觉得这样安排怎么样？"
  },
  {
    "id": 1220,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "呼吸与危重症医学科病房晨交班。夜班报告：患者凌晨咳鲜红色血痰约15ml，伴活动后气促加重。床旁听诊右肺中野新出现湿啰音。昨日实验室回报：痰抗酸涂片++，GeneXpert MTB阴性；分枝杆菌培养初步报告：玛尔摩分枝杆菌生长（5天报阳）。CT复查（与入院时对比）：右肺上叶厚壁空洞由1.8cm增大至2.6cm，周围新发磨玻璃影。血常规：WBC 9.8×10⁹/L，Hb 98g/L；肌酐78μmol/L，ALT 42U/L。患者自述体重近6周再降4kg，夜间盗汗明显；护士备注：患者因既往静脉吸毒史，双上肢静脉硬化，留置针已更换3次仍外渗。今日气温骤降，家属带来保温桶装红烧肉，被值班护士劝阻。——请上级医师查房定夺抗感染方案。",
    "reference_rule": {
      "condition": "玛尔摩分枝杆菌肺病患者",
      "action": "1. 利福平 + 乙胺丁醇 + 大环内酯类（克拉霉素或阿奇霉素），每日口服给药治疗; 2. 对于重症患者（如呼吸道标本抗酸杆菌涂片阳性、影像学检查提示存在空洞、严重感染、临床症状严重或有全身性疾病体征及播散性疾病患者），应注射氨基糖苷类药物（阿米卡星或链霉素）; 3. 若无法注射使用氨基糖苷类药物、存在注射禁忌或需长期使用氨基糖苷类药物，可考虑阿米卡星雾化治疗; 4. 在培养转阴12个月后，继续抗菌药物治疗至少12个月",
      "contraindication": null,
      "evidence": "肺病患者应联合使用利福平、乙胺丁醇和大环内酯类（克拉霉素或阿奇霉素），每日口服给药治疗。重症玛尔摩分枝杆菌肺病（如：呼吸道标本抗酸杆菌涂片阳性、影像学检查提示存在空洞、严重感染、临床症状严重或有全身性疾病体征及播散性疾病患者）应注射氨基糖苷类药物（阿米卡星或链霉素）。若无法注射使用氨基糖苷类药物、存在注射禁忌或需长期使用氨基糖苷类药物的玛尔摩分枝杆菌肺病患者，可考虑阿米卡星雾化治疗。在培养转阴 12 个月后，玛尔摩分枝杆菌病患者应继续抗菌药物治疗至少 12 个月。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为专科专家，我将重点全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全（安全 > 疗效），评估静脉通路困难、贫血、饮食风险等潜在问题。Step 2: 临床解码 (Clinical Decoding) - 患者表现为咯血（鲜红色血痰15ml）、呼吸功能恶化（活动后气促加重、新发湿啰音），结合影像学（空洞增大至2.6cm、新发磨玻璃影）和实验室结果（痰抗酸涂片++、玛尔摩分枝杆菌培养阳性），诊断为重症玛尔摩分枝杆菌肺病进展期；全身症状（体重下降4kg、盗汗）和轻度贫血（Hb 98g/L）提示感染严重；隐式风险包括静脉通路困难（既往静脉吸毒史导致双上肢静脉硬化、留置针反复外渗）和高脂饮食干扰（家属提供红烧肉可能影响药物吸收）。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者完全匹配指南条件（玛尔摩分枝杆菌肺病、重症指标：涂片阳性、空洞、严重症状），但存在注射禁忌（无法静脉注射）；指南Contraindication为null，安全扫描未发现直接药物禁忌（肌酐和ALT正常），但需警惕利福平与高脂饮食的相互作用（降低吸收）及贫血潜在影响；规则Action 2因注射禁忌触发Action 3（阿米卡星雾化替代）。Step 4: 决策生成 (Decision Making) - 根据指南Action，采用口服利福平+乙胺丁醇+大环内酯类（克拉霉素）联合阿米卡星雾化治疗；同时处理合并症（贫血纠正、饮食干预），并设定长期监测计划。",
    "medical_order": "予抗感染治疗：利福平600mg每日口服 + 乙胺丁醇15mg/kg每日口服 + 克拉霉素500mg每日两次口服 + 阿米卡星500mg每日两次雾化吸入。监测痰抗酸涂片及分枝杆菌培养每月一次，血常规、肝肾功能每周一次。予琥珀酸亚铁片0.1g每日三次口服纠正贫血。饮食建议低脂、高蛋白。评估静脉通路，必要时请血管外科会诊中心静脉置管。",
    "patient_dialogue": "张先生，我看了您的检查报告，您肺里的感染比之前严重了，导致您咳血、呼吸困难和晚上出汗多。这是因为一种叫玛尔摩分枝杆菌的病菌在作祟。现在我们要给您开三种药片：利福平、乙胺丁醇和克拉霉素，每天按医嘱吃；另外，您手臂的血管不太好打针，我们会改成雾化吸入一种叫阿米卡星的药，这样效果一样好，还能避免打针的痛苦。记住，吃药期间别吃太油腻的东西，像今天家属带的红烧肉，因为油脂会影响药物吸收，治效果就差了。您还有点贫血，我们会加一种补铁的药帮助您恢复体力。咱们每周会查血和痰，跟踪治疗效果。坚持用药，症状会慢慢缓解的，别太担心，我们一起努力。"
  },
  {
    "id": 1230,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者2月前无明显诱因出现午后低热（37.8–38.5℃），伴盗汗、体重下降8kg，偶有少量鲜血痰。外院胸CT示双肺上叶多发薄壁空洞及树芽征，痰涂片抗酸染色阳性，GeneXpert MTB阴性。CD4⁺ 42个/μL，HIV RNA 5.6×10⁵ cp/mL。既往：确诊AIDS 3年，曾自行中断抗病毒治疗；慢性乙肝（HBsAg⁺，HBV DNA<20IU/mL，未用TDF）；无糖尿病及高血压。入院查体：BMI 17.4kg/m²，口唇轻度紫绀，右上肺闻及爆裂音；肝脾肋下未触及；双下肢无水肿。实验室：WBC 3.1×10⁹/L，Hb 89g/L，CRP 68mg/L，ESR 102mm/h；肌酐74μmol/L，ALT 36U/L，ALB 28g/L；血培养阴性。痰分枝杆菌培养回报：龟分枝杆菌生长，药敏示对阿米卡星敏感（MIC≤1mg/L），亚胺培南中介（MIC 8mg/L），头孢西丁耐药（MIC>128mg/L），替加环素敏感（MIC 0.5mg/L）。患者诉昨日午后再次出现38.2℃发热，伴活动后气短，夜间需垫2个枕头入睡。今日病房护士反映患者因长期静脉用药焦虑，反复询问是否可改用口服药回家治疗。",
    "reference_rule": {
      "condition": "肺或播散性龟分枝杆菌感染患者",
      "action": "1. 根据药敏试验结果选用2种或3种（阿米卡星、亚胺培南、头孢西丁、替加环素）静脉用药",
      "contraindication": null,
      "evidence": "肺或播散性龟分枝杆感染：根据药敏试验结果选用2种或3种（阿米卡星、亚胺培南、头孢西丁、替加环素）静脉用药。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险（包括HIV/AIDS、慢性乙肝、营养不良和免疫缺陷），优先级为安全 > 疗效。需全网扫描潜在风险以确保治疗方案无冲突。\nStep 2: 临床解码 (Clinical Decoding) - 患者为严重免疫缺陷（CD4⁺ 42个/μL, HIV RNA 5.6×10⁵ cp/mL）的AIDS患者，合并肺龟分枝杆菌感染（基于CT空洞、树芽征、痰抗酸阳性及培养阳性），伴慢性乙肝（HBsAg⁺, HBV DNA<20IU/mL）、营养不良（BMI 17.4kg/m², ALB 28g/L）和贫血（Hb 89g/L）。隐式线索：曾中断ART导致HIV控制不佳；焦虑提示依从性问题；当前症状（发热、气短、夜间高枕）表明感染进展；HBV虽低载量但未治疗，有潜在激活风险；低白蛋白可能影响药物代谢。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件匹配：肺龟分枝杆菌感染患者。药敏显示阿米卡星敏感（MIC≤1mg/L）、替加环素敏感（MIC 0.5mg/L）、亚胺培南中介（MIC 8mg/L）、头孢西丁耐药（MIC>128mg/L），无明确禁忌症。安全扫描：阿米卡星有肾毒性风险（肌酐74μmol/L正常，但需监测）；替加环素可能加重消化道症状（营养不良需关注）；亚胺培南中介效果较差，且CNS副作用风险高；头孢西丁耐药排除。药物相互作用：ART重启需避免肾毒性药物（如TDF可能合用，但HBV DNA低风险小）；共病风险：HIV进展、HBV激活、营养不良可加重感染。\nStep 4: 决策生成 (Decision Making) - 根据指南Action，选用阿米卡星和替加环素静脉用药（两种敏感药物），排除中介或耐药选项。合并症管理：重启ART以控制HIV，选择含TDF方案覆盖HBV；添加营养支持；因焦虑和静脉用药需求，暂不改为口服药，以确保疗效和安全。",
    "medical_order": "1. 予阿米卡星静脉注射（15mg/kg/d，分次给药）；2. 予替加环素静脉注射（首剂100mg，后50mg q12h）；3. 重启ART方案（TDF/3TC/DTG qd）；4. 监测肾功能（肌酐、尿量）、肝功能（ALT）、血常规（WBC、Hb）、症状变化及药物不良反应；5. 营养支持（高蛋白肠内营养补充）；6. 心理护理干预。",
    "patient_dialogue": "张先生，我理解您对打针很焦虑，想回家吃口服药。但您的肺部感染比较重，需要强效药物直接进入血液才能控制病菌——口服药效果不够快，容易让病情反复。我们会尽量让注射过程舒服些，护士会多陪您聊天缓解紧张。另外，咱们得重新开始吃HIV药物，这能帮您的免疫系统恢复，同时预防乙肝问题。您最近体重掉得多，营养师会准备高蛋白食物帮您补身体。别担心，我们一起努力，等感染稳定了，咱们再讨论后续方案。您先安心治疗，好吗？"
  },
  {
    "id": 1257,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者4周前启动含多替拉韦/阿巴卡韦/拉米夫定方案，病毒载量由320 000 cp/ml降至12 000 cp/ml。近10天出现38.5–39.8 ℃弛张热，伴盗汗、乏力；右腋下及左腹股沟相继出现痛性核桃大皮下结节，表面皮肤暗红。外院曾予头孢曲松+左氧5日无改善。胸部CT：双肺散在2–4 mm小结节，无空洞；腹部增强CT示腹膜后多发1.2–1.8 cm淋巴结，环形强化。血常规：WBC 9.4×10⁹/L，N 78%，Hb 102 g/L，Plt 195×10⁹/L；ESR 92 mm/h，CRP 112 mg/L；PCT 0.18 ng/ml。两次痰AFB涂片阴性，GeneXpert MTB/RIF阴性；血培养3日无警报。HIV-RNA 12 000 cp/ml，CD4 42/μl。追问病史：患者起病前2周曾因“咳嗽”自行服用泼尼松20 mg/d共5天，症状短暂好转后反弹。今日体温再次升至39.6 ℃，结节触痛明显，影响夜间睡眠。患者职业为夜班出租车司机，担心长期请假被辞退。无腹泻、视力改变，近期体重下降4 kg。既往：8年前确诊HIV，未规律服药；无结核、糖尿病、慢阻肺史；吸烟10包年，已戒2年。用药：仅ART+复方新诺唑预防PCP，未用利福布汀或克拉霉素。实验室补充：ALT/AST 38/42 U/L，Scr 0.9 mg/dL，随机血糖5.8 mmol/L；尿酸512 μmol/L（患者随口提到“体检说我尿酸高，但关节不痛”）。",
    "reference_rule": {
      "condition": "诊断为NTM相关IRIS的患者",
      "action": "1. 对于轻度患者，进行对症处理，一般无需调整抗NTM和ART方案; 2. 对于临床症状重，反复持续高热的患者，使用泼尼松50～80mg/d，2～4周可减轻炎性反应，之后逐渐减量，一般不超过12周",
      "contraindication": null,
      "evidence": "IRIS通常具有自限性，对于轻度患者可进行对症处理，一般无需调整抗NTM和ART方案。对于临床症状重，反复持续高热的患者可使用泼尼松 50～80 mg/d，2～4 周可减轻炎性反应，之后逐渐减量，一般不超过 12 周。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及HIV免疫重建炎症综合征（IRIS）与潜在非结核分枝杆菌（NTM）感染的交互管理。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全性（如药物毒性、感染风险），再考虑疗效优化。Step 2: 临床解码 (Clinical Decoding) - 患者ART启动后病毒载量下降但未完全抑制（12,000 cp/ml），CD4+低（42/μl），提示免疫重建不全；弛张热、盗汗、乏力、痛性皮下结节及影像学（肺小结节、腹膜后淋巴结环形强化）符合NTM感染相关IRIS；炎症标志物（CRP 112 mg/L、ESR 92 mm/h）显著升高，PCT轻度升高（0.18 ng/ml）支持活跃炎症；外院抗生素无效、结核检查阴性强化NTM可能性；隐式线索包括自行泼尼松使用（20mg/d×5天）可能导致免疫紊乱和症状反弹，尿酸升高（512 μmol/L）提示高尿酸血症风险，ALT/AST轻度升高（38/42 U/L）警示潜在肝损伤，以及社会因素（职业压力）可能影响治疗依从性。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition '诊断为NTM相关IRIS的患者' 完全匹配病例；Action 2适用（临床症状重：反复高热39.6℃、结节痛影响睡眠）；Contraindication为null，但强制安全检查：泼尼松与ART药物（多替拉韦/阿巴卡韦/拉米夫定）无重大相互作用（多替拉韦代谢与皮质类固醇低风险），但泼尼松可能暂时升高尿酸和肝酶，需监测；共病风险包括高尿酸血症（可能诱发痛风）、轻度肝损和贫血（Hb 102 g/L），无绝对禁忌，安全优先级确保泼尼松剂量合理。Step 4: 决策生成 (Decision Making) - 根据指南Action 2，生成决策：启动泼尼松60mg/d（取50-80mg/d中间值）减轻炎症，2周后评估减量；维持当前ART方案；加强监测以防副作用；并行NTM确诊测试以优化长期管理。",
    "medical_order": "诊断：考虑非结核分枝杆菌（NTM）相关免疫重建炎症综合征（IRIS）。治疗：1. 予泼尼松60mg/d口服，计划2周后评估炎症反应，逐步减量，总疗程不超过12周；2. 维持多替拉韦/阿巴卡韦/拉米夫定抗逆转录病毒治疗（ART）及复方新诺唑预防肺孢子菌肺炎（PCP）；3. 完善NTM培养及药敏测试（如痰、淋巴结穿刺标本）；4. 监测：每日体温、疼痛评分；隔日血常规、CRP、ESR；每周肝功能（ALT/AST）、尿酸、肾功能；5. 避免其他免疫调节药物；6. 如症状加重，及时行淋巴结活检。",
    "patient_dialogue": "老张，我仔细看了您的检查结果。您这发烧和身上长的肿块，不是因为普通感染，而是身体在艾滋治疗过程中，免疫系统有点'反应过度'了，就像车子刚启动时引擎太猛一样。这很常见，但需要控制一下炎症。我会给您开一种叫泼尼松的药，每天60毫克，先吃两周，它能帮您退烧、减轻疼痛，后面我们再慢慢减量。您之前的艾滋药和预防肺炎的药还得继续吃，别停。不过泼尼松有点副作用，比如可能让尿酸更高，所以咱们得定期抽血查查肝和尿酸，平时多喝水，少吃海鲜和内脏。我知道您开夜班出租车担心请假，但身体是革命的本钱啊！咱们先把烧退下来、肿块消了，您才能安心工作。从今天起，每天量体温，如果痛得厉害或烧到39度以上，马上来医院。我理解这不容易，但咱们一步步来，好吗？"
  },
  {
    "id": 1250,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者38岁，男性，自由插画师，独居。10年前确诊HIV感染，基线CD4+ 42/μL，HIV RNA 5.8 log₁₀ copies/mL。4个月前启动比克替拉韦/恩曲他滨/丙酚替诺福韦复方ART，服药依从性100%。2周前出现38.5℃弛张热、盗汗、干咳，右颈部新发鸽蛋大疼痛性淋巴结，伴明显皮肤红斑。胸部CT示：右肺中叶新增斑片结节影，部分呈树芽征；纵隔淋巴结由1.1 cm增大至1.8 cm。实验室：HIV RNA <50 copies/mL（-1.9 log₁₀下降），CD4+ 180/μL（+138/μL）；WBC 9.1×10⁹/L，CRP 67 mg/L，ESR 92 mm/h。痰GeneXpert MTB/RIF阴性，分枝杆菌培养待报。血培养、G试验、GM试验、隐球菌抗原、巨细胞病毒PCR均阴性。肝肾功能正常，ART药物浓度达标。患者否认新发性接触、宠物暴露及近期旅行。今日步行入院，神情焦虑，抱怨'烧得更高，淋巴结痛得睡不了'。查体：T 38.9℃，HR 112次/分，SpO₂ 96%（RA）；右颈部2.5 cm×2 cm质韧淋巴结，触痛明显，皮肤温度升高；双肺听诊右中肺少许湿啰音。患者强调'药我一颗没落下，为什么影像反而恶化了？'",
    "reference_rule": {
      "condition": "艾滋病患者接受ART后，出现NTM原有症状加重、病灶进展或新病灶，且与新的机会性感染、HIV相关肿瘤、药物不良反应、治疗失败无关，同时ART后HIV RNA下降和(或)CD4+T淋巴细胞计数增加",
      "action": "1. 诊断为NTM相关免疫重建炎性综合征（IRIS）",
      "contraindication": null,
      "evidence": "诊断可参考：(1)艾滋病患者接受ART后，NTM原有症状加重，伴或不伴原有病灶进展或出现新病灶；(2)这种临床症状及病灶的进展与新的机会性感染、HIV相关肿瘤、药物不良反应、治疗失败无关；(3)ART后HIV RNA下降和(或)CD4+T淋巴细胞计数增加。IRIS的诊断需谨慎，需3名及以上有经验的临床医师进行判定。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于复杂合并症治疗场景，涉及HIV感染患者接受抗逆转录病毒治疗（ART）后出现的新症状和影像学变化，提示潜在免疫重建炎性综合征（IRIS）。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保患者安全（如监控炎症进展和呼吸状态），其次评估疗效。关键焦点包括ART药物（比克替拉韦/恩曲他滨/丙酚替诺福韦）的安全性、排除其他感染或肿瘤风险，以及IRIS的潜在并发症。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例提取关键信息：患者基线CD4+极低（42/μL），ART启动4个月后病毒抑制（HIV RNA <50 copies/mL）和免疫重建（CD4+增至180/μL），但2周前出现弛张热、盗汗、干咳、新发颈部疼痛性淋巴结伴皮肤红斑及肺部影像恶化（右肺中叶斑片结节影和纵隔淋巴结增大），提示急性炎症反应。隐式线索包括：症状发生于ART有效期（4个月后），符合IRIS典型时间窗；测试阴性（如痰GeneXpert、血培养、G试验等）排除新机会性感染（如结核、真菌或CMV）；ART依从性100%且浓度达标，排除药物不良反应或治疗失败；炎症标志物升高（CRP 67 mg/L、ESR 92 mm/h）和查体湿啰音，表明全身性炎症；患者焦虑和疑问反映对ART效果误解，需心理支持。转化为医学术语：可能的非结核分枝杆菌（NTM）相关免疫重建炎性综合征（IRIS），需确认NTM感染证据。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n与指南condition对齐：(1) ART后出现新症状（发热、咳嗽）和病灶进展（CT新增影）或新病灶（淋巴结增大）；(2) 测试阴性排除新机会性感染、HIV相关肿瘤、药物不良反应（ART浓度达标）和治疗失败（病毒抑制、CD4+增加）；(3) ART后HIV RNA下降和CD4+增加。完全匹配，符合NTM-IRIS诊断标准。Contraindication为null，无禁忌证据。安全检查：全网扫描ART药物相互作用——比克替拉韦/恩曲他滨/丙酚替诺福韦无已知严重药物相互作用；共病风险——炎症标志物升高和湿啰音提示呼吸道并发症风险，需监测呼吸功能；安全优先级确保无急性呼吸衰竭或败血症，当前SpO₂ 96%（RA）稳定。\n\n**Step 4: 决策生成 (Decision Making)**\n根据指南action（诊断为NTM相关IRIS），但参考证据要求谨慎诊断（需3名及以上有经验医师判定），因此决策为：初步诊断为HIV相关NTM-IRIS，建议立即组织多学科会诊（如感染科、呼吸科专家）确认诊断；继续当前ART方案并强化对症支持治疗；同时追踪分枝杆菌培养结果以排除活动性NTM感染。",
    "medical_order": "予诊断为HIV相关非结核分枝杆菌免疫重建炎性综合征（NTM-IRIS）初步考虑。建议如下：1. 继续当前ART方案（比克替拉韦/恩曲他滨/丙酚替诺福韦）。2. 召集多学科会诊（感染科、呼吸科≥3名专家）确认诊断。3. 监测生命体征（体温、心率、呼吸、SpO₂），每4小时记录；完善血常规、CRP、ESR动态追踪。4. 对症支持治疗：予非甾体抗炎药（如布洛芬）控制发热和疼痛；低流量氧疗备用（SpO₂<95%时启用）。5. 追踪分枝杆菌培养结果；复查胸部CT（72小时后）。6. 一级护理，卧床休息。",
    "patient_dialogue": "嗨，我明白您现在很着急，尤其是发烧和淋巴结痛让您睡不好觉，这确实很难受。但请别担心——您的ART药物其实在起好作用呢！病毒控制得非常好，免疫系统也在慢慢恢复，就像身体在重新‘充电’。但有时候，这个恢复过程会有点‘用力过猛’，引起发烧和淋巴结肿痛，这就好比伤口愈合时发痒一样，不是病情恶化，反而是好转的迹象。我们现在初步判断是这种反应，不是新感染或药物问题。接下来，我们会给您用点退烧和止痛药来缓解症状，帮您睡个好觉。同时，我会请几位专科专家一起讨论确认，确保万无一失。您只需要安心休息，有任何不适随时喊我，好吗？"
  },
  {
    "id": 1205,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者38岁，确诊HIV感染8年，目前ART方案为TDF/3TC/DTG，自述近3周出现渐进性乏力、低热（37.6–38.1 ℃）及夜间多汗，伴轻微干咳，无血痰。今日门诊查CD4+ T淋巴细胞计数 62个/μL（流式细胞仪，单次检测），病毒载量<50 copies/mL。既往史：2年前曾患肺外结核（颈淋巴结），已完成规范抗痨治疗；否认糖尿病、慢阻肺。实验室：WBC 3.8×10⁹/L，Hb 108 g/L，ALB 32 g/L，CRP 26 mg/L，ESR 58 mm/h；胸CT示右肺中叶小结节伴树芽征，未见空洞。痰涂片抗酸染色（+），但GeneXpert MTB/RIF阴性。患者担忧“是不是结核又犯了”，并提到自己每天骑外卖电动车10小时，近期天气湿热，自觉体力下降明显。",
    "reference_rule": {
      "condition": "CD4+ T淋巴细胞计数 < 100个/μL的患者",
      "action": "1. 阿奇霉素1200mg口服，每周1次; 或 2. 克拉霉素500mg口服，2次/d; 或 3. 利福布汀300mg口服，1次/d",
      "contraindication": null,
      "evidence": "推荐对ＣＤ４＋Ｔ淋巴细胞计数＜１００个／μＬ的患者进行一级预防，阿奇霉素（１２００ｍｇ口服，每周１次）或克拉霉素（５００ｍｇ口服，２次／ｄ）或利福布汀（３００ｍｇ口服，１次／ｄ），直至ＣＤ４＋Ｔ淋巴细胞计数＞１００个／μＬ。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，作为专科专家，重点关注全网扫描药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。需全面评估ART方案与潜在抗感染药物的兼容性，排除危及生命的相互作用。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者为38岁HIV感染者，CD4+ T淋巴细胞计数62个/μL（严重免疫抑制），病毒载量<50 copies/mL（ART有效）。症状（渐进性乏力、低热、夜间盗汗、干咳）联合实验室（WBC轻度减少、贫血Hb 108 g/L、低白蛋白ALB 32 g/L、炎症标志物CRP/ESR升高）及影像学（右肺中叶树芽征）提示活动性感染风险。痰涂片抗酸染色阳性但GeneXpert阴性，结合既往肺外结核史，高度疑似结核复发（隐式线索：CD4<100个/μL增加机会性感染风险；低白蛋白和贫血暗示营养不良；工作劳累及湿热天气可能加剧免疫紊乱）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition（CD4<100个/μL）完全匹配，action提供MAC一级预防选项（阿奇霉素、克拉霉素或利福布汀）。强制安全检查：利福布汀（CYP3A4诱导剂）与当前ART方案（DTG为CYP3A4底物）存在显著相互作用风险，可能降低DTG浓度导致治疗失败；阿奇霉素和克拉霉素相互作用较小。患者有活动性结核迹象（症状+痰涂片阳性），优先诊断和治疗结核而非单纯预防。指南contraindication为null，但需排除肝肾功能异常（未提供数据）。\n\nStep 4: 决策生成 (Decision Making) - 根据指南action及安全优先级，决策：予阿奇霉素1200mg口服每周1次进行MAC预防（避免药物相互作用）；同时优先处理结核疑似，启动经验性抗结核治疗并完善诊断。安全为首要考量，暂避利福布汀。",
    "medical_order": "完善痰培养、GeneXpert MTB/RIF复查、结核菌素试验及肝功能检测；启动经验性抗结核治疗：异烟肼300mg口服每日1次、利福平600mg口服每日1次（注意ART相互作用，监测DTG浓度）、吡嗪酰胺1500mg口服每日1次、乙胺丁醇1200mg口服每日1次；予阿奇霉素1200mg口服每周1次用于MAC预防；监测血常规、CD4计数、病毒载量及药物不良反应；建议营养支持并限制体力活动。",
    "patient_dialogue": "张先生，我理解您担心结核又犯了，从您说的乏力、出汗和咳嗽这些症状，加上检查结果，确实有点像结核在活动。咱们不能耽误，得先做点更准的检查确认一下，同时我给您开些药先治着，以防万一。另外，您免疫力比较低，我加一种预防药，每周吃一次就行，能保护您别染上其他感染。您提到送外卖跑得辛苦，天气又闷热，这对身体负担大，我建议您这几天多休息，少干活，把身体养好最重要。别太焦虑，咱们一步步来，我会帮您盯紧的。"
  },
  {
    "id": 1211,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者今日由爱人推轮椅进入诊室，近4周出现38℃左右的弛张热，盗汗明显，咳少量白黏痰，活动后气促。既往史：HIV感染10年，曾中断抗病毒治疗2年；2个月前因“右颈淋巴结脓肿”在外院切开引流，脓液抗酸染色阳性但TB-DNA阴性，培养报告“鸟-胞内分枝杆菌”。胸片：双肺弥漫性细小结节伴右中叶不张；HRCT见支气管扩张伴树芽征。实验室：Hb 89 g/L，ALT 38 U/L，肌酐72 μmol/L，CD4 32个/μL，VL 1.4×10⁵ copies/mL。当前用药：替诺福韦+拉米夫定+多替拉韦，已重启2周。患者主诉听力较术前下降，否认眩晕；爱人补充患者因腹泻频繁，近3周体重又降4 kg。今日复诊目的是制定抗MAC方案并评估是否需住院。诊室空调坏了，患者仍裹着厚外套，额角可见细密汗珠。",
    "reference_rule": {
      "condition": "确诊鸟-胞内分枝杆菌病（MAC病）的患者",
      "action": "1. 克拉霉素500mg口服，1次/d 或 阿奇霉素500mg口服，1次/d + 乙胺丁醇15mg·kg⁻¹·d⁻¹; 2. 在此基础上加3～4种药物（阿米卡星、链霉素、左氧氟沙星或莫西沙星）联合治疗; 3. 推荐检测克拉霉素和阿奇霉素敏感性; 4. 疗程结束继续二级预防阿奇霉素或克拉霉素或利福布汀，直至CD4+ T淋巴细胞计数 > 100个/μL",
      "contraindication": null,
      "evidence": "治疗方案：在克拉霉素／阿奇霉素（５００ｍｇ口服，１次／ｄ）＋乙胺丁醇（１５ｍｇ·ｋｇ－１·ｄ－１）的基础上再加上３～４种药物（阿米卡星、链霉素、左氧氟沙星或莫西沙星）联合治疗。推荐检测克拉霉素和阿奇霉素敏感性。疗程结束继续二级预防阿奇霉素或克拉霉素或利福布汀。直至ＣＤ４＋Ｔ淋巴细胞计数＞１００个／μＬ。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于复杂合并症治疗场景，涉及HIV感染与鸟-胞内分枝杆菌病（MAC病）的协同管理，并伴有贫血、营养不良及活动受限。作为专科专家，我将重点全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全性，再优化疗效。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n关键医学术语转化：弛张热38℃、盗汗、咳嗽白黏痰及活动后气促提示活动性MAC感染；胸片与HRCT显示双肺弥漫性细小结节伴右中叶不张、支气管扩张伴树芽征，证实MAC肺病；HIV感染（CD4 32/μL，病毒载量1.4×10⁵ copies/mL）表明严重免疫抑制，ART重启仅2周，病毒控制不佳；Hb 89 g/L指示贫血（可能与感染或营养不良相关）；ALT 38 U/L提示轻度肝损伤风险；腹泻频繁、3周体重降4kg反映营养不良及潜在吸收障碍；听力下降（否认眩晕）可能为药物副作用（如ART相关）；患者坐轮椅、裹厚外套出汗显示功能状态差及持续发热。隐式线索：ART中断史可能导致耐药风险，腹泻需排除机会性感染（如巨细胞病毒或药物副作用）。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南Condition（确诊MAC病）完全匹配，无直接禁忌症（Contraindication null）。但全网扫描风险：ART药物（多替拉韦等）与大环内酯类（克拉霉素/阿奇霉素）潜在相互作用（CYP450代谢竞争，可能升高ART浓度）；乙胺丁醇或氨基糖苷类（如阿米卡星）可能加重神经毒性或耳毒性（患者已有听力下降）；氟喹诺酮类（如左氧氟沙星）与ART相互作用较低，但需监测QT间期；共病风险包括贫血加重、肝肾功能影响（ALT轻度升高）、营养不良恶化及腹泻病因未明。安全优先：避免耳毒性药物，选择相互作用少的方案，监测肝肾功能及听力。\n\n**Step 4: 决策生成 (Decision Making)**\n基于指南Action：1. 选择阿奇霉素500mg/d口服（优于克拉霉素，减少与ART相互作用）。2. 加乙胺丁醇15mg/kg/d口服（按体重计算）。3. 加左氧氟沙星500mg/d口服（避免注射剂，减少耳毒性风险；不加阿米卡星/链霉素）。4. 推荐检测阿奇霉素敏感性。5. 疗程后二级预防（阿奇霉素）待CD4>100/μL。额外决策：因发热、气促、营养不良及免疫抑制状态，建议住院监测；优化ART依从性；处理腹泻及营养支持。",
    "medical_order": "诊断：1. 鸟-胞内分枝杆菌肺病；2. HIV感染（CD4 32/μL，病毒载量1.4×10⁵ copies/mL）；3. 贫血；4. 营养不良；5. 腹泻待查。\n计划：\n1. 抗MAC治疗：予阿奇霉素500mg口服，1次/d + 乙胺丁醇15mg/kg/d口服（按体重计算剂量） + 左氧氟沙星500mg口服，1次/d。推荐检测阿奇霉素敏感性。\n2. 继续ART方案：替诺福韦300mg/d + 拉米夫定300mg/d + 多替拉韦50mg/d。\n3. 建议住院：予一级护理，监测生命体征、发热、腹泻及药物不良反应。\n4. 完善检查：血常规、肝肾功、CD4计数、病毒载量、听力评估、粪便培养及寄生虫检查。\n5. 支持治疗：营养科会诊，予高蛋白饮食，必要时肠内营养支持；对症处理腹泻。\n6. 随访：每周评估治疗反应，疗程结束后启动二级预防（阿奇霉素）直至CD4>100/μL。",
    "patient_dialogue": "张先生/女士，您好！我知道您最近发烧、出汗多，咳嗽、气短，体重也掉了不少，爱人说您还经常拉肚子。这些症状说明您肺部有个特殊感染需要抓紧治疗。我和您爱人商量一下：我建议您今天住院观察几天，这样我们能随时调整用药，帮您退烧、止泻，还能补充营养。咱们会加几种新药，比如阿奇霉素和乙胺丁醇，都是口服的，再加上另一种叫左氧的药。这些药效果好，但可能让您有点恶心或耳鸣，住院时咱们能及时处理。您之前的艾滋病药要继续吃，不能停。另外，您说听力不太好，我们会检查一下原因，可能是药的影响。拉肚子的事，咱们得做个便检看看是不是感染。别担心体重下降，住院期间营养师会帮您订餐，加点高蛋白食物。您坚持配合，咱们一步一步来，会好起来的！"
  },
  {
    "id": 1248,
    "file_name": "非结核分支杆菌（与结核不同，是另外一种疾病）-艾滋病患者合并非结核分枝杆菌感染诊治专家共识.json",
    "case_input": "患者4个月前开始出现午后低热（最高38.3℃），伴盗汗、体重下降11kg，曾在当地县医院按“肺结核”给予HRZE四联治疗2个月，痰AFB涂片仍阳性，症状无缓解。1周前出现晨起痰中带鲜红色血丝，量约5ml/日，遂来我院。既往：2019年确诊HIV感染，确诊时CD4 42/μL，一直未规律抗病毒治疗；2022年因口腔念珠菌感染住院，出院后仍偶尔漏服复方磺胺甲噁唑。无糖尿病、无慢阻肺。查体：消瘦，BMI 17.4 kg/m²，口腔黏膜可见白斑，右肺上野闻及少量湿啰音，余无明显异常。实验室：CD4 28/μL（流式），HIV RNA 284000 copies/mL；血常规WBC 3.1×10⁹/L，Hb 89g/L；肝肾功能正常；CRP 62mg/L，ESR 98mm/h。胸部HRCT：右肺上叶尖后段斑片影伴空洞，内壁光滑，周围可见小结节树芽征，纵隔淋巴结肿大（短径1.4cm）。痰GeneXpert MTB/RIF阴性，但痰AFB涂片（++）；送检分枝杆菌培养及菌种鉴定，结果尚未回报。今日门诊，患者焦虑询问：“医生，我吃了结核药怎么还咯血？是不是耐药？”",
    "reference_rule": {
      "condition": "HIV/AIDS患者合并NTM感染",
      "action": "1. 如有菌种鉴定结果，根据不同菌种选择敏感药物; 2. 如无菌种鉴定结果，选择5～6种药物联合治疗; 3. 强化期6～12个月; 4. 在NTM培养结果阴转后继续治疗12个月以上",
      "contraindication": null,
      "evidence": "（１）如有菌种鉴定结果，根据不同菌种选择敏感药物，治疗效果不佳者，根据菌种进行药敏试验。（２）如无菌种鉴定结果，则选择选择５～６种药物联合治疗，强化期6∼126∼12个月，在ＮＴＭ培养结果阴转后继续治疗１２个月以上。（３）不同ＮＴＭ病的用药种类和疗程可有所不同。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，重点关注HIV/AIDS合并机会感染的诊疗。作为博学的专科专家，我的思维重点是全网扫描药物相互作用、禁忌症及共病风险，优先级确保安全大于疗效。Step 2: 临床解码 (Clinical Decoding) - 患者关键信息包括：严重免疫缺陷（CD4 28/μL, HIV RNA 284000 copies/mL）、午后低热、盗汗、体重下降11kg、咯血5ml/日，结合痰AFB涂片阳性但GeneXpert MTB/RIF阴性，提示高度可能为非结核分枝杆菌（NTM）感染而非肺结核；既往未规律抗病毒治疗（ART）和预防用药（复方磺胺甲噁唑漏服），增加了机会感染风险；影像学显示右肺上叶空洞伴树芽征和纵隔淋巴结肿大，支持感染性病变；隐式线索包括咯血可能源于空洞或支气管扩张出血，以及未规律ART可能导致免疫恢复不全，加重感染。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 参考指南条件'HIV/AIDS患者合并NTM感染'完美匹配病例。指南无禁忌证（contraindication null）。安全检查：需评估NTM治疗药物（如大环内酯类）与ART的相互作用（例如利福霉素类可能降低ART药物浓度），优化ART以提升免疫力；咯血需监测出血风险以防恶化；无其他已知禁忌症（如肝肾功能正常）。Step 4: 决策生成 (Decision Making) - 根据指南action，当前无菌种鉴定结果（分枝杆菌培养未回报），故选择5～6种药物联合经验性NTM治疗，强化期6～12个月，并在培养阴转后继续12个月以上。同时，必须整合ART优化和咯血管理，确保安全优先。",
    "medical_order": "诊断：HIV/AIDS合并疑似非结核分枝杆菌（NTM）肺病伴咯血。\n治疗：\n1. 启动经验性NTM治疗：联合阿奇霉素500mg PO daily、乙胺丁醇1200mg PO daily、利福布汀300mg PO daily、阿米卡星500mg IV daily、莫西沙星400mg PO daily（共5种药物），强化期至少6个月，待分枝杆菌培养及菌种鉴定结果回报后调整方案。\n2. 优化抗逆转录病毒治疗（ART）：予依非韦伦600mg PO daily + 替诺福韦300mg PO daily + 恩曲他滨200mg PO daily，QD；监测HIV RNA和CD4变化。\n3. 咯血管理：卧床休息，避免剧烈活动；予氨甲环酸1g PO TID止血；密切监测出血量及生命体征。\n4. 预防机会感染：予复方磺胺甲噁唑960mg PO daily（TMP-SMX）预防肺孢子菌肺炎（PCP）；口腔念珠菌感染予氟康唑100mg PO daily。\n5. 支持治疗：营养支持，予高蛋白饮食；监测体重、血常规及肝肾功能。\n监测：每周复查痰AFB涂片及培养；每2周评估CD4、HIV RNA、CRP、ESR；强化期内每月复查胸部影像；定期评估药物相互作用（如利福布汀与ART浓度）。",
    "patient_dialogue": "您好，我理解您很担心，特别是咯血和之前的结核药没效果，这确实让人焦虑。别急，我来一步步解释。您的症状，比如下午发烧、出汗多、体重减轻，还有新出现的咯血，很可能不是普通的肺结核，而是另一种细菌感染，叫做非结核分枝杆菌（NTM）。这就是为什么之前的结核药效果不好——它针对的是不同的病菌。现在，我们需要换一种治疗方法：用五种药物一起上阵，就像团队作战一样，来对付这个感染。同时，您的HIV药物必须严格按时服用，因为只有免疫力上去了，身体才能更好地对抗感染。至于咯血，它可能和肺部的空洞有关，我们会用止血药帮您控制，并让您多休息，避免用力咳嗽或运动。记住，坚持吃药是关键——我们会定期检查，确保药物安全有效，帮您慢慢恢复。您有什么问题或担心，随时跟我说，我们一起来面对。"
  }
]