[
  {
    "id": 1527,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景D",
    "case_input": "患者今日复诊，主诉持续性干咳伴夜间盗汗加重1周，体重近2个月下降5kg。既往有肺结核病史2年，6个月前痰培养确诊为耐多药结核（药敏试验显示对异烟肼和利福平耐药，同时对乙胺丁醇部分耐药）。合并2型糖尿病3年，近期空腹血糖波动在8-10mmol/L（未达标）。查体：体温37.8°C，呼吸稍促，右下肺可闻及细湿啰音。干扰信息：患者在工地工作时偶有接触粉尘，自述上周因淋雨感冒后轻微咽痛，但无发热。实验室报告：今日痰涂片抗酸杆菌阳性，胸部CT显示右上肺空洞扩大伴新发浸润影；血常规提示轻度贫血（Hb 105g/L）。",
    "reference_rule": {
      "condition": "耐药结核和耐多药结核（对至少包括异烟肼和利福平在内的2种以上药物产生耐药）",
      "action": "1. 强化期包含至少5种有效抗结核药物：包括吡嗪酰胺及4个核心二线抗结核药物（A组1个：氟喹诺酮类如高剂量左氧氟沙星≥750 mg/d、莫西沙星或加替沙星；B组1个：二线注射类药物如阿米卡星、卷曲霉素、卡那霉素或链霉素；C组2个：其他二线核心药物如乙硫异烟胺或丙硫异烟胺、环丝氨酸或特立齐酮、利奈唑胺和氯法齐明）; 2. 如果以上选择不能组成有效方案，加入1种D2组药物（贝达喹啉或德拉马尼），再从D3组选择其他有效药物（对氨基水杨酸、亚胺培南西司他丁、美罗培南、阿莫西林克拉维酸、氨硫脲）; 3. 组成含5种有效抗结核药物的方案",
      "contraindication": null,
      "evidence": "耐药结核和耐多药结核：对至少包括异烟肼和利福平在内的2种以上药物产生耐药的结核为耐多药结核（multi-drug resistance tuberculosis, MDR-TB）。WHO根据药物的有效性和安全性将治疗耐药结核的药物分为A、B、C、D 4组，其中A、B、C组为核心二线药物，D组为非核心的附加药物。A组：氟喹诺酮类，包括高剂量左氧氟沙星（≥750 mg/d）、莫西沙星及加替沙星；B组：二线注射类药物，包括阿米卡星、卷曲霉素、卡那霉素、链霉素；C组：其他二线核心药物，包括乙硫异烟胺（或丙硫异烟胺）、环丝氨酸（或特立齐酮）、利奈唑胺和氯法齐明；D组：可以添加的药物，但不能作为MDR-TB治疗的核心药物，分为3个亚类：D1组包括吡嗪酰胺、乙胺丁醇和高剂量异烟肼；D2组包括贝达喹啉和德拉马尼；D3组包括对氨基水杨酸、亚胺培南西司他丁、美罗培南、阿莫西林克拉维酸、氨硫脲。注：耐药结核治疗的强化期应包含至少5种有效抗结核药物，包括吡嗪酰胺及4个核心二线抗结核药物：A组1个，B组1个，C组2个。如果以上的选择仍不能组成有效方案，可以加入1种D2组药物，再从D3组选择其他有效药物，从而组成含5种有效抗结核药物的方案。"
    }
  },
  {
    "id": 1612,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者自述持续性干咳已近3个月，伴有夜间盗汗和体重减轻约5公斤。近一周出现咳血丝痰，偶有低热（体温波动在37.5-38.0°C）。查体：消瘦外观，面色苍白，双肺听诊右上肺可闻及固定性湿啰音。初步胸片显示右上肺野空洞性病变伴浸润影，痰涂片抗酸染色阳性。患者提到近期工地赶工期，工作压力大导致失眠（干扰信息：患者还抱怨轻微背痛，但无外伤史）。",
    "reference_rule": {
      "condition": "诊断为活动性肺结核",
      "action": "1. 遵循早期、规律、全程、适量、联合的治疗原则; 2. 整个治疗方案分强化期和巩固期两个阶段; 3. 化学治疗的主要作用为杀菌和灭菌、防止耐药菌产生、减少结核菌的传播",
      "contraindication": null,
      "evidence": "结核病化学治疗的基本原则是早期、规律、全程、适量、联合。整个治疗方案分强化期和巩固期两个阶段。化学治疗的主要作用为杀菌和灭菌、防止耐药菌产生、减少结核菌的传播。"
    }
  },
  {
    "id": 1633,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景C",
    "case_input": "患者李女士，35岁，小学语文教师，今天下午来社区医院复诊，自诉过去两个月一直在接受标准抗结核治疗（服用异烟肼、利福平、吡嗪酰胺和乙胺丁醇）。然而，她咳嗽和咳痰的症状不仅没有缓解，反而加重，最近一周咳出带血丝的痰液，并伴有持续低热（最高37.8°C）和盗汗。体重减轻了4公斤，患者显得疲惫不堪。作为教师，她最近因备课压力大，常熬夜到深夜；天气转凉后，她感觉症状更明显，还轻微抱怨了无关的肩部酸痛（可能是伏案工作所致）。治疗期间，她规律服药，但无明显改善迹象。",
    "reference_rule": {
      "condition": "临床疑似肺结核者；直接涂片抗酸杆菌镜检阳性者；肺结核治疗过程中出现明显不良反应者；抗肺结核治疗效果不佳者",
      "action": "1. 填写《肺结核患者转诊单》，及时将患者转诊至县级以上结核病防治所或有条件诊治结核病的综合医院进行确诊或治疗; 2. 在非结核病定点医疗机构确诊的肺结核患者，转诊到当地结核病定点医疗机构进行门诊或住院治疗; 3. 在定点医疗机构确诊的肺结核患者，可在确诊机构治疗，或将患者转诊到其居住地定点医疗机构继续治疗",
      "contraindication": null,
      "evidence": "普通转诊建议：(1) 临床疑似肺结核者；(2) 直接涂片抗酸杆菌镜检阳性者；(3) 肺结核治疗过程中出现明显不良反应者；(4) 抗肺结核治疗效果不佳者。"
    }
  },
  {
    "id": 1671,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "28岁男性患者，职业为小学教师，因进行性呼吸困难2个月、加重1周前来门诊复诊。患者3个月前被确诊为肺结核，目前正在接受全身抗结核化学治疗（异烟肼、利福平、吡嗪酰胺、乙胺丁醇方案）。近1周呼吸困难明显恶化，尤其在爬楼梯或轻微活动后，出现喘息和持续性干咳，无咯血。查体：呼吸频率26次/分（正常参考值12-20次/分），血氧饱和度91%（室内空气），听诊右肺呼吸音显著减弱，未闻及啰音。胸部高分辨率CT显示右主支气管及右上叶支气管明显狭窄，狭窄程度达75%，伴有局部管壁增厚和钙化，提示气管支气管结核病变。患者还提及最近天气转凉多雨，感觉疲劳加重，且偶有轻微头晕（无眩晕或意识障碍）。",
    "reference_rule": {
      "condition": "气管支气管结核导致叶及叶以上支气管明显狭窄，影响呼吸功能或导致呼吸衰竭",
      "action": "1. 在全身抗结核化学治疗基础上; 2. 同时给予冷冻、球囊扩张等气道介入治疗",
      "contraindication": null,
      "evidence": "气管支气管结核所致气道狭窄：气管支气管结核导致叶及叶以上支气管明显狭窄时常影响患者呼吸功能，严重者有呼吸衰竭，需在全身抗结核化学治疗基础上，同时给予冷冻、球囊扩张等气道介入治疗。"
    }
  },
  {
    "id": 1674,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者是一名45岁男性，建筑工人，今天因持续性咳嗽伴痰中带血丝、低热和体重减轻两周前来门诊就诊。他既往一年前被诊断为肺结核，完成了标准初治方案治疗并宣布临床治愈。近两周症状复发，包括干咳加重、夜间盗汗明显，自述体重减轻约4公斤。体格检查：体温37.6°C，呼吸频率稍快（22次/分），左下肺可闻及细湿啰音。初步痰涂片检查阴性，胸部X光显示左上肺叶新发浸润影。同时，患者提到最近因工地赶工导致睡眠不足和轻微头痛（但无神经系统症状）。",
    "reference_rule": {
      "condition": "复治活动性肺结核（含痰涂片阳性和阴性）",
      "action": "1. 使用常用方案为2HRZSE/6HRE，3HRZE/6HR，或2HRZSE/1HRZE/5HRE; 2. 进行药敏试验; 3. 对上述方案治疗无效的复治肺结核，参考耐多药结核可能，按耐药或耐多药结核治疗",
      "contraindication": null,
      "evidence": "复治活动性肺结核（含痰涂片阳性和阴性）：常用方案为2HRZSE/6HRE，3HRZE/6HR，2HRZSE/1HRZE/5HRE。复治结核应进行药敏试验，对上述方案治疗无效的复治肺结核应参考耐多药结核可能，需按耐药或耐多药结核治疗。"
    }
  },
  {
    "id": 1712,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景C",
    "case_input": "52岁男性建筑工人今天在社区全科门诊复诊肺结核。患者3个月前诊断为右肺上叶空洞性肺结核，开始接受标准一线抗结核药物治疗（包括异烟肼、利福平、吡嗪酰胺和乙胺丁醇）。然而，他主诉持续剧烈咳嗽、咯血加重和进行性呼吸困难，体重下降8公斤。今早复查胸部CT显示右肺上叶空洞病变范围扩大（直径从3cm增至5cm），伴有新发浸润影和胸膜增厚，提示治疗失败且病变局限化。患者氧饱和度降至92%（室内空气），并自述最近工地加班频繁导致腰背酸痛（无关轻微主诉）。全科医生评估发现患者精神萎靡，呼吸频率25次/分，肺部听诊可闻及湿啰音。",
    "reference_rule": {
      "condition": "药物治疗失败或威胁生命的单侧肺结核特别是局限性病变",
      "action": "1. 考虑外科治疗作为可选用的重要治疗方法",
      "contraindication": null,
      "evidence": "对于药物治疗失败或威胁生命的单侧肺结核特别是局限性病变，外科治疗是可选用的重要治疗方法。"
    }
  },
  {
    "id": 1721,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景F",
    "case_input": "在基层卫生服务中心的午间门诊，一位年轻母亲抱着4岁的儿子匆忙走进诊室，外面正下着小雨，母亲的外套被淋湿了半边。她焦急地描述孩子已持续咳嗽3周，伴有间歇性低热（最高37.8°C）和夜间盗汗，今早还抱怨轻微腹痛，但无呕吐或腹泻。母亲透露，孩子父亲一个月前在县级医院被确诊为痰涂片阳性肺结核，目前在家隔离治疗。患儿精神萎靡，呼吸稍促，听诊肺部可闻及散在湿啰音，体温37.5°C。",
    "reference_rule": {
      "condition": "符合下列条件之一者：1. 有肺结核可疑症状的5岁以下儿童，同时伴有与痰涂片阳性肺结核患者密切接触史或TST强阳性或IGRA阳性；2. 仅胸部影像学检查结果显示有与活动性肺结核相符的病变",
      "action": "1. 按乙类传染病疫情报告要求进行网络直报; 2. 完整填写《肺结核病例登记报告卡》; 3. 填写《肺结核患者转诊单》并及时转诊至县级以上结核病防治所或有条件诊治结核病的综合医院",
      "contraindication": null,
      "evidence": "疑似病例：符合下列条件之一者为疑似病例：① 有肺结核可疑症状的5岁以下儿童，同时伴有与痰涂片阳性肺结核患者密切接触史或TST强阳性或IGRA阳性；② 仅胸部影像学检查结果显示有与活动性肺结核相符的病变。"
    }
  },
  {
    "id": 1723,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景F",
    "case_input": "患者今天准时来到社区诊所复诊，结核病治疗已进入第二周。护士在核对用药记录时发现他昨日未按计划前来服药点，患者自述因工作繁忙（昨天暴雨导致外卖订单激增）而无法抽身。他还附带提到近期有轻微失眠问题，但咳嗽和发热等结核症状较初诊时明显减轻。",
    "reference_rule": {
      "condition": "肺结核患者在治疗过程中",
      "action": "1. 每次用药都必须在医务人员的直接监督下进行; 2. 因故未用药时必须采取补救措施以保证按医嘱规律用药",
      "contraindication": null,
      "evidence": "直接面视下短程督导治疗：直接面视下短程督导治疗是指肺结核患者在治疗过程中，每次用药都必须在医务人员的直接监督下进行，因故未用药时必须采取补救措施以保证按医嘱规律用药。督导治疗可以提高治疗依从性，保证规律用药，从而显著提高治愈率，降低复发率和死亡率，同时降低结核病的患病率和多耐药发生率。"
    }
  },
  {
    "id": 1754,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景D",
    "case_input": "45岁男性，建筑工人，今天来社区门诊复诊糖尿病管理。他有2型糖尿病病史5年，目前口服二甲双胍治疗，但血糖控制不佳（空腹血糖9.8 mmol/L，HbA1c 8.3%）。患者自述近一周有轻微关节痛，尤其在寒冷天气加剧，但无其他明显不适（噪音）。体格检查：心肺听诊正常，无肺部啰音或异常呼吸音。既往史包括高血压2年，服用氨氯地平控制。医生注意到患者长期暴露于工地粉尘（矽肺风险因素），但未确诊矽肺。在评估过程中，医生记录了患者属于肺结核高危人群（糖尿病），并观察到患者体形消瘦（BMI 18.5 kg/m²），考虑其结核感染风险。",
    "reference_rule": {
      "condition": "高危人群：HIV感染者、痰涂片阳性肺结核的密切接触者、肺部硬结纤维病灶（无活动性）、矽肺、糖尿病、长期使用糖皮质激素或免疫抑制剂者、吸毒者、营养不良者、35岁以下结核菌素试验硬结直径≥15 mm者等",
      "action": "1. 使用预防性抗结核化学治疗; 2. 常用异烟肼300 mg/d，顿服6-8个月，儿童每日用量为4~8 mg/kg；或者利福平和异烟肼联用3个月，每日顿服或每周3次",
      "contraindication": null,
      "evidence": "高危人群使用预防性抗结核治疗可减少肺结核发病率。预防性化学治疗主要应用于受结核菌感染易发病的高危人群。包括HIV感染者、痰涂片阳性肺结核的密切接触者、肺部硬结纤维病灶（无活动性）、矽肺、糖尿病、长期使用糖皮质激素或免疫抑制剂者、吸毒者、营养不良者、35岁以下结核菌素试验硬结直径≥15 mm者等。常用异烟肼300 mg/d，顿服6-8个月，儿童每日用量为4~8 mg/kg；或者利福平和异烟肼联用3个月，每日顿服或每周3次。"
    }
  },
  {
    "id": 1759,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景D",
    "case_input": "患者为建筑工人，因皮肤巩膜重度黄染伴恶心呕吐2小时来急诊。正在接受标准四联抗结核治疗（异烟肼+利福平+吡嗪酰胺+乙胺丁醇）第3周。查体见全身散在瘀斑，血压85/50mmHg。实验室急报：总胆红素186μmol/L，ALT 1420U/L，INR 2.8，血小板32×10⁹/L。家属提到患者近三日有轻微足部皮疹未重视，今晨搬运建材时突然虚脱。听诊双肺呼吸音粗，未吸氧下SpO₂ 92%。",
    "reference_rule": {
      "condition": "存在较严重的合并症或并发症：大气道狭窄有窒息风险者；短时间内出现呼吸、循环系统衰竭症状及体征者；发生大咯血、生命体征不稳定者；或治疗中出现严重不良反应和脏器功能衰竭：急性肝衰竭、急性肾衰竭、严重皮肤过敏反应、严重骨髓抑制或明显出血倾向等",
      "action": "1. 立即进行紧急抢救; 2. 转到县级以上医院的传染科或结核病科积极抢救; 3. 待病情稳定后及时转诊到县结核病防治所或结核病定点医院继续治疗管理",
      "contraindication": null,
      "evidence": "紧急转诊建议：(1) 存在较严重的合并症或并发症：大气道狭窄有窒息风险者；短时间内出现呼吸、循环系统衰竭症状及体征者；发生大咯血、生命体征不稳定者；(2) 治疗中出现严重不良反应和脏器功能衰竭：急性肝衰竭、急性肾衰竭、严重皮肤过敏反应、严重骨髓抑制或明显出血倾向等。"
    }
  },
  {
    "id": 1764,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景F",
    "case_input": "今天在社区诊所门诊中，一位28岁的男性建筑工人前来就诊，主诉持续干咳已三周，伴有少量黄痰，无咯血，但最近一周出现夜间盗汗、低热（体温37.6°C）、乏力明显，食欲减退，体重减轻约5公斤。他还提到工地工作粉尘大，但无关紧要地补充说昨天淋雨后有点轻微头痛。体格检查显示呼吸音稍粗，无其他明显异常。",
    "reference_rule": {
      "condition": "具有结核中毒症状（低热、乏力、盗汗、食欲减退、体重减轻等），或伴呼吸道症状者（咳嗽、咳痰2周以上，或伴咯血、痰中带血），或通过健康体检发现的肺部阴影疑似肺结核者",
      "action": "1. 进一步完善相关检查明确是否为肺结核; 2. 在门诊日志标注疑似肺结核病例; 3. 按乙类传染病疫情报告要求进行网络直报; 4. 完整填写《肺结核病例登记报告卡》; 5. 填写《肺结核患者转诊单》并及时转诊至县级以上结核病防治所或有条件诊治结核病的综合医院",
      "contraindication": null,
      "evidence": "具有结核中毒症状（低热、乏力、盗汗、食欲减退、体重减轻等），或伴呼吸道症状者（咳嗽、咳痰2周以上，或伴咯血、痰中带血），或通过健康体检发现的肺部阴影疑似肺结核者，应考虑为肺结核可疑者，需进一步完善相关检查明确是否为肺结核。"
    }
  },
  {
    "id": 1767,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景C",
    "case_input": "患者完成6个月标准抗结核治疗后首次复诊。自述全程坚持服药无中断，末次痰检报告显示阴性（治疗第5个月复查记录：痰涂片阴性）。现轻微咳嗽，无发热盗汗。职业需露天作业，近期阴雨天气致左膝关节旧伤复发。",
    "reference_rule": {
      "condition": "肺结核患者完成治疗后",
      "action": "1. 根据疗效判断标准评估：治愈（痰涂片阳性肺结核患者完成规定疗程，连续2次痰涂片结果阴性，其中1次是治疗末）；完成疗程（痰涂片阴性肺结核患者完成规定的6个月标准疗程，疗程末痰涂片检查结果阴性或未痰检者；痰涂片阳性肺结核患者完成规定的6-12个月疗程，最近一次痰检结果阴性，完成疗程时无痰检结果）；结核死亡（活动性肺结核患者因病变进展或并发咯血、自发性气胸、肺心病、全身衰竭或肺外结核等原因死亡）；非结核死亡（结核病患者因结核病以外的原因死亡）；失败（痰涂片阳性肺结核患者治疗至第6个月末或疗程结束时痰涂片检查仍阳性）；丢失（肺结核患者在治疗过程中中断治疗超过2个月，或由结核病防治机构转出后，虽经医生努力追访，2个月内仍无信息或已在其他地区重新登记）",
      "contraindication": null,
      "evidence": "疗效判断标准如下：(1) 治愈：痰涂片阳性肺结核患者完成规定疗程，连续2次痰涂片结果阴性，其中1次是治疗末；(2) 完成疗程：痰涂片阴性肺结核患者完成规定的6个月标准疗程，疗程末痰涂片检查结果阴性或未痰检者；痰涂片阳性肺结核患者完成规定的6-12个月疗程，最近一次痰检结果阴性，完成疗程时无痰检结果；(3) 结核死亡：活动性肺结核患者因病变进展或并发咯血、自发性气胸、肺心病、全身衰竭或肺外结核等原因死亡；(4) 非结核死亡：结核病患者因结核病以外的原因死亡；(5) 失败：痰涂片阳性肺结核患者治疗至第6个月末或疗程结束时痰涂片检查仍阳性；(6) 丢失：肺结核患者在治疗过程中中断治疗超过2个月，或由结核病防治机构转出后，虽经医生努力追访，2个月内仍无信息或已在其他地区重新登记。"
    }
  },
  {
    "id": 1768,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景F",
    "case_input": "在社区门诊，医生正在电脑前查看患者的检查报告。患者主诉干咳已持续3周，伴有午后低热（体温37.8°C）和夜间盗汗，无痰中带血。患者是一名小学教师，近期因学期末工作压力大，自述轻微头痛和乏力，但否认吸烟史或其他呼吸道病史。影像学检查显示胸片右上肺野见斑片状浸润影，边界模糊，符合活动性肺结核表现；同时，一份晨痰标本直接涂片抗酸杆菌镜检结果为阳性。今天天气阴雨，患者提到因交通延误导致就诊迟到半小时。",
    "reference_rule": {
      "condition": "符合下列条件之一者：1. 痰涂片阳性肺结核（2份痰标本直接涂片抗酸杆菌镜检阳性；或1份痰标本直接涂片抗酸杆菌镜检阳性+肺部影像学检查符合活动性肺结核影像学表现；或1份痰标本直接涂片抗酸杆菌镜检阳性+1份痰标本结核菌培养阳性）；2. 仅培养阳性肺结核（痰涂片阴性，肺部影像学检查符合活动性肺结核影像学表现+1份痰标本结核菌培养阳性）；3. 肺部影像学检查符合活动性肺结核影像学表现，分子生物学检测阳性（如PCR、Xpert MTB/RIF）；4. 肺或胸膜病变标本病理学诊断为结核病变者",
      "action": "1. 立即开始标准抗结核化学治疗; 2. 按乙类传染病疫情报告要求进行网络直报; 3. 完整填写《肺结核病例登记报告卡》; 4. 在结核病定点医疗机构进行门诊或住院治疗",
      "contraindication": null,
      "evidence": "确诊病例：符合下列条件之一者为确诊病例：① 痰涂片阳性肺结核。符合下列3项之一者：a. 2份痰标本直接涂片抗酸杆菌镜检阳性；b. 1份痰标本直接涂片抗酸杆菌镜检阳性+肺部影像学检查符合活动性肺结核影像学表现；c. 1份痰标本直接涂片抗酸杆菌镜检阳性+1份痰标本结核菌培养阳性；② 仅培养阳性肺结核。同时符合下列2项者：a. 痰涂片阴性；b. 肺部影像学检查符合活动性肺结核影像学表现+1份痰标本结核菌培养阳性；③ 肺部影像学检查符合活动性肺结核影像学表现，分子生物学检测阳性（如PCR、Xpert MTB/RIF）；④ 肺或胸膜病变标本病理学诊断为结核病变者。"
    }
  },
  {
    "id": 1779,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "医生在社区门诊接诊一名32岁男性患者，该患者三周前被确诊为肺结核，正在接受标准抗结核治疗。今日主诉持续性发热已7天，体温每日波动在39.0-39.5°C之间，伴有剧烈盗汗、干咳和明显疲乏。体格检查显示呼吸音减弱，左侧肺部可闻及细湿啰音；血常规提示轻度贫血，胸部X光复查显示左上肺浸润影较前扩大。患者职业为电子产品销售员，最近频繁出差导致睡眠不足，并自述轻微背痛（与发热无关）。天气闷热，患者情绪焦虑，反复询问‘这烧什么时候能退’但未提及具体用药请求。",
    "reference_rule": {
      "condition": "肺结核所致发热",
      "action": "1. 有效抗结核治疗后大多在1周内消退; 2. 少数发热不退者应用小剂量非类固醇类退热剂，如布洛芬; 3. 急性血行播散性肺结核或伴有高热等严重毒性症状或高热持续不退者，在抗结核药物治疗基础上使用类固醇糖皮质激素，一般每日20~30 mg泼尼松",
      "contraindication": "必须在充分有效抗结核药物的前提下使用糖皮质激素，否则可能禁忌",
      "evidence": "发热：有效抗结核治疗后肺结核所致的发热大多在1周内消退，少数发热不退者可应用小剂量非类固醇类退热剂，如布洛芬。急性血行播散性肺结核或伴有高热等严重毒性症状或高热持续不退者，可在抗结核药物治疗基础上使用类固醇糖皮质激素，一般每日20~30 mg泼尼松。糖皮质激素可能有助于改善症状，但必须在充分有效抗结核药物的前提下使用。"
    }
  },
  {
    "id": 1786,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景F",
    "case_input": "38岁男性，建筑工人，因持续咳嗽、低热和进行性呼吸困难2周就诊。胸部X线显示右侧单侧胸腔积液。痰涂片检查三次均为阴性。进一步胸水分析结果：渗出液性质，腺苷脱氨酶（ADA）水平为50 U/L，结核菌素皮肤试验（TST）呈强阳性，硬结直径18mm。患者还自述近期食欲减退，但体重无明显变化，无其他消化系统症状。在诊室，医生坐在电脑前，仔细复查这些检查报告，窗外天气闷热（气温32°C），患者已离开等待后续安排。",
    "reference_rule": {
      "condition": "符合下列条件之一者：1. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且伴有咳嗽、咳痰、咯血等肺结核可疑症状；2. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且TST强阳性；3. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且结核抗体检查阳性；4. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且肺外组织病理检查证实为结核病变；5. 痰涂片3次阴性的疑似肺结核病例，经诊断性治疗或随访观察可排除其他肺部疾病者；6. 支气管镜检查符合气管、支气管结核改变；7. 单侧或双侧胸腔积液，胸水检查提示渗出液，胸水ADA明显升高，伴有TST阳性或IGRA阳性",
      "action": "1. 开始抗结核治疗; 2. 按乙类传染病疫情报告要求进行网络直报; 3. 完整填写《肺结核病例登记报告卡》; 4. 填写《肺结核患者转诊单》并及时转诊至结核病定点医疗机构",
      "contraindication": null,
      "evidence": "临床诊断病例：符合下列条件之一者为临床诊断病例：① 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且伴有咳嗽、咳痰、咯血等肺结核可疑症状；② 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且TST强阳性；③ 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且结核抗体检查阳性；④ 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且肺外组织病理检查证实为结核病变；⑤ 痰涂片3次阴性的疑似肺结核病例，经诊断性治疗或随访观察可排除其他肺部疾病者；⑥ 支气管镜检查符合气管、支气管结核改变；⑦ 单侧或双侧胸腔积液，胸水检查提示渗出液，胸水ADA明显升高，伴有TST阳性或IGRA阳性。"
    }
  },
  {
    "id": 1788,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景C",
    "case_input": "患者2个月前因持续性咳嗽、盗汗和体重下降就诊，胸部X线显示右上肺浸润影，痰涂片阳性，确诊为初治活动性肺结核并开始治疗。今日复诊，患者自述咳嗽频率减少，但仍有间歇性低热（体温37.8°C）和夜间盗汗。痰涂片复查结果仍为阳性。患者为小学教师，提到最近期末工作压力大，出现轻微失眠，但否认其他不适。肺部听诊可闻及散在湿啰音，无其他明显体征。",
    "reference_rule": {
      "condition": "初治活动性肺结核（含痰涂片阳性和阴性）",
      "action": "1. 使用2HRZE/4HR方案：强化期使用异烟肼、利福平、吡嗪酰胺、乙胺丁醇，1次/d，共2个月；巩固期使用异烟肼、利福平1次/d，共4个月; 2. 若强化期第2个月末痰涂片仍阳性，强化方案可延长1个月，总疗程6个月不变; 3. 对粟粒型肺结核或结核性胸膜炎，强化期为3个月，巩固期6~9个月，总疗程9~12个月; 4. 在异烟肼高耐药地区，可选择2HRZE/4HRE方案",
      "contraindication": null,
      "evidence": "初治活动性肺结核（含痰涂片阳性和阴性）：通常选用2HRZE/4HR方案，即强化期使用异烟肼、利福平、吡嗪酰胺、乙胺丁醇，1次/d，共2个月；巩固期使用异烟肼、利福平1次/d，共4个月。若强化期第2个月末痰涂片仍阳性，强化方案可延长1个月，总疗程6个月不变。对粟粒型肺结核或结核性胸膜炎上述疗程可适当延长，强化期为3个月，巩固期6~9个月，总疗程9~12个月。在异烟肼高耐药地区，可选择2HRZE/4HRE方案。"
    }
  }
]