[
  {
    "condition": "出现不明原因急性皮疹的患儿，有以下1种或多种症状体征（急性发热>38.5℃、淋巴结肿大、头痛、肌痛、背痛、虚弱等临床症状），且临床表现不能用水痘、带状疱疹、单纯疱疹、麻疹、手足口病、皮肤细菌性感染、播散性淋球菌感染、梅毒等解释，同时具备以下流行病学史中的任意1项：发病前21 d内有境外猴痘病例报告国家或地区旅居史（重点关注非洲地方性流行国家和英国、葡萄牙、西班牙、美国、加拿大等目前已有社区病例报告的国家）；发病前21 d内与确诊病例有密切接触史；发病前21 d内接触过啮齿类、非人类灵长类等MPXV感染动物的血液、体液或分泌物",
    "action": "1. 报告疑似病例；2. 进行网络直报；3. 转运至专业传染病治疗机构进行严格隔离观察、确认和治疗",
    "contraindication": null,
    "evidence": "出现不明原因急性皮疹的患儿，有以下1种或多种症状体征，且同时具备以下流行病学史中的任意1项者。症状和体征：急性发热（>38.5℃）、淋巴结肿大、头痛、肌痛、背痛、虚弱等临床症状，并且其临床表现不能用水痘、带状疱疹、单纯疱疹、麻疹、手足口病、皮肤细菌性感染、播散性淋球菌感染、梅毒等解释。流行病学史：发病前21 d内有境外猴痘病例报告国家或地区旅居史（重点关注非洲地方性流行国家和英国、葡萄牙、西班牙、美国、加拿大等目前已有社区病例报告的国家）；发病前21 d内与确诊病例有密切接触史；发病前21 d内接触过啮齿类、非人类灵长类等MPXV感染动物的血液、体液或分泌物。"
  },
  {
    "condition": "疑似病例且MPXV核酸检测阳性或培养分离出MPXV",
    "action": "1. 确认为确诊病例；2. 立即隔离至皮疹结痂消退；3. 按相关要求进行传染病报告",
    "contraindication": null,
    "evidence": "疑似病例且MPXV核酸检测阳性或培养分离出MPXV。对符合疑似病例或确诊病例标准者，应按相关要求进行传染病报告；确诊的猴痘患儿应立即隔离，至皮疹结痂消退。"
  },
  {
    "condition": "猴痘患儿",
    "action": "1. 适当休息；2. 保证热量和液体充分摄入，维持水电解质、内环境稳定和微生态平衡；3. 密切监测患儿生命体征、指脉血氧饱和度、疼痛分级；4. 观察患儿精神状况和饮食状态，有无精神差、嗜睡、烦躁不安、面色苍白等；5. 注意并发症的出现；6. 对于早产儿及小婴儿，加强营养、喂养及护理，监测生长发育",
    "contraindication": null,
    "evidence": "适当休息，保证热量和液体充分摄入，维持水电解质、内环境稳定和微生态平衡。密切监测患儿生命体征、指脉血氧饱和度、疼痛分级，观察患儿精神状况和饮食状态，有无精神差、嗜睡、烦躁不安、面色苍白等。注意并发症的出现。此外，对于早产儿及小婴儿，应加强营养、喂养及护理等，监测生长发育。"
  },
  {
    "condition": "猴痘患儿有皮肤和/或黏膜病变",
    "action": "1. 保持皮肤、口腔、眼及鼻部清洁；2. 避免抓挠皮损部位，防止继发细菌感染；3. 如皮肤疱疹破溃，酌情予以硼酸溶液或0.5%呋喃西林溶液湿敷；4. 皮肤瘙痒明显者，可外用炉甘石洗剂或使用抗组胺药；5. 如伴有口腔黏膜病变，建议每日使用淡盐水或生理盐水漱口，酌情使用氯已定漱口液，1岁以下患儿可采用棉签蘸淡盐水或生理盐水擦拭；6. 伴有生殖器或直肠肛门病变者，建议使用温水坐浴缓解症状",
    "contraindication": "不建议预防性应用抗菌药物",
    "evidence": "保持皮肤、口腔、眼及鼻部清洁，避免抓挠皮损部位，防止继发细菌感染，但不建议预防性应用抗菌药物。如皮肤疱疹破溃，酌情予以硼酸溶液或0.5%呋喃西林溶液湿敷；皮肤瘙痒明显者，可外用炉甘石洗剂或使用抗组胺药；如伴有口腔黏膜病变，建议每日使用淡盐水或生理盐水漱口，酌情使用氯已定漱口液，1岁以下患儿可采用棉签蘸淡盐水或生理盐水擦拭；伴有生殖器或直肠肛门病变者，建议使用温水坐浴缓解症状。"
  },
  {
    "condition": "猴痘患儿腋温超过38.5℃伴有明显不适",
    "action": "1. 应用退热药物治疗，常用药物有布洛芬和对乙酰氨基酚；2. 对于6月龄以内婴儿，采用物理降温；3. 发生高热惊厥时，及时予止惊治疗",
    "contraindication": null,
    "evidence": "腋温超过38.5℃伴有明显不适者应用退热药物治疗，常用退热药物有布洛芬和对乙酰氨基酚。对于6月龄以内婴儿可采用物理降温。发生高热惊厥的患儿需及时予止惊治疗。"
  },
  {
    "condition": "猴痘患儿因头痛、皮损或淋巴结肿大导致疼痛明显",
    "action": "1. 轻中度疼痛者使用对乙酰氨基酚[10~15 mg/(kg·次)，每4~6小时口服1次]或布洛芬[10 mg/(kg·次)，每6~8小时口服1次]等非甾体类抗炎药；2. 重度疼痛者使用曲马多或阿片类药物，如吗啡，其中曲马多仅限于>6个月的儿童使用，剂量为1~2 mg/(kg·次)，每4~6小时口服或静脉注射1次，每日最大剂量400 mg；吗啡口服0.2~0.4 mg/(kg·次)，每4小时1次，或静脉滴注0.05~0.10 mg/(kg·次)，每4~6小时1次",
    "contraindication": "曲马多禁用于6个月以下婴儿",
    "evidence": "如因头痛、皮损或淋巴结肿大导致疼痛明显时，可酌情使用镇痛药物。轻中度疼痛者使用对乙酰氨基酚[10~15 mg/(kg·次)，每4~6小时口服1次]、布洛芬[10 mg/(kg·次)，每6~8小时口服1次]等非甾体类抗炎药。重度疼痛者使用曲马多或阿片类药物，如吗啡。曲马多仅限于>6个月的儿童使用，剂量为1~2 mg/(kg·次)，每4~6小时口服或静脉注射1次，每日最大剂量400 mg；吗啡口服0.2~0.4 mg/(kg·次)，每4小时1次；或静脉滴注0.05~0.10 mg/(kg·次)，每4~6小时1次。"
  },
  {
    "condition": "严重MPXV感染者；重症或具有重症高危因素的患者；出现眼部、口腔及其他特殊部位（如生殖器或肛门）感染的猴痘患者；重症或有并发症的病例",
    "action": "1. 尝试使用抗病毒药物，包括特考韦瑞、布林西多福韦或西多福韦；2. 特考韦瑞口服：13~25 kg: 200 mg/次, >25~40 kg: 400 mg/次, >40 kg: 600 mg/次，静脉：3~35 kg: 6 mg/(kg·次), >35~120 kg: 200 mg/次, >120 kg: 300 mg/次，每12小时1次，疗程14 d；3. 布林西多福韦口服：<10 kg: 6 mg/(kg·次), 10~48 kg: 4 mg/(kg·次), >48 kg: 200 mg/次，每周2次，第1天和第8天；4. 西多福韦静脉：5 mg/(kg·次)，每周1次×2周，然后隔周1次",
    "contraindication": "布林西多福韦可能导致转氨酶升高；西多福韦有肾毒性、电解质异常等不良反应",
    "evidence": "美国疾病预防控制中心（CDC）建议严重MPXV感染者可以尝试使用布林西多福韦或西多福韦；重症或具有重症高危因素的患者以及出现眼部、口腔及其他特殊部位（如生殖器或肛门）感染的猴痘患者可扩展性使用特考韦瑞。WHO建议对于重症或有并发症的病例使用抗病毒治疗，推荐剂量和疗程见表2。表2：儿童特考韦瑞、布林西多福韦和西多福韦推荐使用剂量、疗程和不良反应。特考韦瑞口服：13~25 kg: 200 mg/次, >25~40 kg: 400 mg/次, >40 kg: 600 mg/次；静脉：3~35 kg: 6 mg/(kg·次), >35~120 kg: 200 mg/次, >120 kg: 300 mg/次；疗程：每12小时1次，疗程14 d；不良反应：头痛、眩晕、恶心、呕吐、腹泻、腹痛等。布林西多福韦口服：<10 kg: 6 mg/(kg·次), 10~48 kg: 4 mg/(kg·次), >48 kg: 200 mg/次；疗程：每周2次，第1天和第8天；不良反应：转氨酶升高、腹泻、恶心、呕吐和腹痛等。西多福韦静脉：5 mg/(kg·次)；疗程：每周1次×2周，然后隔周1次；不良反应：肾毒性、电解质异常、中性粒细胞减少、眼压降低、葡萄膜炎/虹膜炎、恶心、发热、乏力。"
  },
  {
    "condition": "重症或无法接种天花疫苗的严重免疫缺陷患者进行暴露后预防",
    "action": "1. 考虑给予静脉注射牛痘免疫球蛋白（VIG）",
    "contraindication": null,
    "evidence": "目前尚无VIG治疗猴痘的有效性数据。仅对于重症或无法接种天花疫苗的严重免疫缺陷患者进行暴露后预防，可考虑给予静脉注射VIG。"
  },
  {
    "condition": "猴痘患儿出现皮肤继发细菌感染（如蜂窝织炎、脓肿等）",
    "action": "1. 酌情使用3%硼酸溶液或1:5000的呋喃西林溶液湿敷，或外用0.5%新霉素软膏或2%莫匹罗星软膏；2. 初始口服抗菌药物应覆盖金黄色葡萄球菌和链球菌；3. 根据病原菌培养分离鉴定和药敏结果调整抗菌药物；4. 必要时由外科医师进行清创、切开及引流",
    "contraindication": null,
    "evidence": "皮肤继发细菌感染（蜂窝织炎、脓肿等）：酌情使用3%硼酸溶液或1:5000的呋喃西林溶液湿敷，或外用0.5%新霉素软膏或2%莫匹罗星软膏。初始口服抗菌药物应覆盖金黄色葡萄球菌和链球菌，并根据病原菌培养分离鉴定和药敏结果加以调整。必要时由外科医师进行清创、切开及引流。"
  },
  {
    "condition": "猴痘患儿发生肺炎和急性呼吸窘迫综合征",
    "action": "1. 给予氧疗或机械通气；2. 保护心、肺等重要脏器功能等对症支持治疗；3. 如明确有其他病原感染，选择相应抗病原微生物药物治疗",
    "contraindication": null,
    "evidence": "呼吸道并发症：如发生肺炎和急性呼吸窘迫综合征，给予氧疗或机械通气，保护心、肺等重要脏器功能等对症支持等治疗，如明确有其他病原感染，选择相应抗病原微生物药物治疗。"
  },
  {
    "condition": "猴痘患儿出现食欲不振、呕吐、腹泻",
    "action": "1. 及时口服或静脉适当补液；2. 保持水电解质平衡",
    "contraindication": null,
    "evidence": "消化道并发症：食欲不振、呕吐、腹泻的患儿应及时口服或静脉适当补液，保持水电解质平衡。"
  },
  {
    "condition": "猴痘患儿出现脓毒症和感染性休克",
    "action": "1. 积极给予液体复苏疗法；2. 可考虑应用血管活性药物；3. 积极抗感染治疗",
    "contraindication": null,
    "evidence": "脓毒症和感染性休克：积极给予液体复苏疗法，可考虑应用血管活性药物，积极抗感染治疗等。"
  },
  {
    "condition": "猴痘患儿出现脑炎",
    "action": "1. 给予镇静、脱水降颅压等治疗；2. 如果合并感染，使用相应抗病原微生物药物治疗",
    "contraindication": null,
    "evidence": "脑炎：给予镇静、脱水降颅压等治疗。如果合并感染，建议使用相应抗病原微生物药物治疗。"
  },
  {
    "condition": "猴痘患儿出现角膜炎/角膜溃疡",
    "action": "1. 避免佩戴隐形眼镜；2. 应用滴眼液；3. 辅以维生素A等治疗；4. 重者进一步咨询眼科专业医师",
    "contraindication": "避免佩戴隐形眼镜",
    "evidence": "角膜炎/角膜溃疡：应避免佩戴隐形眼镜，可应用滴眼液，辅以维生素A等治疗，重者进一步咨询眼科专业医师。"
  },
  {
    "condition": "猴痘患儿出现情绪不稳、恐惧或心理障碍表现",
    "action": "1. 由心理专科医师予以干预及治疗；2. 采取心理疏导、行为治疗、家庭治疗等；3. 必要时配合使用抗焦虑或抗抑郁药物",
    "contraindication": null,
    "evidence": "如患儿出现情绪不稳、恐惧或心理障碍表现，需要由心理专科医师予以干预及治疗，采取心理疏导、行为治疗、家庭治疗等，必要时配合使用抗焦虑或抗抑郁药物等。"
  },
  {
    "condition": "猴痘患儿有基础疾病（如先天性心肺气道疾病、慢性心肾疾病、营养不良、遗传代谢性疾病、免疫缺陷病、肿瘤等）",
    "action": "1. 同时积极治疗原发病",
    "contraindication": null,
    "evidence": "有基础疾病者（如先天性心肺气道疾病、慢性心肾疾病、营养不良、遗传代谢性疾病、免疫缺陷病、肿瘤等）易出现重症且死亡率高，应同时积极治疗原发病。"
  },
  {
    "condition": "猴痘患儿体温正常，临床症状明显好转，结痂脱落",
    "action": "1. 可以出院",
    "contraindication": null,
    "evidence": "符合以下标准可以出院：体温正常，临床症状明显好转，结痂脱落。"
  },
  {
    "condition": "猴痘疫情暴发流行期间",
    "action": "1. 监测和快速发现病例；2. 隔离疑似和确诊病例；3. 追踪和管理密切接触者，从最后一次接触病例或其污染物品之日起监测症状；4. 加强入境管理，对携带和寄递动物（尤其进口啮齿类和灵长类动物）加强检疫；5. 对可能与感染MPXV动物有接触的动物进行隔离检疫30 d",
    "contraindication": null,
    "evidence": "监测和快速发现病例对于遏制疫情至关重要，各级各类医疗卫生机构日常接诊发热伴出疹患者时，应注意询问其流行病学史，同时进行病原学筛查，排除水痘、带状疱疹、单纯疱疹、手足口病等其他明确病因所致疾患；同时，入境隔离点应主动对入境人员进行MPXV排查，特别是入境前21 d内有猴痘疫情报告国旅居史的人员，应密切监测其出疹情况。与猴痘患者密切接触是最重要的危险因素。因此，在猴痘疫情暴发流行期间，识别、追踪和管理密切接触者是预防和控制MPXV人际传播的关键措施。一旦发现疑似病例，应立即启动密切接触者的识别和追踪工作。从最后一次接触病例或其污染物品之日起，监测密切接触者是否出现任何症状或体征。此外，为从源头上预防MPXV感染，建议非必要不进口啮齿类和灵长类动物，限制或禁止非洲猴痘疫情地方性流行地区的啮齿类和灵长类动物进口贸易，加强入境管理，对携带和寄递动物（尤其进口啮齿类和灵长类动物）加强检疫。对任何可能与感染MPXV动物有接触的动物，应进行隔离检疫，根据标准预防措施处理，观察症状30 d。"
  },
  {
    "condition": "天花或猴痘职业暴露高风险人群（包括实验室人员、临床医护人员和疫情应对人员等）；其他高风险人群，特别是伴有免疫缺陷疾病的儿童；无防护高风险暴露者，尤其是猴痘病例的密切接触者",
    "action": "1. 接种天花疫苗进行暴露前预防，需由医护人员和接种者共同评估风险后决定；2. 初次接种者（无天花疫苗接种史）皮下注射接种2剂次，间隔4周；3. 有天花疫苗接种史的人则只接种1剂次；4. 对于暴露后预防，在末次暴露后4 d内（无症状情况下最多14 d内）接种",
    "contraindication": "现阶段不提倡开展大规模疫苗接种",
    "evidence": "现阶段并不提倡开展大规模疫苗接种来预防猴痘。推荐天花或猴痘职业暴露高风险人群（包括实验室人员、临床医护人员和疫情应对人员等）以及其他高风险人群，特别是伴有免疫缺陷疾病的儿童接种天花疫苗进行暴露前预防，需由医护人员和接种者共同评估风险后决定。疫苗接种建议：初次接种者（无天花疫苗接种史）皮下注射接种2剂次，间隔4周；有天花疫苗接种史的人则只接种1剂次。对于无防护高风险暴露者的暴露后预防，尤其是猴痘病例的密切接触者，建议在末次暴露后4 d内（无症状情况下最多14 d内）接种。"
  },
  {
    "condition": "一般人群在猴痘疫情流行地区工作或旅居",
    "action": "1. 尽量避免无保护地接触或处理野生动物，特别是生病或死亡的野生动物；2. 所有含有野生动物肉或器官的食物在食用前必须彻底烹饪熟；3. 避免与可疑感染者（如男男同性恋者）密切接触；4. 避免共用生活用品（如床上用品、衣物等）；5. 照看或探视患者时佩戴一次性乳胶手套、医用防护口罩、一次性隔离衣等；6. 做好手部卫生，及时用肥皂、洗手液等在流动水下洗手",
    "contraindication": null,
    "evidence": "为降低暴露感染风险，个人还应尽量避免无保护地接触或处理野生动物，特别是生病或死亡的野生动物。所有含有野生动物肉或器官的食物在食用前必须彻底烹饪熟。在猴痘疫情流行地区工作或旅居人员应避免与可疑感染者（如男男同性恋者）密切接触，避免共用生活用品（如床上用品、衣物等）。照看或探视患者时要做好个人防护（如佩戴一次性乳胶手套、医用防护口罩、一次性隔离衣等）。注意做好手部卫生，及时用肥皂、洗手液等在流动水下洗手。"
  },
  {
    "condition": "疑似或确诊病例",
    "action": "1. 安置在单间隔离病房；2. 限制活动范围；3. 如患儿病情允许，佩戴外科口罩并定期更换；4. 尽可能避免皮损暴露：皮损较少者可局部敷料覆盖，皮损较多者穿长衣及长裤，皮损广泛且病情较重需卧床者应用专用纱布覆盖皮损，使用支被架；5. 每日更换床单及接触衣物；6. 房间每日进行紫外线消毒；7. 更换的衣物进行高温高压消毒；8. 对密切接触者进行登记、及时隔离和医学观察21 d",
    "contraindication": null,
    "evidence": "疑似病例和确诊病例均应安置在单间隔离病房，限制其活动范围，尽量减少接触及传播的风险，必要时可安排固定1名家属共同隔离进行陪护。如患儿病情允许，建议佩戴外科口罩，并定期更换。尽可能避免皮损暴露，皮损较少者可局部敷料覆盖，皮损较多者建议穿长衣及长裤，对于皮损广泛且病情较重需卧床者，建议应用专用纱布覆盖皮损，使用支被架避免皮肤二次损伤等。每日更换床单及接触衣物，房间每日进行紫外线消毒。更换的衣物需进行高温高压消毒。对疑似和确诊病例的密切接触者要进行登记、及时隔离和医学观察，医学观察期限为21 d。"
  },
  {
    "condition": "医务人员和陪护人员接触疑似或确诊病例",
    "action": "1. 采取接触预防和飞沫预防措施；2. 佩戴一次性乳胶手套、医用防护口罩、防护面屏或护目镜、一次性隔离衣等；3. 做好手卫生；4. 避免与患儿共用生活物品；5. 减少皮肤暴露",
    "contraindication": null,
    "evidence": "医务人员和陪护人员采取接触预防和飞沫预防措施，佩戴一次性乳胶手套、医用防护口罩、防护面屏或护目镜、一次性隔离衣等，同时做好手卫生。避免与患儿共用生活物品，减少皮肤暴露。"
  },
  {
    "condition": "疑似和确诊病例衣物、毛巾、床单、餐具等个人用品；被分泌物污染的物品及其他可能污染的环境和物体表面",
    "action": "1. 可选择高温消毒；2. 或使用含氯消毒剂、二氧化氯、过氧乙酸、过氧化氢等消毒剂擦拭、喷洒或浸泡消毒；3. 尽量选择一次性诊疗用品；4. 非一次性诊疗用品首选高压蒸汽灭菌；5. 不耐热物品选择化学消毒剂或低温灭菌设备消毒；6. 手卫生选用速干手消毒剂或75%乙醇擦拭消毒（醇类过敏者选择季铵盐类）；7. 有肉眼可见污染物时，先用洗手液（或肥皂）在流动水下按六步洗手法清洗双手，再消毒；8. 对分泌物、粪便及血液污染物按《医疗机构消毒技术规范》消毒",
    "contraindication": "醇类过敏者避免使用75%乙醇",
    "evidence": "重点消毒疑似和确诊病例衣物、毛巾、床单、餐具等个人用品，以及被分泌物污染的物品及其他可能污染的环境和物体表面。可选择高温消毒，或使用含氯消毒剂、二氧化氯、过氧乙酸、过氧化氢等消毒剂擦拭、喷洒或浸泡消毒。尽量选择一次性诊疗用品，非一次性诊疗用品应首选高压蒸汽灭菌，不耐热物品可选择化学消毒剂或低温灭菌设备进行消毒。手卫生可选用速干手消毒剂，或直接使用75%乙醇进行擦拭消毒；醇类过敏者，可选择季铵盐类等有效的非醇类手消毒剂。有肉眼可见污染物时，应先使用洗手液（或肥皂）在流动水下按照六步洗手法清洗双手，然后按上述方法消毒。对患儿的分泌物、粪便及血液污染物按照《医疗机构消毒技术规范》进行严格消毒处理。"
  }
]