[
  {
    "id": 264,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景E",
    "case_input": "患者68岁，退休教师，身高155 cm，体重48 kg。今日由女儿搀扶步入诊室，主诉‘弯腰晾衣服时突然腰背剧痛，休息两天不缓解’。追问病史：5年前绝经，平日每天喝淡茶两大壶，牛奶偶尔喝，日晒不足；否认长期激素服用史。查体：驼背明显，胸腰段棘突压痛（+），骨盆挤压试验（-）。外院急诊X线报告‘T12椎体压缩性改变’。今日门诊天气阴沉，患者抱怨‘最近雨天多，腰腿更酸’。拟进一步评估骨量并明确病因。",
    "reference_rule": {
      "condition": "在 ≥ 65 岁女性和 ≥ 70 岁男性前提下",
      "action": "1. 基于 DXA 测量结果诊断：骨密度值低于同性别、同种族健康成人的骨峰值 1 个标准差及以内属正常；降低 1~2.5 个标准差为骨量低下（或低骨量）；降低等于和超过 2.5 个标准差为骨质疏松；骨密度降低程度符合骨质疏松诊断标准，同时伴有一处或多处脆性骨折为严重骨质疏松；2. 基于脆性骨折的诊断：当患者出现髋部或椎体的脆性骨折，不依赖于骨密度测定，临床上即可诊断骨质疏松症；而患者为肱骨近端、骨盆或前臂远端发生的脆性骨折，即使骨密度测定显示低骨量（-2.5 < T-值 < -1.0），也可诊断骨质疏松症",
      "contraindication": null,
      "evidence": "在 ≥ 65 岁女性和 ≥ 70 岁男性前提下：1.  基于 DXA 测量结果诊断： 骨密度值低于同性别、同种族健康成人的骨峰值 1 个标准差及以内属正常；降低 1~2.5 个标准差为骨量低下（或低骨量）；降低等于和超过 2.5 个标准差为骨质疏松；骨密度降低程度符合骨质疏松诊断标准，同时伴有一处或多处脆性骨折为严重骨质疏松。2.  基于脆性骨折的诊断： 脆性骨折是指受到轻微创伤或日常活动中即发生的骨折。当患者出现髋部或椎体的脆性骨折，不依赖于骨密度测定，临床上即可诊断骨质疏松症；而患者为肱骨近端、骨盆或前臂远端发生的脆性骨折，即使骨密度测定显示低骨量（-2.5 < T-值 < -1.0），也可诊断骨质疏松症。"
    }
  },
  {
    "id": 271,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景B",
    "case_input": "患者由女儿陪同坐轮椅进入诊室，主诉‘腰像断了一样疼，夜里翻不了身’。既往确诊重度老年性骨质疏松症（T值-3.4，L2椎体新发压缩性骨折）。今日复诊，女儿抢先抱怨：‘老太太就是不听劝，每顿咸菜就半碗，说嘴里没味；红烧肉一顿能吃三大块，牛奶嫌腥碰都不碰。’患者本人插话：‘医生，我一辈子口味重，少盐吃不下。’追问运动史，女儿摇头：‘天晴也懒得下楼，说怕晒黑，最多屋里挪两步。’查体可见上臂皮肤菲薄、皮下淤斑，驼背明显。患者小声补充：‘对了，我晚上还得来一小杯白酒才睡得着，大概二两。’今日天气阴，室外紫外线指数3，患者戴宽檐帽、穿长袖外套就诊。",
    "reference_rule": {
      "condition": "老年性骨质疏松症患者",
      "action": "1. 饮食控制：摄入富含钙、低盐和适量蛋白质的均衡膳食；保证充足的日照，以促进体内维生素 D 的合成，但要根据季节等因素避免强烈的日光照射，以防晒伤；2. 运动：进行规律的运动，包括负重运动及抗阻运动，如重量训练、行走、慢跑等；建议每周至少进行 150~300 min 中等强度运动，或者每周 85~150 min 高强度有氧运动；运动应循序渐进、持之以恒，跌倒风险高的患者应在医师或康复治疗师等专业指导下进行；3. 生活习惯：改变不良的生活习惯，包括饮酒、吸烟等；尽量避免或少用影响骨代谢的药物",
      "contraindication": null,
      "evidence": "1.  饮食控制： 加强营养，均衡膳食，建议摄入富含钙、低盐和适量蛋白质的均衡膳食。保证充足的日照，以促进体内维生素 D 的合成，但要根据季节等因素避免强烈的日光照射，以防晒伤。（证据水平 A，推荐等级：强推荐）2.  运动： 进行规律的运动，运动可改善机体敏捷性、力量、姿势及平衡等，减少跌倒风险，运动还有助于增加骨密度，适合于老年性骨质疏松症患者的运动包括负重运动及抗阻运动，推荐规律的负重及肌肉力量练习，以减少跌倒和骨折风险，包括重量训练、行走、慢跑等。运动应循序渐进、持之以恒，跌倒风险高的患者应在医师或康复治疗师等专业指导下进行，建议每周至少进行 150~300 min 中等强度运动，或者每周 85~150 min 高强度有氧运动。（证据水平 B，推荐等级：强推荐）3.  生活习惯： 改变不良的生活习惯，包括饮酒、吸烟等，尽量避免或少用影响骨代谢的药物。（证据水平 D，推荐等级：弱推荐）"
    }
  },
  {
    "id": 275,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景E",
    "case_input": "78岁女性，身高152 cm，体重42 kg。主诉近半年腰背部酸胀加重，夜间翻身痛醒，行走200米即需停下休息。无外伤史。既往高血压15年，血压控制可；2型糖尿病10年，HbA1c 6.8%。已绝经28年。查体：驼背明显，胸腰段压痛（+），双下肢肌力4级。今日骨密度（DXA）：L1-L4 T值 -3.2，左髋T值 -2.7；血Ca 2.3 mmol/L、P 1.1 mmol/L、ALP 110 U/L，25-OH-VD 18 ng/mL，PTH 68 pg/mL，Cr 78 μmol/L。舌淡偏暗、苔薄白，脉沉细。患者自诉平日怕热、口干，夜间小腿抽筋，偶有头晕。今晨空腹，准备抽血复查后开药。",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为肝肾不足证者",
      "action": "1. 治法：补肝益肾；2. 推荐方剂：六味地黄汤（药物组成为熟地，山茱萸肉，丹皮，泽泻，山药，茯苓）或壮骨止痛胶囊联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为肝肾不足证者，推荐选用六味地黄汤（《小儿药证直诀》）（证据水平 B，推荐等级：弱推荐），药物组成为熟地，山茱萸肉，丹皮，泽泻，山药，茯苓；或壮骨止痛胶囊（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗。"
    }
  },
  {
    "id": 277,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景E",
    "case_input": "患者，女，74岁，因“腰背隐痛3月，晨起翻身困难”由家人陪同前来门诊。既往史：2型糖尿病15年（口服二甲双胍+格列美脲）、高血压20年（氨氯地平5 mg qd），否认骨折史。绝经年龄52岁，无激素替代史。近半年无腹泻、甲亢症状，无长期糖皮质激素使用史。查体：身高156 cm（较年轻时缩短4 cm），体重49 kg，BMI 20.1 kg/m²；脊柱轻度后凸，胸12-腰2棘突压痛（+），无肋骨压痛。今日外院DXA：L1-L4 T-score −3.1，左髋T-score −2.8；血Ca 2.32 mmol/L、P 1.12 mmol/L、ALP 78 U/L（正常）、Cr 82 µmol/L、eGFR 67 mL/min；血常规、甲功、血清蛋白电泳未见异常。患者自述平日饮奶少，日晒不足，无烟酒嗜好；职业为退休图书管理员，近期因雨天路滑几乎不出门。家属担心骨质疏松病因，询问“是否就是老年性的，要不要查别的？”",
    "reference_rule": {
      "condition": "老年性骨质疏松症患者需进行鉴别诊断",
      "action": "1. 与绝经后骨质疏松症鉴别：绝经后骨质疏松症主要发生于绝经后妇女（发病年龄一般在 51~65 岁），发生原因与体内雌激素水平下降有关，为高转换型，临床上的骨折部位多见于椎体和桡骨远端；老年性骨质疏松症发病年龄在 70 岁以上，发生原因与细胞、组织、器官的老化与功能衰退有关，为低转换型，骨丢失速率慢，皮质骨与小梁骨均丟失，临床上骨折部位多见于椎体和髋部；2. 与继发性骨质疏松症鉴别：需详细了解患者病史，评价可能导致骨质疏松症的各种病因、危险因素及药物，特别强调部分导致继发性骨质疏松症的疾病可能缺少特异的症状和体征，有赖于进一步辅助检查",
      "contraindication": null,
      "evidence": "参考中华医学会骨质疏松和骨矿盐疾病分会《原发性骨质疏松症诊疗指南》（2022 版）、中国老年学和老年医学学会骨质疏松分会《中国老年骨质疏松症诊疗指南》（2023 版），老年性骨质疏松症主要与绝经后骨质疏松症、继发性骨质疏松症相鉴别。老年性骨质疏松症与绝经后骨质疏松症鉴别。 绝经后骨质疏松症主要发生于绝经后妇女，发病年龄一般在 51~65 岁。发生原因与体内雌激素水平下降有关，为高转换型，临床上的骨折部位多见于椎体和桡骨远端。老年性骨质疏松症发病年龄在 70 岁以上。发生原因与细胞、组织、器官的老化与功能衰退有关，为低转换型，骨丢失速率慢，皮质骨与小梁骨均丟失，临床上骨折部位多见于椎体和髋部。老年性骨质疏松症及继发性骨质疏松症的鉴别。 需详细了解患者病史，评价可能导致骨质疏松症的各种病因、危险因素及药物，特别强调部分导致继发性骨质疏松症的疾病可能缺少特异的症状和体征，有赖于进一步辅助检查。包括影响骨代谢的内分泌疾病、类风湿关节炎等免疫疾病、影响钙和维生素 D 吸收和代谢的消化系统和肾脏疾病、长期服用糖皮质激素或其他影响骨代谢药物等。"
    }
  },
  {
    "id": 278,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景E",
    "case_input": "患者由女儿搀扶步入诊室，步态小碎且驼背明显。主诉近半年‘腰像断了一样酸’，夜间翻身疼醒，晨起需扶墙缓行。追问得知去年11月下雪天滑倒后胸椎轻度压缩骨折，卧床2月，此后身高‘缩了3厘米’。平日畏寒，厚衣早穿；食欲差，半碗米饭即饱，进食后易腹胀；夜尿3-4次，色清长。舌淡胖边有齿痕，苔白滑，脉沉迟。今日骨密度回报：L1-L4 T值-3.1，左髋T值-2.7；血Ca 2.25 mmol/L、P 0.9 mmol/L、ALP 110 U/L、25-OH-VD 18 ng/mL、PTH 68 pg/mL。患者退休前为小学语文教师，仍坚持每日阅读，但自述‘记性不如从前’。本次就诊希望‘开点止痛药’，并咨询能否不再‘一天天佝偻下去’。诊室空调26 ℃，患者仍双手抱热水杯取暖。",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为脾肾阳虚证者",
      "action": "1. 治法：补益脾肾，强筋壮骨；2. 推荐方剂：补中益气汤合金匮肾气丸（药物组成为黄芪、白术、陈皮、升麻、柴胡、人参、甘草、当归、地黄、山药、山茱萸、茯苓、牡丹皮、泽泻、桂枝、附子）或全杜仲胶囊或金匮肾气丸联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为脾肾阳虚证者，推荐选用补中益气汤（《脾胃论》）合金匮肾气丸（《金匮要略》）（证据水平 C，推荐等级：弱推荐），药物组成为黄芪、白术、陈皮、升麻、柴胡、人参、甘草、当归、地黄、山药、山茱萸、茯苓、牡丹皮、泽泻、桂枝、附子；或全杜仲胶囊（证据水平 C，推荐等级：弱推荐）；或金匮肾气丸（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗。"
    }
  },
  {
    "id": 280,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景E",
    "case_input": "患者因‘腰背酸痛半年，加重伴夜间翻身困难1周’前来就诊。自述半年前起出现持续性钝痛，劳累及久站后明显，近1周夜间翻身痛醒，需手扶床栏方能坐起。无外伤史，否认发热、体重下降。日常饮食偏咸，喜腌菜，每日盐摄入量约10 g；晨起习惯喝浓茶，牛奶摄入不足。50岁绝经，既往无激素替代史。查体：身高155 cm，体重48 kg，BMI 20.0 kg/m²；胸椎T11～L2棘突压痛（+），直腿抬高试验（-），双下肢肌力Ⅴ级，病理征未引出。上臂围26 cm，护士测量血压时标准袖带可正常包裹。今日门诊DXA示：腰椎L1-L4 T值 -2.9，左髋T值 -2.6；血常规、肝肾功能正常，血清钙2.28 mmol/L，磷1.12 mmol/L，ALP 98 U/L；25-OH-D 18 ng/mL。患者神情焦虑，反复询问‘是不是骨头空了？会不会瘫？’，同时抱怨最近天气潮湿，膝关节也隐隐作痛。",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为肾虚血瘀证者",
      "action": "1. 治法：补肾强骨、活血化瘀；2. 推荐方剂：补肾活血汤（药物组成为熟地、破故纸、菟丝子、杜仲、枸杞、归尾、山萸肉、苁蓉、没药、独活、红花）或仙灵骨葆胶囊或骨疏康颗粒（胶囊）联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为肾虚血瘀证者，推荐选用补肾活血汤（《伤科大成》）（证据水平 C，推荐等级：弱推荐），药物组成为熟地、破故纸、菟丝子、杜仲、枸杞、归尾、山萸肉、苁蓉、没药、独活、红花；或仙灵骨葆胶囊（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗；或骨疏康颗粒（胶囊）（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗。"
    }
  },
  {
    "id": 283,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景E",
    "case_input": "今日门诊，78岁王奶奶由孙女搀扶步入诊室，弯腰驼背明显。主诉近半年晨起腰背酸痛，活动后稍缓，久坐起立需扶墙，夜尿3-4次，偶发足底抽筋。无外伤史，但上周搬花盆时自觉‘闪了腰’。查体：身高较年轻时缩短6 cm，T11-L1轻叩痛(+)，舌偏红少津、裂纹可见，脉细数。DXA示腰椎L1-L4 T值-2.9，左髋-2.6；血Ca 2.3 mmol·L⁻¹、P 1.0 mmol·L⁻¹，ALP 110 U·L⁻¹，25(OH)D₃ 18 ng·mL⁻¹，PTH 68 pg·mL⁻¹，eGFR 58 mL·min⁻¹，尿Ca 215 mg/24 h。既往高血压15年，近3年服用缬沙坦80 mg qd，BP控制于135/78 mmHg；无DM、无脆性骨折史。平日饮食清淡但奶制品摄入少，每天户外散步不足10分钟。今日天气阴冷，她进门时抱怨‘腰像灌了冷风’。",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为肝肾阴虚证者",
      "action": "1. 治法：滋补肝肾，填精壮骨；2. 推荐方剂：左归饮或左归丸（药物组成为熟地、山药、枸杞、炙甘草、茯苓、山茱萸）或金天格胶囊联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为肝肾阴虚证者，推荐选用左归饮（《景岳全书》）；或左归丸（证据水平 C，推荐等级：弱推荐），药物组成为熟地、山药、枸杞、炙甘草、茯苓、山茱萸；或金天格胶囊（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗。"
    }
  },
  {
    "id": 284,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景E",
    "case_input": "患者由平车推入示教室，驼背明显，静息时仍诉‘腰里像有绳子捆着，喘气都疼’。查体：舌淡暗、边有齿痕，苔薄白，脉细涩；VAS 7/10，翻身困难需两人协助。骨密度T值-3.4（髋部）。血常规Hb 96 g/L，ESR 42 mm/h，β-CTX 1.28 ng/mL↑，P1NP 33.2 ng/mL↓；凝血D-二聚体 1.1 mg/L↑。追问病史：近2年身高‘缩水’6 cm，平日少气懒言，走50米需停歇，家务后手指发绀、晨僵约10分钟。否认激素、抗凝药使用史，但自服‘钙片+维D’断断续续。今日阴天，患者额外主诉‘膝盖酸沉像灌了铅’。家属急切询问：‘西医让打地舒单抗，可老人又虚又瘀，中药能不能一起用？’",
    "reference_rule": {
      "condition": "老年性骨质疏松症中医辨证为气虚血瘀证者",
      "action": "1. 治法：补气、活血、通络；2. 推荐方剂：补阳还五汤（药物组成为黄芪、当归尾、赤芍、地龙、川芎、红花、桃仁）联合抗骨质疏松药物治疗",
      "contraindication": null,
      "evidence": "老年性骨质疏松症中医辨证为气虚血瘀证者，推荐选用补阳还五汤（《医林改错》）（证据水平 C，推荐等级：弱推荐）联合抗骨质疏松药物治疗，药物组成为黄芪、当归尾、赤芍、地龙、川芎、红花、桃仁。"
    }
  },
  {
    "id": 285,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景E",
    "case_input": "患者，女，72岁，退休小学教师，因‘腰背痛半年、加重伴翻身困难1周’由女儿陪同前来骨质疏松专病门诊。半年内身高自觉‘矮了3 cm’，晨起穿袜需人辅助。无外伤史，但3月前曾在浴室滑坐跌倒，尾骨淤青，未拍片。既往高血压10年（氨氯地平5 mg qd，BP控制130/80 mmHg），否认糖尿病、甲亢及风湿病史；50岁绝经，未行激素替代。母亲80岁髋部骨折史。日常饮奶少（约100 ml/日），日晒不足（每日户外＜10 min），口味清淡，不抽烟不喝酒。查体：BMI 19.2 kg/m²，胸椎T11–L2轻压痛，脊柱前屈轻度受限，指地距18 cm，平衡试验可单脚站5 s。门诊便携超声跟骨T-score −2.9。今日空腹血Ca 2.28 mmol/L（正常），P 1.12 mmol/L，ALP 78 U/L，25-OH-D 18 ng/mL，Cr 72 µmol/L，eGFR 75 ml/min；血常规、甲功正常。DXA预约排队中，预计一周后完成。患者同时抱怨近两天因降温出现双侧膝部酸胀，但无红肿。女儿担心再次跌倒，急切询问是否立即需要打针吃药。",
    "reference_rule": {
      "condition": "老年性骨质疏松症患者",
      "action": "1. 西医辨病，中医辨证，病证结合：先结合患者骨质疏松及骨折风险评估、临床症状及辅助检查结果明确西医诊断，在此基础上进行分证论治；2. 针对重点，中西结合，突出优势：西医在改善骨密度、降低骨折发生率方面优势突出，中医在缓解疼痛，促进骨折愈合及改善患者症状方面效果更好；对于骨量减少患者：若症状及中医证候不明显者，在干预生活方式的基础上使用西医基础治疗（钙及维生素 D）；若症状或（和）中医证候明显者，在正确辨证的前提下增加中医治疗",
      "contraindication": null,
      "evidence": "中西医结合治疗老年性骨质疏松症患者，应先结合患者骨质疏松及骨折风险评估、临床症状及辅助检查结果明确西医诊断，在此基础上，谨守“西医辨病，中医辨证，病证结合”的原则，进行分证论治。中西医结合治疗的目的在于取长补短，优势互补。西医在改善骨密度、降低骨折发生率方面优势突出，而中医在缓解疼痛，促进骨折愈合及改善患者症状方面效果更好，中西医结合治疗在增强疗效的同时，能够弥补各疗法的薄弱方面。对于骨量减少患者，若症状及中医证候不明显者，可在干预生活方式的基础上使用西医基础治疗（钙及维生素 D）；若症状或（和）中医证候明显者，则应在正确辨证的前提下增加中医治疗。"
    }
  },
  {
    "id": 292,
    "file_name": "老年性骨质疏松症中西医结合诊疗指南_《老年性骨质疏松症中西医结合诊疗指南》工作组.json",
    "scenario_type": "场景D",
    "case_input": "患者李秀兰，76岁，身高148 cm，体重42 kg，BMI 19.2 kg/m²。既往史：2型糖尿病15年（空腹血糖最近半年7.8–9.4 mmol/L，HbA1c 8.1%）、高血压18年（晨起收缩压波动150–165 mmHg）、慢性肾功能不全（eGFR 45 ml/min·1.73 m²，肌酐132 μmol/L）、5年前T12椎体脆性骨折行椎体成形术。主诉：近1个月翻身及起坐时腰背钝痛明显加重，夜间痛醒2–3次，无下肢放射痛。DXA（腰椎L1–L4）：T值 −3.4；血清25-OH-D 18 ng/ml，β-CTX 0.68 ng/ml↑，PINP 68 μg/L↑。今晨自行扶步行器步入诊室，驼背明显，胸腰段后凸顶点T11–T12处压痛（++），局部肌痉挛呈条索状。患者自述因“胃不好”已自行停用阿仑膦酸钠3个月，仅偶尔服钙片。家属补充：老人怕跌倒，白天多卧床，饮食以粥、咸菜为主，近期出现双踝轻度浮肿。无发热、无肉眼血尿。目前用药：二甲双胍500 mg bid、氨氯地平5 mg qd、骨化三醇0.25 μg qd。今复诊，社区医生需评估下一步抗骨质疏松方案并处理多重合并症。",
    "reference_rule": {
      "condition": "老年性骨质疏松症患者",
      "action": "1. 针灸治疗：针灸主穴选择局部阿是穴、肾俞穴、足三里、悬钟、大杼；根据不同证型选择相应的配穴（肝肾阴虚型配肝俞、太冲、太溪、三阴交；脾肾阳虚型配脾俞、命门、中脘、关元；肾虚血瘀型配膈俞、血海、太溪、三阴交；气虚血瘀型配膈俞、关元、血海、太冲）；建议针灸每天 1 次，10 d 1 疗程，根据病情可适当增加疗程；针刺适用于所有证型，但对于肝肾阴虚有热的患者要谨慎使用灸法；2. 针刀疗法：体位取俯卧位（俯卧困难者可取侧卧位）；定点寻找脊柱后凸畸形最明显处，在该节段选择棘间点及相应上下两个肋横突关节/腰椎小关节点及横突尖点（双侧），再仔细按压寻找肌痉挛及压痛最明显点；用龙胆紫标定后常规消毒铺巾；1% 利多卡因局部浸润麻醉；以 4 号针刀操作，先松解棘间点，再松解肋横突关节/腰椎小关节点、横突尖点及肌痉挛、压痛最明显点；横向快速刺入，松解棘间点时横向刺入棘上韧带、棘间韧带，切割 2~3 刀后出针，其余各点横向进针入肌层后需掉转刀口成纵向，肌痉挛及压痛明显点纵向切割 2~3 刀后出针，肋横突关节/腰椎小关节及横突尖点纵向铲切剥离 2~3 刀后出针；出针后压迫止血；无菌纱布敷盖，出血明显者需加压包扎；3. 穴位贴敷：贴敷药物可选择肉桂、淫羊藿、杜仲等；贴敷穴位参考针灸选穴，也可选择阿是穴",
      "contraindication": "针灸对于肝肾阴虚有热的患者要谨慎使用灸法；针刀和穴位贴敷的禁忌证应符合 GB/T 21709.3-2021 和 GB/T 21709.9-2021 中的规定",
      "evidence": "推荐意见：（1）针灸治疗（证据水平 C，推荐等级：弱推荐）；（2）针刀疗法（证据水平 C，推荐等级：弱推荐）；（3）穴位贴敷（证据水平 C，推荐等级：弱推荐）。方法：针灸： 针灸主穴选择局部阿是穴、肾俞穴、足三里、悬钟、大杼。根据不同证型选择相应的配穴，肝肾阴虚型主要为足厥阴肝经、足少阴肾经穴，配肝俞、太冲、太溪、三阴交等；脾肾阳虚型主要为任脉、督脉穴，配脾俞、命门、中脘、关元等；肾虚血瘀型主要为冲脉、足少阴肾经穴，配膈俞、血海、太溪、三阴交等；气虚血瘀型主要为任脉、足少阴肾经穴，配膈俞、关元、血海、太冲等。针刺适用于所有证型，但对于肝肾阴虚有热的患者要谨慎使用灸法。根据患者的证型选择合适的补泻手法，建议针灸每天 1 次，10 d 1 疗程，根据病情可适当增加疗程。注意事项与禁忌证应符合 GB/T 21709.3-2021 中的规定。针刀： (1) 体位：患者取俯卧位，俯卧困难者可取侧卧位。(2) 定点：先寻找脊柱后凸畸形最明显处，在该节段选择棘间点及相应上下两个肋横突关节/腰椎小关节点及横突尖点 (双侧)，再仔细按压寻找肌痉挛及压痛最明显点。部分病变节段较多，疼痛较广泛者，应分次定点及操作，以便控制单次麻药用量，减少操作时间，从而控制操作风险。寻找上述点后用龙胆紫标定。(3) 常规消毒铺巾。(4) 1% 利多卡因局部浸润麻醉。(5) 小针刀操作：以 4 号针刀操作，先松解棘间点，再松解肋横突关节/腰椎小关节点、横突尖点及肌痉挛、压痛最明显点。横向快速刺入，松解棘间点时横向刺入棘上韧带、棘间韧带，切割 2~3 刀后出针，其余各点横向进针入肌层后需掉转刀口成纵向，肌痉挛及压痛明显点纵向切割 2~3 刀后出针，肋横突关节/腰椎小关节及横突尖点纵向铲切剥离 2~3 刀后出针，各点操作完毕出针后需压迫止血。(6) 无菌纱布敷盖，出血明显者需加压包扎。穴位贴敷： 穴位贴敷药物多种，可根据临床协定方等自行选择，临床常用的药物有肉桂、淫羊藿、杜仲等；贴敷穴位参考针灸选穴，也可选择阿是穴。注意事项与禁忌证应符合 GB/T 21709.9-2021 中的规定。"
    }
  }
]