[
  {
    "id": 813,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景E",
    "case_input": "4岁男童，体重16 kg，因‘发热3天、全身水疱伴头痛1天’由父母抱入急诊留观区。查体：T 38.7 ℃，头面部及四肢散在1–2 cm脐凹样水疱，部分破溃渗液；双侧下颌及颈部可触及2 cm×1.5 cm淋巴结，触痛明显。患儿蜷缩在母亲怀里，反复哭喊‘头好痛’，拒光、拒声，疼痛评分Wong-Baker 8/10。父母补充：昨夜至今晨呕吐2次，非喷射性；既往体健，未接种过猴痘疫苗，否认近期外出史，但家中上周收养了一只流浪幼犬。急诊护士已予隔离单间，等待儿科传染病组会诊。",
    "reference_rule": {
      "condition": "猴痘患儿因头痛、皮损或淋巴结肿大导致疼痛明显",
      "action": "1. 轻中度疼痛者使用对乙酰氨基酚[10~15 mg/(kg·次)，每4~6小时口服1次]或布洛芬[10 mg/(kg·次)，每6~8小时口服1次]等非甾体类抗炎药；2. 重度疼痛者使用曲马多或阿片类药物，如吗啡，其中曲马多仅限于>6个月的儿童使用，剂量为1~2 mg/(kg·次)，每4~6小时口服或静脉注射1次，每日最大剂量400 mg；吗啡口服0.2~0.4 mg/(kg·次)，每4小时1次，或静脉滴注0.05~0.10 mg/(kg·次)，每4~6小时1次",
      "contraindication": "曲马多禁用于6个月以下婴儿",
      "evidence": "如因头痛、皮损或淋巴结肿大导致疼痛明显时，可酌情使用镇痛药物。轻中度疼痛者使用对乙酰氨基酚[10~15 mg/(kg·次)，每4~6小时口服1次]、布洛芬[10 mg/(kg·次)，每6~8小时口服1次]等非甾体类抗炎药。重度疼痛者使用曲马多或阿片类药物，如吗啡。曲马多仅限于>6个月的儿童使用，剂量为1~2 mg/(kg·次)，每4~6小时口服或静脉注射1次，每日最大剂量400 mg；吗啡口服0.2~0.4 mg/(kg·次)，每4小时1次；或静脉滴注0.05~0.10 mg/(kg·次)，每4~6小时1次。"
    }
  },
  {
    "id": 814,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景E",
    "case_input": "6岁男童，昨日突发高热39.4℃，今晨面部出现散在丘疹，随后扩散至躯干及四肢，部分皮疹中央可见小水疱。家长自述孩子夜间频繁抓挠面部，导致左颊两处疱疹破溃渗液。查体：T 38.9℃，P 112次/分，R 24次/分；面部、躯干、手掌及足底可见数十枚2–5 mm大小、境界清楚的红色丘疹，部分中央呈脐凹样水疱，伴少量血清性渗出。口腔颊黏膜可见2枚3 mm浅表溃疡，患儿吞咽时哭闹明显。近期无外出史，家中饲养仓鼠1只，仓鼠两周前出现脱毛。家长担心皮疹留疤，反复询问是否需要涂‘紫药水’。患儿既往体健，已按期接种国家免疫规划疫苗，无药物过敏史。",
    "reference_rule": {
      "condition": "猴痘患儿有皮肤和/或黏膜病变",
      "action": "1. 保持皮肤、口腔、眼及鼻部清洁；2. 避免抓挠皮损部位，防止继发细菌感染；3. 如皮肤疱疹破溃，酌情予以硼酸溶液或0.5%呋喃西林溶液湿敷；4. 皮肤瘙痒明显者，可外用炉甘石洗剂或使用抗组胺药；5. 如伴有口腔黏膜病变，建议每日使用淡盐水或生理盐水漱口，酌情使用氯已定漱口液，1岁以下患儿可采用棉签蘸淡盐水或生理盐水擦拭；6. 伴有生殖器或直肠肛门病变者，建议使用温水坐浴缓解症状",
      "contraindication": "不建议预防性应用抗菌药物",
      "evidence": "保持皮肤、口腔、眼及鼻部清洁，避免抓挠皮损部位，防止继发细菌感染，但不建议预防性应用抗菌药物。如皮肤疱疹破溃，酌情予以硼酸溶液或0.5%呋喃西林溶液湿敷；皮肤瘙痒明显者，可外用炉甘石洗剂或使用抗组胺药；如伴有口腔黏膜病变，建议每日使用淡盐水或生理盐水漱口，酌情使用氯已定漱口液，1岁以下患儿可采用棉签蘸淡盐水或生理盐水擦拭；伴有生殖器或直肠肛门病变者，建议使用温水坐浴缓解症状。"
    }
  },
  {
    "id": 818,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景E",
    "case_input": "凌晨02:17，急诊留观室。患儿由父母抱入，腋下体温枪连续两次显示38.9℃、39.1℃，孩子哭闹明显、面颊及双手背散在2-4mm浅灰色小水疱，中央凹陷；父母代述‘从昨天下午开始烧，一碰就疼，不肯喝水’。追问流行病学史：同住表姐1周前确诊猴痘，目前居家隔离。查体：HR 148次/分，RR 28次/分，SpO₂ 98%（室温空气），咽部轻度充血，双侧颈部可触及黄豆大淋巴结、轻压痛；其余心肺腹（-）。既往体健，足月顺产，疫苗按时接种，无过敏史。父母焦虑询问：‘孩子烧得这么高，要不要马上吃退烧药？’——此刻护士正准备复测腋温确认读数，医生站在床边查看皮疹形态，急诊大厅因暴雨漏水，地面湿滑，家属不时提醒医生别踩到水渍。",
    "reference_rule": {
      "condition": "猴痘患儿腋温超过38.5℃伴有明显不适",
      "action": "1. 应用退热药物治疗，常用药物有布洛芬和对乙酰氨基酚；2. 对于6月龄以内婴儿，采用物理降温；3. 发生高热惊厥时，及时予止惊治疗",
      "contraindication": null,
      "evidence": "腋温超过38.5℃伴有明显不适者应用退热药物治疗，常用退热药物有布洛芬和对乙酰氨基酚。对于6月龄以内婴儿可采用物理降温。发生高热惊厥的患儿需及时予止惊治疗。"
    }
  },
  {
    "id": 822,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景E",
    "case_input": "6岁男童，因“发热3天、全身皮疹2天”由父母夜间带至急诊。患儿体温最高39.1℃，伴畏寒、头痛及双侧颈部淋巴结肿痛；背部与四肢近端先后出现散在红色斑丘疹，渐演变为中央凹陷的小水疱，部分已结痂。家长否认近期水痘、手足口、麻疹等接触史，也否认既往皮肤细菌性感染或过敏史。追问流行病学史：一家三口于发病前18天自加纳探亲返沪，期间曾在当地集市近距离观看并触摸过一只被拴售的小型猴类宠物；返沪后父母无明显不适。查体：急性病容，双侧颌下及颈后各触及2枚1.5 cm×1 cm质韧淋巴结，压痛(+)；躯干、上肢可见30余颗直径0.3–0.8 cm的脐凹状疱疹，基底红晕，部分表面覆有薄痂；咽轻度充血，扁桃体Ⅰ°肿大；心肺腹(-)。辅助检查：血常规WBC 6.8×10⁹/L，中性粒细胞52%，PLT 140×10⁹/L；CRP 12 mg/L。父母焦急询问：“孩子皮疹越来越多，是水痘吗？会不会传染给妹妹？”",
    "reference_rule": {
      "condition": "出现不明原因急性皮疹的患儿，有以下1种或多种症状体征（急性发热>38.5℃、淋巴结肿大、头痛、肌痛、背痛、虚弱等临床症状），且临床表现不能用水痘、带状疱疹、单纯疱疹、麻疹、手足口病、皮肤细菌性感染、播散性淋球菌感染、梅毒等解释，同时具备以下流行病学史中的任意1项：发病前21 d内有境外猴痘病例报告国家或地区旅居史（重点关注非洲地方性流行国家和英国、葡萄牙、西班牙、美国、加拿大等目前已有社区病例报告的国家）；发病前21 d内与确诊病例有密切接触史；发病前21 d内接触过啮齿类、非人类灵长类等MPXV感染动物的血液、体液或分泌物",
      "action": "1. 报告疑似病例；2. 进行网络直报；3. 转运至专业传染病治疗机构进行严格隔离观察、确认和治疗",
      "contraindication": null,
      "evidence": "出现不明原因急性皮疹的患儿，有以下1种或多种症状体征，且同时具备以下流行病学史中的任意1项者。症状和体征：急性发热（>38.5℃）、淋巴结肿大、头痛、肌痛、背痛、虚弱等临床症状，并且其临床表现不能用水痘、带状疱疹、单纯疱疹、麻疹、手足口病、皮肤细菌性感染、播散性淋球菌感染、梅毒等解释。流行病学史：发病前21 d内有境外猴痘病例报告国家或地区旅居史（重点关注非洲地方性流行国家和英国、葡萄牙、西班牙、美国、加拿大等目前已有社区病例报告的国家）；发病前21 d内与确诊病例有密切接触史；发病前21 d内接触过啮齿类、非人类灵长类等MPXV感染动物的血液、体液或分泌物。"
    }
  },
  {
    "id": 825,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景E",
    "case_input": "6岁男童，因‘发热3天、面部及躯干水疱样皮疹2天’由母亲带来我院发热门诊。母亲诉患儿3天前无明显诱因出现38.5°C左右发热，伴轻微咽痛，次日面部出现2颗‘红疙瘩’，逐渐增多并累及躯干、四肢，部分中央凹陷呈脐样。追问病史，患儿幼儿园同班同学2周前被诊断为‘疑似猴痘’，已居家隔离；患儿平时与家养草原犬鼠（宠物）密切接触。查体：T 38.2°C，P 102次/分，R 24次/分，SpO₂ 99%；面部、躯干、四肢散在20余颗直径3–7 mm的圆形丘疹-水疱，部分顶端脐凹，基底红晕，未见脓疱；双侧颌下淋巴结黄豆大、轻压痛；口腔颊黏膜可见1颗浅溃疡。余心肺腹查体（-）。辅助检查：血常规 WBC 7.8×10⁹/L，L 42%；CRP 8 mg/L；皮疹拭子MPXV实时荧光PCR检测阳性（Ct 28.4）。患儿既往体健，按计划完成常规疫苗接种，否认药物过敏。母亲焦虑，反复询问‘是不是水痘？能不能先回家吃药观察？’",
    "reference_rule": {
      "condition": "疑似病例且MPXV核酸检测阳性或培养分离出MPXV",
      "action": "1. 确认为确诊病例；2. 立即隔离至皮疹结痂消退；3. 按相关要求进行传染病报告",
      "contraindication": null,
      "evidence": "疑似病例且MPXV核酸检测阳性或培养分离出MPXV。对符合疑似病例或确诊病例标准者，应按相关要求进行传染病报告；确诊的猴痘患儿应立即隔离，至皮疹结痂消退。"
    }
  },
  {
    "id": 826,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景E",
    "case_input": "凌晨02:17，急诊留观室。3岁8个月男童，体重14kg，由父母抱入。主诉“发热3天，脸上长水疱、不肯喝奶”。体温38.9℃，HR 142次/分，RR 32次/分，SpO₂ 97%（室温空气）。面部、双手背散在0.3-0.8 cm脐凹样丘疹，部分顶端清亮小疱，基底红晕；左眼睑一0.9 cm痂皮，已破溃渗液。口腔颊黏膜2处浅溃疡，因疼痛拒绝吞咽，今日仅进120 ml稀释果汁。家长自述患儿不断抓挠皮疹，夜间哭闹。既往足月顺产，按计划接种疫苗（不含猴痘）。无外地旅居史，但家中上周从宠物市场购回一只“睡鼠”，已出现脱毛。父亲昨日亦出现类似皮疹，尚未就诊。急诊检验：血常规WBC 11.4×10⁹/L，中性粒细胞58%，PLT 220×10⁹/L；CRP 8 mg/L；快速血糖5.1 mmol/L；电解质Na⁺ 135 mmol/L，K⁺ 3.8 mmol/L。目前未给予退热药以外的处理，护士尝试口服补液盐但患儿含在嘴里不肯下咽。",
    "reference_rule": {
      "condition": "猴痘患儿",
      "action": "1. 适当休息；2. 保证热量和液体充分摄入，维持水电解质、内环境稳定和微生态平衡；3. 密切监测患儿生命体征、指脉血氧饱和度、疼痛分级；4. 观察患儿精神状况和饮食状态，有无精神差、嗜睡、烦躁不安、面色苍白等；5. 注意并发症的出现；6. 对于早产儿及小婴儿，加强营养、喂养及护理，监测生长发育",
      "contraindication": null,
      "evidence": "适当休息，保证热量和液体充分摄入，维持水电解质、内环境稳定和微生态平衡。密切监测患儿生命体征、指脉血氧饱和度、疼痛分级，观察患儿精神状况和饮食状态，有无精神差、嗜睡、烦躁不安、面色苍白等。注意并发症的出现。此外，对于早产儿及小婴儿，应加强营养、喂养及护理等，监测生长发育。"
    }
  },
  {
    "id": 828,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景F",
    "case_input": "7岁男童，确诊猴痘第5天，头面及四肢脓疱部分结痂。昨夜起反复哭喊‘怪物’，拒绝任何医护人员靠近，用被单紧裹自己并尖叫。值班护士记录其心率130次/分，血压正常，体温37.8℃。母亲反映孩子白天出现撞头、拔管行为，夜里惊醒3次，说‘痘子会爬进脑子’。患儿既往体健，无神经精神疾病史；家中饲养仓鼠，病前两周曾参加校外露营。今晨查房时，孩子把呼叫铃当‘武器’扔向医生，随后缩到床底，仅肯与母亲对视。母亲因自责哭泣，称‘孩子原来活泼，现在像变了一个人’。病房外，天气预报播报本市高温黄色预警，空调故障导致室温29℃。",
    "reference_rule": {
      "condition": "猴痘患儿出现情绪不稳、恐惧或心理障碍表现",
      "action": "1. 由心理专科医师予以干预及治疗；2. 采取心理疏导、行为治疗、家庭治疗等；3. 必要时配合使用抗焦虑或抗抑郁药物",
      "contraindication": null,
      "evidence": "如患儿出现情绪不稳、恐惧或心理障碍表现，需要由心理专科医师予以干预及治疗，采取心理疏导、行为治疗、家庭治疗等，必要时配合使用抗焦虑或抗抑郁药物等。"
    }
  },
  {
    "id": 829,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景D",
    "case_input": "PICU夜班交接班时，住院医师快速汇报：患儿5岁，体重18 kg，确诊猴痘第6天，面部及四肢密集脓疱部分破溃渗液。今日14:00起体温40.1 ℃，心率180次/分，血压62/35 mmHg，CRT 5″，四肢花纹，尿量＜0.5 ml·kg⁻¹·h⁻¹已持续4 h。血气提示乳酸5.8 mmol/L，BE −10 mmol/L；白细胞1.9×10⁹/L，PLT 65×10⁹/L，CRP 210 mg/L，ALT 168 U/L，ALB 22 g/L。父母代诉患儿今日拒食、精神差，伴呻吟，皮肤出血点增多。夜班护士刚建立双路22 G留置针，发现患儿上臂袖带因皮疹渗液无法常规捆缚，需要改用大腿袖带测压。值班住院医正准备下一步处理。",
    "reference_rule": {
      "condition": "猴痘患儿出现脓毒症和感染性休克",
      "action": "1. 积极给予液体复苏疗法；2. 可考虑应用血管活性药物；3. 积极抗感染治疗",
      "contraindication": null,
      "evidence": "脓毒症和感染性休克：积极给予液体复苏疗法，可考虑应用血管活性药物，积极抗感染治疗等。"
    }
  },
  {
    "id": 830,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景E",
    "case_input": "患儿于昨夜开始无明显诱因出现频繁非喷射性呕吐4次，为胃内容物，伴阵发性腹痛；今日晨起腹泻3次，呈黄色稀水样便，无黏液脓血，每次量中等，伴明显食欲下降，仅勉强饮奶50 ml。家长诉其口渴但一饮即吐，尿量自昨夜起显著减少，色深。无发热、无皮疹。既往体健，按时接种疫苗，否认近期外出及野生动物接触史，但所在托幼班本周因‘疑似水痘’已停课。查体：精神稍倦，皮肤弹性尚可，口唇干，眼眶略凹，颈软；HR 118 次/分，律齐，BP 88/50 mmHg，R 24 次/分；腹平软，肠鸣音活跃。末梢毛细血管再充盈时间 2.5 秒。实验室快速指尖血糖 5.2 mmol/L，血钠 138 mmol/L，暂未做血气。护士测量体重 18 kg，估算自昨夜至今液体丢失约 320 ml。家长焦急询问是否需要立刻输液。",
    "reference_rule": {
      "condition": "猴痘患儿出现食欲不振、呕吐、腹泻",
      "action": "1. 及时口服或静脉适当补液；2. 保持水电解质平衡",
      "contraindication": null,
      "evidence": "消化道并发症：食欲不振、呕吐、腹泻的患儿应及时口服或静脉适当补液，保持水电解质平衡。"
    }
  },
  {
    "id": 831,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景D",
    "case_input": "7岁男童，体重21 kg，确诊猴痘第8天，颜面及四肢脓疱疹部分结痂。昨夜起左眼红痛、畏光、分泌物增多。眼科会诊见左角膜下方2 mm×1 mm上皮缺损，荧光素染色阳性，前房清，结膜中度充血。视力检查配合差，仅辨眼前手动。母亲代诉：患儿平时偏食，爱吃薯片、拒绝蔬菜；发病后食欲更差，近3日仅进米粥和牛奶。既往无眼部外伤、无隐形眼镜佩戴史。实验室：白细胞12.4×10⁹/L，CRP 28 mg/L；肝肾功能正常；血清维生素A 0.25 µmol/L（参考0.7–1.4）。感染科已予口服布洛芬退热及局部莫匹罗星外用，未使用过眼部药物。母亲焦急询问：“孩子眼睛会不会留疤？还能不能看电视？” 诊室空调因市政检修暂停，室温31 ℃，患儿汗湿刘海贴在额头，不断揉眼被护士制止。",
    "reference_rule": {
      "condition": "猴痘患儿出现角膜炎/角膜溃疡",
      "action": "1. 避免佩戴隐形眼镜；2. 应用滴眼液；3. 辅以维生素A等治疗；4. 重者进一步咨询眼科专业医师",
      "contraindication": "避免佩戴隐形眼镜",
      "evidence": "角膜炎/角膜溃疡：应避免佩戴隐形眼镜，可应用滴眼液，辅以维生素A等治疗，重者进一步咨询眼科专业医师。"
    }
  },
  {
    "id": 832,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景D",
    "case_input": "患儿7岁，体重28 kg，既往有原发性免疫缺陷（STAT1 功能获得性突变）需长期口服磺胺甲噁唑/甲氧苄啶预防卡氏肺孢子菌感染。3 天前出现高热（最高 39.8 ℃）、乏力，随后颜面、躯干及四肢迅速出现离心性分布的脐凹样疱疹，部分融合成大疱，伴恶臭渗液；口腔、肛周亦可见痛性溃疡，影响进食与排便。今晨左眼睑红肿，分泌物增多，家长诉睁眼困难。查体：神志清楚，烦躁，HR 142 次/分，BP 85/50 mmHg，RR 28 次/分，SpO₂ 97%（未吸氧）。皮肤科：皮疹总数 >200 枚，最大直径 1.5 cm，基底红晕明显，部分中央坏死呈黑痂；左侧球结膜充血，角膜荧光染色可疑阳性；肛周糜烂渗血，触痛明显。实验室：WBC 1.8×10⁹/L（中性粒细胞 0.35×10⁹/L），PLT 78×10⁹/L，ALT 142 U/L，Cr 56 μmol/L，白蛋白 28 g/L；PCR 检测咽拭子 MPXV 阳性。胸片示双肺纹理模糊，未见实变。今日为发病第 4 天，家长焦急询问下一步处理。",
    "reference_rule": {
      "condition": "严重MPXV感染者；重症或具有重症高危因素的患者；出现眼部、口腔及其他特殊部位（如生殖器或肛门）感染的猴痘患者；重症或有并发症的病例",
      "action": "1. 尝试使用抗病毒药物，包括特考韦瑞、布林西多福韦或西多福韦；2. 特考韦瑞口服：13~25 kg: 200 mg/次, >25~40 kg: 400 mg/次, >40 kg: 600 mg/次，静脉：3~35 kg: 6 mg/(kg·次), >35~120 kg: 200 mg/次, >120 kg: 300 mg/次，每12小时1次，疗程14 d；3. 布林西多福韦口服：<10 kg: 6 mg/(kg·次), 10~48 kg: 4 mg/(kg·次), >48 kg: 200 mg/次，每周2次，第1天和第8天；4. 西多福韦静脉：5 mg/(kg·次)，每周1次×2周，然后隔周1次",
      "contraindication": "布林西多福韦可能导致转氨酶升高；西多福韦有肾毒性、电解质异常等不良反应",
      "evidence": "美国疾病预防控制中心（CDC）建议严重MPXV感染者可以尝试使用布林西多福韦或西多福韦；重症或具有重症高危因素的患者以及出现眼部、口腔及其他特殊部位（如生殖器或肛门）感染的猴痘患者可扩展性使用特考韦瑞。WHO建议对于重症或有并发症的病例使用抗病毒治疗，推荐剂量和疗程见表2。表2：儿童特考韦瑞、布林西多福韦和西多福韦推荐使用剂量、疗程和不良反应。特考韦瑞口服：13~25 kg: 200 mg/次, >25~40 kg: 400 mg/次, >40 kg: 600 mg/次；静脉：3~35 kg: 6 mg/(kg·次), >35~120 kg: 200 mg/次, >120 kg: 300 mg/次；疗程：每12小时1次，疗程14 d；不良反应：头痛、眩晕、恶心、呕吐、腹泻、腹痛等。布林西多福韦口服：<10 kg: 6 mg/(kg·次), 10~48 kg: 4 mg/(kg·次), >48 kg: 200 mg/次；疗程：每周2次，第1天和第8天；不良反应：转氨酶升高、腹泻、恶心、呕吐和腹痛等。西多福韦静脉：5 mg/(kg·次)；疗程：每周1次×2周，然后隔周1次；不良反应：肾毒性、电解质异常、中性粒细胞减少、眼压降低、葡萄膜炎/虹膜炎、恶心、发热、乏力。"
    }
  },
  {
    "id": 833,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景B",
    "case_input": "患儿昨晚起高热39.4 ℃，伴畏寒、乏力。父亲代诉：‘矿区里孩子常跟村里男孩去林子里抓松鼠烤着吃，上周还分吃过一只“病得跑不动”的小猴。’查体见面部及双手散在2～4 mm浅表脐凹样丘疹，部分顶端有透明小水疱；颌下可触及1.5 cm质韧淋巴结。母亲补充：‘住处和另外两个单身矿工共用一间棚屋，床单混着用；孩子怕冷，昨晚还盖了其中一人的外套。’父亲焦急地问：‘医生，这像不像普通水痘？我们路上用了退烧栓，怎么还烧？’",
    "reference_rule": {
      "condition": "一般人群在猴痘疫情流行地区工作或旅居",
      "action": "1. 尽量避免无保护地接触或处理野生动物，特别是生病或死亡的野生动物；2. 所有含有野生动物肉或器官的食物在食用前必须彻底烹饪熟；3. 避免与可疑感染者（如男男同性恋者）密切接触；4. 避免共用生活用品（如床上用品、衣物等）；5. 照看或探视患者时佩戴一次性乳胶手套、医用防护口罩、一次性隔离衣等；6. 做好手部卫生，及时用肥皂、洗手液等在流动水下洗手",
      "contraindication": null,
      "evidence": "为降低暴露感染风险，个人还应尽量避免无保护地接触或处理野生动物，特别是生病或死亡的野生动物。所有含有野生动物肉或器官的食物在食用前必须彻底烹饪熟。在猴痘疫情流行地区工作或旅居人员应避免与可疑感染者（如男男同性恋者）密切接触，避免共用生活用品（如床上用品、衣物等）。照看或探视患者时要做好个人防护（如佩戴一次性乳胶手套、医用防护口罩、一次性隔离衣等）。注意做好手部卫生，及时用肥皂、洗手液等在流动水下洗手。"
    }
  },
  {
    "id": 834,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景B",
    "case_input": "患儿3天前出现38.1℃低热，自服退热药后体温反复。昨日左臂外侧出现3颗2-3mm红色丘疹，中央稍凹陷，轻痒。母亲自述孩子平日喜与小区流浪猫玩耍，上周曾用手触碰一只口鼻带痂的猫，未戴手套。既往史：2岁时确诊Wiskott-Aldrich综合征，长期口服环孢素，未接种天花疫苗。家族史无特殊。查体：左臂3颗典型脐凹状丘疹，周围绕以红晕；颌下可及2枚0.8cm淋巴结，质韧，轻压痛；口腔黏膜未见损害。母亲情绪焦虑，反复询问“医生，这会不会是猴痘？需要打疫苗吗？” 门诊候诊区空调故障，室温30℃，患儿略显烦躁，轻微出汗。",
    "reference_rule": {
      "condition": "天花或猴痘职业暴露高风险人群（包括实验室人员、临床医护人员和疫情应对人员等）；其他高风险人群，特别是伴有免疫缺陷疾病的儿童；无防护高风险暴露者，尤其是猴痘病例的密切接触者",
      "action": "1. 接种天花疫苗进行暴露前预防，需由医护人员和接种者共同评估风险后决定；2. 初次接种者（无天花疫苗接种史）皮下注射接种2剂次，间隔4周；3. 有天花疫苗接种史的人则只接种1剂次；4. 对于暴露后预防，在末次暴露后4 d内（无症状情况下最多14 d内）接种",
      "contraindication": "现阶段不提倡开展大规模疫苗接种",
      "evidence": "现阶段并不提倡开展大规模疫苗接种来预防猴痘。推荐天花或猴痘职业暴露高风险人群（包括实验室人员、临床医护人员和疫情应对人员等）以及其他高风险人群，特别是伴有免疫缺陷疾病的儿童接种天花疫苗进行暴露前预防，需由医护人员和接种者共同评估风险后决定。疫苗接种建议：初次接种者（无天花疫苗接种史）皮下注射接种2剂次，间隔4周；有天花疫苗接种史的人则只接种1剂次。对于无防护高风险暴露者的暴露后预防，尤其是猴痘病例的密切接触者，建议在末次暴露后4 d内（无症状情况下最多14 d内）接种。"
    }
  },
  {
    "id": 835,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景F",
    "case_input": "6岁男童，随父母结束在尼日利亚探亲后乘航班抵沪。入境检疫通道红外测温37.8℃，关员发现其右侧面颊、双手背散在5-7颗2-4 mm脐凹样水疱，中央结痂，周围红晕；左掌心一枚黑色焦痂。男童精神可，轻微痒痛，无咳嗽、腹泻。父母否认近期接触草原宠物或食用野味，仅回忆两周前在酒店游泳池边曾被“小松鼠”咬过手指，未就医。航班上有两名成人旅客同期出现“类似皮疹”已通报。海关流行病学调查表记录：全程口罩佩戴率约60%，抵沪前一周曾入住当地暴发“猴痘聚集性疫情”的社区。随身的安抚玩偶（布制仓鼠造型）被检疫犬反复嗅闻。父母焦急询问是否需隔离、能否先回家取学习平板，因孩子次日原定参加国际学校入学面试。",
    "reference_rule": {
      "condition": "猴痘疫情暴发流行期间",
      "action": "1. 监测和快速发现病例；2. 隔离疑似和确诊病例；3. 追踪和管理密切接触者，从最后一次接触病例或其污染物品之日起监测症状；4. 加强入境管理，对携带和寄递动物（尤其进口啮齿类和灵长类动物）加强检疫；5. 对可能与感染MPXV动物有接触的动物进行隔离检疫30 d",
      "contraindication": null,
      "evidence": "监测和快速发现病例对于遏制疫情至关重要，各级各类医疗卫生机构日常接诊发热伴出疹患者时，应注意询问其流行病学史，同时进行病原学筛查，排除水痘、带状疱疹、单纯疱疹、手足口病等其他明确病因所致疾患；同时，入境隔离点应主动对入境人员进行MPXV排查，特别是入境前21 d内有猴痘疫情报告国旅居史的人员，应密切监测其出疹情况。与猴痘患者密切接触是最重要的危险因素。因此，在猴痘疫情暴发流行期间，识别、追踪和管理密切接触者是预防和控制MPXV人际传播的关键措施。一旦发现疑似病例，应立即启动密切接触者的识别和追踪工作。从最后一次接触病例或其污染物品之日起，监测密切接触者是否出现任何症状或体征。此外，为从源头上预防MPXV感染，建议非必要不进口啮齿类和灵长类动物，限制或禁止非洲猴痘疫情地方性流行地区的啮齿类和灵长类动物进口贸易，加强入境管理，对携带和寄递动物（尤其进口啮齿类和灵长类动物）加强检疫。对任何可能与感染MPXV动物有接触的动物，应进行隔离检疫，根据标准预防措施处理，观察症状30 d。"
    }
  },
  {
    "id": 836,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景E",
    "case_input": "5岁男童，因‘发热3天、面部及躯干出现水疱样皮疹1天’由家长带至急诊。家长述患儿近一周未离开本市，但曾与邻家新购宠物草原犬鼠有过密切接触。查体：T 38.7 ℃，咽部充血，双侧耳后及颌下可触及黄豆大小淋巴结、轻压痛；颜面、手掌散在0.3–0.8 cm脐凹状水疱，部分基底红晕，中央见灰白痂；躯干亦可见数个类似皮损，伴抓痕。急诊快速抗原检测显示正痘病毒属阳性。家长焦急询问：‘孩子需要住院吗？会不会留疤？’ 护士正准备为患儿办理留观手续，同时注意到候诊区还有两名候诊儿童在追逐打闹。",
    "reference_rule": {
      "condition": "疑似或确诊病例",
      "action": "1. 安置在单间隔离病房；2. 限制活动范围；3. 如患儿病情允许，佩戴外科口罩并定期更换；4. 尽可能避免皮损暴露：皮损较少者可局部敷料覆盖，皮损较多者穿长衣及长裤，皮损广泛且病情较重需卧床者应用专用纱布覆盖皮损，使用支被架；5. 每日更换床单及接触衣物；6. 房间每日进行紫外线消毒；7. 更换的衣物进行高温高压消毒；8. 对密切接触者进行登记、及时隔离和医学观察21 d",
      "contraindication": null,
      "evidence": "疑似病例和确诊病例均应安置在单间隔离病房，限制其活动范围，尽量减少接触及传播的风险，必要时可安排固定1名家属共同隔离进行陪护。如患儿病情允许，建议佩戴外科口罩，并定期更换。尽可能避免皮损暴露，皮损较少者可局部敷料覆盖，皮损较多者建议穿长衣及长裤，对于皮损广泛且病情较重需卧床者，建议应用专用纱布覆盖皮损，使用支被架避免皮肤二次损伤等。每日更换床单及接触衣物，房间每日进行紫外线消毒。更换的衣物需进行高温高压消毒。对疑似和确诊病例的密切接触者要进行登记、及时隔离和医学观察，医学观察期限为21 d。"
    }
  },
  {
    "id": 837,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景F",
    "case_input": "上午09:10，感染科隔离病房。6岁男童小葛（22 kg）正坐在床沿拼乐高，口罩拉到下巴。夜班护士交班记录：腋温36.4 ℃已稳定48 h，面部与四肢原痘痂90 %自然脱落，露出淡粉色新生上皮，无渗血；仅左踝留一处2 mm黑痂，干燥。晨起患儿自述“痒但不太疼”，能完整背诵出院三字经奖励卡。查体：呼吸22次/分，心率88次/分，SpO₂ 99 %（室空气）；咽部无充血，颈部淋巴结未及肿大。实验室：CRP 2 mg/L，血象正常；PCR-Mpox  Ct值昨日36.8（阴性阈值<34）。父亲追问：“孩子体温正常、痂快掉光了，今天能不能回家？家里还有网课和妹妹。” 病房外，后勤人员已推来含氯消毒桶，准备终末消毒。唯一干扰：昨夜暴雨导致电梯短暂停运，今晨恢复。",
    "reference_rule": {
      "condition": "猴痘患儿体温正常，临床症状明显好转，结痂脱落",
      "action": "1. 可以出院",
      "contraindication": null,
      "evidence": "符合以下标准可以出院：体温正常，临床症状明显好转，结痂脱落。"
    }
  },
  {
    "id": 838,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景D",
    "case_input": "患儿6岁，体重18 kg，急性淋巴细胞白血病维持化疗期间出现骨髓抑制。入院前10天完成第3次大剂量甲氨蝶呤输注，WBC 0.4×10⁹/L，中性粒细胞绝对计数 0.02×10⁹/L，淋巴细胞 0.1×10⁹/L；CD4⁺ 22 个/μL。3天前开始39.5 ℃弛张热，面部出现3枚脐形水疱，直径0.8-1.2 cm，基底红晕，疱液清；今日躯干、四肢新发散在类似皮损共11处，伴明显瘙痒。口腔黏膜可见2处浅溃疡。家长诉患儿昨夜因瘙痒抓破2处水疱，流出浆液。既往史：确诊白血病11个月，曾发生真菌肺炎1次；未接种天花疫苗（因化疗禁忌）。实验室：PCR已送检猴痘病毒核酸，结果待回；肝肾功能大致正常（ALT 28 U/L，Cr 0.4 mg/dL）。患儿目前入住负压隔离病房，接受美罗培南+万古霉素经验抗细菌治疗，以及静脉伏立康唑预防真菌。今日血液科会诊意见：重症免疫抑制状态，属猴痘暴露后高风险人群，需紧急评估进一步暴露后预防措施。家长焦急询问：“孩子烧得这么高，新药什么时候能用？”窗外暴雨，配送电梯因天气原因延迟，药师电话告知医院药房暂无口服特考韦瑞库存。",
    "reference_rule": {
      "condition": "重症或无法接种天花疫苗的严重免疫缺陷患者进行暴露后预防",
      "action": "1. 考虑给予静脉注射牛痘免疫球蛋白（VIG）",
      "contraindication": null,
      "evidence": "目前尚无VIG治疗猴痘的有效性数据。仅对于重症或无法接种天花疫苗的严重免疫缺陷患者进行暴露后预防，可考虑给予静脉注射VIG。"
    }
  },
  {
    "id": 840,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景F",
    "case_input": "傍晚的儿科隔离留观室里，空调坏了，室温29℃。患儿蜷缩在负压推床一角，颜面、双手背散在0.5-1.2 cm脐凹样水疱，部分顶端覆黑痂；母亲正用自备湿巾替孩子擦脸。急诊护士小李准备为患儿采咽拭子送检猴痘病毒PCR，她背着的听诊器随动作晃动，几乎要碰到孩子的枕巾。孩子口渴，伸手去拿妈妈刚喝过的粉色保温杯，母亲下意识把杯子递过去。小李注意到自己只戴了普通外科口罩，隔离衣下摆因长时间弯腰已滑到膝盖，手腕处的乳胶手套边缘因为出汗卷起了皱褶。此时检验科电话催促尽快送血常规，她左手拿着条码单，右手还握着未盖盖的拭子管，犹豫是否先写完护理记录再去洗手。",
    "reference_rule": {
      "condition": "医务人员和陪护人员接触疑似或确诊病例",
      "action": "1. 采取接触预防和飞沫预防措施；2. 佩戴一次性乳胶手套、医用防护口罩、防护面屏或护目镜、一次性隔离衣等；3. 做好手卫生；4. 避免与患儿共用生活物品；5. 减少皮肤暴露",
      "contraindication": null,
      "evidence": "医务人员和陪护人员采取接触预防和飞沫预防措施，佩戴一次性乳胶手套、医用防护口罩、防护面屏或护目镜、一次性隔离衣等，同时做好手卫生。避免与患儿共用生活物品，减少皮肤暴露。"
    }
  },
  {
    "id": 843,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景A",
    "case_input": "7岁男孩，因‘发热38.7℃、面部及上肢散在脐凹样水疱2天’被收入留观病房等待PCR结果。孩子体型偏胖，上臂围24 cm，护士准备为他复测体温时发现：孩子自带的卡通毛巾与换下的校服汗衫一起堆在床尾，表面可见少量清亮水疱液渍；床头柜上还有早上用过的塑料吸管杯和Switch游戏手柄，手柄缝隙里沾着干涸的痂皮碎屑。家长抱歉地说：‘早上走得急，没来得及给他换干净衣服，毛巾也是昨晚洗澡后重复用的。’ 空调房温度低，孩子仍出汗，护士注意到床单肩部有一块1元硬币大小的淡黄色渗出痕迹。家长补充：‘他半夜痒得厉害，抓破了好几个疱，我怕感染，就用家里的普通湿巾给他擦了擦。’ 护士准备处理这些个人物品及环境表面，但物品中有塑料玩具、充电线、棉质毛巾和不锈钢餐具，家长询问：‘这些东西是不是带病毒？我们回家还能继续用吗？’",
    "reference_rule": {
      "condition": "疑似和确诊病例衣物、毛巾、床单、餐具等个人用品；被分泌物污染的物品及其他可能污染的环境和物体表面",
      "action": "1. 可选择高温消毒；2. 或使用含氯消毒剂、二氧化氯、过氧乙酸、过氧化氢等消毒剂擦拭、喷洒或浸泡消毒；3. 尽量选择一次性诊疗用品；4. 非一次性诊疗用品首选高压蒸汽灭菌；5. 不耐热物品选择化学消毒剂或低温灭菌设备消毒；6. 手卫生选用速干手消毒剂或75%乙醇擦拭消毒（醇类过敏者选择季铵盐类）；7. 有肉眼可见污染物时，先用洗手液（或肥皂）在流动水下按六步洗手法清洗双手，再消毒；8. 对分泌物、粪便及血液污染物按《医疗机构消毒技术规范》消毒",
      "contraindication": "醇类过敏者避免使用75%乙醇",
      "evidence": "重点消毒疑似和确诊病例衣物、毛巾、床单、餐具等个人用品，以及被分泌物污染的物品及其他可能污染的环境和物体表面。可选择高温消毒，或使用含氯消毒剂、二氧化氯、过氧乙酸、过氧化氢等消毒剂擦拭、喷洒或浸泡消毒。尽量选择一次性诊疗用品，非一次性诊疗用品应首选高压蒸汽灭菌，不耐热物品可选择化学消毒剂或低温灭菌设备进行消毒。手卫生可选用速干手消毒剂，或直接使用75%乙醇进行擦拭消毒；醇类过敏者，可选择季铵盐类等有效的非醇类手消毒剂。有肉眼可见污染物时，应先使用洗手液（或肥皂）在流动水下按照六步洗手法清洗双手，然后按上述方法消毒。对患儿的分泌物、粪便及血液污染物按照《医疗机构消毒技术规范》进行严格消毒处理。"
    }
  },
  {
    "id": 844,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景E",
    "case_input": "5岁男童，因“发热3天、全身皮疹伴右前臂红肿疼痛1天”由父母夜间带至发热门诊。患儿体温最高39.1℃，热峰时伴寒战；皮疹初起于面部，为散在脐凹样水疱，后波及躯干及四肢，部分破溃结痂。1天前右前臂远端原水疱处迅速出现进行性加重的红肿、热痛，中心可见2 cm波动区，触痛明显，拒碰。患儿食欲下降，小便量略减，无咳嗽、无抽搐。既往体健，按计划完成基础疫苗接种，否认慢性皮肤病及免疫缺陷。家族史无特殊。流行病学史：托幼机构内无类似病例，无非洲/欧美旅行史，无啮齿类或灵长类动物接触史，但其父2周前自欧洲商务返国，自述“下颌长了个痘”，未就诊。急诊查体：T 38.7 ℃，P 116次/分，R 24次/分，SpO₂ 98%；神志清，烦躁；颜面、躯干、四肢散在0.3–1 cm脐凹状丘疹-水疱，部分中央结痂，数目约40枚；右前臂远端背侧8 cm×6 cm弥漫性红肿，皮温显著升高，中央见2 cm×2 cm波动区，轻压痛伴脓头；双侧腋下可触及黄豆大淋巴结，质韧压痛。实验室：WBC 18.4×10⁹/L，N 0.82，CRP 87 mg/L，PCT 0.68 ng/mL；血糖、电解质正常；肝肾功能无异常。床旁超声提示右前臂皮下低回声区，厚壁包裹，内见碎屑样回声，考虑脓肿形成。追问家长，患儿昨日抓破皮疹后曾用未消毒的毛巾反复擦拭。目前患儿母亲焦虑追问：“孩子这皮疹怎么突然肿得这么厉害？是不是感染了？”",
    "reference_rule": {
      "condition": "猴痘患儿出现皮肤继发细菌感染（如蜂窝织炎、脓肿等）",
      "action": "1. 酌情使用3%硼酸溶液或1:5000的呋喃西林溶液湿敷，或外用0.5%新霉素软膏或2%莫匹罗星软膏；2. 初始口服抗菌药物应覆盖金黄色葡萄球菌和链球菌；3. 根据病原菌培养分离鉴定和药敏结果调整抗菌药物；4. 必要时由外科医师进行清创、切开及引流",
      "contraindication": null,
      "evidence": "皮肤继发细菌感染（蜂窝织炎、脓肿等）：酌情使用3%硼酸溶液或1:5000的呋喃西林溶液湿敷，或外用0.5%新霉素软膏或2%莫匹罗星软膏。初始口服抗菌药物应覆盖金黄色葡萄球菌和链球菌，并根据病原菌培养分离鉴定和药敏结果加以调整。必要时由外科医师进行清创、切开及引流。"
    }
  },
  {
    "id": 847,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景D",
    "case_input": "5岁男童，体重18 kg，因“发热7天、皮疹5天、呼吸急促伴低氧1天”由传染病医院转入我院PICU。父母代诉：患儿病初最高体温40.1 ℃，面部、躯干及掌跖先后出现2–4 mm脐凹状水疱，部分结痂；近24 h出现咳嗽、鼻翼扇动、三凹征。既往史：1岁时诊断“室间隔缺损（膜周部，3 mm）”，未手术；无哮喘、无免疫缺陷。入院查体：T 38.9 ℃，HR 176 次/分，RR 42 次/分，SpO₂ 87%（面罩吸氧5 L/min），BP 84/50 mmHg；烦躁，唇绀，双肺呼吸音粗、右下肺可闻细湿啰音；肝肋下3 cm，质软。实验室：WBC 18.4×10⁹/L（中性粒细胞 78%），CRP 112 mg/L，PCT 3.8 ng/mL；血气（FiO₂ 0.4）：pH 7.28，PaO₂ 56 mmHg，PaCO₂ 49 mmHg，Lac 2.6 mmol/L；NT-proBNP 2 840 pg/mL。胸片：双肺弥漫性斑片状渗出，右下肺实变；心影轻度增大。咽拭子MPXV-PCR阳性；痰培养回报“肺炎链球菌（青霉素MIC 2 μg/mL）”生长。今日凌晨患儿氧合指数降至P/F 120 mmHg，呼吸功明显增加，FiO₂已调至0.6仍SpO₂ 88%，伴心率增快、毛细血管再充盈时间4 s，尿量1.2 mL/kg·h。",
    "reference_rule": {
      "condition": "猴痘患儿发生肺炎和急性呼吸窘迫综合征",
      "action": "1. 给予氧疗或机械通气；2. 保护心、肺等重要脏器功能等对症支持治疗；3. 如明确有其他病原感染，选择相应抗病原微生物药物治疗",
      "contraindication": null,
      "evidence": "呼吸道并发症：如发生肺炎和急性呼吸窘迫综合征，给予氧疗或机械通气，保护心、肺等重要脏器功能等对症支持等治疗，如明确有其他病原感染，选择相应抗病原微生物药物治疗。"
    }
  },
  {
    "id": 848,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景D",
    "case_input": "患儿3岁，体重11 kg，身高88 cm。主诉：发热3天（最高39.4 ℃）、颜面及四肢离心性分布的2-4 mm脐凹样水疱1天，伴拒食、烦躁。父母代诉：水疱由“小红点”迅速演变为“小脓包”，轻触即痛。既往史：生后3个月确诊重症联合免疫缺陷（SCID），一直口服复方磺胺甲噁唑预防PCP，未行造血干细胞移植；合并轻-中度营养不良（近半年体重增长曲线<第3百分位）。家族史：无类似皮疹史。查体：T 39.1 ℃，HR 158次/分，RR 36次/分，SpO₂ 94%（空氧），BP 82/48 mmHg。颜面、手掌、足底共可见约40颗脐凹状脓疱，个别疱底红晕，颈前及腹股沟可触及0.8-1.2 cm淋巴结，质韧、活动、压痛（+）。口腔颊黏膜见2处3 mm浅溃疡。实验室：血常规WBC 6.8×10⁹/L，L 0.9×10⁹/L（绝对计数显著低下），Hb 102 g/L，PLT 134×10⁹/L；CRP 38 mg/L；肝肾功能、电解质基本正常；PCR咽拭子猴痘病毒DNA阳性（Ct 24）。胸部X线：双肺纹理稍粗，未见明显浸润。干扰信息：父亲补充“昨晚给他吃了半包海苔，不知道是不是海苔过敏”。",
    "reference_rule": {
      "condition": "猴痘患儿有基础疾病（如先天性心肺气道疾病、慢性心肾疾病、营养不良、遗传代谢性疾病、免疫缺陷病、肿瘤等）",
      "action": "1. 同时积极治疗原发病",
      "contraindication": null,
      "evidence": "有基础疾病者（如先天性心肺气道疾病、慢性心肾疾病、营养不良、遗传代谢性疾病、免疫缺陷病、肿瘤等）易出现重症且死亡率高，应同时积极治疗原发病。"
    }
  },
  {
    "id": 852,
    "file_name": "儿童猴痘诊疗和预防专家共识.json",
    "scenario_type": "场景D",
    "case_input": "患儿6岁，足月顺产，既往体健，按时接种疫苗。5天前出现发热（Tmax 39.4 ℃），伴咽痛，家长予布洛芬退热。3天前颜面部出现2 mm红色斑疹，逐渐演变为脐凹样水疱，波及手掌、足底及臀部，伴明显瘙痒。今日凌晨突发全身强直-阵挛性抽搐1次，持续约3 min，抽搐后嗜睡，送至我院急诊。入院查体：T 38.7 ℃，HR 142 次/分，RR 28 次/分，BP 88/50 mmHg，SpO₂ 97%（RA）。神志朦胧，GCS 11分（E3V3M5），颈抵抗（+），双侧瞳孔直径3 mm、对光反射迟钝。全身皮肤可见散在0.3–0.8 cm脐凹样水疱，部分结痂，手掌足底受累明显。口腔黏膜见2枚浅溃疡。脑膜刺激征阳性，双侧巴氏征可疑阳性。实验室：WBC 14.2×10⁹/L（N 0.78），PLT 162×10⁹/L，CRP 28 mg/L；血糖5.1 mmol/L；Na⁺ 129 mmol/L；肝肾功能正常；HIV抗体阴性。头颅CT未见出血及占位，脑沟稍窄。脑脊液：压力260 mmH₂O，外观清亮，WBC 86×10⁶/L（单核0.65），蛋白0.72 g/L，糖2.6 mmol/L（同步血糖5.1 mmol/L），氯118 mmol/L；MPXV-PCR（皮肤疱液）阳性，CSF-MPXV-PCR结果待报。胸片示双肺纹理增粗，未见实变。家长诉患儿发病前曾接触家养草原犬鼠（死亡1只），家长否认家族遗传病史及近期旅行史。急诊已予咪达唑仑0.15 mg/kg静推止惊、20%甘露醇5 ml/kg q6h快速静滴，并建立两条静脉通路。患儿目前嗜睡，呕吐1次非喷射性，尿量1.2 ml/kg·h，末梢循环尚可。",
    "reference_rule": {
      "condition": "猴痘患儿出现脑炎",
      "action": "1. 给予镇静、脱水降颅压等治疗；2. 如果合并感染，使用相应抗病原微生物药物治疗",
      "contraindication": null,
      "evidence": "脑炎：给予镇静、脱水降颅压等治疗。如果合并感染，建议使用相应抗病原微生物药物治疗。"
    }
  }
]