[
  {
    "id": 1710,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者近3周来反复干咳，夜间加重，伴38℃左右低热、盗汗，晨起需换一件湿透的背心；体重自测下降约4kg，食欲差，常靠两包泡面撑到收工。今日咳出少量带血丝痰，遂趁工地调休骑电动车30分钟来诊。既往体健，吸烟指数800，偶尔饮酒。查体：T 37.8℃，P 92次/分，R 20次/分，BP 118/74 mmHg；右上肺叩诊略浊，呼吸音减低。门诊胸片示右肺上野斑片、结节影，边缘模糊，其内疑似小空洞。患者自述近半年同住宿舍的表哥也有“长期咳嗽”，但未曾就医。",
    "reference_rule": {
      "condition": "具有结核中毒症状（低热、乏力、盗汗、食欲减退、体重减轻等），或伴呼吸道症状者（咳嗽、咳痰2周以上，或伴咯血、痰中带血），或通过健康体检发现的肺部阴影疑似肺结核者",
      "action": "1. 进一步完善相关检查明确是否为肺结核; 2. 在门诊日志标注疑似肺结核病例; 3. 按乙类传染病疫情报告要求进行网络直报; 4. 完整填写《肺结核病例登记报告卡》; 5. 填写《肺结核患者转诊单》并及时转诊至县级以上结核病防治所或有条件诊治结核病的综合医院",
      "contraindication": null,
      "evidence": "具有结核中毒症状（低热、乏力、盗汗、食欲减退、体重减轻等），或伴呼吸道症状者（咳嗽、咳痰2周以上，或伴咯血、痰中带血），或通过健康体检发现的肺部阴影疑似肺结核者，应考虑为肺结核可疑者，需进一步完善相关检查明确是否为肺结核。"
    }
  },
  {
    "id": 1715,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景F",
    "case_input": "午后，乡镇卫生院儿保室。奶奶抱着4岁半的孙子小浩（体重18 kg）进门，着急地说：“大夫，孩子这俩礼拜一到下午就烧到38 ℃左右，夜里出汗多，还总咳，听着空空的。”孩子缩在奶奶怀里，偶尔轻咳，右颈可触及一枚1.5 cm淋巴结，轻压痛。奶奶补了一句：“他舅舅前阵子在大医院查出来肺上有空洞，说是痰里带菌，一直住家里，娃总黏着他。”护士量腋温37.9 ℃，听诊右肺上野呼吸音略低。今天外面下雨，候诊走廊地面湿滑。医生追问疫苗史，奶奶说卡介苗出生时就种了，但具体复查情况记不清。目前未行任何影像或结核菌检查，家长只带了上周村卫生室开的止咳糖浆空瓶。",
    "reference_rule": {
      "condition": "符合下列条件之一者：1. 有肺结核可疑症状的5岁以下儿童，同时伴有与痰涂片阳性肺结核患者密切接触史或TST强阳性或IGRA阳性；2. 仅胸部影像学检查结果显示有与活动性肺结核相符的病变",
      "action": "1. 按乙类传染病疫情报告要求进行网络直报; 2. 完整填写《肺结核病例登记报告卡》; 3. 填写《肺结核患者转诊单》并及时转诊至县级以上结核病防治所或有条件诊治结核病的综合医院",
      "contraindication": null,
      "evidence": "疑似病例：符合下列条件之一者为疑似病例：① 有肺结核可疑症状的5岁以下儿童，同时伴有与痰涂片阳性肺结核患者密切接触史或TST强阳性或IGRA阳性；② 仅胸部影像学检查结果显示有与活动性肺结核相符的病变。"
    }
  },
  {
    "id": 1726,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者20天前无明显诱因出现阵发性干咳，晨起重，夜间伴盗汗，自测体温波动37.6-38.2℃，口服阿莫西林5天无缓解。3天前痰中带血丝一次，量约1ml，鲜红色，无胸痛气促。吸烟史15年，约20支/日，近1周因工期紧张仍坚持高空作业。查体：T 38.0℃，右上肺呼吸音稍低，未闻及干湿啰音；余心肺腹（-）。门诊胸片示右上肺尖后段斑片、结节影伴小空洞，直径约1.5cm，边缘模糊；左肺清晰。今日留取即时痰与晨痰各1份送检，抗酸染色镜检回报：即时痰找到抗酸杆菌（+），晨痰结果待报；HIV抗体筛查（-）。患者自述昨晚夜班后疲惫，担心耽误工期，询问能否先开口服药回家观察。",
    "reference_rule": {
      "condition": "符合下列条件之一者：1. 痰涂片阳性肺结核（2份痰标本直接涂片抗酸杆菌镜检阳性；或1份痰标本直接涂片抗酸杆菌镜检阳性+肺部影像学检查符合活动性肺结核影像学表现；或1份痰标本直接涂片抗酸杆菌镜检阳性+1份痰标本结核菌培养阳性）；2. 仅培养阳性肺结核（痰涂片阴性，肺部影像学检查符合活动性肺结核影像学表现+1份痰标本结核菌培养阳性）；3. 肺部影像学检查符合活动性肺结核影像学表现，分子生物学检测阳性（如PCR、Xpert MTB/RIF）；4. 肺或胸膜病变标本病理学诊断为结核病变者",
      "action": "1. 立即开始标准抗结核化学治疗; 2. 按乙类传染病疫情报告要求进行网络直报; 3. 完整填写《肺结核病例登记报告卡》; 4. 在结核病定点医疗机构进行门诊或住院治疗",
      "contraindication": null,
      "evidence": "确诊病例：符合下列条件之一者为确诊病例：① 痰涂片阳性肺结核。符合下列3项之一者：a. 2份痰标本直接涂片抗酸杆菌镜检阳性；b. 1份痰标本直接涂片抗酸杆菌镜检阳性+肺部影像学检查符合活动性肺结核影像学表现；c. 1份痰标本直接涂片抗酸杆菌镜检阳性+1份痰标本结核菌培养阳性；② 仅培养阳性肺结核。同时符合下列2项者：a. 痰涂片阴性；b. 肺部影像学检查符合活动性肺结核影像学表现+1份痰标本结核菌培养阳性；③ 肺部影像学检查符合活动性肺结核影像学表现，分子生物学检测阳性（如PCR、Xpert MTB/RIF）；④ 肺或胸膜病变标本病理学诊断为结核病变者。"
    }
  },
  {
    "id": 1727,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者因“断断续续低烧、夜里出汗3周，咳黄痰带血丝2天”来乡镇卫生院门诊。T 37.8 ℃，消瘦明显（BMI 18.2 kg/m²），右锁骨上听诊可闻细小湿啰音。胸片提示右肺上叶斑片影伴小空洞，PPD 硬结18 mm，γ-干扰素释放试验阳性；痰涂片抗酸杆菌（+）。患者自述每天抽1包烟，工期紧常通宵加班，既往无慢性病史，青霉素过敏。今日由工友陪同步行就诊，外面正下小雨，他还担心工地老板嫌请假时间长。",
    "reference_rule": {
      "condition": "诊断为活动性肺结核",
      "action": "1. 遵循早期、规律、全程、适量、联合的治疗原则; 2. 整个治疗方案分强化期和巩固期两个阶段; 3. 化学治疗的主要作用为杀菌和灭菌、防止耐药菌产生、减少结核菌的传播",
      "contraindication": null,
      "evidence": "结核病化学治疗的基本原则是早期、规律、全程、适量、联合。整个治疗方案分强化期和巩固期两个阶段。化学治疗的主要作用为杀菌和灭菌、防止耐药菌产生、减少结核菌的传播。"
    }
  },
  {
    "id": 1728,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景C",
    "case_input": "患者42岁，建筑工，因“咳嗽伴低热3周”于10天前在本院拍胸片提示“双上肺斑片影”，当日连续两次痰涂片均找到抗酸杆菌（4+）。已按指南启动HRZE四联抗结核治疗，并上报传染病卡。今日复诊，患者仍咳黄脓痰、夜间盗汗明显，体温37.8℃，体重较首诊下降2kg；复查肝功ALT 112 U/L（正常<40），外周血白细胞3.1×10⁹/L。患者抱怨“吃药后胃胀、恶心，一天只能喝粥”，并担心耽误工地工期。诊室窗外正下小雨，他脚穿沾满泥浆的高帮胶鞋，反复看表，生怕错过下午回工地的班车。",
    "reference_rule": {
      "condition": "临床疑似肺结核者；直接涂片抗酸杆菌镜检阳性者；肺结核治疗过程中出现明显不良反应者；抗肺结核治疗效果不佳者",
      "action": "1. 填写《肺结核患者转诊单》，及时将患者转诊至县级以上结核病防治所或有条件诊治结核病的综合医院进行确诊或治疗; 2. 在非结核病定点医疗机构确诊的肺结核患者，转诊到当地结核病定点医疗机构进行门诊或住院治疗; 3. 在定点医疗机构确诊的肺结核患者，可在确诊机构治疗，或将患者转诊到其居住地定点医疗机构继续治疗",
      "contraindication": null,
      "evidence": "普通转诊建议：(1) 临床疑似肺结核者；(2) 直接涂片抗酸杆菌镜检阳性者；(3) 肺结核治疗过程中出现明显不良反应者；(4) 抗肺结核治疗效果不佳者。"
    }
  },
  {
    "id": 1729,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者20天前无明显诱因出现阵发性干咳，近1周转为少量白黏痰，伴午后低热（37.5–37.8 ℃）、夜间盗汗及明显乏力，无胸痛、咯血。自行服用阿莫西林及甘草片5天无缓解。今日至镇卫生院门诊，查体：消瘦，右肩胛间区可闻及细湿啰音；SpO₂ 96%（室温空气）。门诊胸片示：右肺上叶尖后段斑片、结节影伴小空洞，边缘模糊，直径约2.1 cm，空洞壁薄，周围可见卫星灶。痰涂片抗酸染色已连送3次，结果均回报“未检出抗酸杆菌”。患者诉近3个月体重下降4 kg，常年在粉尘环境作业，吸烟指数400支年。无糖尿病、无HIV高危史。查血WBC 6.8×10⁹/L，CRP 28 mg/L，ESR 55 mm/h；结核菌素试验（PPD 5 IU）48 h硬结18 mm×19 mm，局部水疱。今日为明确下一步处理，患者再次来到诊室。",
    "reference_rule": {
      "condition": "符合下列条件之一者：1. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且伴有咳嗽、咳痰、咯血等肺结核可疑症状；2. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且TST强阳性；3. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且结核抗体检查阳性；4. 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且肺外组织病理检查证实为结核病变；5. 痰涂片3次阴性的疑似肺结核病例，经诊断性治疗或随访观察可排除其他肺部疾病者；6. 支气管镜检查符合气管、支气管结核改变；7. 单侧或双侧胸腔积液，胸水检查提示渗出液，胸水ADA明显升高，伴有TST阳性或IGRA阳性",
      "action": "1. 开始抗结核治疗; 2. 按乙类传染病疫情报告要求进行网络直报; 3. 完整填写《肺结核病例登记报告卡》; 4. 填写《肺结核患者转诊单》并及时转诊至结核病定点医疗机构",
      "contraindication": null,
      "evidence": "临床诊断病例：符合下列条件之一者为临床诊断病例：① 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且伴有咳嗽、咳痰、咯血等肺结核可疑症状；② 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且TST强阳性；③ 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且结核抗体检查阳性；④ 痰涂片3次阴性，胸部影像学检查显示有与活动性肺结核相符的病变，且肺外组织病理检查证实为结核病变；⑤ 痰涂片3次阴性的疑似肺结核病例，经诊断性治疗或随访观察可排除其他肺部疾病者；⑥ 支气管镜检查符合气管、支气管结核改变；⑦ 单侧或双侧胸腔积液，胸水检查提示渗出液，胸水ADA明显升高，伴有TST阳性或IGRA阳性。"
    }
  },
  {
    "id": 1730,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者近6周出现午后低热（Tmax 38.1℃）、夜间盗汗伴体重下降4kg，干咳无痰，偶有血丝。自诉3年前患肺结核，规律服药半年后停药，未复查。吸烟10年，每天1包。查体：消瘦，右上肺呼吸音减弱，可闻及细湿啰音。胸片示右上肺尖后段不规则浸润影伴空洞形成，直径约2.5cm。痰涂片抗酸染色阳性（3+），GeneXpert MTB/RIF提示结核分枝杆菌阳性且对利福平耐药。患者担心再次治疗失败，询问基层医生下一步如何处理。",
    "reference_rule": {
      "condition": "耐药结核和耐多药结核（对至少包括异烟肼和利福平在内的2种以上药物产生耐药）",
      "action": "1. 强化期包含至少5种有效抗结核药物：包括吡嗪酰胺及4个核心二线抗结核药物（A组1个：氟喹诺酮类如高剂量左氧氟沙星≥750 mg/d、莫西沙星或加替沙星；B组1个：二线注射类药物如阿米卡星、卷曲霉素、卡那霉素或链霉素；C组2个：其他二线核心药物如乙硫异烟胺或丙硫异烟胺、环丝氨酸或特立齐酮、利奈唑胺和氯法齐明）; 2. 如果以上选择不能组成有效方案，加入1种D2组药物（贝达喹啉或德拉马尼），再从D3组选择其他有效药物（对氨基水杨酸、亚胺培南西司他丁、美罗培南、阿莫西林克拉维酸、氨硫脲）; 3. 组成含5种有效抗结核药物的方案",
      "contraindication": null,
      "evidence": "耐药结核和耐多药结核：对至少包括异烟肼和利福平在内的2种以上药物产生耐药的结核为耐多药结核（multi-drug resistance tuberculosis, MDR-TB）。WHO根据药物的有效性和安全性将治疗耐药结核的药物分为A、B、C、D 4组，其中A、B、C组为核心二线药物，D组为非核心的附加药物。A组：氟喹诺酮类，包括高剂量左氧氟沙星（≥750 mg/d）、莫西沙星及加替沙星；B组：二线注射类药物，包括阿米卡星、卷曲霉素、卡那霉素、链霉素；C组：其他二线核心药物，包括乙硫异烟胺（或丙硫异烟胺）、环丝氨酸（或特立齐酮）、利奈唑胺和氯法齐明；D组：可以添加的药物，但不能作为MDR-TB治疗的核心药物，分为3个亚类：D1组包括吡嗪酰胺、乙胺丁醇和高剂量异烟肼；D2组包括贝达喹啉和德拉马尼；D3组包括对氨基水杨酸、亚胺培南西司他丁、美罗培南、阿莫西林克拉维酸、氨硫脲。注：耐药结核治疗的强化期应包含至少5种有效抗结核药物，包括吡嗪酰胺及4个核心二线抗结核药物：A组1个，B组1个，C组2个。如果以上的选择仍不能组成有效方案，可以加入1种D2组药物，再从D3组选择其他有效药物，从而组成含5种有效抗结核药物的方案。"
    }
  },
  {
    "id": 1731,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "28岁男性，建筑工人，因“间断低热、盗汗、咳嗽3周”于今日上午来社区卫生服务中心。患者3周前起每日傍晚体温37.6–38.1℃，夜间明显盗汗，干咳伴少量白黏痰，偶有血丝，无胸痛气短。自行服用“感冒药”无缓解。既往体健，无慢病史，吸烟6年约10支/日。查体：消瘦，BMI 18.4 kg/m²，右上肺听诊可闻及细湿啰音，余无异常。今日门诊胸片示右上肺野斑片及小结节影，边缘模糊；痰涂片抗酸染色报告待回。患者自述工期紧，希望尽快明确诊断并拿到口服药后返回工地。外头正下小雨，他脚边沾满泥浆的解放鞋已浸湿。",
    "reference_rule": {
      "condition": "初治活动性肺结核（含痰涂片阳性和阴性）",
      "action": "1. 使用2HRZE/4HR方案：强化期使用异烟肼、利福平、吡嗪酰胺、乙胺丁醇，1次/d，共2个月；巩固期使用异烟肼、利福平1次/d，共4个月; 2. 若强化期第2个月末痰涂片仍阳性，强化方案可延长1个月，总疗程6个月不变; 3. 对粟粒型肺结核或结核性胸膜炎，强化期为3个月，巩固期6~9个月，总疗程9~12个月; 4. 在异烟肼高耐药地区，可选择2HRZE/4HRE方案",
      "contraindication": null,
      "evidence": "初治活动性肺结核（含痰涂片阳性和阴性）：通常选用2HRZE/4HR方案，即强化期使用异烟肼、利福平、吡嗪酰胺、乙胺丁醇，1次/d，共2个月；巩固期使用异烟肼、利福平1次/d，共4个月。若强化期第2个月末痰涂片仍阳性，强化方案可延长1个月，总疗程6个月不变。对粟粒型肺结核或结核性胸膜炎上述疗程可适当延长，强化期为3个月，巩固期6~9个月，总疗程9~12个月。在异烟肼高耐药地区，可选择2HRZE/4HRE方案。"
    }
  },
  {
    "id": 1732,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景C",
    "case_input": "患者52岁，建筑工人，因“咳嗽、低热3周”2周前在本院启动HRZE四联抗结核治疗。今日复诊，家属用轮椅推入，诉今晨咯血3次，每次约半痰盂鲜红色，伴血块，最后一次咯血后突发呼吸困难、面色青紫，持续约2分钟。查体：T 37.8℃，P 132次/分，R 34次/分，BP 86/54 mmHg，SpO₂ 78%（未吸氧），大汗，颈静脉怒张，右肺叩诊浊音，呼吸音消失，可闻及喘鸣，左肺散在湿啰音；四肢湿冷，甲床发绀。心电监护提示窦性心动过速，ST段普遍压低。家属补充：昨夜患者自行停用利福平，因“胃难受”，今晨未进食，仅喝两口凉水。昨夜至今尿量约100 ml，呈浓茶色。无高血压、糖尿病史，但10年前因车祸脾切除。今日凌晨曾出现一次短暂意识丧失，约30秒，自行恢复。患者目前躁动，反复问“我是不是要憋死了？”",
    "reference_rule": {
      "condition": "存在较严重的合并症或并发症：大气道狭窄有窒息风险者；短时间内出现呼吸、循环系统衰竭症状及体征者；发生大咯血、生命体征不稳定者；或治疗中出现严重不良反应和脏器功能衰竭：急性肝衰竭、急性肾衰竭、严重皮肤过敏反应、严重骨髓抑制或明显出血倾向等",
      "action": "1. 立即进行紧急抢救; 2. 转到县级以上医院的传染科或结核病科积极抢救; 3. 待病情稳定后及时转诊到县结核病防治所或结核病定点医院继续治疗管理",
      "contraindication": null,
      "evidence": "紧急转诊建议：(1) 存在较严重的合并症或并发症：大气道狭窄有窒息风险者；短时间内出现呼吸、循环系统衰竭症状及体征者；发生大咯血、生命体征不稳定者；(2) 治疗中出现严重不良反应和脏器功能衰竭：急性肝衰竭、急性肾衰竭、严重皮肤过敏反应、严重骨髓抑制或明显出血倾向等。"
    }
  },
  {
    "id": 1733,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者29岁，建筑工人，因“咳嗽伴血丝痰3个月、午后低热1个月”今日首次来社区卫生服务中心。近两周出现活动后气短，体重下降约6 kg。查体：T 37.8 ℃，右肺上野叩诊浊音，呼吸音明显减弱；未闻及干湿啰音。胸片示右肺上叶尖后段大片致密影伴空洞形成，直径约4 cm，内壁不规则；左肺清晰。痰涂片抗酸杆菌（+++），GeneXpert MTB/RIF 检出结核分枝杆菌且利福平耐药。已规范四联抗结核（HRZE）治疗5个月，复查痰菌仍阳性，病灶无吸收且空洞增大至5 cm，伴反复咯血2次（每次约30 ml）。患者无糖尿病、HIV及其他慢性病史，肝肾功能正常。今日步行来院途中抱怨“胸口像压着石头”，并随口提到“昨晚工地加班到凌晨两点”。",
    "reference_rule": {
      "condition": "药物治疗失败或威胁生命的单侧肺结核特别是局限性病变",
      "action": "1. 考虑外科治疗作为可选用的重要治疗方法",
      "contraindication": null,
      "evidence": "对于药物治疗失败或威胁生命的单侧肺结核特别是局限性病变，外科治疗是可选用的重要治疗方法。"
    }
  },
  {
    "id": 1735,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "夜间22:10，患者独自步入抢救室，右手捂着口，指缝间可见鲜红色血沫。自诉当日下午开始阵咳，傍晚突然咳出两口‘全血’，量约半茶杯，无食物残渣，伴胸骨后灼热感。既往确诊‘双上肺继发型肺结核’4个月，一直在村医处服HRZE组合板装药，但近两周因农忙常漏服。T 37.4 ℃，BP 118/76 mmHg，R 26次/分，SpO₂ 94%（室内空气）。听诊双上肺散在细湿啰音，左肩胛区可闻及局限性哮鸣音。急诊床边胸片示‘双上肺斑片影并左肺尖薄壁空洞，对比旧片空洞略增大’。患者神情紧张，反复问：‘医生，我还会不会大口吐血？’同时抱怨昨夜开始‘解小便有点痛’，自述白天自行服用‘三金片’两次。",
    "reference_rule": {
      "condition": "肺结核所致咯血（少量或大咯血）",
      "action": "1. 少量咯血时以安慰和消除紧张情绪、卧床休息为主，可用氨基己酸、凝血酶、卡洛磺等药物止血; 2. 大咯血时迅速畅通气道，包括体位引流、负压吸引、气管插管; 3. 使用垂体后叶素8~10 U缓脉静脉推注（血压正常者可使用酚妥拉明10~20 mg加入生理盐水250 ml中缓慢静脉滴注）; 4. 对于药物难以控制的大咯血，在保证气道通畅的情况下紧急转诊至有条件的专科或综合医院进行手术治疗或支气管动脉栓塞术",
      "contraindication": null,
      "evidence": "咯血：少量咯血时多以安慰和消除紧张情绪、卧床休息为主，可用氨基己酸、凝血酶、卡洛磺等药物止血。大咯血可危及生命，应特别警惕和尽早发现窒息先兆征象。迅速畅通气道是抢救大咯血窒息的首要措施，包括体位引流、负压吸引、气管插管。大咯血者可使用垂体后叶素8~10 U缓脉静脉推注，血压正常者可使用酚妥拉明10~20 mg加入生理盐水250 ml中缓慢静脉滴注。对于药物难以控制的大咯血，在保证气道通畅的情况下应紧急转诊至有条件的专科或综合医院进行手术治疗或支气管动脉栓塞术。"
    }
  },
  {
    "id": 1737,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者27岁，男性，外卖骑手，连续3周午后至夜间发热38.5–39.8℃，伴盗汗、乏力。昨日晨起咳出鲜红色血痰约20 ml，遂来中心。既往体健，无慢病史，吸烟6年约10支/日。查体：T 39.4 ℃，P 110次/分，R 24次/分，SpO₂ 94%（室内空气）。右上肺叩诊浊音，呼吸音减弱，可闻及细湿啰音。胸片示双肺弥漫性粟粒样结节，右上肺野可见片絮状影；门诊快检血常规WBC 9.8×10⁹/L，NE% 72%，CRP 56 mg/L，HIV抗体阴性。患者自述因担心收入减少，已自行服用对乙酰氨基酚退热4天，效果越来越差，仍持续高热，今晨体温峰值达40.1 ℃。患者询问：“医生，我这是不是普通肺炎？能不能先打退烧针继续跑单？”",
    "reference_rule": {
      "condition": "肺结核所致发热",
      "action": "1. 有效抗结核治疗后大多在1周内消退; 2. 少数发热不退者应用小剂量非类固醇类退热剂，如布洛芬; 3. 急性血行播散性肺结核或伴有高热等严重毒性症状或高热持续不退者，在抗结核药物治疗基础上使用类固醇糖皮质激素，一般每日20~30 mg泼尼松",
      "contraindication": "必须在充分有效抗结核药物的前提下使用糖皮质激素，否则可能禁忌",
      "evidence": "发热：有效抗结核治疗后肺结核所致的发热大多在1周内消退，少数发热不退者可应用小剂量非类固醇类退热剂，如布洛芬。急性血行播散性肺结核或伴有高热等严重毒性症状或高热持续不退者，可在抗结核药物治疗基础上使用类固醇糖皮质激素，一般每日20~30 mg泼尼松。糖皮质激素可能有助于改善症状，但必须在充分有效抗结核药物的前提下使用。"
    }
  },
  {
    "id": 1740,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景C",
    "case_input": "38岁男性，外来务工人员，因“咳嗽、低热3周”于20天前在本中心确诊涂阳肺结核，已启动2HREZ/4HR方案。今日为第3次复诊，患者步行前来，面色尚可，但自述“上周有两天晚上跑车太晚，没赶上卫生站关门，就把药带回去自己吃了”。查体：T 36.8 ℃，R 18次/分，HR 82次/分，SpO₂ 97%。听诊右上肺仍可闻及少量湿啰音。胸片示右上肺斑片影较初诊时稍有吸收，但空洞仍存。痰涂片抗酸染色：阳性（+）。患者烟瘾未戒，每天仍吸10支左右。今日空腹到诊，尚未服药。患者问：“医生，我能不能一次性把下周的药都领回去？跑夜班实在赶不过来。”窗外正下小雨，患者鞋底沾满泥浆，裤脚湿透。",
    "reference_rule": {
      "condition": "肺结核患者在治疗过程中",
      "action": "1. 每次用药都必须在医务人员的直接监督下进行; 2. 因故未用药时必须采取补救措施以保证按医嘱规律用药",
      "contraindication": null,
      "evidence": "直接面视下短程督导治疗：直接面视下短程督导治疗是指肺结核患者在治疗过程中，每次用药都必须在医务人员的直接监督下进行，因故未用药时必须采取补救措施以保证按医嘱规律用药。督导治疗可以提高治疗依从性，保证规律用药，从而显著提高治愈率，降低复发率和死亡率，同时降低结核病的患病率和多耐药发生率。"
    }
  },
  {
    "id": 1741,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景C",
    "case_input": "患者6个月前因“咳嗽3周、低热”初诊，痰涂片阳性（3+），胸片示右上肺空洞，HIV抗体阴性，无合并糖尿病。县定点医院予以2HREZ/4HR标准方案，全程督导服药，第2、5月末痰涂片已转阴。今日为疗程结束第180天复诊，患者自述近1周夜雨降温后略有咳白痰，无血，无发热、盗汗；仍每日吸1包烟，体重较治疗前增加3 kg。查体：T 36.4 ℃，R 18次/分，右上肺偶闻细湿啰音。卫生院仅能做痰涂片，患者晨起未漱口即留取一份合格痰标本，实验室回报：抗酸染色阴性。因患者担心“工地老板催返工”，询问能否开“痊愈证明”立即离乡。门诊医生需根据《肺结核基层诊疗指南（2018年）》判定其治疗结局并决定后续管理。",
    "reference_rule": {
      "condition": "肺结核患者完成治疗后",
      "action": "1. 根据疗效判断标准评估：治愈（痰涂片阳性肺结核患者完成规定疗程，连续2次痰涂片结果阴性，其中1次是治疗末）；完成疗程（痰涂片阴性肺结核患者完成规定的6个月标准疗程，疗程末痰涂片检查结果阴性或未痰检者；痰涂片阳性肺结核患者完成规定的6-12个月疗程，最近一次痰检结果阴性，完成疗程时无痰检结果）；结核死亡（活动性肺结核患者因病变进展或并发咯血、自发性气胸、肺心病、全身衰竭或肺外结核等原因死亡）；非结核死亡（结核病患者因结核病以外的原因死亡）；失败（痰涂片阳性肺结核患者治疗至第6个月末或疗程结束时痰涂片检查仍阳性）；丢失（肺结核患者在治疗过程中中断治疗超过2个月，或由结核病防治机构转出后，虽经医生努力追访，2个月内仍无信息或已在其他地区重新登记）",
      "contraindication": null,
      "evidence": "疗效判断标准如下：(1) 治愈：痰涂片阳性肺结核患者完成规定疗程，连续2次痰涂片结果阴性，其中1次是治疗末；(2) 完成疗程：痰涂片阴性肺结核患者完成规定的6个月标准疗程，疗程末痰涂片检查结果阴性或未痰检者；痰涂片阳性肺结核患者完成规定的6-12个月疗程，最近一次痰检结果阴性，完成疗程时无痰检结果；(3) 结核死亡：活动性肺结核患者因病变进展或并发咯血、自发性气胸、肺心病、全身衰竭或肺外结核等原因死亡；(4) 非结核死亡：结核病患者因结核病以外的原因死亡；(5) 失败：痰涂片阳性肺结核患者治疗至第6个月末或疗程结束时痰涂片检查仍阳性；(6) 丢失：肺结核患者在治疗过程中中断治疗超过2个月，或由结核病防治机构转出后，虽经医生努力追访，2个月内仍无信息或已在其他地区重新登记。"
    }
  },
  {
    "id": 1742,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者28岁，货车司机，因“间断低热、盗汗、体重下降3周”前来就诊。体温37.8℃，夜间盗汗明显，近1个月体重下降4 kg。既往史：确诊HIV感染2年，CD4 180 cells/μL，规律服用替诺福韦/拉米夫定/多替拉韦，病毒载量<50 copies/mL；无结核病史。个人史：每日吸烟15支，无吸毒；父亲5年前因痰涂片阳性肺结核去世，生前与其共同居住。查体：消瘦，右锁骨上区可触及1枚1.2 cm质韧淋巴结，无压痛；双肺呼吸音清，未闻及啰音。辅助检查：血常规WBC 4.1×10⁹/L，LY 0.9×10⁹/L；空腹血糖5.3 mmol/L；胸片示右肺尖条索状及小结节影，边缘较清晰，未见空洞；结核菌素试验硬结直径18 mm。今日门诊，患者自述症状持续，担心传染家中2岁女儿。",
    "reference_rule": {
      "condition": "高危人群：HIV感染者、痰涂片阳性肺结核的密切接触者、肺部硬结纤维病灶（无活动性）、矽肺、糖尿病、长期使用糖皮质激素或免疫抑制剂者、吸毒者、营养不良者、35岁以下结核菌素试验硬结直径≥15 mm者等",
      "action": "1. 使用预防性抗结核化学治疗; 2. 常用异烟肼300 mg/d，顿服6-8个月，儿童每日用量为4~8 mg/kg；或者利福平和异烟肼联用3个月，每日顿服或每周3次",
      "contraindication": null,
      "evidence": "高危人群使用预防性抗结核治疗可减少肺结核发病率。预防性化学治疗主要应用于受结核菌感染易发病的高危人群。包括HIV感染者、痰涂片阳性肺结核的密切接触者、肺部硬结纤维病灶（无活动性）、矽肺、糖尿病、长期使用糖皮质激素或免疫抑制剂者、吸毒者、营养不良者、35岁以下结核菌素试验硬结直径≥15 mm者等。常用异烟肼300 mg/d，顿服6-8个月，儿童每日用量为4~8 mg/kg；或者利福平和异烟肼联用3个月，每日顿服或每周3次。"
    }
  },
  {
    "id": 1745,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景E",
    "case_input": "患者42岁，男性，身高168 cm，体重59 kg，既往体健，吸烟史20年（约15支/日）。2年前因咳嗽、低热被确诊为“继发性肺结核（痰涂片阳性）”，接受2HRZE/4HR方案治疗，疗程结束后自行停药，未复查痰菌。近1个月再发咳嗽、午后低热（37.6 ℃）、盗汗，伴少量白色黏痰，偶有血丝。今日上午来社区卫生服务中心复诊，门诊测体温37.4 ℃，HR 88次/分，BP 118/72 mmHg，SpO₂ 96%（室内空气）。查体：右肺上野叩诊稍浊，呼吸音减弱，可闻及细湿啰音；余肺呼吸音清。实验室检查：血常规WBC 7.8×10⁹/L，NE% 68%，Hb 132 g/L；肝肾功能正常；空腹血糖5.2 mmol/L。痰涂片抗酸染色阳性（3+），GeneXpert MTB/RIF检测提示结核分枝杆菌阳性，利福平敏感。胸片示右肺上叶尖后段斑片、结节影伴小空洞形成，与2年前旧片比较病灶进展。患者自述因工地赶工期，近3周仍坚持高空作业，偶有轻度气促，未向工头报告病情。无药物过敏史，未合并糖尿病或其他慢病，近期体重下降约3 kg。",
    "reference_rule": {
      "condition": "复治活动性肺结核（含痰涂片阳性和阴性）",
      "action": "1. 使用常用方案为2HRZSE/6HRE，3HRZE/6HR，或2HRZSE/1HRZE/5HRE; 2. 进行药敏试验; 3. 对上述方案治疗无效的复治肺结核，参考耐多药结核可能，按耐药或耐多药结核治疗",
      "contraindication": null,
      "evidence": "复治活动性肺结核（含痰涂片阳性和阴性）：常用方案为2HRZSE/6HRE，3HRZE/6HR，2HRZSE/1HRZE/5HRE。复治结核应进行药敏试验，对上述方案治疗无效的复治肺结核应参考耐多药结核可能，需按耐药或耐多药结核治疗。"
    }
  },
  {
    "id": 1751,
    "file_name": "肺结核基层诊疗指南（2018年）.json",
    "scenario_type": "场景D",
    "case_input": "患者29岁，女性，电子厂质检员，因“咳嗽伴活动后喘促3月余”今日复诊。3个月前在外院诊为“肺结核”，HRZE四联抗结核治疗至今，但近2周出现上楼即喘、夜间阵发性呼吸困难。既往体健，无慢病史。查体：T 37.2 ℃，HR 112 次/分，R 28 次/分，SpO₂ 90%（室内空气），右肺中部及下部呼吸音明显减弱，可闻及散在哮鸣音。实验室：WBC 7.8×10⁹/L，CRP 28 mg/L，ESR 55 mm/h；痰涂片抗酸杆菌阳性（2+）。胸片：右肺门上移，右中下肺体积缩小，纹理聚拢；胸部高分辨率CT示右中间支气管及右下叶支气管管壁增厚、管腔重度狭窄（约3 mm），远端肺组织膨胀不全。血气分析（未吸氧）：PaO₂ 56 mmHg，PaCO₂ 48 mmHg，pH 7.34。患者自述近1周需半卧位入睡，说话断续，不能完成日常流水线作业。今日由社区医生陪同转诊至本院结核专科门诊，随身携带的抗结核药物记录显示规律服药，无漏服。门诊候诊区室温32 ℃，患者仍感畏寒，手持塑料风扇持续吹面。",
    "reference_rule": {
      "condition": "气管支气管结核导致叶及叶以上支气管明显狭窄，影响呼吸功能或导致呼吸衰竭",
      "action": "1. 在全身抗结核化学治疗基础上; 2. 同时给予冷冻、球囊扩张等气道介入治疗",
      "contraindication": null,
      "evidence": "气管支气管结核所致气道狭窄：气管支气管结核导致叶及叶以上支气管明显狭窄时常影响患者呼吸功能，严重者有呼吸衰竭，需在全身抗结核化学治疗基础上，同时给予冷冻、球囊扩张等气道介入治疗。"
    }
  }
]