[
  {
    "id": 1326,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者3周前带领旅行团在肯塔基州洞穴景区工作后，出现持续低热、盗汗及干咳。1周前开始感到胸骨后钝痛，深呼吸与平卧时加重，伴双腕、双膝交替性肿痛，晨僵<30 min。无皮肤红斑、口腔溃疡或晨僵延长。既往体健，无免疫抑制药物史。查体：T 37.8 ℃，BP 118/76 mmHg，HR 92 次/分；心包摩擦音在胸骨左缘第3肋间可闻，呈三相；双膝轻度肿胀，局部皮温升高。急诊血常规：WBC 8.3×10⁹/L，Hb 142 g/L，Plt 267×10⁹/L；CRP 34 mg/L，ESR 52 mm/h；肝肾功能、电解质、尿酸正常；RF、抗CCP阴性。心电图示广泛ST段弓背向下抬高；心脏超声提示少量心包积液，无室壁运动异常。胸片仅见肺门略饱满，未见空洞或大片实变。患者自述因担心‘真菌感染’，已自行口服阿莫西林5日无好转，今日要求‘做真菌检查并开抗真菌药’。今日天气潮湿闷热，患者入院时仍穿着沾有泥点的登山靴。",
    "reference_rule": {
      "condition": "心包炎或关节炎患者",
      "action": "1. 不需抗真菌处理; 2. 需用抗炎药治疗",
      "contraindication": "null",
      "evidence": "心包炎或关节炎患者通常不需抗真菌处理，但需用抗炎药治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规急诊诊疗场景，患者因低热、胸痛及关节肿痛急诊就诊。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除脓毒症、结核病或心肌梗死等危急重症，并优先处理可快速缓解症状的核心问题——心包炎与关节炎。Step 2: 临床解码 (Clinical Decoding): 核心线索包括：①洞穴暴露史（肯塔基州为组织胞浆菌病流行区）但无肺部空洞/实变，且阿莫西林无效，降低细菌/真菌感染概率；②胸骨后痛+心包摩擦音+ST段弓背向下抬高+少量心包积液=急性心包炎；③游走性关节肿痛+晨僵<30分钟+CRP/ESR升高=急性炎症性关节炎（反应性关节炎可能性大）；④RF/抗CCP阴性暂不支持类风湿关节炎；⑤患者穿污染登山靴提示持续暴露风险。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南 Condition '心包炎或关节炎患者' 与本例完全匹配（患者同时存在心包炎和关节炎）；Contraindication 为 null，无禁忌；Action 强制要求 '不需抗真菌处理，需用抗炎药治疗'，与患者要求'抗真菌药'冲突，需明确拒绝。Step 4: 决策生成 (Decision Making): 依据指南，决策核心为：①立即启动抗炎治疗；②排除其他炎症病因（如结缔组织病）；③避免抗真菌药物；④切断潜在暴露源（污染衣物）。",
    "medical_order": "1. 诊断：急性心包炎，急性炎症性关节炎（反应性关节炎待排）。2. 治疗：①卧床休息，予一级护理，监测生命体征及心包填塞征象；②布洛芬 600mg 口服 q8h（餐后）；③秋水仙碱 0.5mg 口服 qd；④双膝冰敷 q6h。3. 完善检查：抗核抗体（ANA）、抗双链DNA抗体、HLA-B27、血清组织胞浆菌抗原检测。4. 禁用抗真菌药物。5. 患者更换清洁衣物及鞋袜，污染物品密封消毒。",
    "patient_dialogue": "王先生，您这趟洞穴工作真是辛苦了！您提到的低烧、胸口疼和膝盖肿，我们仔细看了检查结果——现在最要紧的是两个问题：一是心脏外面那层'外套'发炎了（叫心包炎），二是关节有些红肿。别担心，这都不是真菌捣的鬼，您吃的抗生素没效果也说明这点。咱们得抓紧做三件事：第一，我给您开两种药，一个是止疼消肿的（像'消防员'灭关节的火），另一个专门保护心脏（防止心包炎加重）。第二，您这双沾泥的靴子得赶紧换了，洞穴里的灰尘万一带病菌，可能让身体一直'打架'发炎。第三，再抽两管血查查发炎的原因，结果出来前您先别乱吃药。记住啊，胸口一闷或喘不上气就马上按铃喊护士！"
  },
  {
    "id": 1309,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "主诉：干咳伴低热6周，加重并出现活动后气短3天。现病史：患者6周前出现刺激性干咳，体温37.6–38.2℃，夜间盗汗明显，自服阿莫西林1周无改善。3天前爬2层楼梯即感气短，无胸痛、咯血。既往体健，无慢阻肺、结核史。个人史：每日吸烟10支×20年；职业为林场巡护，近3个月多次参与清理旧禽舍与蝙蝠栖木，未佩戴防护口罩。体格检查：T 37.8℃，SpO₂ 92%（室内空气），双肺散在吸气末细湿啰音，余无异常。实验室：WBC 7.8×10⁹/L，LY 28%，ESR 56 mm/h，CRP 38 mg/L；HIV抗原/抗体(-)。胸片：双上肺弥漫性小结节影伴右肺门淋巴结肿大。今日门诊，患者询问：'医生，我这是肺结核吗？要不要先做那个皮肤试验？'",
    "reference_rule": {
      "condition": "一般诊断情境",
      "action": "不进行皮试",
      "contraindication": "皮试可能促使受试者产生血清反应，导致假阳性结果",
      "evidence": "皮试通常对诊断帮助不大，故不常用。当采用组织胞浆菌素做皮试时，会促使受试者产生血清反应，导致假阳性结果;"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景，我作为果断的急诊/门诊医生，需快速建立鉴别诊断（Differential Diagnosis），重点关注排除危急重症（如急性呼吸衰竭或感染性休克），并给出直接、高效的诊疗指令。Step 2: 临床解码 (Clinical Decoding): 患者主诉干咳伴低热6周、活动后气短3天，结合现病史（阿莫西林无效、夜间盗汗）、个人史（20年吸烟史、高危职业暴露于禽舍和蝙蝠栖木未防护）和检查结果（低氧SpO₂ 92%、双肺湿啰音、炎症标志物ESR/CRP升高、胸片示双上肺弥漫性小结节伴淋巴结肿大），隐式线索指向感染性或肉芽肿性疾病。关键医学术语：鉴别诊断包括肺结核、组织胞浆菌病（职业暴露高度提示）、结节病或肺癌（吸烟史）；需优先排除活动性感染。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition为'一般诊断情境'，与当前常规诊断场景匹配。强制检查Contraindication：'皮试可能促使受试者产生血清反应，导致假阳性结果'，在本案中尤其相关（组织胞浆菌素皮试可能干扰血清学诊断），必须遵守禁忌。Step 4: 决策生成 (Decision Making): 根据指南Action '不进行皮试'，决策为避免皮试，并立即启动进一步检查（如影像学和微生物学评估），以快速明确病因并排除危急情况。",
    "medical_order": "完善胸部高分辨率CT扫描；安排痰涂片（抗酸染色）及痰培养（包括细菌、真菌和抗酸杆菌）；检测血清学（组织胞浆菌抗体和结核相关检查）；监测生命体征（包括SpO₂和体温）；暂不进行皮试；建议戒烟咨询；如症状加重，立即转急诊。",
    "patient_dialogue": "别担心，我们来一步步搞清楚。您的情况确实需要重视，但先别急着下结论是肺结核。那个皮肤试验（皮试）我们不建议做，因为它可能会给出错误的结果，反倒耽误诊断——就好比做实验时加了不该加的料，搞得结果不准了。现在最重要的是做更可靠的检查，比如拍个更详细的CT片子，还有化验痰液和血样，看看是不是感染了真菌或其他东西，特别是考虑到您的工作环境。您最近气短得厉害，咱们得抓紧时间，避免拖成更严重的问题。同时，我强烈建议您戒烟，这能大大帮助恢复。如果感觉更不舒服，比如呼吸更困难，马上来医院。咱们一起努力，好吗？"
  },
  {
    "id": 1315,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者42岁，园艺师，半月前因‘反复午后低热、盗汗伴体重下降4kg’首诊。当时体温37.8℃，SpO₂ 96%，胸CT示双肺弥漫性微小结节，部分呈‘暴风雪’样改变；血清组织胞浆菌抗原EIA 6.8 ng/mL（阳性≥0.7），血培养3周回报阴性。患者无免疫抑制药物史，CD4 810/μL。今日复诊：体温已正常1周，仍感易疲劳，体重回升1kg，无咳嗽、胸痛。查体：口腔黏膜未见白斑，肝脾未及，皮肤无结节。实验室：WBC 7.2×10⁹/L，Hb 128g/L，ALT 28U/L，Cr 0.9mg/dL。患者询问：‘我能不能先不吃那么久的药？工作忙，经常出差。’诊室空调突然故障，护士临时开窗，患者抱怨‘今天真闷热’。",
    "reference_rule": {
      "condition": "播散性感染病情较轻者",
      "action": "使用氟康唑或伊曲康唑治疗，连续口服6~12个月",
      "contraindication": "null",
      "evidence": "病情较轻者可使用氟康唑或伊曲康唑治疗，连续口服6~12个月。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（排除其他危急重症如结核或恶性肿瘤），并基于现有证据给出直接、高效的治疗指令。Step 2: 临床解码 (Clinical Decoding) - 患者病史和检查显示播散性组织胞浆菌病（血清组织胞浆菌抗原EIA阳性6.8 ng/mL，胸CT暴风雪样改变），属真菌感染；复诊症状改善（体温正常1周、体重回升），无新发症状或体征，实验室指标均在正常范围，提示病情较轻但需持续治疗。隐式线索：患者工作性质（园艺师）可能增加环境暴露风险，且主诉工作繁忙和出差，暗示依从性挑战。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 当前情况完美匹配指南条件“播散性感染病情较轻者”，无禁忌症（CD4正常、无免疫抑制史、无药物相互作用或肝肾功能异常）；强制检查未发现禁忌（contraindication null），安全无虞。Step 4: 决策生成 (Decision Making) - 根据指南action，优先选用伊曲康唑（因氟康唑潜在耐药风险更高），坚持6-12个月疗程以预防复发；同时需监测肝功能和依从性，以应对患者诉求。",
    "medical_order": "1. 继续抗真菌治疗：予伊曲康唑 200mg 口服，每日一次，疗程6-12个月。2. 监测与随访：每3个月复查肝肾功能（ALT、Cr）、血清组织胞浆菌抗原及胸CT；每月门诊评估症状和体重变化。3. 健康教育：强调治疗依从性，避免土壤暴露（园艺工作时佩戴口罩）。",
    "patient_dialogue": "张先生，我理解您工作忙还经常出差，吃药这么久确实不太方便。但您这个情况是肺部真菌感染，虽然现在烧退了、体重也在回升，这药得坚持吃至少半年到一年，才能彻底清除病菌，防止它复发或变得更严重。就像除草一样，不连根拔掉，它很容易再长回来。我会开一种叫伊曲康唑的药，每天吃一次就行，出差时带上也方便。另外，咱们每三个月要做个小检查，看看肝和肾的情况，确保安全。园艺工作时，尽量戴个口罩，减少接触土壤里的真菌。坚持下来，您的疲劳感会慢慢好转的——咱们一起努力，好吗？"
  },
  {
    "id": 1313,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者近4周体重下降8 kg，每日午后发热38.5–39.3 °C，伴盗汗及上腹隐痛。外院曾予头孢曲松＋阿奇霉素5 d无改善。查体：BP 86/58 mmHg，HR 112 次/min，皮肤黏膜色素沉着加重，腋下可见散在暗红色丘疹。实验室：Hb 8.9 g/dL，Na⁺ 129 mmol/L，K⁺ 5.2 mmol/L，ALT 62 U/L，TBil 24 μmol/L；血培养已抽3套，尚未报阳；真菌(1→3)-β-D葡聚糖 298 pg/mL。胸部CT示双肺弥漫微小结节，肾上腺区增粗并低密度影，边缘模糊。患者自述近2周站立时头晕明显，今日晨起出现恶心、呕吐胃内容物2次，无咖啡样物。目前静脉补液后血压仍≤90 mmHg，需小剂量去甲肾上腺素维持。既往：确诊AIDS 3年，未规律抗病毒；10个月前隐球菌脑膜炎病史，已痊愈。无结核接触史，不吸烟，职业为长途货车司机，近期无外出至河谷洞穴。今日值班住院医拟评估感染灶，患者追问“为什么一站起来就眼前发黑，血压总升不上去？”",
    "reference_rule": {
      "condition": "播散性感染患者",
      "action": "进行肾上腺功能评价",
      "contraindication": "null",
      "evidence": "在各种类型的播散性感染中均可见肾上腺功能不全，因而在临床上对所有患者应进行肾上腺功能评价。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，患者存在AIDS相关免疫抑制、播散性感染表现及肾上腺功能不全风险。作为博学的专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保安全（如避免治疗恶化低血压或电解质紊乱），再考虑疗效（如控制感染）。Step 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：体重下降、午后发热、盗汗提示慢性播散性感染（如结核或真菌复发）；低血压（BP ≤90 mmHg）、体位性头晕、低钠（129 mmol/L）和高钾（5.2 mmol/L）结合肾上腺CT异常（增粗低密度影）强烈暗示肾上腺功能不全；既往AIDS未治疗和真菌葡聚糖升高（298 pg/mL）表明免疫抑制下机会性感染高风险；血培养未阳和抗生素无效指向非细菌性病因。隐式线索包括皮肤色素沉着和丘疹（可能Addison病相关）、呕吐和需去甲肾上腺素维持（提示肾上腺危象），需紧急干预。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition '播散性感染患者' 完美匹配病例（发热、肺结节、既往感染史）。contraindication为'null'，无绝对禁忌；但安全扫描显示共病风险：去甲肾上腺素使用中，肾上腺功能测试（如ACTH刺激）需警惕血压波动；药物相互作用风险（如未来抗真菌药与ART）；电解质紊乱加重休克风险。优先级：安全第一，稳定生命体征后再行测试。Step 4: 决策生成 (Decision Making) - 基于指南action '进行肾上腺功能评价'，生成决策：立即启动肾上腺功能测试（皮质醇和ACTH水平），同时处理共病（如抗感染和支持治疗），确保安全监测。",
    "medical_order": "予一级护理，持续监测生命体征（BP、HR、SpO₂）。完善肾上腺功能评价：抽血查晨间皮质醇、ACTH水平，必要时行ACTH刺激试验。继续小剂量去甲肾上腺素静脉维持血压目标≥90/60 mmHg。纠正电解质紊乱：静脉补钠（0.9% NaCl）目标Na⁺ >135 mmol/L，监测K⁺，如高钾持续予葡萄糖酸钙10 mL静脉推注。评估播散性感染：启动经验性抗真菌治疗（氟康唑静脉输注，首剂800 mg，维持400 mg/d），完善结核筛查（PPD试验、痰/血Xpert MTB/RIF）。启动HIV抗病毒治疗（ART），方案：替诺福韦/恩曲他滨/多替拉韦每日一次。禁食，予静脉补液（生理盐水500 mL q8h），必要时止吐（昂丹司琼8 mg静脉推注）。",
    "patient_dialogue": "王先生，您现在感觉怎么样？别担心，我慢慢跟您解释。您站起来头晕、血压上不去，主要是因为身体里有个叫肾上腺的器官出了问题——它就像身体的‘压力调节器’，现在可能因为感染发炎了，导致血压不稳和头晕。我们必须马上做个血液检查，看看它的功能是否正常，这样才能对症下药。同时，您有发烧和体重下降，我们怀疑是过去脑膜炎的感染又活跃了，得用抗真菌药控制。我会给您继续输药稳住血压，再补点盐水调电解质。记住，现在先别吃东西，以免呕吐加重。别慌，我们一步步来，重点是把您的基础稳住了再治感染。有什么不舒服随时告诉我！"
  },
  {
    "id": 1310,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者近10个月反复低热（37.5–38.2℃）、盗汗伴体重下降8kg，干咳为主，偶有少量白色黏痰，无血。曾在当地诊所按“慢性支气管炎”口服多轮抗生素（阿莫西林–克拉维酸、左氧氟沙星）无效。既往无结核、无糖尿病、无HIV。吸烟史30包年，仍吸1包/天。职业史：近3年参与旧谷仓与禽舍拆除，现场尘土飞扬，未佩戴防护口罩。查体：消瘦，BMI 19kg/m²，呼吸音粗糙，右肺基底部可闻及散在细湿啰音，余无异常。今日门诊外院胸片提示双上肺纤维结节影伴右侧肺门淋巴结钙化；本院急诊查血常规WBC 7.8×10⁹/L，Eos 3%，CRP 38mg/L，ESR 65mm/h。患者自述“咳得胸口疼”，并抱怨近期雨天左膝关节隐痛，但无红肿。目前尚未进行痰检、血清学或抗原检测。",
    "reference_rule": {
      "condition": "慢性肺组织胞浆菌病患者",
      "action": "1. 反复进行痰培养（连续收集12份以上标本）; 2. 检测补体结合抗体水平（≥1:32强烈支持诊断）; 3. 尿中检测抗原",
      "contraindication": "null",
      "evidence": "对慢性肺组织胞浆菌病患者，应反复进行痰培养(连续收集12份以上标本)，约75%的患者可以确诊。补体结合抗体水平升高(≥1:32)也强烈支持诊断，但有些患者抗体滴度较低。约20%以上的慢性肺组织胞浆菌病患者尿中可检测出抗原。"
    },
    "thought": "本案例属于常规诊断与治疗场景，作为急诊/门诊医生，重点关注快速建立鉴别诊断（排除危急重症如结核病或肺癌），并基于患者暴露史和症状直接指向真菌感染。临床解码：患者表现为慢性低热、盗汗、体重下降8kg（提示慢性感染或炎症），干咳伴抗生素无效（非细菌性感染），职业暴露于旧谷仓和禽舍尘土（隐式线索：高风险真菌感染如组织胞浆菌病）；胸片显示双上肺纤维结节影伴淋巴结钙化（典型于组织胞浆菌病），CRP和ESR升高（炎症标志）；吸烟史增加肺癌风险，但钙化结节支持良性过程；关节痛可能为系统性反应。规则对齐与安全：匹配指南条件'慢性肺组织胞浆菌病患者'，Contraindication为null，无禁忌；安全方面，排除急性重症（如无呼吸困难或血氧下降）。决策生成：根据指南Action，直接安排痰培养、抗体检测和尿抗原检测以确诊。",
    "medical_order": "1. 安排反复痰培养：连续收集12份以上痰标本进行真菌培养（包括组织胞浆菌）。2. 检测血清补体结合抗体水平：评估滴度（≥1:32支持诊断）。3. 尿液检测组织胞浆菌抗原。4. 完善结核病筛查：如干扰素释放试验（IGRA）。5. 建议胸部CT扫描进一步评估肺结节。6. 戒烟宣教及随访：预约1周后复诊评估结果。7. 监测生命体征：包括体温和体重。",
    "patient_dialogue": "您好，根据您描述的症状——长期低烧、夜间出汗、咳嗽和体重下降，还有您工作环境里那些尘土飞扬的旧谷仓，这可能是由一种叫组织胞浆菌的真菌感染引起的。它不是细菌，所以之前的抗生素没效果，别担心，我们接下来会做几个简单检测来搞清楚。首先，我们需要您连续几天咳痰出来，我们多收集几次样本去检查真菌；第二，抽点血查抗体，就像看身体有没有抵抗这种感染；第三，验个尿帮助诊断。同时，我会建议做个结核病筛查以防万一。您吸烟挺久的，这对肺不好，容易让咳嗽加重，我强烈建议您戒烟——咱们可以一起制定个计划。这些检测结果出来大约要一周，到时我们再见面讨论治疗方案。您别太焦虑，这病通常能治好，关键是现在确诊了就好处理。"
  },
  {
    "id": 1308,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者 42 岁，男性，拆楼工，近 10 日持续高热（最高 39.8 ℃）、干咳伴进行性呼吸困难，夜间盗汗明显。无基础慢病史，不吸烟。3 周前在俄亥俄河谷某废弃禽舍拆除时未佩戴呼吸防护，现场尘土飞扬。查体：T 39.4 ℃，SpO₂ 92%（室内空气），右下肺听诊细湿啰音。急诊胸 CT 示双肺多发结节伴空洞样变、纵隔淋巴结肿大；外周血 WBC 11.2×10⁹/L，CRP 142 mg/L，肝肾功能正常。今日凌晨咯血丝痰 1 次，量约 5 ml。患者主诉‘胸口像压了石头’，并担心工期延误。目前尚未开始抗真菌治疗，亦无激素用药史。",
    "reference_rule": {
      "condition": "严重的原发性肺部感染者",
      "action": "1. 短时采用两性霉素B治疗，总剂量500~1000mg; 2. 有时可同时使用皮质类固醇",
      "contraindication": "null",
      "evidence": "严重的原发性肺部感染者可短时采用两性霉素B治疗(总剂量为500~1000mg)，有时可同时使用皮质类固醇。"
    },
    "thought": "本案例属于常规诊断与治疗场景，具体是急诊诊疗环境。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断、排除危急重症（如脓毒症、结核或肺栓塞），并基于直接证据给出治疗指令。临床解码：患者有高风险职业暴露（俄亥俄河谷废弃禽舍拆除，提示组织胞浆菌病可能），症状包括持续高热、干咳、进行性呼吸困难、盗汗和咯血丝痰，查体显示发热、低氧（SpO₂ 92%）、右肺湿啰音，影像学见双肺多发结节伴空洞及纵隔淋巴结肿大，实验室示炎症指标升高（WBC和CRP）。这符合严重的原发性肺部感染，需优先排除其他感染（如结核）。规则对齐与安全检查：指南条件'严重的原发性肺部感染者'完全匹配；禁忌症为null，患者无激素用药史、肝肾功能正常，无药物过敏报告，但需监测两性霉素B的肾毒性风险。决策生成：根据指南Action，立即启动两性霉素B治疗（总剂量500-1000mg），并加用皮质类固醇以控制炎症反应（因呼吸困难显著），同时安排辅助支持以稳定病情。",
    "medical_order": "予一级护理，持续监测生命体征及SpO₂。立即启动抗真菌治疗：两性霉素B静脉滴注，起始剂量0.25 mg/kg，每日递增至目标总剂量500-1000mg。加用皮质类固醇：地塞米松4mg IV q6h，短期使用3-5天。氧疗维持SpO₂ >95%。完善痰培养、血培养、组织胞浆菌抗原检测及结核菌素试验。监测肾功能、电解质每日。",
    "patient_dialogue": "张先生，您好。根据您的症状和检查结果，我们高度怀疑是工作中吸入的粉尘导致了一种真菌感染，这会让您发高烧、咳嗽和呼吸费力。我们需要立即行动：我们会给您一种强效的抗真菌药物，通过输液进入身体，专门对付这种感染；同时，加一点激素药来减轻您胸口的压迫感和炎症，让您呼吸更顺畅。还会给您吸氧，帮助您感觉不那么憋闷。我知道您担心工作进度，但现在最要紧的是把身体治好——如果不及时处理，感染可能加重，影响您恢复工作。别担心，我们会全程监测，确保治疗安全有效。"
  },
  {
    "id": 1343,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "主诉：干咳伴渐进性气促3月，加重2周。现病史：患者3月前出现晨起刺激性干咳，初无痰，后偶伴白色黏液，伴活动后气短，登2层楼即需停下休息。无发热、盗汗，体重下降4 kg。外院曾按‘慢性支气管炎’予左氧氟沙星2周无效。2周前因连续夜班伐木后气促明显加重，伴胸骨后闷痛，无咯血。既往史：高血压5年，口服氨氯地平控制可；30包年吸烟史，已戒烟6年。体格检查：BP 128/76 mmHg，HR 88次/分，SpO₂ 92%（室内空气），体型偏瘦，口唇无发绀；右肺上野闻及散在细湿啰音，余肺呼吸音清；肝脾肋下未触及，无杵状指。实验室检查：血常规WBC 7.8×10⁹/L，Eos 3%；肝肾功能正常；HIV抗体阴性。胸部CT（高分辨）：右肺上叶尖后段团块状致密影，边界不规则，最大径3.7 cm，内见层状钙化及低密度坏死区，周围伴卫星小结节；纵隔7R、4R组淋巴结肿大，部分伴蛋壳样钙化；双肺散在2–5 mm小结节，以中下野为主。今日门诊复查，患者仍咳嗽剧烈，夜间需坐起，痰涂片找抗酸杆菌阴性，Gene-Xpert MTB亦阴性；血清β-D-葡聚糖 158 pg/mL（↑），隐球菌抗原阴性。患者自述曾在旧谷仓清理霉木时未戴口罩，作业现场尘土飞扬。今日天阴，候诊时他不断轻咳，右手握有已捏皱的止咳糖浆瓶，神情焦虑地询问：‘医生，我这咳嗽怎么越来越重，是不是长东西了？’",
    "reference_rule": {
      "condition": "慢性肺组织胞浆菌病患者",
      "action": "1. 使用两性霉素B，在数周内使药物总量达到35mg/kg; 2. 或使用伊曲康唑200mg，2次/d，持续6~12个月",
      "contraindication": "null",
      "evidence": "慢性肺组织胞浆菌病的标准治疗是使用两性霉素B，在数周内使药物总量达到35mg/kg。也有采用伊曲康唑200mg，2次/d，持续6~12个月成功治疗慢性肺组织胞浆菌病的报告。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于常规门诊诊疗场景。作为急诊/门诊医生，需快速建立鉴别诊断（重点排除肺癌、结核等危重疾病），基于证据链直接决策治疗方案",
      "Step 2: 临床解码": {
        "核心线索": [
          "进行性干咳+气促+体重下降（3月）",
          "特异性影像：右肺团块伴层状钙化+蛋壳样钙化淋巴结（组织胞浆菌病典型表现）",
          "霉菌暴露史（旧谷仓霉木作业未防护）",
          "血清β-D-葡聚糖↑（158 pg/mL）",
          "结核检测双阴性排除TB",
          "血嗜酸细胞正常排除过敏性肺炎"
        ],
        "高危征象": [
          "SpO₂ 92%（提示低氧血症需干预）",
          "夜间端坐呼吸（心功能代偿不足）",
          "进行性消瘦（消耗性疾病特征）"
        ]
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "符合'慢性肺组织胞浆菌病'诊断标准（暴露史+影像特征+血清标志物）",
        "禁忌核查": "无两性霉素B/伊曲康唑禁忌（肝肾功能正常，无心脏病史）",
        "安全预警": "需监测伊曲康唑与氨氯地平的相互作用（可能增强降压效果）"
      },
      "Step 4: 决策生成": "首选伊曲康唑方案（口服便利性＞静脉两性霉素B），同步安排氧疗及诊断性检查"
    },
    "medical_order": "1. 诊断：慢性肺组织胞浆菌病（疑似） 2. 治疗：伊曲康唑口服液200mg bid（首剂加倍），疗程12个月 3. 氧疗：持续低流量吸氧（2L/min），维持SpO₂≥95% 4. 完善检查：急诊支气管镜肺泡灌洗（BALF送组织胞浆菌PCR/培养），血清GM试验 5. 监测：每周肝肾功能+血压监测（警惕药物相互作用），每月HRCT评估病灶 6. 宣教：严格避免霉尘环境暴露，戒烟巩固",
    "patient_dialogue": "王师傅，您这咳嗽气喘的原因基本明确了——是当年清理谷仓时吸入的霉菌在作怪，不是肿瘤（轻拍肩）。咱们需要坚持喝一种'杀霉菌药'，每天早晚各一次，得喝满一年才能彻底清除病菌（展示药盒）。现在血氧有点低，回家要用这个吸氧机（示范面罩），让呼吸轻松些。另外得做个支气管镜的小检查，取点肺部黏液化验确认病菌类型。记住三点：第一，绝对别再接触发霉木头；第二，每周来测血压查肝功能；第三，吸氧时家里禁止抽烟。这病能治好，但就像砍树得除根，您得配合我打持久战啊！"
  },
  {
    "id": 1311,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者48岁，男性，确诊HIV 8年，CD4 82/μL，近10天出现进行性干咳、低热（最高37.8℃）及活动后气促。无胸痛、咯血。查体：T 37.6℃，SpO₂ 92%（室内空气），双肺听诊散在细小爆裂音，余无异常。胸CT示双肺弥漫性磨玻璃影伴小结节，呈‘月晕征’。急诊已送检血培养、痰革兰染色、1-3-β-D葡聚糖及HIV病毒载量，结果未归。患者自诉在印第安纳州南部洞穴探险导游工作，2个月前曾连续两周每日进入蝙蝠密集洞穴，未佩戴呼吸防护。既往除HIV外无慢性病史，未吸烟。今日实验室回报：血清乳酸脱氢酶 640 IU/L（参考范围 120–250）。患者目前最担心‘是不是卡氏肺囊虫肺炎又要住院’，因其两年前因此病ICU插管1周。",
    "reference_rule": {
      "condition": "与卡氏肺囊虫病鉴别诊断",
      "action": "检测血清乳酸脱氢酶，若大于600IU/L提示组织胞浆菌病",
      "contraindication": "null",
      "evidence": "在与卡氏肺囊虫病的鉴别诊断中，有学者认为，可将乳酸脱氢酶作为组织胞浆菌病的实验室诊断指标，若血清乳酸脱氢酶大于600IU/L以上时多提示为组织胞浆菌病，而不是卡氏肺囊虫病。"
    },
    "thought": "Step 1: 场景定义：本案例属于常规诊断与治疗场景，关注重点是快速建立鉴别诊断（如排除危及生命的卡氏肺囊虫肺炎或组织胞浆菌病），并给出直接、果断的诊疗指令，优先处理潜在危急重症。Step 2: 临床解码：患者为48岁男性，HIV感染伴严重免疫抑制（CD4 82/μL），出现进展性呼吸道症状（干咳、低热、活动后气促），提示间质性肺炎；查体示轻度低氧血症（SpO2 92%）和双肺爆裂音；影像学显示双肺弥漫性磨玻璃影伴‘月晕征’，符合真菌感染特征；暴露史（蝙蝠洞穴探险，未防护）强烈提示地方性真菌病如组织胞浆菌病；血清乳酸脱氢酶（LDH）640 IU/L显著升高，是重要实验室线索；患者有PCP病史，焦虑复发风险。Step 3: 规则对齐与安全检查：指南针对‘与卡氏肺囊虫病鉴别诊断’，明确LDH >600 IU/L提示组织胞浆菌病而非PCP，本病例LDH 640 IU/L符合该标准；指南无禁忌症（contraindication为null），可安全应用此规则。Step 4: 决策生成：鉴于LDH水平、暴露史和影像学特征，组织胞浆菌病可能性高，优先启动经验性抗真菌治疗，同时监测排除PCP等其他感染，并等待未归检测结果。",
    "medical_order": "1. 予一级护理，监测生命体征（T、HR、RR、BP）及氧饱和度（SpO2），必要时予低流量氧疗。2. 经验性予两性霉素B脂质体静脉注射，起始剂量3-5mg/kg/日，监测肾功能和电解质。3. 完善组织胞浆菌血清抗原检测及尿抗原检测。4. 继续追踪血培养、痰革兰染色、1-3-β-D葡聚糖及HIV病毒载量结果。5. 监测血清乳酸脱氢酶（LDH）水平动态变化。6. 评估是否需要支气管肺泡灌洗（BAL）以获取微生物学标本。",
    "patient_dialogue": "先生，我完全理解您担心肺囊虫肺炎复发——毕竟您上次经历太艰难了。但这次情况不同：从您的检查结果和工作经历来看，更像是组织胞浆菌感染，这和您在蝙蝠洞穴里没戴口罩有关。这种感染比肺囊虫肺炎更容易控制。我们会立刻开始给您用抗真菌药物，通过输液来治疗，同时密切监测您的呼吸和血液指标。这能帮助您更快恢复，避免再进ICU。治疗期间，我们会等几个检查结果出来确认诊断，您别太紧张，我们团队会全程陪着您。"
  },
  {
    "id": 1307,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者近3周出现低热（37.8–38.4 °C）、干咳及活动后气短，夜间盗汗明显；村诊所按‘支气管炎’给予头孢口服1周无改善。既往体健，务农为生，常在鸡舍清理粪便。查体：消瘦，右下肺可闻及细湿啰音；SpO₂ 94%（未吸氧）。门诊胸片示右下肺斑片浸润伴肺门淋巴结肿大；血常规WBC 6.8×10⁹/L，嗜酸粒细胞7%。今日行纤维支气管镜活检，病理科电话回报：‘HE切片见大量组织细胞，胞质内可疑卵圆形小体，请结合临床排除真菌’。患者目前仍在留观室，家属询问‘到底什么病？多久能确诊？’窗外正逢梅雨季，空气湿热。",
    "reference_rule": {
      "condition": "病理切片检测",
      "action": "使用PCR检测组织胞浆菌",
      "contraindication": "null",
      "evidence": "而PCR则有助于对病理切片中组织胞浆菌的检测。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（优先排除危及生命的疾病如急性呼吸衰竭或重症感染），基于现有证据直接给出诊断和处置指令，确保效率与安全。\n\nStep 2: 临床解码 (Clinical Decoding): 患者表现为亚急性呼吸道综合征（关键症状：低热37.8–38.4 °C、干咳、活动后气短、夜间盗汗），结合暴露史（务农、鸡舍清理粪便，提示鸟类粪便接触，增加真菌感染风险）和查体（消瘦、右下肺细湿啰音），影像学（右下肺斑片浸润伴肺门淋巴结肿大）和实验室结果（血常规WBC正常但嗜酸粒细胞7%，轻度升高，可能提示过敏或真菌反应），病理报告（HE切片见组织细胞伴胞质内可疑卵圆形小体，高度可疑真菌感染，如组织胞浆菌）。环境因素（梅雨季湿热）可促进真菌孢子扩散。核心鉴别诊断：组织胞浆菌病（最可能）、结核病、其他真菌感染（如隐球菌）、细菌性肺炎复发；需排除危急重症如脓胸或肿瘤。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南条件为‘病理切片检测’，病例中纤维支气管镜活检已满足此条件（病理报告提示可疑真菌）。指南Action为‘使用PCR检测组织胞浆菌’，且Contraindication为‘null’，表明无禁忌（如无药物过敏或标本质量问题），可安全执行。安全检查：患者SpO₂ 94%稳定、无急性呼吸窘迫、无免疫抑制史，因此PCR检测无额外风险。\n\nStep 4: 决策生成 (Decision Making): 基于指南Action，优先安排组织胞浆菌PCR检测以确诊；同时维持留观状态，监测呼吸功能（SpO₂），并考虑初步支持治疗（如氧疗备用），但避免过早抗真菌治疗以免干扰诊断。确诊后启动针对性治疗（如抗真菌药物）。",
    "medical_order": "予留观监护；监测生命体征（体温、呼吸、SpO₂ q4h）；完善组织胞浆菌PCR检测；复查血常规及炎症指标；保持呼吸道通畅，备低流量吸氧（SpO₂ <92%时启动）。",
    "patient_dialogue": "您家老爷子这个情况，我们从检查结果来看，很可能是一种真菌感染，叫组织胞浆菌病。因为他平时在鸡舍工作，接触了鸟粪，再加上现在梅雨季潮湿，真菌容易传播，导致这些发烧、咳嗽和盗汗的症状。为了确认到底是不是这个病，我们需要做一个专门的检测叫PCR，就是从之前取的肺组织样本中再查一下。这个检测结果大概需要2-3天出来，我们会抓紧时间处理。现在他留在留观室很安全，我们会一直盯着他的呼吸和体温，如果有需要，还会给他吸点氧气。你们别太担心，等结果出来，我们就能定下治疗方案了。"
  },
  {
    "id": 1316,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "42岁男性，HIV感染者（CD4 38/μL），因“持续发热2周、体重骤降4 kg、舌面疼痛”由感染科门诊转入急诊留观。体温38.7 ℃，血压96/58 mmHg，SpO₂ 92%（室内空气）。查体见舌背2 cm×1 cm火山口样溃疡，覆灰白伪膜，轻触即出血；双肺底细湿啰音；肝肋下2指、质韧伴压痛；脾未及。外周血WBC 2.8×10⁹/L，Hb 84 g/L，PLT 67×10⁹/L；ALT 102 U/L，ALP 198 U/L；LDH 478 U/L。胸片示双肺网状结节影，右肺门略大。患者诉平日饲养信鸽，近3月鸽舍霉味明显。今日凌晨出现一次寒颤，无咳血或头痛。陪同的妻子焦急补充：丈夫近一周刷牙时牙龈也渗血，夜间盗汗湿透两件T恤。",
    "reference_rule": {
      "condition": "播散性感染患者",
      "action": "1. 进行外周血涂片查找细胞内寄生物; 2. 血真菌培养; 3. 组织活检; 4. 病原体培养（特别是口腔溃疡拭子培养和骨髓培养）; 5. 尿抗原检测",
      "contraindication": "null",
      "evidence": "在播散性感染时，进行外周血涂片查找细胞内寄生物、血真菌培养、组织活检和病原体培养(特别是口腔溃疡拭子培养和骨髓培养)有助于诊断。尿抗原检测是播散性组织胞浆菌病良好的诊断手段之一。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规急诊诊疗场景（患者由门诊转入急诊留观），作为果断的急诊医生，我的关注重点是快速建立鉴别诊断（包括播散性真菌感染、结核、淋巴瘤等），优先排除危急重症（如脓毒症、呼吸衰竭），并给出直接、高效的诊疗指令。Step 2: 临床解码 (Clinical Decoding): 患者为42岁男性，HIV感染者（CD4 38/μL，提示严重免疫抑制），临床特征包括系统性炎症（持续发热、体重骤降、盗汗）、口腔黏膜损害（舌背火山口样溃疡伴出血）、呼吸系统受累（低氧血症、肺底湿啰音、胸片网状结节影）、肝损害（肝肿大压痛、ALT/ALP升高）、血液学异常（三系减少、LDH升高）。隐式线索：鸽舍霉味暴露史高度提示真菌感染（如组织胞浆菌病），牙龈渗血和肝大暗示播散性病变，低血压和SpO₂下降表明潜在脓毒性休克或ARDS风险。整体符合播散性感染综合征。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition为‘播散性感染患者’，患者临床表现完全匹配该条件。指南Action无禁忌症（Contraindication为null），可安全执行所有建议检查。安全检查：患者低血压（96/58 mmHg）和低氧血症（SpO₂ 92%）属危急状态，需优先稳定生命体征后再行侵入性操作（如骨髓活检），避免加重风险。Step 4: 决策生成 (Decision Making): 基于指南Action，立即启动播散性感染诊断流程：进行外周血涂片、血真菌培养、口腔溃疡拭子培养、骨髓培养和尿抗原检测；同时排除危急重症，给予经验性抗真菌治疗和支持治疗（如给氧、补液）。优先顺序：稳定生命体征 > 诊断检查 > 针对性治疗。",
    "medical_order": "予一级护理，持续监测生命体征（体温、血压、SpO₂、心率）。即刻完善以下检查：1. 外周血涂片查找细胞内寄生物；2. 血真菌培养；3. 口腔溃疡拭子培养；4. 骨髓穿刺培养；5. 尿组织胞浆菌抗原检测。经验性予广谱抗真菌药物（如两性霉素B脂质体）。支持治疗：面罩吸氧维持SpO₂ >95%，静脉输注晶体液纠正低血压。复查血常规、肝肾功能及凝血功能。建议胸部CT进一步评估肺部病变。",
    "patient_dialogue": "您好，我是负责的医生。您丈夫的情况比较紧急，我们需要马上行动。首先，他的免疫系统很弱，加上发烧、呼吸困难和口腔溃疡，这些都指向一个严重的感染——可能是鸽子棚里的霉菌引起的。我们会立刻给他吸氧气，帮助呼吸更顺畅，同时输液来稳住血压，防止情况恶化。接下来，要抽血、取口腔溃疡的样本，还有做尿检，这些是为了快速找到感染的根源。另外，可能还需要做个骨髓检查，虽然有点不舒服，但能帮我们确认问题在哪里。我们会用抗真菌药先治疗，防止感染扩散。整个过程我们会密切盯着，确保他安全。您别太担心，我们团队都在这里全力处理，有任何变化我会马上告诉您。"
  },
  {
    "id": 1322,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者3周前从俄亥俄河谷运货返回，途中出现持续低热、盗汗与干咳，自服退热药可短暂缓解。2天前突发右季肋部锐痛并伴气促，夜间无法平卧。急诊查体：T 38.7 ℃，SpO₂ 92%（未吸氧），右下肺叩诊浊音、呼吸音减弱；腹软，肝于锁中线肋下4 cm触及，轻触痛。实验室：白细胞2.8×10⁹/L，血小板94×10⁹/L，ALT 86 U/L，LDH 412 U/L；HIV抗体阴性。床旁胸片示弥漫性微结节影伴右侧少量胸腔积液；腹部CT见肝脾多发低强化灶，最大径1.8 cm。血培养已送，1小时前患者出现发作性寒战，体温升至39.4 ℃。患者自述既往体健，无慢病史，但近半年体重下降6 kg，否认结核接触史。今日凌晨急诊室外暴雨，患者入院时鞋底仍带泥。",
    "reference_rule": {
      "condition": "所有播散性感染者",
      "action": "需接受治疗",
      "contraindication": "null",
      "evidence": "播散性感染若不治疗将对患者的生命构成威胁，故此，所有播散性感染者都需接受治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规急诊诊疗场景，患者急性起病，表现为发热、气促和肝大，需快速建立鉴别诊断排除危及生命的播散性感染。作为果断的急诊医生，我的关注重点是识别并优先处理危急重症（如败血症、呼吸衰竭），并基于证据给出直接治疗指令。\n\nStep 2: 临床解码 (Clinical Decoding)：从病例中提取关键信息并转化为医学术语：①患者有俄亥俄河谷暴露史（地方性真菌感染高发区），结合弥漫性微结节影、肝脾多发低强化灶（最大径1.8 cm），提示播散性感染（如组织胞浆菌病）。②急性症状包括持续低热、盗汗、干咳（3周前），近期突发右季肋部锐痛、气促及夜间无法平卧（提示急性呼吸窘迫和胸腔积液影响）；查体示T 38.7 ℃、SpO₂ 92%（低氧血症）、右下肺叩诊浊音和呼吸音减弱（肺实变或积液）、肝大伴触痛（肝损伤）。③实验室异常：白细胞减少（2.8×10⁹/L）、血小板减少（94×10⁹/L）、ALT升高（86 U/L，肝损伤）、LDH升高（412 U/L，细胞损伤），结合HIV阴性排除免疫缺陷；近期体重下降6 kg（慢性消耗）。④隐式线索：鞋底带泥（土壤暴露，强化真菌感染风险），寒战和体温骤升（39.4 ℃）提示败血症进展。整体解码为播散性真菌感染高风险，需紧急干预。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南规定“所有播散性感染者需接受治疗”，患者影像和实验室证据（肝脾病灶、弥漫性结节、血液异常）明确符合播散性感染条件。指南无禁忌（contraindication为null），安全检查确认：无药物过敏史（既往体健）、HIV阴性（无免疫抑制禁忌），但需监测治疗副作用（如肾毒性）。安全优先级：患者低氧血症和败血症为危急状态，治疗必须即刻启动以防生命威胁。\n\nStep 4: 决策生成 (Decision Making)：根据指南Action“需接受治疗”，决策为立即启动抗真菌治疗（首选两性霉素B脂质体以覆盖组织胞浆菌病），同时给予支持治疗稳定生命体征，并完善确诊检查。鉴别诊断需排除结核或细菌感染，但播散性感染优先级最高。",
    "medical_order": "诊断：疑诊播散性组织胞浆菌病（基于俄亥俄河谷暴露、影像学及实验室证据）。予一级护理，密切监测生命体征（每30分钟记录T、P、R、BP、SpO₂）。治疗：立即静脉滴注两性霉素B脂质体 3-5 mg/kg/d，起始剂量按标准计算；同时予氧疗（面罩吸氧，目标SpO₂ ≥95%）、静脉补液维持水电解质平衡。检查：急查血清组织胞浆菌抗原、β-D-葡聚糖检测；复查全血细胞计数、肝肾功能、凝血功能；追踪血培养结果；安排胸部CT增强和超声引导下肝活检（如病情稳定）。禁忌：无已知禁忌，但监测肾功能（肌酐、尿量）及药物不良反应。",
    "patient_dialogue": "王先生，您现在的情况比较紧急，我来简单说明一下。您从俄亥俄州回来后就一直发烧咳嗽，现在又突然胸痛、喘不上气，这很可能是因为感染已经扩散到肺部和肝脏了，就像身体多个地方都在发炎。如果不马上治疗，可能会越来越严重，甚至危及生命。所以，我们现在要立刻给您打一种专门对抗真菌的药（叫两性霉素B），同时吸氧帮您呼吸顺畅些。您还需要做几项检查，比如抽血和拍片，来确认具体是什么病菌。别担心，我们会全程盯着您的血压、呼吸这些指标，确保安全。您有任何不舒服，随时告诉我或护士。"
  },
  {
    "id": 1325,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者为42岁男性，建筑拆除工，近3周出现低热（37.8–38.5 ℃）、盗汗、干咳伴少量白色黏痰，活动后气促明显。自述“以为感冒”在工地旁诊所口服头孢7天无改善。昨日突发右胸钝痛，伴乏力到我院急诊。查体：T 38.2 ℃，HR 104 次/分，RR 22 次/分，SpO₂ 92%（室内空气）。右下肺叩诊稍浊，听诊可及细小湿啰音；余心肺（-）。实验室：WBC 7.8×10⁹/L，LY 18%，Hb 112 g/L，PLT 145×10⁹/L；CRP 62 mg/L，ESR 78 mm/h；肝肾功能正常。HIV抗体阴性。急诊胸片示双肺弥漫性结节样影伴右下肺门增大；CT提示纵隔多发淋巴结肿大（最大2.1 cm），双肺多发小结节并部分呈“银河征”。患者否认饲养禽类，但承认3个月前在肯塔基州一废弃鸡舍拆除作业时未佩戴口罩，现场尘土飞扬。患者吸烟史15包年，已戒烟2年。无慢阻肺、结核及免疫抑制病史。今日上午急诊留观，等待进一步病原学检查。",
    "reference_rule": {
      "condition": "急性播散性肺部感染、慢性肺部感染、纵隔肉芽肿或全身播散性感染患者",
      "action": "1. 选择两性霉素B; 2. 选择唑类抗真菌药",
      "contraindication": "纤维性纵隔炎、支气管结石形成等慢性感染对药物治疗反应差，应选择其他方法",
      "evidence": "对急性播散性肺部感染、慢性肺部感染、纵隔肉芽肿和全身播散性感染患者应予积极药物治疗，可选择两性霉素B和唑类抗真菌药，而纤维性纵隔炎、支气管结石形成等一些慢性感染对药物治疗的反应差，应选择其他治疗方法。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，具体为急诊环境。我的关注重点是快速建立鉴别诊断（例如排除结核、败血症等危急重症），并基于直接证据给出果断的治疗决策。\nStep 2: 临床解码 (Clinical Decoding) - 患者表现为急性播散性肺部感染症状：持续低热、盗汗、干咳、活动后气促（提示呼吸系统受累），突发胸痛和乏力加剧病情。关键隐式线索包括：职业暴露（肯塔基州废弃鸡舍拆除未防护，尘土环境，高度提示组织胞浆菌病）；影像学特征（CT显示'银河征'和纵隔淋巴结肿大，典型组织胞浆菌病表现）；实验室炎症标志物升高（CRP 62 mg/L, ESR 78 mm/h）和淋巴细胞减少（LY 18%）；抗生素无效（口服头孢无改善，排除细菌感染）。综合所有信息，最可能的诊断是急性播散性组织胞浆菌病。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 病例完全匹配指南的'急性播散性肺部感染、慢性肺部感染、纵隔肉芽肿或全身播散性感染患者'条件（基于播散性肺部结节和纵隔淋巴结肉芽肿）。强制检查禁忌症：无纤维性纵隔炎或支气管结石证据（影像学显示急性特征，无慢性并发症描述）；患者肝肾功能正常、HIV阴性，无药物过敏史，无唑类或两性霉素B的禁忌症。安全优先级：无药物相互作用风险（患者无其他用药）。\nStep 4: 决策生成 (Decision Making) - 根据指南Action '选择两性霉素B; 选择唑类抗真菌药'，结合患者中度低氧血症（SpO₂ 92%）但无休克，优先选择唑类抗真菌药（如伊曲康唑）作为初始治疗，因其安全性更高；同时，因病情急性，需紧急启动治疗，无需等待病原学确认。",
    "medical_order": "诊断：疑似急性播散性组织胞浆菌病。予一级护理，持续监测生命体征、SpO₂。启动抗真菌治疗：伊曲康唑200 mg口服，每日两次。完善组织胞浆菌血清学检测、痰真菌培养及支气管肺泡灌洗病原学检查。密切观察呼吸状态，必要时予低流量吸氧（目标SpO₂ >95%）。急诊留观，定期复查血常规、CRP、ESR。",
    "patient_dialogue": "您好，我是您的医生。从您的情况来看，这不像普通感冒——您之前的咳嗽、低烧和胸痛，加上检查结果，让我们怀疑是一种真菌感染，可能和您之前在鸡舍工作时吸入的灰尘有关。这种感染需要专门的药物来治疗，不是普通的抗生素能解决的。今天我们会给您开一种叫伊曲康唑的药片，一天吃两次，帮助对抗这种真菌。同时，您需要先留在医院观察一晚，我们会随时检查您的呼吸和体温，确保您安全。如果感觉呼吸更费力，我们会立刻给您加氧气支持。另外，我们还要做几个简单检查来确认具体是什么病菌，这样能更精准地帮您康复。别担心，这种感染是能治好的，但及时治疗很重要，我会一直在这里关注您的情况。"
  },
  {
    "id": 1321,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者3天前出现39.5℃弛张热、干咳伴进行性呼吸困难，今日急诊。颜面潮红，下唇可见一枚2mm裂口溃疡。右锁骨上可触及1.5cm质韧淋巴结，轻压痛。SpO₂ 89%（面罩5L/min）。血常规：WBC 2.8×10⁹/L，LY 0.9×10⁹/L，PLT 74×10⁹/L；肝酶ALT 186U/L，TBil 42μmol/L。胸CT示双肺弥漫性1-3mm小结节，部分呈“晕征”，脾大。追问病史，患者4周前在俄亥俄州一处废弃鸡舍拆除屋顶，未佩戴呼吸防护，作业时尘土飞扬。患者自述“当时就觉得呛得慌，回家洗了三遍鼻子还是黑水”。否认结核接触、HIV高危。急诊已送血真菌培养，结果未归。患者目前仍高热寒战，呼吸频率32次/分，需要快速决定抗感染策略。",
    "reference_rule": {
      "condition": "急性播散性感染患者",
      "action": "使用两性霉素B作为主要治疗药物",
      "contraindication": "null",
      "evidence": "两性霉素B是主要的治疗药物，特别适用于急性播散性感染。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规急诊诊疗场景，患者表现为急性发热和呼吸衰竭，需要快速决策以排除危及生命的疾病。作为果断的急诊医生，我的关注重点是快速建立鉴别诊断（如播散性感染、脓毒症或急性呼吸窘迫综合征），并立即实施治疗以稳定患者生命体征。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者有39.5℃弛张热、进行性呼吸困难、SpO₂下降至89%（提示急性低氧性呼吸衰竭），血常规三系减少（WBC、LY、PLT均降低，表明骨髓抑制）、肝酶升高（ALT和TBil异常，提示肝功能损害），胸CT显示双肺弥漫性小结节伴“晕征”（典型血行播散感染特征）、脾大（支持播散性疾病）。结合病史：4周前在俄亥俄州废弃鸡舍无防护暴露于尘土（吸入大量鸟粪或真菌孢子，如组织胞浆菌），出现鼻洗黑水症状，高度怀疑急性播散性组织胞浆菌病。其他隐式线索包括右锁骨上淋巴结肿大、唇溃疡（可能为感染相关），否认结核或HIV高危，真菌培养未归。综合以上，临床诊断为急性播散性真菌感染（组织胞浆菌病可能性大），需优先排除结核或隐球菌感染，但当前危急状态要求即刻干预。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为“急性播散性感染患者”，患者表现（发热、呼吸衰竭、播散性肺部病变、脾大）完全匹配。Contraindication为null，但需强制检查：患者无肾功能报告（两性霉素B潜在肾毒性风险），但当前无已知禁忌（如严重肾衰、过敏）。安全优先级：患者生命体征不稳（高热、呼吸频率32次/分），紧急处理优先于详细检查，治疗收益大于风险。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action“使用两性霉素B作为主要治疗药物”，决定立即启动两性霉素B静脉治疗，同时加强支持性措施（如氧疗和监测），以控制播散性感染。并需完善相关检查（如肾功能、电解质）以监测副作用，同时等待真菌培养结果以确认诊断。",
    "medical_order": "1. 立即启动两性霉素B脂质体（5mg/kg/d）静脉滴注，作为主要抗真菌治疗，针对急性播散性感染。\n2. 予一级护理，持续面罩高流量氧疗（调至10L/min），监测SpO₂、呼吸频率、血压、心率q1h；如氧合恶化（SpO₂<90%），考虑无创通气或ICU转入评估。\n3. 完善急诊实验室检查：血电解质、肾功能（BUN、Cr）、凝血功能、血培养及重复真菌血清学（如组织胞浆菌抗原）。\n4. 支持治疗：静脉补液维持水电解质平衡，监测肝功能（ALT、TBil）q12h；如高热持续，予物理降温或对乙酰氨基酚650mg PO prn。\n5. 隔离防护措施，预防传播风险。",
    "patient_dialogue": "先生/女士，我现在要跟您说明一下情况。您在鸡舍工作时吸入了那些灰尘，很可能引发了严重的感染，这让您发烧、呼吸困难，情况很紧急。我们必须马上用药来对抗这个感染——我们会给您打一种强效的抗真菌药，叫两性霉素B，它通过输液进入身体，直接消灭病菌。用药时我们会密切监测您的反应，因为它有时会让您感到不舒服，比如寒战或恶心，但我们有办法处理。同时，您需要吸氧来帮助呼吸，我们会调整氧气量，确保您的血氧稳定。如果情况没好转，我们可能得转去重症监护室。别担心，我们团队会一直守着您，先控制感染，等检查结果出来再调整方案。现在最紧要的是让您稳定下来，好吗？"
  },
  {
    "id": 1320,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者因‘干咳伴低热3周’就诊。无盗汗、咯血，体重下降约2kg。既往体健，吸烟史15年，约10支/日，长期在山谷林区砍伐枯木。查体：T37.8℃，右肺尖呼吸音稍低，无干湿啰音。外院胸片示‘右肺上叶2.8cm孤立结节，边缘毛刺，伴邻近胸膜牵拉’；CT增强后病灶内部可见小空洞，纵隔淋巴结短径≤1cm。血常规：WBC8.9×10⁹/L，嗜酸粒细胞5%；肝肾功能正常。患者今日提到最近两周晨起痰中带少量暗红血丝，并抱怨天气潮湿时咳嗽加重，但否认夜间盗汗及胸痛。患者主诉担心‘是不是肺癌’，神情焦虑，反复询问是否需要立即做PET-CT。",
    "reference_rule": {
      "condition": "局限性肺上叶病变患者",
      "action": "必要时可考虑手术切除",
      "contraindication": "基础性慢性阻塞性肺病不适合手术",
      "evidence": "对局限性肺上叶病变，必要时可考虑手术切除，但许多患者因有基础性慢性阻塞性肺病而不适合手术。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规门诊诊疗场景，关注重点是快速建立鉴别诊断（Differential Diagnosis），排除危急重症（如活动性出血或急性感染），并给出最直接的诊断和治疗指令。作为果断的急诊/门诊医生，我将优先识别潜在恶性病变，同时考虑患者焦虑情绪，确保决策高效且安全。\n\nStep 2: 临床解码 (Clinical Decoding) - 从患者病例中提取关键信息：①症状学：干咳伴低热3周、体重下降2kg、近期痰中带血丝（提示hemoptysis），潮湿天气加重咳嗽（可能关联环境暴露）；②病史：长期吸烟史（15年，10支/日）为肺癌风险因素，职业暴露于山谷林区（增加真菌感染如组织胞浆菌病风险）；③查体与影像：T37.8℃（低热），右肺尖呼吸音降低，胸片和CT显示右肺上叶2.8cm孤立结节伴边缘毛刺、胸膜牵拉及小空洞（恶性特征如肺癌可疑），纵隔淋巴结≤1cm（无转移迹象）；④实验室：嗜酸粒细胞5%（轻度升高，可能提示过敏或感染），余正常。据此，鉴别诊断包括：首要排除肺癌（高风险因子），次选感染（如结核或真菌），其他如肉芽肿性疾病；需排除危急重症（如大咯血或脓毒症），但当前无急症迹象。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为‘局限性肺上叶病变患者’，患者病灶符合此描述（右肺上叶孤立结节），故对齐。指南Action为‘必要时可考虑手术切除’，但Contraindication为‘基础性慢性阻塞性肺病不适合手术’；强制检查后，患者既往体健、无COPD症状（如无慢性咳嗽或呼吸困难），无禁忌症。安全优先级：确保进一步诊断以排除恶性或感染性病变，避免过早手术。\n\nStep 4: 决策生成 (Decision Making) - 基于指南Action和临床评估，决策分步：①立即安排PET-CT以评估结节恶性风险（高优先级，因影像特征和患者焦虑）；②若PET-CT提示恶性，考虑手术切除（指南对齐）；③若良性，转感染科或呼吸科随访；④同时干预风险因素（如戒烟）。决策依据指南，强化安全（先确诊后手术）。",
    "medical_order": "1. 予完善PET-CT检查评估右肺上叶结节恶性风险。2. 若PET-CT提示恶性肿瘤，建议转胸外科评估手术切除可行性。3. 若PET-CT阴性或不确定，行CT引导下穿刺活检明确病理。4. 予戒烟干预宣教。5. 门诊随访，监测症状变化。",
    "patient_dialogue": "王先生，我理解您对这个肺结节很担心，特别是担心肺癌，这是很正常的。首先，您的症状和检查结果确实需要更深入了解——这个结节可能是感染造成的，比如您在树林工作可能接触到真菌，但也可能是其他问题。我们建议做个PET-CT扫描，它能帮我们看清楚这个结节是不是癌变的，就像给肺拍个‘高清照片’。如果结果不好，我们可以讨论手术切除；如果没事，我们再找其他原因。同时，吸烟会加重肺部负担，我强烈建议您从现在开始戒烟，这对您的肺健康非常重要。别太焦虑，我们一起一步步来解决。如果您有任何疑问，随时问我。"
  },
  {
    "id": 1304,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者3天前在废弃鸡舍拆除作业后出现高热（39.4℃）、干咳伴右侧胸痛，咳少量白色黏痰，无血。自服布洛芬可短暂退热，但夜间盗汗明显。既往体健，无慢性病史，吸烟15年、约10支/日。查体：右下肺叩诊浊音，吸气末可闻及细湿啰�；SpO₂ 92%（室空气）。急诊胸片示右下肺斑片浸润伴同侧肺门淋巴结肿大，外周血WBC 9.8×10⁹/L，LY 28%，CRP 67mg/L。患者同时提到‘最近天气返潮，工地灰尘大，喉咙一直痒’，但否认哮喘及过敏史。目前尚未进行任何病原学检测。",
    "reference_rule": {
      "condition": "急性肺组织胞浆菌病患者",
      "action": "1. 在患者的尿中检测抗原（约75%的患者阳性）; 2. 通过免疫扩散法检测补体结合抗体（约95%患者阳性）",
      "contraindication": "null",
      "evidence": "若在患者的尿中检测出抗原(约75%的患者阳性)或通过免疫扩散法检测出补体结合抗体(约95%患者阳性)，则强烈地支持组织胞浆菌病的诊断。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规急诊诊疗场景（Context: 常规诊断与治疗），重点关注快速建立鉴别诊断（Differential Diagnosis），排除危急重症如脓毒症、结核或急性呼吸衰竭，并给出最直接的诊疗指令。患者急性起病，需优先识别潜在致命感染源。\n\nStep 2: 临床解码 (Clinical Decoding)：从病例中提取关键信息并转化为医学术语：患者为成年男性（吸烟15年，推测年龄≥35岁），暴露于废弃鸡舍（组织胞浆菌常见来源）后急性起病，表现为高热（39.4℃）、干咳、右侧胸痛、少量白色黏痰及夜间盗汗（提示感染性发热）；查体示右下肺叩诊浊音和吸气末细湿啰音（表明肺实变或浸润），SpO₂ 92%（室空气）示轻度低氧血症；胸片显示右下肺斑片浸润伴同侧肺门淋巴结肿大（符合真菌或肉芽肿性肺炎）；实验室检查：WBC 9.8×10⁹/L（正常范围，无显著白细胞升高），LY 28%（淋巴细胞比例正常下限），CRP 67mg/L（显著升高，提示急性炎症）。隐式线索：吸烟史（10支/日）增加呼吸道易感性；暴露于潮湿、多尘环境（‘天气返潮，工地灰尘大’）强化了真菌感染风险，但否认过敏史降低了过敏性肺炎可能性。综上，临床特征高度提示急性肺组织胞浆菌病，需与社区获得性肺炎（细菌性或病毒性）鉴别。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南Condition为‘急性肺组织胞浆菌病患者’，与患者暴露史、症状及影像学高度匹配（废弃鸡舍为高危源，胸片淋巴结肿大是典型表现）。Contraindication为null，无禁忌症（患者无慢性病史、无药物过敏，自服布洛芬无不良反应），确保检测安全。\n\nStep 4: 决策生成 (Decision Making)：根据指南Action，生成核心决策为优先执行病原学检测以确诊组织胞浆菌病：1. 检测尿组织胞浆菌抗原（敏感性约75%）；2. 通过免疫扩散法检测血清补体结合抗体（敏感性约95%）。同时，鉴于低氧血症，需支持性监测，排除其他急症。",
    "medical_order": "诊断：急性右下肺炎，疑诊组织胞浆菌病。\n医嘱：1. 完善尿组织胞浆菌抗原检测；2. 完善血清补体结合抗体检测（免疫扩散法）。3. 监测生命体征q4h，包括SpO₂；如SpO₂ <92%，予低流量吸氧（2L/min）。4. 暂予对症支持：布洛芬400mg prn发热（间隔≥6h）。5. 建议住院观察，完善血培养、痰涂片及培养以排除细菌性肺炎。",
    "patient_dialogue": "张先生，您的情况我已经看过了。您在拆鸡舍后突然发烧、咳嗽和胸痛，这些症状很可能是因为吸入了鸡舍里的灰尘，里面可能藏有真菌。我们现在需要做一些检查来确认——一个是检查您的小便，另一个是抽点血，这样能帮我们找到病菌的踪迹，好对症下药。另外，您的血氧有点偏低，我们会给您戴个指夹监测，如果掉到92%以下，可能得给您吸点氧气来帮助呼吸。别担心，我们会全程看着您，确保安全。您先继续吃布洛芬退烧，但别过量，隔6小时以上才能再用一次。对了，您抽烟的习惯得注意了，这会让肺更脆弱，等这阵子过去，咱们好好聊聊怎么戒烟。"
  },
  {
    "id": 1319,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者42岁，男性，体重58 kg，CD4 28 cells/μL。3周前因“持续发热38.5 ℃、盗汗、肝脾肿大、全血细胞减少”入院，骨髓活检见巨噬细胞内卵圆形小体，血清组织胞浆菌抗原>19 ng/mL，确诊播散性组织胞浆菌病。已接受两性霉素B脂质体累计1.2 g，体温趋稳，但昨日晨起再次38.1 ℃，伴轻度气促。实验室回报：Hb 82 g/L，WBC 2.9×10⁹/L，PLT 67×10⁹/L；ALT 62 U/L，肌酐97 μmol/L（基线78）。患者职业为长途货车司机，行程常经密西西比河谷，自述“车内空调坏了一路开窗，灰大”。今由感染科主治医师陪同门诊调整方案，家属询问是否需长期打针。",
    "reference_rule": {
      "condition": "播散性感染患者（不常用方法）",
      "action": "1. 在数周内使两性霉素B的用药剂量达到2g; 2. 然后改为50~80mg，1次/周，终身治疗",
      "contraindication": "需长期静脉注射，可能出现相关并发症",
      "evidence": "另一种不常用的方法是，在数周内使两性霉素B的用药剂量达到2g，然后改为50~80mg，1次/周，终身治疗。该疗法的缺点是需长期静脉注射，并因此可能出现一些相关并发症。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)** 本案例属于复杂合并症治疗场景。作为感染病专科专家，我将重点进行全网扫描，检查两性霉素B与其他潜在因素（如免疫功能低下、肝肾功能异常、职业暴露）的药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。关注点包括药物毒性、新发症状（如气促）的鉴别，以及终身治疗的风险管理。\n\n**Step 2: 临床解码 (Clinical Decoding)** 患者关键临床信息：1. 播散性组织胞浆菌病确诊（血清抗原>19 ng/mL、骨髓活检阳性），CD4严重低下（28 cells/μL）提示免疫缺陷高风险。2. 当前治疗状态：两性霉素B脂质体累计1.2 g，体温反弹至38.1℃伴轻度气促，提示疾病未完全控制或新发并发症（如肺部受累）。3. 实验室异常：全血细胞减少（Hb 82 g/L、WBC 2.9×10⁹/L、PLT 67×10⁹/L）增加感染和出血风险，轻度肝损（ALT 62 U/L）和肾功恶化（肌酐97 μmol/L vs 基线78），可能由两性霉素B肾毒性或原发病加重所致。4. 职业暴露史：长途司机常经密西西比河谷，开窗暴露尘埃，增加组织胞浆菌再感染风险。隐式线索：气促可能表示肺组织胞浆菌病进展或新发机会性感染（如PCP），需排除；家属询问“长期打针”凸显对终身治疗的心理担忧。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)** 指南Condition（播散性感染患者）与病例匹配。Action建议两性霉素B达2g后转50-80mg/周终身治疗。强制检查Contraindication：需长期静脉注射，可能出现并发症。安全风险：患者有肾功恶化（肌酐上升）和ALT升高，两性霉素B可能加重肾毒性或骨髓抑制；全血细胞减少增加注射部位出血或感染风险；气促需评估是否为肺栓塞或新感染。优先级安全：必须强化监测以避免并发症。\n\n**Step 4: 决策生成 (Decision Making)** 基于指南Action，继续两性霉素B脂质体至总剂量2g（剩余0.8g），随后转50-80mg/周终身维持治疗。但为管理风险：1. 强化安全监测（肾功能、血常规）。2. 评估气促原因（完善胸部影像）。3. 教育避免职业暴露。决策核心：维持终身治疗以预防复发，但安全为首要。",
    "medical_order": "1. 继续两性霉素B脂质体静脉注射，目标累计剂量2g（剩余0.8g）。2. 达到2g后，改为两性霉素B脂质体50-80mg静脉注射，每周一次，终身维持。3. 监测：每周复查全血细胞计数、肾功能（肌酐、尿素氮）、肝功能（ALT、AST）；密切观察体温及呼吸症状。4. 完善胸部X线检查评估气促原因。5. 教育患者避免尘埃暴露，建议职业防护（如驾驶时关闭车窗、使用N95口罩）。",
    "patient_dialogue": "张先生，我理解您和家人的担心，特别是关于是否需要长期打针的问题。这个感染比较顽固，就像您之前的发烧和不适，我们得继续用这种药一段时间——先打完剩下的针，让总量达到2克，这大概还需要几周。之后呢，我们会改成每周打一次小剂量的针，这可能是终身的安排。为啥要这样？因为这个病在免疫力低的情况下很容易复发，就像野草没除根会再长出来，长期打针能大大降低风险。不过，我得老实说，长期打针确实有些风险，比如可能伤肾或让您更容易出血，所以我们每星期都会查血和尿，及时调整，确保安全。另外，您提到开车时灰尘大，这很重要！以后尽量关上车窗，或者戴个口罩，减少吸进灰尘的机会，这对预防再感染很关键。现在您感觉有点气短，我们会做个胸片看看原因。别太担心，我们一起努力，您有什么想问的吗？"
  },
  {
    "id": 1327,
    "file_name": "组织胞浆菌病的诊断和治疗.json",
    "case_input": "患者近3周每日傍晚寒战高热至39.6℃，伴盗汗，咳少量白黏痰，无胸痛。体重由68 kg降至57 kg。查体：轻度气促，SpO₂ 92%（室内空气），口咽部可见散在白斑，颈部及腹股沟可触及1.5 cm质韧淋巴结，无压痛，肝右锁骨中线肋下3 cm，质软，脾侧卧可及。实验室：WBC 2.8×10⁹/L，Hb 85 g/L，PLT 78×10⁹/L；LDH 510 U/L（↑），ALT 68 U/L，ALP 190 U/L；HIV-RNA 185 000 copies/mL。胸CT：双肺弥漫性细小结节伴纵隔淋巴结肿大，部分呈“树芽征”，脾内多发低密度灶。血培养已送检，尚未报阳。患者诉曾在地下室清理鸽粪，未戴口罩。今日午后体温再次升至39.8℃，伴乏力明显，护士记录24 h尿量仅600 mL，色深。患者职业为外卖骑手，担心住院费用反复询问“能不能先吃口服药观察”。目前尚未启动任何抗真菌治疗。",
    "reference_rule": {
      "condition": "艾滋病患者播散性感染",
      "action": "1. 采用两性霉素B 0.7mg/(kg·d)静脉滴注（总剂量1000mg）; 2. 停药后加伊曲康唑200mg，2次/d，终身用药",
      "contraindication": "null",
      "evidence": "对艾滋病患者，为了控制组织胞浆菌病的播散性感染，通常采用两性霉素B 0.7mg/(kg·d)静脉滴注(总剂量1000mg)，停药后加伊曲康唑200mg，2次/d，终身用药。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于复杂合并症治疗场景。作为专科专家，我将全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全性（安全 > 疗效），重点关注患者免疫抑制状态下的多重风险。Step 2: 临床解码 (Clinical Decoding)：患者为艾滋病晚期（HIV-RNA 185 000 copies/mL），免疫严重抑制（WBC 2.8×10⁹/L），临床表现符合播散性感染：傍晚高热、盗汗、体重下降11kg，结合胸CT弥漫性结节伴'树芽征'（提示真菌性肺炎）、纵隔淋巴结肿大、肝脾肿大（肝肋下3cm，脾可触及）及脾内低密度灶，暴露于鸽粪史高度指向组织胞浆菌病播散。隐式线索包括：口咽白斑（可能鹅口疮）、少尿（24h尿量600mL，色深，提示脱水或早期肾损伤）、全血细胞减少（Hb 85g/L，PLT 78×10⁹/L）及LDH升高（510 U/L）反映感染负荷；费用担忧和职业因素可能影响依从性。Step 3: 规则对齐与安全检查 (Alignment & Safety)：指南针对'艾滋病患者播散性感染'（条件匹配），推荐两性霉素B静脉滴注后伊曲康唑终身治疗，禁忌症为'null'。但全网扫描发现：两性霉素B肾毒性风险高（患者少尿，未报肾功能指标）；伊曲康唑与潜在抗逆转录病毒药物（ART）可能相互作用（如CYP450抑制）；共病包括贫血、血小板减少增加出血风险，脱水需纠正；HIV未控需同步启动ART。安全优先，建议使用脂质体两性霉素B减肾毒性，并强化监测。Step 4: 决策生成 (Decision Making)：基于指南Action，启动两性霉素B脂质体静脉滴注0.7mg/(kg·d)（计算体重57kg，约40mg/d），目标总剂量1000mg；完成后转伊曲康唑200mg bid终身口服。但调整：优先脂质体制剂保护肾脏，并同步启动ART、补液支持及肾功能评估。",
    "medical_order": "予两性霉素B脂质体静脉滴注，起始剂量0.7mg/(kg·d)（按57kg计40mg/d），目标总剂量1000mg；监测肾功能（急查血肌酐、BUN）及尿量。治疗期间每日监测电解质、尿常规。完成静脉疗程后，转伊曲康唑200mg口服，2次/d，终身维持。同步启动抗逆转录病毒治疗（ART）。完善肾功能评估，予静脉补液（0.9%氯化钠注射液500mL q8h），维持尿量>1500mL/d。监测生命体征，包括体温、SpO₂。隔离防护，避免机会性感染。营养支持，高蛋白饮食。复查血培养、胸CT 1周后随访。",
    "patient_dialogue": "张先生，我明白您担心住院费用，但您的身体情况比较紧急。您最近发烧、出汗多、瘦了不少，检查发现肺部有感染，这很可能和您之前清理鸽粪有关——那些灰尘里可能带病菌，现在扩散到全身了。如果不及时用强效药，感染会越来越重，甚至影响肾脏（您尿少就是个信号）。所以，我们得给您静脉打针（输液），这个药能快速控制病菌，之后换成口服药长期吃来预防复发。费用别太担心，我会帮您联系社工申请补助。同时，我们还要给您补点盐水，让小便恢复正常。记住，这个治疗很关键，我会全程盯着您的安全指标。咱们先稳住病情，好吗？"
  }
]