[
  {
    "id": 541,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者46岁，出租车司机，今日由妻子搀扶步入诊室。主诉：近6周口渴难忍，每日携2升装可乐出车，仍觉“嗓子冒烟”；夜尿4-5次，影响睡眠；体重自发下降6 kg（自述“裤腰松了两扣”）。今日凌晨出班前自测指尖血糖12.8 mmol/L。无糖尿病家族史，否认高血压、冠心病。查体：BMI 24.7 kg/m²，BP 128/78 mmHg，HR 88次/分，律齐；舌红少津，苔薄黄，脉滑数。随机血糖14.2 mmol/L，尿糖（+++），尿酮体（±）。患者同时抱怨“最近空调坏了，车里热得慌，嘴角都裂口子”，但否认发热、咳嗽等其他不适。",
    "reference_rule": {
      "condition": "2型糖尿病早期，热盛伤津证",
      "action": "推荐中成药：杞黄降糖胶囊（强推荐，证据等级：A）：一次 6粒，一日 3次",
      "contraindication": null,
      "evidence": "② 杞黄降糖胶囊（强推荐，证据等级：A）：一次 6粒，一日 3次。"
    },
    "thought": "本案例属于常规诊断与治疗场景，作为果断的门诊医生，我的关注重点是快速鉴别诊断、排除危急重症，并基于证据给出直接诊疗方案。Step 1: 场景定义——患者以典型高血糖症状（口渴、多尿、体重下降）就诊，无急性并发症（如发热、咳嗽），场景聚焦常规门诊处理，需优先排除糖尿病酮症酸中毒（DKA）风险。Step 2: 临床解码——关键线索包括：随机血糖14.2 mmol/L（>11.1 mmol/L 符合糖尿病诊断标准）、尿糖(+++)及尿酮体(±)（提示轻度酮症但非DKA）、BMI 24.7 kg/m²（超重前期）、舌红少津与脉滑数（中医热盛伤津证）；隐式线索：职业（出租车司机久坐、高温暴露）可能加剧代谢紊乱，体重下降6kg及“裤腰松”暗示未控高血糖。整体解码为2型糖尿病（T2DM）早期伴轻度代谢失代偿，热盛伤津证。Step 3: 规则对齐与安全检查——指南Condition '2型糖尿病早期，热盛伤津证' 与解码一致；Contraindication为null，安全检查：尿酮体(±)非禁忌（非中重度酮症），无高血压/冠心病史，药物无交互风险。Step 4: 决策生成——直接采纳指南Action：杞黄降糖胶囊为核心治疗，同时整合常规监测与生活方式干预以确保安全。",
    "medical_order": "诊断：2型糖尿病（T2DM）早期，热盛伤津证。处理：1. 予杞黄降糖胶囊 6粒 每日3次口服。2. 即刻完善检查：糖化血红蛋白（HbA1c）、空腹血糖、肾功能、电解质、尿常规复检（重点监测酮体）。3. 生活方式干预：糖尿病教育（饮食、运动处方）；予低糖、低脂饮食；鼓励每日中等强度运动≥30分钟。4. 监测：嘱患者每日晨起及餐后2小时指尖血糖监测；记录症状变化。5. 随访：1周后复诊评估血糖控制及酮体转阴情况，若尿酮体持续阳性或血糖>16.7 mmol/L，转内分泌科。",
    "patient_dialogue": "张师傅，您这阵子口渴、晚上老跑厕所，还瘦了不少，确实挺遭罪的。检查结果出来了，是得了糖尿病，不过好在发现得早，不算严重。咱们先开个降糖药叫杞黄降糖胶囊，每天三次、每次六粒，饭后吃就行——它能帮您身体把血糖降下来，缓解您说的‘嗓子冒烟’那种感觉。另外，从今天起，您得做些调整：第一，车里备白开水代替可乐，可乐糖分太高了，越喝越渴；做菜少放糖和油，多吃蔬菜瘦肉。第二，每天抽空散步半小时，比如交班后走走路，别总坐着。第三，早晚用血糖仪扎手指测一下血糖，记在本子上，下次带来给我看。如果您嘴角裂口子或还觉得特别渴，随时给我打电话。咱们一起努力，把血糖稳住，您就能睡个安稳觉了！"
  },
  {
    "id": 527,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者男性，42岁，出租车司机。近3月出现口干欲饮、晨起口苦，伴脘腹胀满、胸胁闷胀，情绪易激动，大便2～3日一行、干结如栗，小便色黄。自述工作昼夜颠倒，常深夜进食烧烤、奶茶。查体：BMI 29.4 kg/m²，腰围102 cm，面色红赤，腹形饱满，肝区轻叩痛。舌质红、苔黄厚，脉弦数。随机血糖11.8 mmol/L，HbA1c 7.2%。今日因腹胀加重、排气不爽就诊，顺带咨询体检报告上的血糖异常。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肝胃郁热证。临床表现：形体偏胖，腹部胀大，脘腹痞满，胸胁胀闷，面色红赤，心烦易怒，口干口苦，大便干，小便色黄，舌质红，苔黄，脉弦数",
      "action": "推荐方药：大柴胡汤（《伤寒论》）（强推荐，证据等级：A），药物组成：柴胡、大黄、枳实、黄芩、半夏、白芍、生姜",
      "contraindication": null,
      "evidence": "推荐方药：大柴胡汤（《伤寒论》）（强推荐，证据等级：A），药物组成：柴胡、大黄、枳实、黄芩、半夏、白芍、生姜。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于常规诊断与治疗场景，具体为门诊诊疗。作为果断的急诊/门诊医生，我将快速建立鉴别诊断，排除危急重症（如急性胰腺炎或糖尿病酮症酸中毒），重点关注直接治疗决策和风险控制，避免拖延。\n\n**Step 2: 临床解码 (Clinical Decoding)**：从患者病例中提取关键信息：患者男性，42岁，肥胖（BMI 29.4 kg/m²，腰围102 cm），症状包括口干多饮、口苦、脘腹胀满、胸胁闷胀、情绪易激动、便秘（大便干结如栗）、小便色黄；体征包括面色红赤、腹形饱满、肝区轻叩痛、舌质红苔黄厚、脉弦数；实验室结果示随机血糖11.8 mmol/L和HbA1c 7.2%，结合患者职业（出租车司机）及生活习惯（昼夜颠倒、深夜进食烧烤奶茶），诊断为2型糖尿病早期伴代谢异常综合征。隐式线索包括生活方式不良（如高脂高糖饮食）可能导致胰岛素抵抗和消化不良，需警惕非酒精性脂肪肝风险（基于肝区叩痛）。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：将解码信息与指南 Condition \"2型糖尿病早期，肝胃郁热证\" 对齐：患者临床表现（形体偏胖、腹部胀大、脘腹痞满、胸胁胀闷、面色红赤、心烦易怒、口干口苦、大便干、小便色黄、舌质红苔黄、脉弦数）完全匹配指南描述。检查 Contraindication：指南中为 null，表明无禁忌证（如无过敏史或肝肾严重损害）。证据支持强推荐（证据等级A）使用大柴胡汤。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南 Action，直接生成决策：推荐大柴胡汤作为核心治疗方案，同时整合生活方式干预以控制糖尿病进展。排除危急重症后，无需转诊，门诊处理即可。",
    "medical_order": "诊断：2型糖尿病早期（肝胃郁热证）。\n治疗：1. 予大柴胡汤口服，每日一剂，分两次温服（组成：柴胡10g、大黄6g、枳实10g、黄芩10g、半夏10g、白芍15g、生姜3片）。2. 生活方式干预：嘱低脂低糖饮食、规律作息，避免夜间进食高热量食物。3. 监测：完善空腹血糖、餐后2小时血糖及肝功能检测（ALT、AST），每周随访一次。4. 转诊指征：若腹胀加剧、血糖控制不佳或出现黄疸，转内分泌科评估。",
    "patient_dialogue": "张师傅，您这情况我仔细看了。您现在有点早期糖尿病，中医上讲是‘肝胃郁热’，简单说就是身体里热气和堵住了，所以您老觉得口干、肚子胀、大便干。别太担心，这阶段咱们能控制好。\n\n我给您开个中药方子，叫大柴胡汤，它专门帮您疏通一下身体，缓解腹胀和口干的问题。每天喝一次，分早晚两次，坚持一阵子看看效果。\n\n另外，您工作辛苦，常吃夜宵烧烤奶茶，但这会让身体负担加重——糖分和油脂太高了，容易让血糖飙升，肚子更胀。我建议您尽量少碰这些，晚上吃点清淡的蔬菜水果，调整下作息，早点儿休息。这样配合治疗，血糖就能慢慢降下来，肚子也会舒服很多。咱们下周再复查一次，看看进展，好不好？"
  },
  {
    "id": 576,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者68岁，男性，退休美术教师，今日由老伴推着轮椅进入诊室。2型糖尿病病史18年，近半年出现双下肢麻木、夜间小腿抽筋，伴视物模糊、口干咽燥明显。既往史：高血压20年，去年因急性前壁心梗植入1枚支架；3年前发现eGFR 45 mL·min⁻¹·1.73 m⁻²，尿白蛋白/肌酐比 420 mg/g；否认脑卒中。平日自测空腹血糖7.8–9.4 mmol/L，餐后2 h血糖11–14 mmol/L。查体：BP 148/86 mmHg，BMI 23.5 kg/m²，皮肤干燥脱屑，舌红少津、裂纹明显，脉细数；膝腱反射减弱，双足10 g尼龙丝试验阳性。今日实验室回报：HbA1c 8.7%，Scr 132 μmol/L，eGFR 42 mL·min⁻¹·1.73 m⁻²，ALT 18 U/L，AST 22 U/L，TC 5.9 mmol/L，TG 2.4 mmol/L。患者抱怨最近夜尿3–4次、晨起头晕，担心“肾快不行了”。老伴补充说老爷子脾气越来越急，夜里盗汗明显，床单常湿。今日就诊目的：调整降糖方案并咨询如何保护肾功能。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，肝肾阴虚证",
      "action": "推荐中成药：六味地黄丸（强推荐，证据等级：A）：一次 8丸，一日 3次",
      "contraindication": null,
      "evidence": "② 六味地黄丸（强推荐，证据等级：A）：一次 8丸，一日 3次。"
    },
    "thought": "Step 1: 场景定义 – 本案例属于复杂合并症治疗场景（糖尿病肾病、神经病变、心血管疾病共存），作为专科专家，关注重点是全网扫描药物相互作用、禁忌症及共病风险，确保安全优先。Step 2: 临床解码 – ①糖尿病微血管并发症（双下肢麻木、尼龙丝试验阳性提示周围神经病变；视物模糊提示视网膜病变；eGFR 42 mL·min⁻¹·1.73 m⁻²及蛋白尿提示糖尿病肾病G3b期） ②代谢紊乱（HbA1c 8.7%示血糖控制不佳；TG 2.4 mmol/L示高甘油三酯血症） ③心血管风险（高血压、心梗病史） ④阴虚证候（舌红少津、盗汗、口干、脉细数符合肝肾阴虚） ⑤潜在电解质风险（夜尿增多、头晕需警惕高钾或低血压）。Step 3: 规则对齐与安全检查 – 患者证候与指南‘2型糖尿病晚期，肝肾阴虚证’完全匹配，无禁忌症（contraindication为null）。但强制检查：六味地黄丸含山茱萸（钾含量较高），患者eGFR 42且用RAS抑制剂（推测降压方案含此类药），需排除高钾风险；另需确认当前用药（如磺脲类或胰岛素）与中成药无相互作用。Step 4: 决策生成 – 采纳指南强推荐六味地黄丸，但需整合西医管理：优先优化降糖护肾方案（启用SGLT2抑制剂），协同控制血压/血脂，并监测电解质。",
    "medical_order": "1. 降糖方案调整：停用当前降糖药，予恩格列净 10 mg qd 口服（SGLT2抑制剂，护肾证据明确）。监测血糖及容量不足症状。2. 中成药：六味地黄丸 8丸 tid 口服。3. 血压管理：维持替米沙坦 80 mg qd + 氨氯地平 5 mg qd，目标BP<130/80 mmHg。4. 并发症处理：予依帕司他 50 mg tid 口服（改善神经病变）；阿托伐他汀 20 mg qn 口服（降LDL-C）。5. 检查：即刻查血钾、尿ACR；3月后复查HbA1c、eGFR、肝功能。6. 转诊：预约眼科（糖尿病视网膜病变筛查）、营养科（低蛋白饮食指导）。",
    "patient_dialogue": "王老师，您和老伴特意跑一趟，这份担心我完全明白。咱们今天重点做两件事：一是帮您稳住血糖，二是保护好肾脏。听我慢慢说啊——首先，您这腿麻、脚没知觉的情况，是糖尿病引起的神经损伤，咱们得加个新药（依帕司他），专门修复神经。晚上抽筋和出虚汗的问题，中医说是‘肝肾阴虚’，我给您开个六味地黄丸，就像给树根浇水一样，慢慢调理身体里的‘燥火’。其次，您吃的降糖药效果不够理想，我给您换一种叫恩格列净的药片，每天早上一粒。这个药特别棒，既能降血糖，又能保护肾脏，像给肾穿个小盔甲。不过刚开始可能会多跑两趟厕所，别担心，这是正常现象。血压药咱们继续吃，但得勤量着点，您老伴帮忙记录，争取降到130/80以下。另外啊，您说夜里汗多，我建议：1. 睡前喝点莲子汤（别加糖） 2. 穿纯棉睡衣 3. 床头放条干毛巾随时擦。记住这三招，能让您睡踏实些。最后，咱们这两天抽血查个血钾（就是血液里的矿物质），结果出来我第一时间告诉您。下个月记得带老伴一起来复诊，咱们一步一步把身体调顺溜，您啊，放宽心画画去！"
  },
  {
    "id": 571,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者因“视物模糊加重伴夜尿增多3个月”由女儿搀扶进入诊室。既往T2DM 18年，近5年先后加用甘精胰岛素+门冬胰岛素（总量已达0.8 U/kg·d），空腹血糖仍7.8–9.4 mmol/L；高血压15年，最高170/95 mmHg，现服缬沙坦/氨氯地平；3年前因“急性非ST段抬高心梗”植入1枚支架，术后规律双抗。近期实验室：HbA1c 8.7%，Scr 112 μmol/L（eGFR 58 mL/min），尿白蛋白/肌酐 420 mg/g，眼底照相示“双眼大量硬性渗出+视网膜前出血，黄斑水肿”。主诉夜间需起夜4–5次，口干咽燥，腰膝酸软，双下肢偶有抽筋；查体：BP 155/88 mmHg，BMI 24.5 kg/m²，踝反射减弱，双足背动脉搏动减弱。患者补充：近半年爱出汗、怕热，喝完水仍觉喉咙发干，像“含着沙子”；昨晚因腿抽筋痛醒两次。今日空腹血糖仪自测9.2 mmol/L。女儿焦急询问父亲眼睛会不会“很快失明”，并提到老同事推荐“补肾明目”的偏方，但患者不敢擅自服用。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，肝肾阴虚证",
      "action": "推荐单验方：补肾明目方（弱推荐，证据等级：B）：熟地黄、山萸肉、枸杞子、玄参、苍术、泽泻、丹参、昆布、川牛膝",
      "contraindication": null,
      "evidence": "推荐的单验方：补肾明目方（弱推荐，证据等级：B）：熟地黄、山萸肉、枸杞子、玄参、苍术、泽泻、丹参、昆布、川牛膝。"
    },
    "thought": "思维链（包含场景分析、临床解码、规则对齐、决策生成）：\n* **Step 1: 场景定义**：本案例属于复杂合并症治疗场景（Context明确标注）。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保安全（如中药与西药的肝肾毒性叠加），再评估疗效。\n* **Step 2: 临床解码**：从病例提取关键医学信息：①糖尿病晚期并发症：糖尿病视网膜病变（DR，眼底硬性渗出+出血+黄斑水肿）、糖尿病肾病（DKD，eGFR 58 mL/min + 尿白蛋白/肌酐 420 mg/g）、周围神经病变（踝反射减弱+下肢抽筋）、自主神经病变（夜尿增多+口干+怕热出汗）；②心血管风险：支架术后双抗治疗+高血压未控（BP 155/88 mmHg）；③代谢紊乱：血糖控制差（HbA1c 8.7% + 空腹9.2 mmol/L），电解质失衡风险（腿抽筋）；④证候：符合‘肝肾阴虚证’（口干咽燥、腰膝酸软、视物模糊）。隐式线索：胰岛素抵抗（总量0.8 U/kg·d仍高血糖）、容量负荷过重（夜尿多+高血压）及潜在低钾/低钙（抽筋）。\n* **Step 3: 规则对齐与安全检查**：指南Condition‘2型糖尿病晚期，肝肾阴虚证’与患者表现高度匹配。Action推荐‘补肾明目方’，无Contraindication，但强制安全扫描发现：①中药成分（如泽泻、丹参）可能加重肾功能负担（Scr 112 μmol/L）；②与现有西药（胰岛素、缬沙坦/氨氯地平、双抗）无已知禁忌，但长期联用需监测出血/电解质风险；③共病管理优先级：DR和黄斑水肿有失明风险（女儿焦虑点），需紧急干预；DKD和心血管病需同步优化。\n* **Step 4: 决策生成**：基于指南Action，采纳‘补肾明目方’作为辅助治疗（弱推荐），但必须整合西医核心治疗：升级降糖方案（解决胰岛素抵抗）、强化血压控制、转诊眼科处理DR，并预防性补充电解质。",
    "medical_order": "1. 予糖尿病视网膜病变（DR）及糖尿病肾病（DKD）规范化管理；2. 降糖方案调整：加用SGLT2抑制剂（如恩格列净10 mg qd），监测血糖及酮体；甘精胰岛素增量至0.9 U/kg·d，门冬胰岛素按餐前血糖调整；3. 降压优化：缬沙坦/氨氯地平剂量滴定，目标BP<130/80 mmHg；4. 予口服中药汤剂：补肾明目方（熟地黄15g、山萸肉10g、枸杞子10g、玄参10g、苍术6g、泽泻6g、丹参10g、昆布6g、川牛膝10g），每日1剂，疗程4周；5. 完善电解质（血钾、钙、镁）、24小时尿蛋白定量、心脏彩超；6. 转诊眼科急诊评估黄斑水肿（24小时内）；7. 予碳酸钙D3片600 mg qd + 维生素D3 800 IU qd；8. 营养科会诊制定低蛋白饮食（0.8 g/kg·d）。",
    "patient_dialogue": "张先生，还有您女儿，先别着急，咱们一步步来。您这眼睛模糊和晚上总起夜的问题，主要是因为糖尿病年头长了，影响了眼睛和肾脏——就像水管用久了会生锈，得赶紧修。您女儿担心的‘失明’风险确实有，但别慌，今天我就帮您联系眼科专家，明天就去查，他们能打针或激光治疗，多数人能保住视力。千万别试偏方！那些没经过验证，万一伤肾就麻烦了，咱们用医院开的药更安全。\n\n您说喉咙干、腿抽筋，这是身体缺水和缺钙了。药我给您调一下：降糖药加个新种类，能保护心脏和肾；降压药剂量微调，目标让血压稳下来；另外开个中药方子，专门针对您这种‘腰酸口干’的体质，每天喝一包。家里做饭千万少放盐，咸菜、酱豆腐都别碰——盐多了血压蹭蹭涨，腿肿更难受！钙片和维生素D每天吃，抽筋会好很多。\n\n今晚就做三件事：第一，女儿帮您记个‘小本本’，明早空腹再测血糖；第二，钙片现在开始吃；第三，眼科号我已约好，女儿陪您去。咱们一起把血糖、血压控住，眼睛和肾就能少受罪。您看这样行吗？"
  },
  {
    "id": 544,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁，男性，网约车司机，今日因‘口干、多饮、尿频两周’来门诊。自述近半月每日饮水量约4升，仍觉口渴，夜间需起床小便3-4次，影响睡眠。昨日中午送客途中曾出现短暂头晕，自测指尖血糖12.8 mmol/L。无体重下降，无视力模糊。既往体健，否认高血压、冠心病。吸烟10年，约10支/日，偶饮啤酒。父亲有2型糖尿病史。查体：BMI 28.4 kg/m²，腰围96 cm，BP 128/82 mmHg，HR 78次/分，律齐；舌红少津，苔薄黄，脉滑数。今日空腹静脉血糖8.1 mmol/L，HbA1c 7.2%。患者担心耽误跑车挣钱，希望尽快缓解口渴症状并简化用药方案。",
    "reference_rule": {
      "condition": "2型糖尿病早期，热盛伤津证",
      "action": "推荐中成药：降糖胶囊（弱推荐，证据等级：C）：一次 1.5 g，一日 3次",
      "contraindication": null,
      "evidence": "① 降糖胶囊（弱推荐，证据等级：C）：一次 1.5 g，一日 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断以排除危急重症（如糖尿病酮症酸中毒或高渗状态），并基于指南给出最直接的诊疗指令，确保决策高效且安全。\nStep 2: 临床解码 (Clinical Decoding) - 提取患者关键信息：典型2型糖尿病症状（口干、多饮、尿频，伴自测血糖12.8 mmol/L和HbA1c 7.2%，确诊糖尿病）；BMI 28.4 kg/m²和腰围96 cm指示肥胖（代谢综合征风险）；中医体征舌红少津、苔薄黄、脉滑数对应热盛伤津证；无急性并发症（如体重下降或视力模糊），排除危急重症。隐式线索包括职业（网约车司机）提示久坐生活方式和吸烟史（10支/日），增加心血管风险；父亲糖尿病史强化遗传易感性。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition为'2型糖尿病早期，热盛伤津证'，与患者临床特征（症状、HbA1c、中医体征）高度匹配。强制检查contraindication为null，无禁忌症（如药物过敏或严重肝肾功能不全，病例未提及）；安全优先，确认患者无急性事件且生命体征稳定（BP 128/82 mmHg，HR 78次/分）。\nStep 4: 决策生成 (Decision Making) - 根据指南action推荐降糖胶囊（证据等级C），剂量为1.5g tid po；同时作为门诊医生，补充生活方式干预（戒烟、限酒、饮食运动调整）以控制风险，并安排随访确保疗效。",
    "medical_order": "诊断：2型糖尿病早期，热盛伤津证。\n治疗：予降糖胶囊 1.5g tid po；监测空腹及餐后血糖 qd。\n生活方式干预：戒烟；限酒（啤酒<1瓶/日）；低热量饮食（总热量控制，减少精制糖摄入）；增加运动（如每日快走30分钟）。\n随访：门诊复诊2周后评估症状缓解及血糖控制；完善尿常规、肝肾功能检查排除并发症。",
    "patient_dialogue": "李师傅，看了你的情况，我得说你这个是得了糖尿病，就是身体里血糖太高了，所以总感觉口干、老想喝水和小便。别太担心，这病早期好控制，咱们一起想办法。\n\n我先给你开个药叫降糖胶囊，每天三次，每次一小包，饭后吃就行。它能帮你把血糖降下来，缓解口渴和尿频，这样晚上也能睡安稳点，不影响你开车挣钱。\n\n另外，生活习惯得调整一下：烟得戒掉，因为抽烟会让血糖更难控制，还伤血管；啤酒少喝点，最好别超过一瓶一天。饮食上注意少吃甜食和油腻的，多做点像快走这样的运动，每天半小时，这样能帮你减重，改善整体健康。\n\n两周后回来复查，咱们看看效果。坚持下来，症状很快就能好转，你照样能安心跑车！"
  },
  {
    "id": 563,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近3个月口干明显，晨起痰多、色白黏腻，自觉胸脘痞闷。自述既往体检发现空腹血糖7.8 mmol/L，未系统治疗，喜食肥甘，活动量小。查体：BMI 29.4 kg/m²，腹围102 cm，舌质淡胖、边有齿痕，苔白厚腻，脉滑。今日空腹血糖9.1 mmol/L，HbA1c 8.2%。患者同时抱怨昨夜工地加班后右肩轻微酸痛，无红肿，不影响活动。",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，痰浊",
      "action": "推荐中成药：金糖宁胶囊（弱推荐，证据等级：C）：一次 4粒，一日 3次",
      "contraindication": null,
      "evidence": "① 金糖宁胶囊（弱推荐，证据等级：C）：一次 4粒，一日 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)\n本案例属于常规诊断与治疗场景。作为果断的门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如糖尿病酮症酸中毒或急性并发症），并给出直接的治疗指令。患者主诉以慢性症状为主（如口干、痰多），无紧急迹象（如肩酸痛为非特异性），因此优先处理核心问题——2型糖尿病及其兼夹证。\n\nStep 2: 临床解码 (Clinical Decoding)\n从病例中提取关键信息：患者口干3个月、晨起痰多色白黏腻、胸脘痞闷，结合舌质淡胖边有齿痕、苔白厚腻、脉滑，这转化为医学术语“痰湿内阻证”，符合中医痰浊证候。血糖指标（空腹血糖9.1 mmol/L，HbA1c 8.2%）和肥胖相关体征（BMI 29.4 kg/m²，腹围102 cm）确诊为2型糖尿病控制不佳，隐式线索包括不良生活方式（喜食肥甘、活动量小）导致的胰岛素抵抗和代谢综合征。肩酸痛为次要问题（无红肿或活动受限），可能源于劳累，不构成急症。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)\n将解码信息与指南Condition“2型糖尿病兼夹证，痰浊”进行匹配：患者情况完全吻合（糖尿病伴痰湿证）。强制检查Contraindication：指南为null，无禁忌症或药物相互作用风险（无其他药物或共病报告）。肩酸痛不影响核心治疗，安全优先级高（无急危因素）。\n\nStep 4: 决策生成 (Decision Making)\n根据指南Action“推荐中成药：金糖宁胶囊（弱推荐，证据等级：C）：一次4粒，一日3次”，直接采纳该建议。同时，基于门诊常规，补充生活方式干预以强化管理，因为患者肥胖和不良习惯是糖尿病进展的关键驱动因素。决策包括金糖宁胶囊处方和健康教育。",
    "medical_order": "诊断：2型糖尿病，痰湿内阻证。处理：1. 予金糖宁胶囊口服，一次4粒，一日3次。2. 生活方式干预：低盐低脂饮食，限制肥甘摄入；每日中等强度活动≥30分钟。3. 监测：每周空腹血糖检测，3月后复查HbA1c。4. 肩酸痛：建议避免重体力劳动，局部热敷观察；如症状加重，复诊评估。",
    "patient_dialogue": "您好，我看您有口干、痰多这些症状，加上血糖偏高，这提示您的糖尿病没控制好，还带点中医说的“痰湿”问题。别担心，咱们先从吃药开始——我给您开个中成药叫金糖宁胶囊，每天吃三次，每次四粒，它能帮助降糖和化掉那些痰湿。记住，药得坚持吃才有效。另外，您的体重和肚子偏大，这会让血糖更难控制，所以咱得改改习惯：做菜少放盐，油和肥肉少吃点，多吃青菜粗粮；每天抽空走走路或做点运动，30分钟就行，像散步就很安全。这样坚持下来，血糖就能慢慢稳住，人也精神些。对了，您说肩膀有点酸——估计是加班累的，回家用热毛巾敷敷，别干重活就行。要是肩膀还疼或血糖测出来更高，一定赶紧再来找我看看，好吗？咱们一起努力，您肯定会好起来的！"
  },
  {
    "id": 516,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁，出租车司机，今日因“嘴里发黏发苦、喝水多仍渴”首次来门诊。体型偏胖，腹型明显（腰围102cm），平素夜班多、喜夜宵烧烤配冰啤。查体：面色偏红，舌红苔黄腻，脉滑数；随机指尖血糖9.8mmol/L，空腹静脉血糖7.4mmol/L，HbA1c6.9%。患者还随口提到“最近雨多，右膝盖有点酸胀”，但无红肿发热。门诊病历拟写“2型糖尿病早期？”，需进一步辨证并考虑干预方案。",
    "reference_rule": {
      "condition": "2型糖尿病早期，痰热互结证",
      "action": "推荐中成药：痰热清胶囊（强推荐，证据等级：B）：一次 3粒，一日 3次",
      "contraindication": null,
      "evidence": "② 痰热清胶囊（强推荐，证据等级：B）：一次 3粒，一日 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) —— 本案例属于常规诊断与治疗场景，作为果断的门诊医生，我的关注重点包括快速建立鉴别诊断以排除危急重症（如糖尿病酮症酸中毒或急性感染），并直接给出针对性干预方案。Step 2: 临床解码 (Clinical Decoding) —— 患者以口干、口渴、多饮为主诉，结合体型肥胖（腰围102cm）、不良生活习惯（夜班多、夜宵烧烤配冰啤）、查体面色红、舌红苔黄腻、脉滑数等体征，以及实验室指标（空腹血糖7.4mmol/L ≥7.0 mmol/L，HbA1c 6.9% ≥6.5%），可明确诊断为2型糖尿病早期；中医证型为痰热互结证（湿热内蕴）。隐含线索包括腹型肥胖提示代谢综合征风险，以及膝盖酸胀（无红肿发热）可能与肥胖相关骨关节负荷增加有关，但无急性炎症证据。Step 3: 规则对齐与安全检查 (Alignment & Safety) —— 病例解码结果（2型糖尿病早期，痰热互结证）与指南 Condition 匹配；指南 Contraindication 为 null，故强制检查无禁忌症（患者无药物过敏史、肝肾功能异常等风险）。Step 4: 决策生成 (Decision Making) —— 依据指南 Action，直接推荐痰热清胶囊作为核心治疗，同时结合常规管理原则，添加生活方式干预和监测计划。",
    "medical_order": "诊断：2型糖尿病早期（痰热互结证）。处理：1. 予痰热清胶囊 3粒 tid 口服；2. 生活方式干预：建议低热量饮食、限制酒精摄入、增加有氧运动、目标减重5%；3. 监测：定期复查空腹血糖、HbA1c（每3个月），教育自我血糖监测；4. 其他：右膝盖酸胀无急性体征，建议观察，如持续加重转骨科评估。",
    "patient_dialogue": "王师傅，您这情况我仔细看过了，主要是血糖有点偏高，属于早期糖尿病，咱们得趁现在好好管起来。第一呢，给您开个叫痰热清胶囊的药，每天三次，每次三粒，饭前饭后吃都行，它能帮您清热去湿，改善嘴里发黏发苦的感觉。第二呢，生活习惯得改改——您开夜班辛苦，但夜宵烧烤配冰啤真得控制，改成清淡点的，比如煮点蔬菜或水果；酒尽量少喝，因为酒精会让血糖更不稳。另外，每天抽空走走步，哪怕下班后散散步，减点体重对膝盖酸胀也有好处，咱们争取先减个几斤。第三，我会安排您定期测血糖，自己在家也留意一下，下次复查咱们再细聊。别担心，只要坚持，这毛病能管住，您身体底子还不错！"
  },
  {
    "id": 539,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁，男性，IT程序员，今日因“口干多饮伴体重下降2个月”首诊。自述近半年频繁熬夜赶项目，喜夜宵烧烤配冰啤酒，情绪急躁，晨起口苦明显。查体：BMI 28.4 kg/m²，腹围98 cm，面色偏红，舌红苔黄腻，脉弦滑。随机血糖12.8 mmol/L，空腹血糖7.9 mmol/L，HbA1c 7.2%。患者另诉近两周右手腕因搬服务器扭伤，活动稍受限，其余无特殊。否认高血压、冠心病史，无家族糖尿病史，平日几乎不运动。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肝胃郁热证",
      "action": "推荐单验方：开郁清热方（弱推荐，证据等级：C）：柴胡、黄芩、半夏、白芍、枳实、大黄、黄连、全瓜蒌、水蛭、桃仁",
      "contraindication": null,
      "evidence": "推荐的单验方：开郁清热方（弱推荐，证据等级：C）：柴胡、黄芩、半夏、白芍、枳实、大黄、黄连、全瓜蒌、水蛭、桃仁。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规门诊诊疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如排除1型糖尿病、酮症酸中毒或急性感染等危急重症），优先基于现有证据给出直接、可行的治疗方案。Step 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：患者42岁男性，主诉口干多饮伴体重下降2个月，结合随机血糖12.8 mmol/L（≥11.1 mmol/L 符合糖尿病诊断标准）、空腹血糖7.9 mmol/L（≥7.0 mmol/L）和HbA1c 7.2%（≥6.5%），明确诊断为2型糖尿病早期；隐式线索包括不良生活习惯（频繁熬夜、高脂高糖饮食如烧烤啤酒、缺乏运动）与情绪急躁，查体BMI 28.4 kg/m²（超重）、腹围98 cm（中心性肥胖）和中医体征（面色偏红、舌红苔黄腻、脉弦滑）提示肝胃郁热证；次要问题右手腕扭伤（活动受限）为非紧急创伤，不影响主要诊疗。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 将解码信息与指南条件“2型糖尿病早期，肝胃郁热证”完美匹配；指南中contraindication为null，强制检查无禁忌症（患者无药物过敏史、无肝肾功能异常报告，且当前无急性并发症如酮症），确保治疗安全。Step 4: 决策生成 (Decision Making) - 基于指南action推荐“开郁清热方”（弱推荐，证据等级C），直接生成决策：开具该中药方剂，并整合生活方式干预（饮食运动调整）及血糖监测；次要扭伤处理予简单支持。",
    "medical_order": "诊断：2型糖尿病早期（ICD-10: E11.9），中医证型：肝胃郁热证。治疗：予开郁清热方（柴胡10g、黄芩10g、半夏10g、白芍10g、枳实10g、大黄6g、黄连6g、全瓜蒌10g、水蛭3g、桃仁10g），每日一剂，水煎服，分两次服用，疗程4周；监测空腹血糖及餐后2小时血糖每周一次，复查HbA1c于4周后。生活方式干预：建议低脂低糖饮食（限制烧烤啤酒等高热量食物）、规律作息（避免熬夜）、增加有氧运动（如每日步行30分钟，起始缓慢避免手腕负荷）。辅助处理：右手腕扭伤予弹性绷带固定，避免重物提拿；转诊内分泌科随访，评估代谢综合征风险。",
    "patient_dialogue": "王先生您好，我是您的医生。从您的检查来看，您这是2型糖尿病的早期阶段，简单说就是血糖偏高导致口干、体重下降这些症状，还好发现得早，咱们能好好控制。中医上呢，这和您平时熬夜、爱吃烧烤配啤酒的习惯有关，身体里有股‘热气’堵着，所以您感觉口苦、情绪急。我给您开个中药方子，主要是清热解郁的，每天煮着喝，坚持一个月，能帮您调理身体、降血糖。同时啊，您得改改生活习惯：烧烤啤酒这些要少碰，做菜也清淡些，多喝水；晚上尽量早点睡，别熬夜；每天抽空散散步30分钟，轻松点开始，别搬重物免得手腕伤加重。对了，您这手腕扭伤，我给您绑个绷带固定一下，休息几天就好。咱们每星期测一次血糖，一个月后再复查，一步一步来，您别担心，配合治疗就能稳住。"
  },
  {
    "id": 553,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近 3 个月出现明显口渴、夜尿 4~5 次，体重下降 4 kg，伴午后乏力、易汗。既往体检发现空腹血糖 8.9 mmol/L，今日复查空腹血糖 9.4 mmol/L，HbA1c 8.2%。查体：BMI 26.8 kg/m²，BP 132/80 mmHg，舌淡红、边有齿痕、苔薄白，脉细弱。自述工作班次颠倒，常错过正餐，靠甜饮料提神。无酮症史，无心脑血管事件。患者进门时抱怨今早因堵车没来得及吃早餐，略感心慌。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证",
      "action": "推荐中成药：天麦消渴片（强推荐，证据等级：A）：一次 2片，一日 2次",
      "contraindication": null,
      "evidence": "（3）天麦消渴片（强推荐，证据等级：A）：一次 2片，一日 2次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为果断的门诊医生，我的关注重点是快速建立鉴别诊断（排除糖尿病急性并发症如酮症酸中毒或低血糖急症），并基于患者症状和检查结果，给出直接的初始治疗指令。Step 2: 临床解码 (Clinical Decoding): 患者症状（口渴、夜尿增多、体重下降、午后乏力、易汗）结合实验室检查（空腹血糖 9.4 mmol/L、HbA1c 8.2%）明确诊断为2型糖尿病；中医体征（舌淡红、边有齿痕、苔薄白、脉细弱）符合气阴两虚证；隐式线索包括不规律饮食（班次颠倒、错过正餐）和依赖甜饮料导致血糖波动，今早心慌提示潜在低血糖风险（但无酮症史或心脑血管事件，排除危急重症）。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南条件 '2型糖尿病中期，气阴两虚证' 完全匹配患者情况（HbA1c 8.2% 提示中期控制不佳）；指南推荐天麦消渴片，无禁忌症（contraindication null），且患者无药物过敏或急性风险，确保安全。Step 4: 决策生成 (Decision Making): 依循指南强推荐（证据等级 A），核心决策为处方天麦消渴片；同时需补充生活方式干预和监测以优化管理。",
    "medical_order": "诊断：2型糖尿病中期，气阴两虚证。予天麦消渴片口服，一次 2片，一日 2次。建议生活方式干预：规律进餐、避免高糖饮料，监测空腹血糖及餐后血糖。完善尿常规、血脂、肝肾功能检查。门诊随访，2周后复诊评估疗效。",
    "patient_dialogue": "张先生，别担心，您的检查结果出来了。您这段时间的口渴、夜尿多和体重下降，是因为血糖偏高引起的糖尿病。这是一种慢性病，但我们可以一起管理好。我会给您开一种专门针对您这种情况的药，叫天麦消渴片，每天早晚各吃两片，它帮助调节身体，改善乏力和出汗的问题。同时，您的工作班次乱、常喝甜饮料这些习惯得改改——甜饮料会让血糖忽高忽低，导致像今早那样心慌。以后尽量按时吃饭，饿了就吃个苹果或全麦面包，别靠饮料提神。我会教您怎么测血糖，在家自己监控。坚持下来，您会感觉越来越好！"
  },
  {
    "id": 572,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者，女，58岁，自由插画师，今日由女儿陪同复诊。2型糖尿病病史12年，平日空腹血糖7.2–8.5 mmol/L，HbA1c 7.8%。主诉近3个月双眼视物模糊、干涩，夜间加重，伴腰膝酸软、五心烦热。查视力：右眼0.6、左眼0.5；眼底照相示后极部散在微血管瘤、硬性渗出，未见新生血管及出血。实验室：肌酐76 μmol/L，eGFR 88 mL/min，尿白蛋白/肌酐比18 mg/g；ALT 22 U/L，AST 19 U/L。今日诊室空调过冷，患者进门时轻咳几声，随口抱怨‘最近天气忽冷忽热，水彩纸都翘边’。既往：高血压8年，口服缬沙坦80 mg qd，BP 132/78 mmHg；否认心脑血管事件。BMI 24.3 kg/m²。舌质红少津，苔薄白，脉细数。目前仅口服二甲双胍0.5 g bid，未使用任何降糖注射制剂或眼底激光。患者自述因赶稿常熬夜至凌晨2点，靠浓咖啡提神，未规律运动。",
    "reference_rule": {
      "condition": "单纯型糖尿病视网膜病变，肝肾阴虚证",
      "action": "针刺治疗（弱推荐，证据等级：C）：选穴：承泣、瞳子髎、攒竹、丝竹空、风池、肝俞、肾俞、光明、阳陵泉、三阴交。针用平补平泻，每周 3次",
      "contraindication": null,
      "evidence": "① 针刺治疗（弱推荐，证据等级：C）：选穴：承泣、瞳子髎、攒竹、丝竹空、风池、肝俞、肾俞、光明、阳陵泉、三阴交。针用平补平泻，每周 3次，适用于单纯型糖尿病视网膜病变。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及糖尿病视网膜病变与高血压的共存管理。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全性（安全 > 疗效），并整合中西医方案。Step 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：患者诊断为单纯型糖尿病视网膜病变（眼底照相显示微血管瘤和硬性渗出，无新生血管或出血）伴肝肾阴虚证（主诉视物模糊、干涩、腰膝酸软、五心烦热，舌质红少津、脉细数）；合并高血压（口服缬沙坦，BP 132/78 mmHg）和糖尿病（HbA1c 7.8%，显示血糖控制不佳）。隐式线索包括不良生活习惯（熬夜至凌晨2点、依赖浓咖啡、缺乏运动），这可能加剧代谢紊乱和眼底病变进展；eGFR 88 mL/min和尿白蛋白/肌酐比18 mg/g提示早期肾病风险，需警惕糖尿病肾病。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为'单纯型糖尿病视网膜病变，肝肾阴虚证'，与患者眼底表现和中医证候匹配。指南Action推荐针刺治疗（弱推荐，证据等级C），无禁忌症（Contraindication为null）。全网扫描安全风险：药物相互作用（二甲双胍和缬沙坦无已知冲突，针刺无系统风险）；禁忌症（针刺无明显禁忌，但需排除皮肤感染或出血倾向，病例未提示）；共病风险（高血压和糖尿病并存，血糖不达标可能加速视网膜病变；熬夜和咖啡因摄入可能升高血糖和血压，需综合干预）。Step 4: 决策生成 (Decision Making) - 基于指南Action，决定启动针刺治疗作为辅助疗法（选穴承泣、瞳子髎等，每周3次），同时优化整体管理：维持当前药物（二甲双胍和缬沙坦），但强化生活方式干预以控制共病风险，确保安全优先。",
    "medical_order": "诊断：1. 2型糖尿病合并单纯型视网膜病变（肝肾阴虚证）；2. 高血压。治疗：予针刺治疗（选穴：承泣、瞳子髎、攒竹、丝竹空、风池、肝俞、肾俞、光明、阳陵泉、三阴交），针用平补平泻，每周3次；维持二甲双胍0.5 g bid及缬沙坦80 mg qd。监测：每周测空腹血糖及血压，3月后复查HbA1c、眼底照相及尿白蛋白/肌酐比。生活方式干预：建议规律作息（避免熬夜）、限制咖啡因摄入（每日≤200mg）、每周≥150分钟中等强度运动（如步行）、低糖低盐饮食。",
    "patient_dialogue": "王阿姨，您今天提到眼睛看东西有点模糊，还有腰酸、手脚发热，这些症状咱们得好好管理。首先呢，我建议给您加个针灸治疗，专门针对眼睛和身体这些不舒服的地方——每周来三次，每次大约30分钟，挺温和的，能帮您改善视力和缓解疲劳。另外，您现在的降糖药和降压药还需要继续吃，但咱们得一起调整一下生活习惯：熬夜画画到凌晨2点，还喝浓咖啡，这些会让血糖和血压更难控制，时间长了可能加重眼睛问题。试试每晚11点前睡觉，咖啡换成淡茶或少喝点，每天抽半小时散散步，这些小事儿坚持下来，身体会轻松很多。别担心，咱们一步步来，我会帮您定期检查，确保安全又有效。"
  },
  {
    "id": 521,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近3个月口干、易疲乏，晨起视物略模糊，情绪易急躁，两胁胀满，餐后腹胀明显，大便溏薄1-2次/日。无体重骤降，无酮症史。今日空腹血糖6.9 mmol/L，HbA1c 6.4%，BMI 24.5 kg/m²，血压118/76 mmHg。舌质淡红、边有齿痕，苔薄白，脉弦细。自述工作压力大，熬夜至凌晨1点常见，靠甜食“续命”。母亲有2型糖尿病。患者担心西药副作用，倾向尝试非药物干预。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肝郁脾虚证",
      "action": "针刺治疗（弱推荐，证据等级：B）：取穴：百会、神庭、中脘、足三里（双）、合谷（双）、太冲（双）。留针 30分钟，一周 3次",
      "contraindication": null,
      "evidence": "推荐的其他疗法：针刺治疗（弱推荐，证据等级：B）：取穴：百会、神庭、中脘、足三里（双）、合谷（双）、太冲（双）。留针 30分钟，一周 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我的关注重点在于快速建立鉴别诊断（排除危急重症），并基于现有证据给出直接的治疗指令。患者症状非急性（如无酮症、无体重骤降），血压和生命体征稳定，故无需急诊处理，重点转向常规管理。\n\nStep 2: 临床解码 (Clinical Decoding)：患者症状（口干、易疲乏、视物模糊、情绪急躁、两胁胀满、餐后腹胀、大便溏薄）结合实验室指标（空腹血糖6.9 mmol/L 提示空腹血糖受损，HbA1c 6.4% 处于糖尿病前期范围），BMI正常，支持2型糖尿病早期诊断。中医证候（舌质淡红、边有齿痕、苔薄白、脉弦细）符合肝郁脾虚证，表现为肝气不舒（情绪急躁、胁胀）和脾气虚弱（疲乏、腹胀、便溏）。隐式线索包括不良生活方式（熬夜、高糖饮食）和家族史（母有2型糖尿病），增加进展风险；患者偏好非药物干预，需优先考虑安全、可接受的方案。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南condition为'2型糖尿病早期，肝郁脾虚证'，与患者表现高度匹配。action推荐针刺治疗（弱推荐，证据等级B），指定穴位和频率。contraindication为null，经强制检查无禁忌（如无出血倾向、皮肤感染或过敏史，病例未提及风险）。安全上，排除危急情况（血糖未达糖尿病诊断标准HbA1c<6.5%，无急性并发症），确保干预可行。\n\nStep 4: 决策生成 (Decision Making)：基于指南action，首选针刺治疗作为核心干预，同时整合生活方式调整（因患者习惯如熬夜和甜食摄入是可控风险因素），并安排随访监测以评估疗效。决策直接、高效，符合常规门诊流程。",
    "medical_order": "诊断：2型糖尿病前期（空腹血糖6.9 mmol/L，HbA1c 6.4%），证属肝郁脾虚。\n治疗：\n1. 予针刺治疗，取穴百会、神庭、中脘、足三里（双侧）、合谷（双侧）、太冲（双侧），留针30分钟，频次一周3次，疗程4周后复评。\n2. 生活方式干预：建议低糖饮食、规律作息、适度运动（如每日步行30分钟）。\n3. 监测：定期检测空腹血糖及HbA1c（建议3个月复查），观察症状变化。\n4. 患者教育：强调非药物管理重要性。",
    "patient_dialogue": "您好，从您描述的症状和检查结果来看，您目前处于糖尿病早期阶段，还没有严重到需要马上用药的程度，这真是个好消息！您担心的西药副作用，我们完全可以先尝试一些安全的方法。比如，我建议您试试针灸治疗——这是一种很温和的中医疗法，通过在特定穴位扎针来帮您调节身体，缓解口干、疲劳和腹胀这些问题。每周三次，每次半小时左右，不会太疼，而且没有副作用，特别适合您现在的情况。同时，您提到工作压力大、熬夜和爱吃甜食，这些习惯会让身体负担加重。咱们一起调整一下：尽量在11点前睡觉，甜食换成水果或坚果，每天抽时间散散步。这样不仅能控制血糖，还能让您感觉更有精神。记住，早期干预效果最好，我会定期帮您检查，咱们一步步来，您看怎么样？"
  },
  {
    "id": 520,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者，女，42岁，网络公司产品经理。近3个月自觉口渴多饮、晨起乏力，体重下降2 kg，夜间需起床小便1-2次。自述工作压力大，常熬夜赶方案，情绪波动明显，易怒且伴两胁胀闷；食欲一般但餐后腹胀，大便溏薄、日行1-2次。无糖尿病家族史，不吸烟，偶饮红酒。查体：BMI 24.7 kg·m⁻²，腰围84 cm，BP 118/76 mmHg；甲状腺未及肿大，心肺腹无显著异常，双下肢无水肿。今日空腹静脉血糖6.9 mmol·L⁻¹，HbA1c 6.4%。舌淡红、边有齿痕，苔薄白稍腻；脉弦细。患者另提及近一周因空调过冷出现轻微打喷嚏，无发热。实验室余项（肝肾功能、血脂、尿常规）暂未见异常。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肝郁脾虚证",
      "action": "推荐中成药：加味逍遥丸（弱推荐，证据等级：C），用法用量：一次 6 g，一日 2次",
      "contraindication": null,
      "evidence": "推荐的中成药：加味逍遥丸（弱推荐，证据等级：C），一次 6 g，一日 2次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如急性感染、酮症酸中毒等），并给出直接的治疗指令。Step 2: 临床解码 (Clinical Decoding): 患者症状（多饮、多尿、乏力、体重下降）结合实验室结果（空腹血糖6.9 mmol·L⁻¹、HbA1c 6.4%）提示糖尿病前期；中医证候特征（情绪波动、两胁胀闷、食欲一般、餐后腹胀、大便溏薄、舌淡红边齿痕苔薄白稍腻、脉弦细）符合肝郁脾虚证；轻微打喷嚏（无发热）可能为空调诱发的上呼吸道刺激，非急性感染风险；总体排除危急重症（生命体征稳定、无炎症指标异常）。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition '2型糖尿病早期，肝郁脾虚证' 与临床解码结果高度匹配；Contraindication为null，无药物禁忌或安全风险（如无肝肾损害、过敏史）。Step 4: 决策生成 (Decision Making): 根据指南Action的推荐（弱推荐，证据等级C），直接生成决策：使用加味逍遥丸，一次6g，一日2次。",
    "medical_order": "诊断：2型糖尿病早期（肝郁脾虚证）。治疗：予加味逍遥丸 6g po bid。",
    "patient_dialogue": "您好，我看您最近工作压力挺大的，经常熬夜，这确实容易影响身体。检查结果呢，显示您的血糖有点偏高，属于糖尿病前期阶段，所以才有口渴、乏力这些症状。另外，您提到情绪波动和腹胀，这跟中医说的肝郁脾虚有关。我给您开一个中成药，叫加味逍遥丸，每天吃两次，每次一小包，它能帮助调节情绪和脾胃功能。同时，为了控制血糖，建议您尽量少熬夜，工作间隙多休息；饮食上注意清淡，少吃生冷油腻的食物；空调别开太冷，避免着凉。别太担心，现在干预效果很好，咱们一步步来。"
  },
  {
    "id": 560,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "58岁女性，今日因“口干多饮加重伴乏力2周”来我院内分泌门诊复诊。既往2型糖尿病病史7年，平素口服二甲双胍0.5 g tid，近3个月自测空腹血糖7.8–9.2 mmol/L，餐后2 h血糖11–14 mmol/L。查体：BMI 26.4 kg/m²，腰围92 cm；面色少华，语声低微；舌淡红、边有齿痕，苔薄白少津；脉细无力。实验室：HbA1c 8.1%，FPG 8.9 mmol/L，2h-PG 13.4 mmol/L，尿微量白蛋白/肌酐比值正常。患者诉夜间盗汗、易疲劳，无酮症及感染征象。今日空腹来院，候诊时主动要求“能不能给调调中药，实在没劲儿”。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证",
      "action": "推荐中成药：芪药消渴胶囊（强推荐，证据等级：A）：一次 6粒，一日 3次",
      "contraindication": null,
      "evidence": "（5）芪药消渴胶囊（强推荐，证据等级：A）：一次 6粒，一日 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于常规诊断与治疗场景，作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断以排除危急重症（如糖尿病酮症酸中毒或感染），并基于现有证据给出最直接的诊疗指令。Step 2: 临床解码 (Clinical Decoding) – 患者为58岁女性，2型糖尿病7年，血糖控制不佳（HbA1c 8.1%，FPG 8.9 mmol/L，2h-PG 13.4 mmol/L），提示糖尿病进展；症状包括口干多饮、乏力加重、夜间盗汗及易疲劳，结合查体（BMI 26.4 kg/m²、腰围92 cm显示超重且中心性肥胖，面色少华、语声低微、舌淡红边齿痕苔薄白少津、脉细无力）支持中医气阴两虚证；实验室排除酮症、感染及肾脏并发症（尿微量白蛋白/肌酐比值正常），隐式线索为患者依从性可（主动复诊）但当前降糖方案（二甲双胍单药）不足。Step 3: 规则对齐与安全检查 (Alignment & Safety) – 病例与指南condition '2型糖尿病中期，气阴两虚证' 高度匹配；指南contraindication为null，且患者无禁忌症（无酮症、感染或肝肾异常），安全评估通过。Step 4: 决策生成 (Decision Making) – 根据指南action，直接推荐芪药消渴胶囊作为辅助治疗，一次6粒，一日3次，用于改善气阴两虚症状及血糖控制。",
    "medical_order": "继续二甲双胍0.5 g tid口服。加用芪药消渴胶囊6粒 tid口服。监测空腹血糖及餐后2小时血糖每周3次。建议糖尿病饮食控制及适度运动。2周后复诊，评估血糖控制及症状改善情况。",
    "patient_dialogue": "王阿姨，我看了您的检查结果，血糖还是有点高，难怪您最近总感觉口干、没力气，还出盗汗。咱们得调整一下药，给您加一种中药叫芪药消渴胶囊，它能补气养阴，帮您改善这些疲劳症状。您就每天饭后吃6粒，一天三次，和您原来的二甲双胍一起用，千万别停。平时吃饭注意清淡些，少吃甜的油的，多走动走动，比如散步半小时。这样坚持两周，咱们再来看看，应该能让您感觉有劲多了。别担心，我们一起慢慢调整，会好起来的！"
  },
  {
    "id": 587,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日独自复诊，进门时拎着刚买的半袋速冻水饺。主诉近3个月体重又涨了4kg，夜里小腿抽筋明显。自述‘下班太累，回家就躺沙发刷手机’，晚饭后习惯再来一碗红烧牛肉面当夜宵。既往2型糖尿病7年，目前口服二甲双胍0.5 g bid，自测空腹血糖7.8–9.2 mmol/L，糖化血红蛋白8.1%。查体：BMI 30.4 kg/m²，腰围105 cm，BP 138/86 mmHg，双足背动脉搏动减弱。今日空腹静脉血糖9.0 mmol/L。患者提到‘小区广场早上有人练气功，但我早上起不来’，并随口抱怨最近天热，空调房待久了肩膀发硬。",
    "reference_rule": {
      "condition": "2型糖尿病患者",
      "action": "推荐八段锦练习",
      "contraindication": null,
      "evidence": "八段锦能够降低 2型糖尿病患者的空腹血糖、餐后 2小时血糖、糖化血红蛋白，改善血脂，降低体质指数，并可预防或延缓糖调节受损发展为糖尿病。同时长期练习八段锦可改善 2型糖尿病患者焦虑抑郁等不良情绪，有助于患者的心理健康。（强推荐，证据等级：A）"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于生活方式与风险干预场景，重点关注识别患者隐式的不良生活习惯（如久坐、高热量夜宵摄入），关联长期健康风险（如糖尿病并发症、心血管事件），并以共情但坚定的语气提出非药物干预建议。Step 2: 临床解码 (Clinical Decoding): 患者为2型糖尿病7年，控制不佳（空腹血糖9.0 mmol/L，糖化血红蛋白8.1%），伴有肥胖（BMI 30.4 kg/m²）、中心性肥胖（腰围105 cm）、高血压前期（BP 138/86 mmHg），以及潜在神经血管病变（小腿抽筋、双足背动脉搏动减弱）。隐式线索包括久坐不动（‘下班就躺沙发刷手机’）、不健康饮食（夜宵吃红烧牛肉面、携带速冻水饺）、运动不足（‘起不来练气功’），以及空调房久坐导致的肌肉僵硬（肩膀发硬），这些共同加剧糖尿病风险和体重增加。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南针对‘2型糖尿病患者’推荐八段锦练习，无禁忌症（contraindication为null），且患者无急性疾病或运动禁忌（如严重心血管事件），指南证据支持其改善血糖、血脂、BMI和心理健康（证据等级A）。安全检查确认八段锦适用。Step 4: 决策生成 (Decision Making): 基于指南Action，推荐八段锦作为核心非药物干预；同时结合风险识别，建议综合生活方式调整，包括饮食优化和增加日常活动，以降低并发症风险。",
    "medical_order": "1. 诊断：2型糖尿病控制不佳（HbA1c 8.1%，空腹血糖9.0 mmol/L），肥胖（BMI 30.4 kg/m²），高血压前期（BP 138/86 mmHg），可疑周围血管神经病变（双足背动脉搏动减弱、夜间小腿抽筋）。2. 非药物干预：予八段锦练习，建议每周≥3次，每次20-30分钟；结合饮食管理（低热量、低盐饮食），避免夜宵及加工食品；增加日常活动（如散步）。3. 监测：继续口服二甲双胍0.5 g bid；自测空腹血糖每周3次，监测血压；定期复查HbA1c（3个月后）、足背动脉及体重变化。",
    "patient_dialogue": "王先生，您最近体重涨了点儿，晚上还抽筋，这确实让人不舒服。我看到您糖尿病控制得不太理想，血糖有点高，这长期下去可能会伤到血管和神经，比如脚麻或者心脏问题。别担心，咱们一起做些小调整就能改善。您提到小区有人练气功，八段锦就很适合您——它动作轻柔，像做操一样，能帮您降血糖、减体重，还能让心情更放松，早上起不来也没关系，下午或晚上抽空练练就行。另外，下班回家尽量别总躺着刷手机，多起来走动走动，肩膀僵硬也会好些；夜宵吃牛肉面热量太高了，换成水果或酸奶更健康。这些小习惯改一改，效果会很大，咱们一步一步来，好吗？"
  },
  {
    "id": 569,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者，男，52岁，出租车司机。近3个月出现口干多饮、体重下降4 kg，今日空腹血糖8.9 mmol/L，HbA1c 8.1%。体型偏胖（BMI 28.4 kg/m²），腹型肥胖明显。舌质淡胖、边有齿痕，苔白厚腻，脉滑。自述平日嗜甜饮，喜食油炸，活动量极少；晨起常觉胸闷、痰多，需清嗓数分钟方能说话。无高血压、冠心病史，否认酮症酸中毒。尿常规：尿糖（++），余阴性。肝肾功能正常。患者今日因‘体检发现血糖高’首次来内分泌门诊求治，神情略显焦虑，反复询问‘是不是要打胰岛素’。",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，痰浊（偏寒湿者）",
      "action": "推荐方药：宜苓桂术甘汤（《伤寒论》）（弱推荐，证据等级：B），药物组成：茯苓、桂枝、白术、甘草",
      "contraindication": null,
      "evidence": "偏寒湿者，宜苓桂术甘汤（《伤寒论》）（弱推荐，证据等级：B），药物组成：茯苓、桂枝、白术、甘草；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规门诊诊疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如排除糖尿病酮症酸中毒或其他危急重症），并给出直接的治疗指令。患者首次就诊，症状以慢性为主（口干多饮、体重下降），无急性危险体征（如否认酮症酸中毒），因此优先排除危急状况后，提供高效的门诊管理方案。\n\nStep 2: 临床解码 (Clinical Decoding): 从患者病例提取关键信息：患者为52岁男性，有典型2型糖尿病症状（空腹血糖8.9 mmol/L、HbA1c 8.1%、尿糖++），合并肥胖（BMI 28.4 kg/m²）和腹型肥胖，提示胰岛素抵抗风险。隐式线索包括生活方式不良（嗜甜饮、喜食油炸、活动量少），以及中医体征（舌质淡胖边有齿痕、苔白厚腻、脉滑）支持痰浊偏寒湿证；晨起胸闷痰多可能关联呼吸道不适，但无其他系统并发症（如无高血压、冠心病史）。整体转化为医学术语：2型糖尿病（T2DM）伴代谢综合征，中医辨证为痰浊（偏寒湿型）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 将解码信息与指南 condition \"2型糖尿病兼夹证，痰浊（偏寒湿者）\" 匹配：患者症状和体征符合该证型（如舌苔白厚腻对应寒湿）。强制检查 contraindication：指南中为 null，患者无禁忌症（肝肾功能正常、无酮症酸中毒史），确保安全优先（无药物相互作用风险）。指南 action 推荐苓桂术甘汤（弱推荐，证据等级B），因此该方案适用。\n\nStep 4: 决策生成 (Decision Making): 基于指南 action，生成直接决策：开具苓桂术甘汤中药方剂，同时结合生活方式干预（因患者有不良习惯），并安排血糖监测和随访以优化管理。排除危急重症后，无需胰岛素启动（HbA1c 8.1%未达胰岛素指征），强调教育以缓解焦虑。",
    "medical_order": "诊断：2型糖尿病（T2DM）伴痰浊偏寒湿证。予以下方案：1. 口服中药：苓桂术甘汤（茯苓、桂枝、白术、甘草），每日一剂，水煎分两次服。2. 生活方式干预：建议糖尿病饮食（限制甜饮及油炸食品，控制总热量），增加体力活动（如每日步行30分钟）。3. 监测：血糖自我监测（空腹及餐后2小时），4周后复查空腹血糖及HbA1c。4. 教育：糖尿病自我管理指导。5. 随访：4周后内分泌门诊复诊，评估疗效及调整方案。",
    "patient_dialogue": "张先生，您好！我是您的医生。首先，别担心，您这个情况不是特别严重，咱们有办法控制。检查结果确实显示血糖偏高，是典型的2型糖尿病，但好消息是您现在不需要打胰岛素——您的血糖水平还没到那一步，咱们先用更温和的方法试试。我会给您开一种中药方子，叫苓桂术甘汤，它像温开水一样帮你调理身体里的湿气，改善您早上胸闷痰多的感觉，还能辅助降血糖。您每天熬煮当茶喝就行。另外，您平时爱喝甜饮料、吃油炸食物是吧？这些习惯得改改，因为它们会让血糖更难控制。试试换成白开水或无糖茶，饭菜少放油和糖，咸菜也少吃点。还有，您开车时间长，活动少，我建议每天抽空走走路，哪怕30分钟，这对减重和降血糖特别管用。您买个血糖仪在家自己测测，早上和饭后各测一次，记下来，下次复诊时咱们看看效果。4周后您再来找我，咱们一起调整方案。记住，糖尿病管理好了，和正常人一样生活，别太焦虑！"
  },
  {
    "id": 546,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近3个月来明显乏力，午后潮热，夜尿2~3次，体重下降约4 kg。自述口干欲饮，饮不解渴，食欲尚可但餐后易腹胀。既往体检发现空腹血糖7.8 mmol/L，未规律服药。今日空腹血糖9.4 mmol/L，HbA1c 8.2%。舌质偏红、边有齿痕，苔薄少津，脉细数。患者为地铁售票员，长期轮班，昨夜因暴雨滞留车站仅睡4小时，今晨感心悸伴轻微手抖，遂请假就诊。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证",
      "action": "推荐中成药：消渴丸（强推荐，证据等级：A）：一次 5~10丸，一日 2~3次",
      "contraindication": null,
      "evidence": "（4）消渴丸（强推荐，证据等级：A）：一次 5~10丸，一日 2~3次。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于常规诊断与治疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断以排除危急重症（如糖尿病酮症酸中毒、低血糖或急性心血管事件），并基于症状给出直接的治疗指令，确保患者安全。\n\n**Step 2: 临床解码 (Clinical Decoding)**：从患者病例中提取关键信息并转化为医学术语：1) 乏力、午后潮热、夜尿增多、体重下降4 kg、口干多饮但饮不解渴，提示持续性高血糖状态（空腹血糖9.4 mmol/L、HbA1c 8.2%），符合2型糖尿病控制不佳；2) 餐后腹胀可能反映糖尿病相关胃肠功能紊乱；3) 舌质偏红、边有齿痕、苔薄少津、脉细数，结合中医证候诊断为气阴两虚证；4) 心悸伴轻微手抖、睡眠不足（仅4小时），需优先排除急性低血糖（交感神经兴奋表现）或应激反应。隐式线索包括：长期轮班导致的睡眠紊乱可能加剧血糖波动，体重下降和乏力提示代谢失代偿。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南Condition '2型糖尿病中期，气阴两虚证' 与患者临床特征完全匹配（高血糖值、典型症状、中医舌脉）。Contraindication为null，无禁忌症；强制安全检查确认：消渴丸适用于该证型，患者无肝肾疾病、过敏史或其他共病提及，安全。但需立即评估急性症状（心悸手抖）以排除低血糖。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南Action '推荐中成药：消渴丸（强推荐，证据等级：A）：一次 5~10丸，一日 2~3次'，生成决策：在排除危急重症后，予消渴丸起始治疗；同时结合急性症状，优先完善即时血糖监测以指导处理。",
    "medical_order": "诊断：2型糖尿病中期（气阴两虚证），伴急性心悸待查。处理：1) 立即测指尖血糖；2) 若血糖正常或高，予消渴丸口服，一次5~10丸，一日2~3次；3) 完善空腹血糖、餐后2小时血糖及尿常规监测；4) 建议糖尿病饮食教育及规律作息；5) 一周后复诊评估疗效。",
    "patient_dialogue": "王先生，我看您最近挺辛苦的，又是乏力又是口干，体重也掉了些，这些症状都跟您的血糖控制不好有关。刚才的心悸和手抖，可能是昨晚没睡好导致的血糖波动，咱们先测个手指血糖看看情况。如果没问题，我给您开个药叫消渴丸，每天吃几次，它能帮您补气养阴、稳定血糖，就像给身体加油一样。但光吃药不够，您得注意多休息——轮班太累了，尽量保证睡眠；饮食上多吃蔬菜、少吃油腻，口渴时喝温水别喝甜饮料。这样血糖慢慢好起来，乏力感就会减轻。下周再来复查，我们一起调整治疗。别担心，控制好了就能正常生活！"
  },
  {
    "id": 547,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁男性，软件工程师，昨日公司体检发现空腹血糖7.9 mmol/L，今日请假来门诊复查。主诉近3周口干明显，夜间需起床饮水2-3次，晨起咽喉干痛；小便偏黄、量不少；体重自发下降2 kg。无多饮多尿外的显著不适，但自述“上火”，喜喝冰饮料。既往体健，无高血压及冠心病史，父亲有2型糖尿病。查体：BMI 25.4 kg/m²，血压118/76 mmHg，舌红少津、苔薄黄，脉滑数。随机血糖12.4 mmol/L，HbA1c 7.1%。患者顺带提到最近加班多、睡眠仅5 h，担心体检报告影响升职。未使用任何降糖药物。",
    "reference_rule": {
      "condition": "2型糖尿病早期，热盛伤津证",
      "action": "推荐单验方：石地降糖饮（弱推荐，证据等级：C）：生地、知母、天花粉、葛根、太子参、麦冬、苍术、黄芩、生石膏、山药、柴胡、白芍、川牛膝",
      "contraindication": null,
      "evidence": "推荐的单验方：石地降糖饮（弱推荐，证据等级：C）：生地、知母、天花粉、葛根、太子参、麦冬、苍术、黄芩、生石膏、山药、柴胡、白芍、川牛膝。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于常规门诊诊疗场景，作为果断的急诊/门诊医生，关注重点在于快速建立鉴别诊断（排除糖尿病酮症酸中毒等危急重症），并基于现有证据给出直接、高效的治疗指令，避免延误处理。\n\n**Step 2: 临床解码 (Clinical Decoding)**：患者为42岁男性，主诉口干、多饮、多尿（夜间饮水2-3次）、体重下降2kg，结合实验室检查（空腹血糖7.9 mmol/L、随机血糖12.4 mmol/L、HbA1c 7.1%）符合WHO 2型糖尿病诊断标准（空腹≥7.0 mmol/L或随机≥11.1 mmol/L）。隐式线索包括：BMI 25.4 kg/m²提示超重（肥胖相关胰岛素抵抗），中医证候为热盛伤津（舌红少津、苔薄黄、脉滑数），风险因素包括家族史（父亲2型糖尿病）、工作压力大、睡眠不足（仅5小时），可能导致血糖控制恶化。患者焦虑影响升职，需安抚。无急性并发症证据（如无恶心、呕吐）。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：患者表现与指南Condition“2型糖尿病早期，热盛伤津证”高度匹配。强制检查Contraindication为null，无禁忌症（如无肝肾疾病或药物过敏史），安全可行。指南Action推荐单验方“石地降糖饮”（证据等级C，弱推荐），适用于此证候。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南，优先推荐“石地降糖饮”作为辅助治疗。同时，结合常规管理，需强化生活方式干预（饮食、运动）和血糖监测，以控制疾病进展，并安排随访确保疗效。",
    "medical_order": "1. 诊断：2型糖尿病（早期），中医证型：热盛伤津证。\n2. 治疗建议：予单验方石地降糖饮（含生地、知母、天花粉、葛根、太子参、麦冬、苍术、黄芩、生石膏、山药、柴胡、白芍、川牛膝），每日一剂，水煎服，分两次口服。\n3. 生活方式干预：建议糖尿病饮食（低糖、低脂、高纤维），每日规律有氧运动（如快走30分钟），控制体重。\n4. 监测：完善空腹及餐后2小时血糖监测（每周2-3次），定期复查HbA1c（每3个月）。\n5. 教育：提供糖尿病自我管理教育，包括症状识别和应急处理。\n6. 随访：门诊预约2周后复诊，评估疗效及调整方案。",
    "patient_dialogue": "您好，从您的检查结果来看，血糖确实偏高了，这可能是早期糖尿病引起的。您说的口干、晚上老喝水这些症状，都和这个有关，中医上叫‘上火伤津’。别太担心，这阶段控制好，不会影响您的工作和升职的。\n\n我给您开一个中药方子，叫石地降糖饮，它能帮您降血糖、改善口干，每天煮一剂喝就行。同时，生活上得调整一下：尽量别喝冰饮料了，换成白水；做菜少放糖和油，多吃蔬菜和全谷物；每天抽点时间散步半小时，这对控制体重和血糖很有帮助。\n\n您最近加班多、睡得少，这也可能让血糖不稳，试着保证7小时睡眠吧。咱们过两周再见面，看看效果，您记着在家测几次血糖，有什么不舒服随时告诉我。早期干预，效果会很好的，我们一起努力！"
  },
  {
    "id": 557,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者，男，58岁，出租车司机。近3个月出现口渴多饮、夜尿3～4次、体重下降4 kg，伴午后乏力、手心热。否认酮症史。既往高血压8年，口服氨氯地平5 mg qd，血压控制尚可；吸烟约20包年，日均开车10 h，运动极少。母亲有2型糖尿病。查体：BMI 28.4 kg·m⁻²，腰围98 cm，BP 136/82 mmHg；皮肤干燥，舌淡红少津、边有齿痕，苔薄白，脉细数。随机血糖13.7 mmol·L⁻¹，空腹血糖8.9 mmol·L⁻¹，HbA₁c 8.2%。今日凌晨因送客至郊区，气温骤降，自觉怕冷、轻度咽痛，无发热。患者自述近两周加班频繁，常忘记吃晚饭，靠甜饮料提神。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证",
      "action": "推荐中成药：参芪降糖胶囊（强推荐，证据等级：A）：一次 3粒，一日 3次",
      "contraindication": null,
      "evidence": "（2）参芪降糖胶囊（强推荐，证据等级：A）：一次 3粒，一日 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景，作为果断的急诊/门诊医生，重点关注快速建立鉴别诊断（排除危急重症如糖尿病酮症酸中毒或严重感染），并基于现有证据给出直接治疗指令。Step 2: 临床解码 (Clinical Decoding): 提取关键信息：患者症状（口渴多饮、夜尿频繁、体重下降4 kg、午后乏力、手心热）结合实验室指标（随机血糖13.7 mmol/L、空腹血糖8.9 mmol/L、HbA₁c 8.2%）明确诊断为2型糖尿病；BMI 28.4 kg·m⁻²和腰围98 cm提示肥胖及代谢综合征；中医体征（舌淡红少津、边有齿痕，脉细数）支持气阴两虚证；隐式线索包括不良生活方式（吸烟20包年、日均久坐10小时、运动极少、靠甜饮料提神）、近期加班致饮食不规律（忘记吃晚饭），以及当前轻微上呼吸道感染症状（怕冷、咽痛，无发热）。排除危急重症：否认酮症史、无发热，当前症状轻，暂无需急诊处理。Step 3: 规则对齐与安全检查 (Alignment & Safety): 病例与指南condition '2型糖尿病中期，气阴两虚证'高度匹配（HbA₁c 8.2%指示糖尿病中期；中医体征符合气阴两虚）。Contraindication为null，无绝对禁忌；安全检查：参芪降糖胶囊（中成药）与患者现有药物氨氯地平（钙通道阻滞剂）无明显相互作用记录，但需监测血压和血糖波动，避免低血糖风险。Step 4: 决策生成 (Decision Making): 基于指南action '推荐中成药：参芪降糖胶囊（强推荐，证据等级：A）：一次 3粒，一日 3次'，生成核心治疗指令，同时整合整体管理：处方参芪降糖胶囊，强化生活方式干预（戒烟、饮食调整、运动），监测血糖，并处理当前轻微感染。",
    "medical_order": "诊断：2型糖尿病（中期），气阴两虚证；高血压（控制尚可）；肥胖；上呼吸道感染（轻度）。治疗：1. 予参芪降糖胶囊口服，一次3粒，一日3次。2. 继续氨氯地平5 mg qd控制血压。3. 生活方式干预：戒烟；低脂低糖饮食（限碳水化合物摄入）；增加有氧运动（如每日步行30分钟）。4. 监测：每日空腹血糖及随机血糖；一周后复诊评估疗效。5. 对症处理：多饮水、休息，若咽痛加重予对症支持。",
    "patient_dialogue": "王先生，您好！看了您的检查结果，咱们确诊了糖尿病，这主要是血糖偏高引起的，所以您会感觉口渴、尿多、体重下降。别担心，这病早期控制好问题不大。我给您开了个中成药叫参芪降糖胶囊，每天吃三次，每次三粒，它能帮您调理身体、降低血糖。另外，您还得继续吃降压药氨氯地平，血压控制得不错，别停。现在关键是生活习惯：第一，必须戒烟了，抽烟会让糖尿病更严重；第二，别再喝甜饮料了，那会让血糖飙升，尽量按时吃饭，比如带点健康零食上班；第三，每天抽时间动一动，哪怕走走路也能帮大忙。您说今天有点怕冷和嗓子疼，像是感冒了，多喝温水、多休息就行，别硬扛。记住，这些改变能预防并发症，我帮您定个复诊时间，一周后咱们再看看效果。您能做到吗？"
  },
  {
    "id": 545,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近3个月来常觉饭后心口堵闷，像塞了团棉花，偶尔干呕，打嗝带酸腐味；晨起口干明显，得连喝两口温水才能说话。唇周反复冒红肿小脓疱，自己擦了祛痘膏也不见好。大便一日2～3次，先成形后松散，偶有未消化菜叶；昨日午餐吃公司轻食沙拉后，傍晚腹泻一次。晚上加班到23点，觉得双腿发沉，爬三层楼就气短。否认明显多饮多尿，体重自测下降约2kg。无烟酒嗜好，但每天2杯拿铁、几乎不运动。查体：BP 128/82 mmHg，BMI 25.4 kg/m²；腹软，剑突下轻压痛，无反跳痛；舌淡胖，边有齿痕，苔白厚微黄，舌下静脉色暗略显瘀曲；脉弦滑而无力。随机血糖7.9 mmol/L，HbA1c 6.6%。今日因“胃胀难受”请假半天，顺路来看门诊，希望“调理脾胃、别再腹泻”。",
    "reference_rule": {
      "condition": "2型糖尿病早期，脾胃不和证。临床表现：心下痞满，口干，唇周痤疮，乏力，纳差，脘腹满闷，水谷不消，便溏，或腹泻，干呕呃逆，舌淡胖苔腻，舌下络瘀，脉弦滑无力",
      "action": "推荐方药：半夏泻心汤（强推荐，证据等级：A）（《伤寒论》），药物组成：半夏、黄连、黄芩、干姜、甘草、大枣、人参",
      "contraindication": null,
      "evidence": "推荐方药：半夏泻心汤（强推荐，证据等级：A）（《伤寒论》），药物组成：半夏、黄连、黄芩、干姜、甘草、大枣、人参。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景，作为门诊医生，我的关注重点是快速建立鉴别诊断（如排除胃肠道急症或糖尿病酮症酸中毒），确认无危急重症风险后，给出直接治疗指令。Step 2: 临床解码 (Clinical Decoding): 患者主诉饭后心口堵闷（医学术语：心下痞满）、干呕打嗝带酸腐味（提示胃食管反流和消化不良）、晨起口干（提示津液不足或糖尿病相关）、唇周红肿小脓疱（可视为痤疮）、大便松散有未消化菜叶及腹泻（提示消化不良和便溏）、双腿发沉气短（提示乏力）、体重下降2kg；结合查体：腹软剑突下轻压痛（提示脘腹满闷）、舌淡胖边齿痕苔白厚微黄（提示脾虚湿盛）、舌下静脉瘀曲（提示血瘀）、脉弦滑无力（提示气滞兼虚）；实验室检查：随机血糖7.9 mmol/L 和 HbA1c 6.6%（符合2型糖尿病早期）。总体解码为脾胃不和证，伴糖尿病前期风险。Step 3: 规则对齐与安全检查 (Alignment & Safety): 患者症状（心下痞满、口干、唇周痤疮、乏力、脘腹满闷、水谷不消、便溏腹泻、干呕呃逆、舌象脉象）与指南Condition高度匹配，符合'2型糖尿病早期，脾胃不和证'。指南Contraindication为null，无禁忌（如无药物过敏或肝肾功能异常报告）。Step 4: 决策生成 (Decision Making): 根据指南Action强推荐半夏泻心汤（证据等级A），作为核心治疗。同时，考虑患者生活方式（咖啡因过量、缺乏运动），需补充非药物建议以优化疗效。",
    "medical_order": "诊断：2型糖尿病早期，脾胃不和证。治疗：予半夏泻心汤口服（组成：半夏、黄连、黄芩、干姜、甘草、大枣、人参），每日一剂，水煎分两次服，疗程建议4周。生活方式干预：减少咖啡因摄入至每日不超过1杯拿铁；增加适量有氧运动如每日散步30分钟；建议低脂易消化饮食，避免生冷刺激性食物。随访：1周后复诊评估症状缓解情况，监测空腹血糖及HbA1c；如腹泻持续，完善大便常规及潜血检查。",
    "patient_dialogue": "王先生，我看了您的症状，饭后胃胀、口干、还有腹泻这些问题，主要是因为您的脾胃功能有点失调了，加上血糖也偏高些。别太担心，这是常见的脾胃不和，咱们用个中药方子叫半夏泻心汤来调理，它能帮助缓解胃胀和腹泻，让您舒服点。另外啊，您平时喝咖啡的习惯得改改——每天一杯就够了，别喝两杯，因为咖啡喝多了会加重胃不舒服。还有，尽量抽空动一动，比如下班后散散步，这对改善消化和控制血糖都有好处。咱们先这样调理四周，下周再来复查看看效果，好吗？坚持一下，这些症状会慢慢好转的。"
  },
  {
    "id": 518,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日因‘体检发现空腹血糖6.9 mmol/L，伴餐后2 h血糖11.4 mmol/L’来内分泌门诊。自述近半年情绪急躁，夜间多梦，胁肋偶胀，饭后腹胀明显，大便日行2–3次、质溏，稍食油腻即肠鸣。无多饮多尿消瘦。舌淡红边齿痕，苔薄白微腻，脉弦细。BMI 24.7 kg/m²，血压118/76 mmHg，余查体无特殊。平素工作熬夜至凌晨1点，靠拿铁提神，日均步数不足3000。否认家族糖尿病史，无药物过敏。实验室：HbA1c 6.4%，ALT 28 U/L，肌酐68 μmol/L，尿常规阴性。患者进门时仍接听客户电话，语气急促，候诊区反复来回踱步。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肝郁脾虚证",
      "action": "推荐单验方：三舒汤（弱推荐，证据等级：C），药物组成：柴胡、当归、白芍、姜半夏、甘草、白术、厚朴、枳壳、山药、郁金、茯苓、知母",
      "contraindication": null,
      "evidence": "推荐的单验方：三舒汤（弱推荐，证据等级：C）：柴胡、当归、白芍、姜半夏、甘草、白术、厚朴、枳壳、山药、郁金、茯苓、知母。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)** 本案例属于常规诊断与治疗场景。作为门诊医生，我的关注重点是快速建立鉴别诊断（排除危急重症如糖尿病急性并发症），并基于患者表现直接给出诊疗指令，确保决策高效、简洁。**Step 2: 临床解码 (Clinical Decoding)** 患者关键信息包括：生化指标（空腹血糖6.9 mmol/L、餐后2h血糖11.4 mmol/L、HbA1c 6.4%）符合2型糖尿病早期诊断标准（空腹≥6.1 mmol/L且<7.0 mmol/L为IFG，餐后≥11.1 mmol/L为糖尿病）；症状（情绪急躁、胁肋胀、饭后腹胀、大便溏、肠鸣）及舌脉（舌淡红边齿痕、苔薄白微腻、脉弦细）转化为中医证型肝郁脾虚；生活方式因素（日均步数不足3000、熬夜、咖啡因依赖）为隐式风险，可加剧代谢紊乱；行为观察（语气急促、踱步）提示焦虑状态，需在治疗中安抚。无危急体征（血压正常、无多饮多尿消瘦），排除糖尿病酮症酸中毒等重症。**Step 3: 规则对齐与安全检查 (Alignment & Safety)** 指南condition“2型糖尿病早期，肝郁脾虚证”与病例高度匹配。contraindication为null，无药物过敏史（患者无过敏），实验室检查（ALT、肌酐正常）无禁忌风险，药物组成（柴胡等）安全，无相互作用。**Step 4: 决策生成 (Decision Making)** 根据指南action，推荐核心治疗为三舒汤（弱推荐，证据等级C），同时整合门诊处理原则，添加生活方式干预和随访计划，以控制糖尿病进展。",
    "medical_order": "诊断：2型糖尿病（早期），肝郁脾虚证。予中药方剂三舒汤（柴胡10g、当归10g、白芍10g、姜半夏6g、甘草6g、白术10g、厚朴6g、枳壳6g、山药15g、郁金10g、茯苓15g、知母6g），每日一剂，水煎服，分两次温服。生活方式干预：建议规律作息（每晚23点前入睡），限制咖啡因摄入（每日咖啡类饮品≤1杯），增加日常活动（日均步数目标8000步）。随访：监测空腹及餐后2h血糖每周1次，4周后复诊复查HbA1c及肝功能。",
    "patient_dialogue": "王先生，看您刚才挺忙的，咱们慢慢聊。检查结果显示您的血糖确实偏高，属于早期糖尿病，但别担心，这阶段控制好就不会有大问题。您最近感觉烦躁、肚子胀、大便不成形，这些和身体失调有关。我给您开个中药方子叫三舒汤，它能帮您调理情绪和消化，让您舒服些。另外，您常熬夜、喝咖啡、走路少，这些习惯会让血糖更难控制——如果长期这样，容易发展成更严重的糖尿病。所以我建议您：尽量早点睡，咖啡少喝点，每天多走走路，比如饭后散散步。这些改变对您很重要，能预防并发症。咱们四周后复查血糖，看看效果。别给自己太大压力，一步步来，您肯定能改善的！"
  },
  {
    "id": 552,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者52岁，女性，体型偏瘦，面色少华。自诉近3个月来午后明显乏力，讲台上写板书时手抖，需扶桌休息；夜间入睡困难，多梦易醒，晨起心悸，记忆力下降，批改作业时常忘带红笔。口干不欲多饮，食欲一般，但饭后腹胀，大便偏溏，日1-2次。既往2型糖尿病8年，目前服二甲双胍0.5 g bid，空腹血糖7.2 mmol/L，糖化血红蛋白7.4 %。查体：舌淡胖边有齿痕、苔薄白，脉细弱。今日午餐后2 h血糖11.8 mmol/L，BP 118/72 mmHg，HR 88次/分，律齐。患者抱怨‘血糖老是降不下来，还越来越累’，并随口提到最近学校粉笔灰多，喉咙干痒，但无咳嗽发热。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证，以心脾两虚为主者",
      "action": "推荐方药：宜选归脾汤",
      "contraindication": null,
      "evidence": "心脾两虚为主者，宜选归脾汤。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（Differential Diagnosis），排除潜在危急重症如甲状腺功能亢进危象、严重低血糖或心血管事件，并基于现有证据给出直接的治疗指令。\n\nStep 2: 临床解码 (Clinical Decoding): 患者52岁女性，2型糖尿病8年，控制不佳（空腹血糖7.2 mmol/L, 糖化血红蛋白7.4%，餐后血糖11.8 mmol/L）。关键症状包括午后乏力、手抖（需排除神经肌肉或内分泌紊乱）、心悸、失眠、记忆减退、口干不欲饮、饭后腹胀、大便溏泄，结合体型偏瘦、面色少华、舌淡胖边有齿痕、脉细弱，符合中医气阴两虚证，以心脾两虚为主（心脾虚损导致气血不足）。隐式线索：手抖和心悸可能提示甲状腺功能异常或贫血风险；血糖持续偏高提示降糖方案需优化；粉笔灰相关喉咙干痒无关急性感染。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南条件'2型糖尿病中期，气阴两虚证，以心脾两虚为主者'与患者表现高度匹配（乏力、心悸、失眠、腹胀便溏等心脾虚症状）。强制检查禁忌症：指南contraindication为null，患者无发热、咳嗽、急性腹痛等危急征象，当前用药二甲双胍无已知与归脾汤相互作用，安全适用。\n\nStep 4: 决策生成 (Decision Making): 基于指南action'推荐方药：宜选归脾汤'，决策为开具归脾汤以补益心脾、调理气血；同时排除危急重症，建议完善甲状腺功能和血常规检查；优化糖尿病管理，评估二甲双胍疗效并考虑加药。",
    "medical_order": "予归脾汤口服，每日一剂。完善甲状腺功能五项（TSH、FT3、FT4等）及血常规检查。评估二甲双胍疗效，监测空腹及餐后血糖谱，必要时加用SGLT2抑制剂或DPP-4抑制剂。嘱糖尿病饮食，定期随访。",
    "patient_dialogue": "张阿姨，您最近感觉这么累，还手抖心慌，主要是因为身体气血不足了——就像电池快没电了一样，尤其您有糖尿病这么久，血糖控制得不太理想，加重了这种情况。我会给您开一个中药方子叫归脾汤，它专门补气养心，帮您改善疲劳、睡得好些。另外，咱们得排除一些其他可能原因，比如甲状腺问题或贫血，所以需要抽血做个简单检查。血糖方面，您吃的二甲双胍效果不太好，我可能得加个新药，咱们一起调一调。平时注意饮食清淡点，少吃甜食和油腻，多吃蔬菜瘦肉，这样身体才能慢慢恢复力气。别担心，坚持治疗会好起来的！"
  },
  {
    "id": 543,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日由同事搀扶步入诊室，神情焦躁。主诉‘口干得像着火，喝多少水都止不住，夜里起夜四五次’，病程约6周。既往体健，否认高血压、冠心病。查体：BMI 29.8 kg/m²，腰围102 cm；舌红少津，苔薄黄；脉滑数。随机指尖血糖13.4 mmol/L，空腹血糖8.1 mmol/L，HbA1c 7.2%。患者自述近两个月熬夜赶项目，每天喝3~4罐冰镇功能饮料‘提神’，并抱怨最近牙龈反复肿痛。今日室外37 ℃高温，候诊时一直拿冰镇矿泉水敷额头。",
    "reference_rule": {
      "condition": "2型糖尿病早期，热盛伤津证",
      "action": "推荐中成药：糖尿灵片（强推荐，证据等级：A）：一次 6片，一天 3次",
      "contraindication": null,
      "evidence": "③ 糖尿灵片（强推荐，证据等级：A）：一次 6片，一天 3次。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规门诊诊疗场景。作为急诊/门诊医生，聚焦快速鉴别诊断（排除糖尿病酮症酸中毒等高危状态）并启动基础治疗。重点关注：随机血糖13.4 mmol/L但生命体征稳定，无腹痛/深大呼吸等危象。\n\nStep 2: 临床解码 - ①代谢指标：随机血糖>11.1 mmol/L + HbA1c>6.5% 符合糖尿病诊断；②中医证候：口干多饮+舌红苔黄+脉滑数=热盛伤津；③行为风险：BMI 29.8+日饮3-4罐含糖功能饮料（隐式糖负荷超标）；④牙龈肿痛提示高血糖相关口腔感染。\n\nStep 3: 规则对齐与安全检查 - 指南condition'2型糖尿病早期，热盛伤津证'匹配患者代谢指标及中医证候。Contraindication为null，患者无肝肾功能异常记录，可安全使用糖尿灵片。\n\nStep 4: 决策生成 - 核心执行指南强推荐药物（糖尿灵片）。补充：需干预含糖饮料摄入（直接诱因），并处理牙龈感染（血糖控制干扰因素）。",
    "medical_order": "诊断：2型糖尿病（热盛伤津证）；牙龈炎。\n处理：\n1. 药物治疗：予糖尿灵片 6片/次 口服 3次/日\n2. 急查：尿常规（重点尿酮体）、血酮体、电解质\n3. 生活方式干预：立即停用含糖饮料，每日饮水<1.5L（常温白水为主）\n4. 口腔科会诊：评估牙龈感染\n5. 监测：指导家庭血糖监测（晨起空腹+三餐后2h），记录排尿次数\n6. 随访：3天后复诊血糖及症状变化",
    "patient_dialogue": "李师傅，您这口渴尿多的情况啊，就是血糖太高把身体水分'烤干'了——好比烧水壶一直开着大火，加再多水也赶不上蒸发。咱们分三步走：\n\n第一，得赶紧给身体'灭火'。这个糖尿灵片就像消防队，一次吃6片，一天3次，专门解决您这种上火型口干。但记住啊，那些功能饮料可不能再碰了！它们相当于往火堆里浇汽油，您越喝血糖越刹不住。口渴改喝凉白开，小口慢饮。\n\n第二，您这牙龈肿痛不是小事。高血糖会让伤口难愈合，明天一定要挂个口腔科，别让小炎症拖成大病。\n\n第三，咱们得当好侦察兵。给您个血糖仪，早晨起床、饭后两小时各扎手指测一次，把数字记本子上。下次复诊咱们看'战报'调整战术。\n\n您放心，这病发现得早，只要管住嘴迈开腿，血糖稳稳当当降下来，夜里就不用老跑厕所啦！"
  },
  {
    "id": 528,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁，出租车司机，近3个月体重下降4 kg，口渴多饮日饮3 L矿泉水，尿量明显增多，夜尿4-5次。自述‘嘴里总发黏，像含了糖浆’，晨起口苦明显，近两周大便黏滞、臭秽，每日2次，便后马桶壁挂残便难冲。今日午餐后2 h随机血糖12.8 mmol/L，HbA1c 7.4%。舌红胖大、苔黄厚腻，脉滑数。查体：BMI 28.6 kg/m²，腹围98 cm，血压128/82 mmHg。患者进门时拎着装剩半瓶凉茶的塑料瓶，抱怨‘最近天气闷热，车里空调坏了，更觉得胸口闷热’。无糖尿病家族史，既往无心脑血管病史，未用过降糖药。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肠道湿热证",
      "action": "推荐单验方：清热祛湿方（弱推荐，证据等级：C）：黄连、苍术、厚朴、枳壳、茵陈、佩兰、当归、薏苡仁、玄参、丹参",
      "contraindication": null,
      "evidence": "推荐的单验方：清热祛湿方（弱推荐，证据等级：C）：黄连、苍术、厚朴、枳壳、茵陈、佩兰、当归、薏苡仁、玄参、丹参。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为果断的门诊医生，我的关注重点在于快速建立鉴别诊断，排除危急重症（如糖尿病酮症酸中毒或心血管事件），并基于证据给出直接治疗指令。Step 2: 临床解码 (Clinical Decoding) - 患者关键信息包括：典型糖尿病症状（多饮、多尿、体重下降，随机血糖12.8 mmol/L和HbA1c 7.4%符合糖尿病诊断标准）；湿热证候（舌红胖大、苔黄厚腻、脉滑数、大便黏滞臭秽及马桶挂残便提示肠道湿热，结合口苦、胸闷热）；肥胖相关风险（BMI 28.6 kg/m²、腹围98 cm）。隐式线索：患者携带凉茶瓶及抱怨闷热，暗示不良生活习惯（如过度饮用冷饮），可能加重湿热。排除危急重症：无胸痛、呕吐或意识障碍，生命体征稳定（血压128/82 mmHg），HbA1c 7.4%表明慢性高血糖而非急性危机。鉴别诊断聚焦于2型糖尿病（无家族史支持非遗传性），排除1型糖尿病（无急性起病）或感染。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件“2型糖尿病早期，肠道湿热证”与患者临床表现高度匹配（血糖异常、湿热证候）。指南无禁忌症（contraindication为null），患者无药物过敏史、无心脑血管疾病，故清热祛湿方安全。强制检查：无药物相互作用风险（未用降糖药）。Step 4: 决策生成 (Decision Making) - 根据指南行动“推荐单验方：清热祛湿方（弱推荐，证据等级：C）”，生成决策：开具清热祛湿方，并补充生活方式干预以管理肥胖和血糖。",
    "medical_order": "诊断：2型糖尿病，肠道湿热证。予清热祛湿方：黄连10g、苍术10g、厚朴6g、枳壳6g、茵陈10g、佩兰10g、当归10g、薏苡仁15g、玄参10g、丹参10g，水煎服，每日1剂，分2次服，疗程4周。建议低糖低脂饮食，控制每日热量摄入；增加有氧运动，目标每日30分钟；监测空腹及餐后2小时血糖，每周记录；体重管理目标BMI降至<25 kg/m²。随访1个月后复查血糖、HbA1c及症状评估。",
    "patient_dialogue": "王师傅，您好！从您的症状和检查结果看，您得了2型糖尿病，简单说就是血糖偏高，身体处理糖分不太好了，所以您会觉得口渴、尿多、体重掉得快。另外，您嘴里发黏、口苦和大便黏糊糊的，是因为体内有‘湿热’，就像天气闷热时身体里也积了热气和湿气，不及时处理会让人更不舒服。我给您开个中药方子，里面有黄连、苍术这些药材，能帮您清热祛湿，让身体轻松些。同时，为了控制好血糖，您得调整生活习惯：做饭时少放糖和油，多吃青菜水果，别喝太多凉茶或甜饮料；每天抽空走走路，哪怕在车里休息时活动下腿脚；买个血糖仪自己测测血糖，早上空腹和饭后两小时各测一次，记在本子上。作为出租车司机，您工作辛苦，但健康最重要。坚持这些，慢慢就会好转的，下次来咱们看看效果怎么样。"
  },
  {
    "id": 514,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁，女性，身高160 cm，体重55 kg，BMI 21.5。主诉近半年反复胁肋胀满、饭后腹胀、大便溏而不爽，每日2-3次，伴情绪低落、常叹长气，夜间易醒。自述工作压力大，常靠甜食缓解焦虑；饮食偏咸，外卖为主，平均每日步数不足3000步。无烟酒史，月经规则但量少色暗。查体：舌质淡胖、边有齿痕，苔白腻，脉弦缓。随机血糖7.8 mmol/L，HbA1c 6.4%。患者担忧体重下降及情绪波动，希望医生帮她‘调一调’。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肝郁脾虚证。临床表现：胁肋胀满，腹胀，纳少，便溏不爽，情志抑郁，善太息，舌质淡胖、苔白或腻，脉弦缓。以女性为多，形体中等或偏瘦，可有焦虑、抑郁倾向",
      "action": "推荐方药：逍遥散（《太平惠民和剂局方》）（强推荐，证据等级：B），药物组成：当归、白芍、柴胡、茯苓、白术、甘草、生姜、薄荷",
      "contraindication": null,
      "evidence": "推荐方药：逍遥散（《太平惠民和剂局方》）（强推荐，证据等级：B），药物组成：当归、白芍、柴胡、茯苓、白术、甘草、生姜、薄荷。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于生活方式与风险干预场景。作为健康管理师，我的关注重点是识别患者隐式的不良习惯（如高糖高盐饮食、低体力活动），关联长期健康风险（如糖尿病进展、情绪障碍恶化），并用共情但坚定的语气提出非药物干预建议，以促进行为改变。\n\nStep 2: 临床解码 (Clinical Decoding): 从病例中提取并转化关键信息：患者主诉胁肋胀满、饭后腹胀、大便溏而不爽、情绪低落、善太息、夜间易醒，提示肝郁脾虚证（肝气郁结和脾虚湿困）；生活习惯包括高糖摄入（甜食缓解焦虑）、高盐饮食（外卖为主）、低活动量（每日步数<3000步），隐式线索为工作压力导致情绪性进食和久坐，增加胰岛素抵抗和心血管风险；查体舌淡胖齿痕苔白腻、脉弦缓，证实脾虚湿盛；实验室指标随机血糖7.8 mmol/L和HbA1c 6.4%符合糖尿病前期；月经量少色暗可能与肝郁血虚相关；BMI正常但担忧体重下降，反映情绪波动影响主观感受。整体风险：若不干预，可进展为2型糖尿病、代谢综合征或抑郁加重。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 患者症状（胁肋胀满、腹胀、便溏、情志抑郁、舌脉）完全匹配指南condition中的2型糖尿病早期肝郁脾虚证。指南contraindication为null，无禁忌；检查安全：逍遥散成分（当归、白芍等）无已知过敏或禁忌（病例未提及特殊病史），HbA1c 6.4%属于糖尿病前期，需优先生活方式干预，情绪低落需心理支持，无直接风险。\n\nStep 4: 决策生成 (Decision Making): 基于指南action（强推荐逍遥散），决策为处方中药以疏肝健脾，并强化非药物干预：针对不良习惯，提出低糖低盐饮食和增加活动建议，以控制血糖和改善症状；需随访监测指标。",
    "medical_order": "诊断：2型糖尿病前期（HbA1c 6.4%），肝郁脾虚证。\n治疗：予逍遥散口服，每日一剂，分两次服（药物组成：当归、白芍、柴胡、茯苓、白术、甘草、生姜、薄荷）。\n非药物干预：建议低盐饮食（每日钠摄入<2000mg）、低糖饮食（限制添加糖）、增加体力活动（每日步数目标≥8000步）、压力管理（如认知行为疗法）。\n监测：完善空腹血糖及餐后2小时血糖检测，每3个月复查HbA1c；记录饮食日记及活动日志；评估情绪状态（如PHQ-9量表）。\n随访：门诊随诊4周，评估症状改善及依从性。",
    "patient_dialogue": "王女士，我看了您的检查结果和症状，咱们一起来聊聊怎么调整。首先，您的血糖有点偏高，但还不算糖尿病，这是早期阶段，咱们现在干预完全来得及。您说的那些腹胀、情绪低落和睡眠问题，中医上叫‘肝郁脾虚’，就是压力大影响了消化和心情。\n\n我给您开个中药方子，叫逍遥散，它能帮您疏肝理气、健脾化湿，缓解那些不舒服的感觉。每天一包，分两次喝就行。\n\n更重要的是生活习惯的改变，这比药还关键！您提到爱吃甜食和咸外卖，这会让血糖更难控制，还可能加重腹胀。建议您做菜少放盐，咸菜、酱料这些也少吃；甜食换成水果或坚果，慢慢戒掉。为什么？因为高糖高盐会让身体负担加重，时间长了可能发展成糖尿病或高血压。另外，您每天走路不到3000步，太少了！咱们目标加到8000步，比如上下班多走楼梯或晚饭后散步。为什么？活动能改善消化、降血糖，还能让心情好起来。\n\n压力大时，试试深呼吸或找朋友聊聊，别光靠吃甜食。您别担心体重下降，现在BMI是正常的，只要咱们一起调整，情绪和身体都会好转。坚持4周后咱们再复查，我陪您一步步来，好吗？"
  },
  {
    "id": 578,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者52岁，出租车司机，今日因‘口干多饮3月，加重伴体重下降1周’来门诊。体型偏胖（BMI 29.4 kg/m²），腹型肥胖明显，平素嗜食肥甘，自述‘夜班靠甜饮料提神’。晨起咳嗽有痰、色白黏，常觉胸闷、头重如裹，舌淡胖、边有齿痕，苔白厚腻，脉滑。随机指尖血糖12.8 mmol/L，糖化血红蛋白 9.1%。无酮症酸中毒表现，血压 138/86 mmHg，余查体未见明显异常。患者同时抱怨近半月右耳偶有闷胀感，否认发热及听力下降。实验室：空腹血糖 9.7 mmol/L，TG 3.4 mmol/L，HDL-C 0.9 mmol/L，尿常规（-）。",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，痰浊",
      "action": "推荐单验方：五加苍耳降糖方（弱推荐，证据等级：C）：五加皮、苍耳子、茯苓、白术、陈皮、黄精、生甘草、三七粉",
      "contraindication": null,
      "evidence": "推荐的单验方：五加苍耳降糖方（弱推荐，证据等级：C）：五加皮、苍耳子、茯苓、白术、陈皮、黄精、生甘草、三七粉。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规门诊诊疗场景，患者因糖尿病相关症状就诊，无急性危急表现（如酮症酸中毒被排除）。作为果断的门诊医生，我的重点在于快速建立鉴别诊断，排除潜在危及生命的状况（如糖尿病酮症或心血管事件），并基于现有证据给出直接、可行的治疗指令。鉴别诊断需考虑2型糖尿病、代谢综合征及痰湿证候，排除其他内分泌紊乱或感染性疾病（如耳朵闷胀可能与压力或耳咽管功能相关）。\n\nStep 2: 临床解码 (Clinical Decoding)：患者52岁男性，出租车司机，提示久坐、不规律作息和不良饮食（嗜食肥甘、依赖甜饮料）等隐式风险因素。关键临床特征包括：口干多饮、体重下降（显性糖尿病症状）；BMI 29.4 kg/m²及腹型肥胖（肥胖相关代谢综合征）；晨起咳痰色白黏、胸闷、头重如裹（痰浊阻滞表现）；舌淡胖边齿痕、苔白厚腻、脉滑（典型痰湿内蕴体征）；实验室指标（随机血糖12.8 mmol/L、HbA1c 9.1%、TG 3.4 mmol/L、HDL-C 0.9 mmol/L）确认未控制的2型糖尿病伴血脂异常；右耳闷胀感（非特异性，可能源于压力或微循环障碍，但无发热或听力下降，暂不严重）。整体解码为‘2型糖尿病兼夹痰浊证’，核心问题是代谢紊乱和生活方式相关慢性病。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南条件‘2型糖尿病兼夹证，痰浊’与患者症状高度匹配（痰湿表现如咳痰、胸闷、舌苔厚腻）。动作‘推荐单验方：五加苍耳降糖方’适用，证据等级C（弱推荐）。指南中禁忌症为null，患者无急性并发症（如酮症酸中毒）、过敏史或药物相互作用风险（尿常规正常，血压轻度偏高但可控），因此该方案安全可行。\n\nStep 4: 决策生成 (Decision Making)：基于指南推荐，优先开具五加苍耳降糖方（五加皮、苍耳子、茯苓、白术、陈皮、黄精、生甘草、三七粉），同时整合基础管理（生活方式干预和监测），确保方案直接、高效。鉴于患者血脂异常和肥胖，辅以饮食运动指导；耳朵不适暂观察，若持续则转诊耳鼻喉科。",
    "medical_order": "诊断：2型糖尿病伴痰浊证、代谢综合征。治疗：1. 予五加苍耳降糖方（五加皮10g、苍耳子6g、茯苓15g、白术12g、陈皮9g、黄精15g、生甘草6g、三七粉3g冲服），每日一剂，水煎分两次服，疗程4周。2. 生活方式干预：低脂低糖饮食（限制甜饮料及高脂食物），增加有氧运动（每日≥30分钟）。3. 监测：空腹及餐后血糖每日监测，血脂、血压每周记录。4. 右耳闷胀感：暂予观察，若症状持续或加重，建议耳鼻喉科会诊。随访：1周后复诊评估血糖控制及症状改善。",
    "patient_dialogue": "王师傅，您好！看了您的检查结果，您这情况是得了糖尿病，还有点儿湿气重，所以会感觉口干、胸闷、咳嗽有痰，体重也掉了一些。别担心，这病能控制好。我给您开个中药方子，里面有几味药材，像茯苓、白术这些，能帮您降血糖、化痰湿，吃了会觉得舒服些。关键是，您平时开出租要改改习惯：少喝甜饮料，吃饭别太油腻，咸菜肥肉都少吃，多走走路或者抽空做做运动。为什么这么重要？因为这些习惯不改，血糖高了容易伤到心脏或肾，那就麻烦了。您说耳朵有点闷，可能跟熬夜压力大有关，先别太操心，注意休息就好；如果没好转，咱们再查查。咱们一起努力，下次复查时看看效果，好吗？"
  },
  {
    "id": 596,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者走进诊室时带着明显的黑眼圈，手里还攥着一杯刚买的冰美式。她一落座就叹气：'医生，我这两个月几乎天天凌晨两点才迷迷糊糊睡着，四点又醒，血糖也跟着飙，空腹老在9-10 mmol/L晃。'追问下去，她自述工作是做直播带货，晚上十点下播后习惯再吃一顿重口味夜宵——烧烤加麻辣小龙虾，'不然总觉得一天没过完'。她否认抽烟喝酒，但承认'脾气一点就着'，上周因物流延迟当场把耳机摔了。查体：BMI 28.4 kg/m²，腹围92 cm，舌边尖红、苔薄黄，脉弦数。今日空腹血糖9.7 mmol/L，HbA1c 8.1%。患者顺带抱怨昨晚小区楼下有人办丧事吹唢呐，'吵得我更是心烦睡不着'，却绝口未提任何音乐或放松方式。",
    "reference_rule": {
      "condition": "2型糖尿病肝郁化火失眠患者",
      "action": "五音疗法，角调音乐",
      "contraindication": null,
      "evidence": "角调音乐可改善 2型糖尿病肝郁化火失眠患者的睡眠质量，并降低空腹血糖。（弱推荐，证据等级：C）"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于生活方式与风险干预场景。作为健康管理师，我的关注重点是识别患者隐式的不良生活习惯（如昼夜节律紊乱、高脂高盐夜宵、情绪应激），关联其与长期健康风险（如糖尿病并发症、心血管事件），并以共情但坚定的语气提出非药物干预建议，强调行为改变的必要性。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：① 代谢指标：2型糖尿病（空腹血糖9.7 mmol/L，HbA1c 8.1%）、肥胖（BMI 28.4 kg/m²，腹围92 cm）；② 睡眠障碍：失眠表现为入睡困难（凌晨2点睡）及早醒（凌晨4点醒）；③ 肝郁化火证候：情绪易怒（摔耳机事件）、舌边尖红苔薄黄、脉弦数；④ 不良习惯：昼夜颠倒（直播工作至22:00后）、高脂高盐夜宵（烧烤及麻辣小龙虾）、缺乏放松活动（仅抱怨噪音，未提减压方式）；⑤ 隐式风险：睡眠剥夺加重胰岛素抵抗，情绪应激升高皮质醇，进一步恶化血糖控制，夜宵习惯促中心性肥胖。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 患者完全匹配指南Condition：'2型糖尿病肝郁化火失眠患者'（血糖异常+失眠+肝郁证候）。指南Contraindication为null，无需排除禁忌。证据等级虽弱（C级），但五音疗法安全性高，适合作为辅助干预。\n\nStep 4: 决策生成 (Decision Making) - 根据指南Action，核心决策为'五音疗法，角调音乐'。但需结合场景重点扩展：同步干预睡眠卫生（固定作息）、饮食调整（戒夜宵）及情绪管理（替代性放松），以形成综合方案。单一音乐疗法效果有限，需多维度行为调整才能显著改善血糖及睡眠。",
    "medical_order": "诊断：2型糖尿病伴失眠，肝郁化火证。\n干预：\n1. 非药物疗法：予五音疗法（角调音乐），每日睡前30分钟聆听。\n2. 生活方式调整：嘱规律作息（建议23:00前就寝）；戒除高脂高盐夜宵，改为低热量加餐（如无糖酸奶）；每日中等强度运动30分钟（如快走）。\n3. 监测：家庭血糖监测（空腹及餐后2小时血糖，每日1次）；记录睡眠日记（入睡/觉醒时间）。\n随访：2周后复诊，评估睡眠质量（PSQI量表）及血糖控制（复查空腹血糖、HbA1c）。",
    "patient_dialogue": "王女士啊，看到您这黑眼圈和手里的咖啡，我真能感受到您有多累！您这失眠和血糖高的问题，其实跟咱们的生活习惯紧紧挂钩——晚上直播完还吃烧烤小龙虾，身体就像24小时没熄火的机器，血糖能不'造反'吗？更别说您性子急，一生气血糖也跟着'上火'。\n\n咱们一步步来调整：第一，试试睡前听些安静的古筝或笛子曲子，手机APP就能找，每天半小时。这能帮您把紧绷的神经'松绑'，慢慢找回睡眠节奏。第二，夜宵咱得换换——把烧烤改成一杯温牛奶或几颗核桃，胃舒服了才能睡踏实。第三，尽量11点前躺下，刚开始可能不习惯，但坚持一周就会好很多。\n\n您别担心，这些改变不是为了'吃苦'，而是让身体少受罪。血糖稳了，您白天直播时精神头更足，脾气也能缓下来。咱们两周后一起看效果，您随时跟我聊聊进展，好吗？"
  },
  {
    "id": 525,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者王某，42岁，出租车司机，今日因“口干渴喜冷饮、喝水量明显增多2个月”来门诊。体形肥胖（BMI 30.4 kg/m²），腹围102 cm，诉腹胀、胸闷脘痞，饭后尤甚；晨起口苦，心烦易急，大便2～3日一行、干结如栗，小便色深黄。否认既往糖尿病史，父亲有2型糖尿病。查体：BP 128/82 mmHg，HR 88次/分，律齐；舌质红，舌体胖大，苔黄厚腻，脉弦滑。随机指尖血糖11.3 mmol/L，尿糖（++），尿酮体阴性。今日凌晨出车时因空调故障，车窗全开，自觉吸入大量灰尘，伴轻微咽痒咳嗽，已自服含片缓解。",
    "reference_rule": {
      "condition": "2型糖尿病早期，痰热互结证。临床表现：形体肥胖，腹胀，胸闷脘痞，口干口渴，喜冷饮，饮水量多，心烦口苦，大便干结，小便色黄，舌质红，舌体胖，苔黄腻，脉弦滑",
      "action": "推荐方药：小陷胸汤（《伤寒论》）（强推荐，证据等级：B），药物组成：黄连、半夏、瓜蒌",
      "contraindication": null,
      "evidence": "推荐方药：小陷胸汤（《伤寒论》）（强推荐，证据等级：B），药物组成：黄连、半夏、瓜蒌。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于常规诊断与治疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如糖尿病酮症酸中毒或急性感染），并基于现有证据给出直接、高效的治疗建议。\nStep 2: 临床解码 (Clinical Decoding) – 患者表现为典型糖尿病症状（口干渴、多饮2个月，随机血糖11.3 mmol/L 和尿糖++），结合肥胖（BMI 30.4 kg/m²）、腹围增大和家族史，诊断为2型糖尿病早期。症状细节（腹胀、胸闷脘痞饭后加重、口苦、心烦、大便干结、小便深黄）及舌脉（舌质红、舌体胖大、苔黄厚腻、脉弦滑）符合痰热互结证。吸入灰尘事件（咽痒咳嗽）已自愈，属无关急性事件，不影响主诊。关键隐式线索：职业（出租车司机）提示久坐、饮食不规律风险。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) – 患者症状与指南Condition（2型糖尿病早期，痰热互结证）高度匹配。指南无禁忌症（Contraindication为null），且尿酮体阴性排除急性并发症。安全检查：无药物过敏或交互风险（小陷胸汤成分安全），血压、心率正常，无急症触发转诊。\nStep 4: 决策生成 (Decision Making) – 依据指南Action（强推荐小陷胸汤，证据等级B），决策为处方小陷胸汤（黄连、半夏、瓜蒌），同时辅以生活方式干预和监测，以控制血糖和症状。吸入灰尘事件无需额外处理。",
    "medical_order": "诊断：2型糖尿病早期，痰热互结证。\n治疗：\n1. 予小陷胸汤（黄连6g, 半夏9g, 瓜蒌实30g）口服，每日一剂，水煎服，分两次服。\n2. 完善空腹血糖、糖化血红蛋白（HbA1c）及肝肾功能检查。\n3. 建议糖尿病饮食（低糖低脂，控制总热量），每日监测空腹及餐后2小时指尖血糖。\n4. 生活方式干预：增加体力活动（如每日步行30分钟），减重目标（BMI降至25 kg/m²以下）。\n5. 随访：2周后复诊评估症状及血糖控制情况。\n备注：吸入灰尘事件已缓解，无需特殊处理。",
    "patient_dialogue": "王先生，您好！看了您的检查结果和症状，我给您解释一下情况。您有早期的糖尿病，这跟您平时开车坐得多、体重有点偏高有关，再加上您父亲也有这个病，所以风险就更高了。现在您感觉口干、肚子胀、心烦这些，都是糖尿病引起的‘痰热’表现，中医上叫痰热互结证。别担心，咱们早发现早控制，问题不大。\n\n我给您开个中药方子，叫小陷胸汤，它就像个‘清火化痰’的帮手，每天煮一剂喝，分两次，能帮您缓解口干、腹胀这些不舒服。同时，您得注意饮食——少吃甜食和油腻的东西，比如饮料、油炸食品都尽量别碰，多吃蔬菜粗粮；再就是多动一动，比如抽空下车走走，每天半小时，帮助减减肥。这些做得好，血糖降下去，您就不会老觉得渴或烦了。\n\n另外，您自己买个血糖仪，每天早饭前和饭后两小时测一下血糖，记下来下次带给我看。两周后咱们再见面，看看效果怎么样。您开车时那个咳嗽已经没事了，不用管它。坚持住，咱们一起把身体调好！"
  },
  {
    "id": 534,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁，男性，身高172 cm，体重85 kg，BMI 28.7 kg/m²。主诉“口干多饮3个月，伴大便黏滞不爽”。平日久坐少动，加班频繁，喜食辛辣外卖。今日空腹血糖7.2 mmol/L，HbA1c 6.6%。舌红苔黄腻，脉滑数；腹微膨，无压痛。自述近两周排便后厕纸常带黄腻黏液，肛门灼热感明显。无酮症酸中毒表现，血压128/82 mmHg，其余查体未见明显异常。患者担心需不需要立刻打胰岛素，并随口提到“昨晚暴雨赶项目，只睡了4小时”。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肠道湿热证",
      "action": "糖四针（弱推荐，证据等级：C）：取穴包括丰隆、地机、养老及曲池，消毒处理后，使用毫针深刺，进针 1~2寸，以患者有触电感为宜，随后提插 3~5分钟，留针 30分钟，每 15分钟提插 1次，5次/周",
      "contraindication": null,
      "evidence": "推荐的其他疗法：糖四针（弱推荐，证据等级：C）：取穴包括丰隆、地机、养老及曲池，消毒处理后，使用毫针深刺，进针 1~2寸，以患者有触电感为宜，随后提插 3~5分钟，留针 30分钟，每 15分钟提插 1次，5次/周。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于常规诊断与治疗场景，作为果断的门诊医生，我的关注重点在于快速建立鉴别诊断，排除危急重症，并给出直接、高效的诊疗指令。需优先排除糖尿病酮症酸中毒等急性并发症，基于患者症状和指南匹配，直接输出治疗方案。\n\n**Step 2: 临床解码 (Clinical Decoding)**：从病例提取关键信息：主诉口干多饮3个月、空腹血糖7.2 mmol/L和HbA1c 6.6%符合2型糖尿病早期诊断（HbA1c ≥6.5%为糖尿病阈值）。伴大便黏滞不爽、肛门灼热感及排便带黄腻黏液，结合舌红苔黄腻、脉滑数，明确中医证候为肠道湿热证。BMI 28.7 kg/m²提示超重，隐式线索包括久坐少动、辛辣饮食、加班频繁和睡眠不足（仅4小时），这些是血糖控制不良和肠道症状加重的风险因素。排除危急重症：无酮症酸中毒、血压正常、腹无压痛，表明无急性并发症。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南Condition为'2型糖尿病早期，肠道湿热证'，与病例解码结果完全匹配。Contraindication为null，无禁忌症，安全检查通过。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南Action，优先推荐'糖四针'针灸治疗（弱推荐，证据等级C），作为核心干预。同时，结合患者超重和生活方式风险，补充生活方式干预建议以强化整体管理。决策包括：启动针灸疗程，教育饮食运动调整，安排随访监测。",
    "medical_order": "诊断：2型糖尿病早期，肠道湿热证。\n\n治疗：\n1. 予糖四针治疗：取穴丰隆、地机、养老、曲池，消毒后毫针深刺1~2寸，以触电感为度，提插3~5分钟，留针30分钟，每15分钟提插1次，频率5次/周。\n2. 建议生活方式干预：低脂低糖饮食，避免辛辣刺激性食物；增加体力活动，目标每日中等强度运动30分钟；减重目标5~10%。\n\n监测：复查空腹血糖和HbA1c，3个月后随访评估。\n\n注意事项：当前无需胰岛素治疗，无急性并发症指征。",
    "patient_dialogue": "先生，别担心，您的情况不算严重，还不需要打胰岛素。检查结果显示是早期糖尿病，再加上您说的口干和大便问题，我们中医上叫'肠道湿热'。我会给您安排一个针灸治疗，专门针对这个的，叫'糖四针'——就是在几个穴位扎针，帮助调节血糖和改善肠道不适，比如减轻肛门灼热感和大便黏腻。扎针时可能会有点麻麻的感觉，但一般不会疼，每周做5次，坚持一段时间看看效果。\n\n另外，您的生活习惯很重要：咱得少吃点外卖和辛辣食物，这些东西容易加重症状；多动一动，比如每天散步半小时，减点体重对控制血糖很有帮助；还有，尽量保证睡眠，熬夜加班会让血糖更难控制。如果您配合好，血糖很可能就稳定下来，避免恶化。咱们先做针灸，3个月后复查血糖，我再看看进展。加油，您能做到的！"
  },
  {
    "id": 550,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近半年出现口渴多饮、夜尿3-4次，伴乏力、腰膝酸软，体重下降约4 kg。自述既往体健，无高血压及冠心病史，父亲有2型糖尿病。查体：BMI 26.8 kg/m²，腰围96 cm，舌质偏红、少津，苔薄白，脉细数。随机血糖13.7 mmol/L，HbA1c 8.4%，尿常规提示尿糖（++），其余未见异常。患者为长途货车司机，常昼夜颠倒，饮食不规律，喜食辛辣重口。今日门诊希望‘用中药调理’，未提及任何具体方药请求。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证，偏于肾者",
      "action": "推荐方药：宜选参芪地黄汤",
      "contraindication": null,
      "evidence": "偏于肾者，宜选参芪地黄汤。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规门诊诊疗场景，我的关注重点是快速建立鉴别诊断，排除危急重症，并给出直接、高效的治疗指令。这包括确认糖尿病诊断、评估无急性并发症（如酮症酸中毒）风险，并基于患者诉求（希望中药调理）制定初步方案。Step 2: 临床解码 (Clinical Decoding) - 患者症状（口渴多饮、夜尿增多、乏力、腰膝酸软、体重下降）和化验结果（随机血糖13.7 mmol/L、HbA1c 8.4%、尿糖++）明确指示2型糖尿病中期。查体BMI 26.8 kg/m²和腰围96 cm提示超重和中心性肥胖，舌质偏红少津、脉细数支持气阴两虚证（阴虚内热为主），而夜尿和腰膝酸软突出肾虚特征。隐式线索包括不良生活方式（昼夜颠倒、饮食不规律、喜辛辣重口），可能加剧代谢紊乱和阴虚证；家族史（父亲糖尿病）增加遗传易感性；当前无高血压或冠心病，排除合并症风险。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition为‘2型糖尿病中期，气阴两虚证，偏于肾者’，与患者临床特征高度匹配（症状、舌脉指向肾虚）。contraindication为null，无禁忌症（如无药物过敏史或急性并发症），确保用药安全。Step 4: 决策生成 (Decision Making) - 根据指南action，推荐参芪地黄汤作为核心中药治疗，同时整合生活方式干预和监测计划，以快速控制病情。",
    "medical_order": "诊断：2型糖尿病中期，气阴两虚证（偏于肾者）。建议：予参芪地黄汤口服，每日一剂；控制糖尿病饮食（低脂、低糖），避免辛辣刺激食物；调整作息规律，减少昼夜颠倒；监测空腹血糖、餐后2小时血糖每周2次。随访：1个月后复查HbA1c、尿常规及体重变化。排除危急重症：无酮症酸中毒或高渗状态指征，门诊处理即可。",
    "patient_dialogue": "张师傅，您好！我看您最近总口渴、晚上起夜多，还觉得累、腰酸，体重也掉了些，这确实是糖尿病的表现，中医上说是‘气阴两虚’，尤其肾虚为主。您父亲有这个病，加上您开车作息乱、吃得太辣太咸，这些都容易让血糖高起来。别担心，咱们现在就能开始调理——我建议您用个中药方子叫参芪地黄汤，它能补气养阴、强腰补肾，帮您缓解夜尿和乏力。同时，您的工作辛苦，但尽量调整下：晚上睡足觉，少熬夜；吃东西呢，做菜少放盐和油，别吃咸菜辣菜，多吃点清淡的蔬菜水果。如果不改这些习惯，血糖可能更难控制，还容易累出其他问题。您每周测两次血糖，记下来，下个月咱们再查查看效果。只要配合好，一定能稳住的，咱们一起努力！"
  },
  {
    "id": 519,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近3个月口渴明显，每日饮水量增至3 000 ml，夜尿2-3次；体重下降4 kg但腹型肥胖仍存（BMI 28.7 kg/m²，腰围102 cm）。今日空腹血糖7.9 mmol/L，餐后2 h血糖13.4 mmol/L，HbA1c 7.2%。舌质红、苔黄厚腻，脉滑数。自述加班时常以奶茶、炸鸡夜宵“续命”，睡眠仅5 h，几乎无运动。无酮症史，血压128/82 mmHg，血脂示TG 3.1 mmol/L。患者担心长期服药伤肾，希望“先试试中药调理”。",
    "reference_rule": {
      "condition": "2型糖尿病早期，痰热互结证",
      "action": "推荐单验方：益糖康（强推荐，证据等级：A）：黄芪、党参、白术、茯苓、甘草、黄连、黄柏、黄精、五味子、丹参、三七、大黄、葛根",
      "contraindication": null,
      "evidence": "推荐的单验方：益糖康（强推荐，证据等级：A）：黄芪、党参、白术、茯苓、甘草、黄连、黄柏、黄精、五味子、丹参、三七、大黄、葛根。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于常规诊断与治疗场景，对应果断的急诊/门诊医生角色。我将快速建立鉴别诊断（排除危急重症如糖尿病酮症酸中毒），重点关注患者主诉和实验室指标，以给出直接、高效的诊疗指令。\nStep 2: 临床解码 (Clinical Decoding) – 患者典型症状（多饮3000 ml/d、夜尿、体重下降）和实验室检查（空腹血糖7.9 mmol/L、餐后2h血糖13.4 mmol/L、HbA1c 7.2%）明确符合2型糖尿病早期诊断。中医证候（舌质红、苔黄厚腻、脉滑数）提示痰热互结证。隐式线索包括：腹型肥胖（BMI 28.7 kg/m²、腰围102 cm）和高TG（3.1 mmol/L）指向代谢综合征；不良生活习惯（奶茶、炸鸡夜宵、睡眠5 h、无运动）加剧胰岛素抵抗；患者担忧伤肾提示依从性问题。排除危急重症：无酮症史、血压正常（128/82 mmHg），无急性并发症风险。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) – 患者情况与指南condition '2型糖尿病早期，痰热互结证'高度匹配。指南contraindication为null，无禁忌症；证据支持强推荐单验方益糖康（证据等级A）。安全检查：无药物相互作用或急性风险（如酮症），但需监测血脂异常（TG 3.1 mmol/L）和潜在心血管风险。\nStep 4: 决策生成 (Decision Making) – 根据指南action，核心决策为处方益糖康单验方。同时，整合患者担忧和生活习惯，强化生活方式干预建议（饮食、运动、睡眠），以全面控制血糖和预防并发症。",
    "medical_order": "诊断：2型糖尿病早期，痰热互结证。予益糖康单验方（黄芪、党参、白术、茯苓、甘草、黄连、黄柏、黄精、五味子、丹参、三七、大黄、葛根），每日一剂口服。建议生活方式干预：低脂低糖饮食（限制奶茶、炸鸡等高热量食物），规律有氧运动（如散步30分钟/日），保证睡眠≥7小时。监测：每周测空腹及餐后2h血糖，2周后复查HbA1c、血脂、肾功能、血压。2周后复诊评估疗效。",
    "patient_dialogue": "我明白您担心长期吃药会伤肾，这是个常见顾虑。好消息是，咱们可以先试试中药调理，给您开一个叫益糖康的方子，它用天然草药帮助调节血糖，改善口渴和夜尿问题，而且对肾脏很温和。不过，光靠中药还不够——您得配合改变生活习惯。比如，别再靠奶茶和炸鸡'续命'了，这些会让血糖更难控制；每天抽半小时散散步，睡够7小时，身体才能更好恢复。这些调整很关键，因为糖尿病管理得靠整体配合，否则血糖容易波动。别担心，咱们一步步来，2周后一起看看效果，好吗？"
  },
  {
    "id": 579,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日空腹血糖8.9 mmol/L，糖化血红蛋白8.1%，自述近3个月体重又涨3 kg。夜班收车后常感疲惫，回家先喝两瓶啤酒再睡，夜宵偏爱炸酱面加卤蛋。平时几乎不运动，‘方向盘攥一天，哪还有力气锻炼’。今日候诊时不停刷短视频，笑称‘等叫号也是休息’。顺带抱怨左足跟干裂，‘天干物燥，抹啥油都不管用’。",
    "reference_rule": {
      "condition": "2型糖尿病患者",
      "action": "推荐太极拳运动，其中以二十四式太极拳为最优",
      "contraindication": null,
      "evidence": "太极拳可显著降低 2型糖尿病患者的空腹血糖、糖化血红蛋白，其中以二十四式太极拳为最优，同时太极拳运动亦可改善糖脂代谢，提高生活质量。（强推荐，证据等级：A）"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于生活方式与风险干预场景。关注重点在于识别患者隐式的不良生活习惯，关联这些习惯导致的长期健康风险（如糖尿病并发症），并以共情但坚定的语气提出非药物干预建议。\nStep 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息并转化为医学术语：空腹血糖8.9 mmol/L和糖化血红蛋白8.1%提示2型糖尿病控制不佳（空腹血糖>7.0 mmol/L和HbA1c>7.0%为未达标）；体重增加3kg表明体重管理失败，可能加重胰岛素抵抗；不良习惯包括夜班后酒精摄入（啤酒两瓶，约20-30g酒精/天）、高热量高碳水化合物夜宵（炸酱面加卤蛋，可能导致热量过剩和血糖波动）、久坐行为（工作相关缺乏运动，候诊时刷短视频反映静态生活方式）；左足跟干裂可能为糖尿病相关皮肤干燥或早期神经病变表现。隐式线索包括生活压力大（夜班疲惫）、健康意识薄弱（笑称刷短视频是休息），这些均增加心血管和代谢风险。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件为‘2型糖尿病患者’，病例中血糖和HbA1c异常符合该条件。行动推荐二十四式太极拳，无禁忌症（contraindication为null）。安全检查：患者无急性运动禁忌（如未提及心脏病或关节问题），但左足跟干裂需注意运动安全以防皮肤损伤；酒精摄入可能影响运动依从性，需评估。\nStep 4: 决策生成 (Decision Making) - 根据指南行动，核心决策为推荐二十四式太极拳；同时，结合场景识别其他风险，扩展为综合生活方式干预：包括太极拳运动、限制酒精、调整饮食、增加日常活动及足部护理，以改善血糖控制、体重和代谢指标。",
    "medical_order": "诊断：2型糖尿病控制不佳（空腹血糖8.9 mmol/L，HbA1c 8.1%，体重增加3 kg）。干预：1. 推荐二十四式太极拳运动，每日30分钟，每周5次。2. 限制酒精摄入，每日不超过1标准单位（相当于啤酒350ml），避免夜班后饮酒。3. 调整饮食：减少高热量夜宵，以低升糖指数食物替代（如全麦面包加蔬菜）；控制总热量摄入，目标BMI<25 kg/m²。4. 增加日常身体活动：建议工作间隙短时步行（如每2小时活动5分钟），减少静态行为。5. 足部护理：每日使用尿素基保湿霜涂抹左足跟，监测皮肤变化以防感染。6. 定期监测：复查空腹血糖和HbA1c（每3个月），体重每周记录。",
    "patient_dialogue": "王先生，看到您最近的血糖和体重数据，我有点担心啊——这些数字说明咱们的糖尿病控制得不够理想，长期下去可能伤到心脏或脚上的神经。别急，咱们一起调整几个小习惯就行。首先，我推荐您试试二十四式太极拳，动作很柔和，您下班累了也能做，每天半小时就行，它能帮您降血糖、放松心情，还不会太累。另外，您说夜班后喝两瓶啤酒解乏，但酒精会让血糖忽高忽低，咱们换成一杯温水或花草茶，同样能舒缓疲劳；夜宵那个炸酱面，热量高，容易让体重上去，改成吃点蔬菜沙拉或全麦面包，既饱腹又健康。方向盘攥一天确实辛苦，但抽空走走动动，比如等叫号时别坐着刷手机，起来溜达几步，积少成多嘛。您的脚后跟干裂，可能是糖尿病引起的皮肤干，每天抹点润肤霜保护好，别让它裂开感染了。这些小改变，咱们一步步来，您的身体会感谢您的！"
  },
  {
    "id": 598,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者58岁，男性，物流长途司机。2型糖尿病病史12年，近半年出现双足麻木、刺痛，夜间加重。既往：高血压8年，血脂异常，1年前因‘急性下壁心肌梗死’植入支架1枚。无酮症史。目前用药：二甲双胍1.0 g bid、达格列净10 mg qd、阿托伐他汀20 mg qn、贝那普利10 mg qd、阿司匹林100 mg qd。实验室（本周外院）：FPG 8.7 mmol/L，HbA1c 8.1%，TG 2.6 mmol/L，LDL-C 2.1 mmol/L，eGFR 72 mL·min⁻¹·1.73 m⁻²，尿微量白蛋白/肌酐 42 mg/g；双下肢动脉彩超示右侧胫后动脉峰值流速降低，足背动脉PI 0.72。舌质暗红、边有瘀斑，舌下络脉青紫粗长，苔薄白；脉细涩。患者主诉：‘最近货多，跑贵州山路，脚像踩棉花，夜里抽着疼，得靠布洛芬顶。’查体：右足背动脉搏动减弱，10 g尼龙丝试验3点缺失，振动觉踝部减退。今日随机血糖11.3 mmol/L，BP 136/84 mmHg，BMI 28.4 kg/m²，腰围102 cm。患者询问：‘除了止痛药，还有别的办法让脚不这么遭罪吗？’",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，血瘀",
      "action": "推荐中成药：芪蛭降糖胶囊（强推荐，证据等级：B）：一次 5粒，一日 3次",
      "contraindication": null,
      "evidence": "① 芪蛭降糖胶囊（强推荐，证据等级：B）：一次 5粒，一日 3次。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于复杂合并症治疗场景，涉及糖尿病周围神经病变、心血管疾病及代谢综合征。重点关注药物相互作用与共病风险。Step 2: 临床解码 - 关键问题：①血糖控制不佳（HbA1c 8.1%）诱发DPN症状（尼龙丝试验异常+振动觉减退）②周围血管病变（胫后动脉流速降低）③心血管高危（心梗支架术后）④血瘀证候（舌脉征象+足部症状夜间加重）。隐式风险：达格列净潜在截肢风险+布洛芬的肾损伤风险。Step 3: 规则对齐 - 指南条件'2型糖尿病兼夹证，血瘀'与患者舌脉高度匹配。无绝对禁忌证，但需警惕：①芪蛭降糖胶囊中水蛭成分与阿司匹林联用可能增加出血风险 ②患者eGFR 72 mL/min需监测肾功能。Step 4: 决策生成 - 在指南强推荐基础上，整合多系统管理：加用芪蛭降糖胶囊改善血瘀，同步升级神经痛治疗并优化血糖方案，优先规避药物相互作用风险。",
    "medical_order": "1. 药物治疗：\n   - 加用芪蛭降糖胶囊 5粒 po tid\n   - 停用布洛芬，改用普瑞巴林 75 mg po qn（根据疼痛缓解情况1周后增至150 mg qn）\n   - 加用甘精胰岛素 10U sc qn（根据空腹血糖调整，目标FPG 4.4-7.0 mmol/L）\n2. 监测调整：\n   - 每周监测空腹/餐后血糖谱（轮测）\n   - 每月复查肾功能、电解质\n   - 3月后复查HbA1c、尿微量白蛋白/肌酐、下肢动脉彩超\n3. 非药物干预：\n   - 糖尿病足防护教育（含尼龙丝自测法）\n   - 限制连续驾驶≤2小时/次",
    "patient_dialogue": "张师傅，您这脚麻脚疼的事儿，咱们得三管齐下解决：\n1. 给您加个活血通络的中成药（芪蛭胶囊），一天三次饭后来吃，专门改善脚上血液循环——但要注意如果牙龈出血或者大便发黑得立刻告诉我，因为您同时在吃阿司匹林，咱们得防着点出血风险。\n2. 布洛芬咱不能长期用，伤肾！换成专治神经痛的药（普瑞巴林），晚上吃一次，慢慢把那种'抽着疼'的感觉压下去，刚开始可能会有点头晕，适应几天就好。\n3. 血糖控制还得加把劲，晚上给您添一针胰岛素，就像您卡车装个定速巡航，让血糖更平稳些，这对脚神经修复特别重要。\n\n关键您跑长途时：\n- 每开2小时务必停车，做做勾脚尖动作（示范），促进脚部血流\n- 每晚拿手电筒照脚底，找找有没有小破口或水泡\n您这方向盘上的生计重要，但脚底板更是本钱啊！咱们先这样调整，一个月后看看脚上'踩棉花'的感觉能不能轻点。"
  },
  {
    "id": 561,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近3个月出现口渴多饮、夜尿增多，伴乏力、午后潮热、手心汗出，自述夜间小腿抽筋，睡眠浅易醒。查体：BMI 28.4 kg/m²，腰围 93 cm，面色少华，舌淡红、边有齿痕，苔薄白，脉细数。空腹血糖 8.7 mmol/L，HbA1c 8.1%，2 h-OGTT 14.2 mmol/L；肝肾功能正常，尿微量白蛋白 18 mg/L。既往高血压 8 年，口服缬沙坦 80 mg qd，血压控制可；无冠心病及脑血管病史。患者今日由女儿陪同复诊，女儿提到母亲最近常忘事，情绪易低落，担心‘老年痴呆’。今日门诊室温 26 ℃，患者仍穿两件长袖，自述怕冷又怕热。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证",
      "action": "针刺疗法（弱推荐，证据等级：C）：取穴：百会、四神聪、印堂、内关（双）、神门（双）、太乙（双）、水道（双）、关元、足三里（双）、三阴交（双），平补平泻，留针 30分钟，每日 1次",
      "contraindication": null,
      "evidence": "推荐的其他疗法：针刺疗法（弱推荐，证据等级：C）：取穴：百会、四神聪、印堂、内关（双）、神门（双）、太乙（双）、水道（双）、关元、足三里（双）、三阴交（双），平补平泻，留针 30分钟，每日 1次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规门诊诊疗场景，作为果断的门诊医生，我的关注重点在于快速建立鉴别诊断（如排除糖尿病酮症酸中毒或急性心力衰竭等危急重症），并基于现有证据给出直接诊疗指令。Step 2: 临床解码 (Clinical Decoding)：从病例中提取关键信息：患者有典型糖尿病症状（口渴多饮、夜尿增多）和中医气阴两虚证表现（乏力、午后潮热、手心汗出、舌淡红边有齿痕、脉细数），结合实验室数据（空腹血糖8.7 mmol/L、HbA1c 8.1%、2h-OGTT 14.2 mmol/L）确诊2型糖尿病中期；其他隐式线索包括肥胖（BMI 28.4 kg/m²、腰围93 cm）提示代谢综合征风险，尿微量白蛋白18 mg/L指示早期糖尿病肾病，自主神经功能紊乱（怕冷又怕热）、睡眠障碍和小腿抽筋可能源于电解质失衡或神经病变；女儿提到的记忆减退和情绪低落需警惕轻度认知障碍或抑郁，但无急性神经症状。Step 3: 规则对齐与安全检查 (Alignment & Safety)：指南condition为‘2型糖尿病中期，气阴两虚证’，完全匹配患者情况；action推荐针刺疗法（弱推荐），contraindication为null，故无绝对禁忌。强制安全检查确认：患者肝肾功能正常、无针刺禁忌症（如皮肤破损或出血倾向），缬沙坦无已知药物相互作用，但需监测血压和血糖波动以防低血糖或体位性低血压。Step 4: 决策生成 (Decision Making)：基于指南action，优先实施针刺疗法以改善症状；同时，考虑到血糖控制不佳（HbA1c >7%）和合并症，需强化糖尿病管理（如添加二甲双胍）并评估认知功能，确保安全优先。",
    "medical_order": "诊断：1. 2型糖尿病中期，气阴两虚证；2. 高血压；3. 肥胖（BMI 28.4 kg/m²）；4. 轻度白蛋白尿（18 mg/L）。治疗：1. 针刺治疗：取穴百会、四神聪、印堂、内关（双）、神门（双）、太乙（双）、水道（双）、关元、足三里（双）、三阴交（双），平补平泻，留针30分钟，每日1次，连续14天；2. 糖尿病管理：予二甲双胍500mg bid po，监测空腹血糖及HbA1c（目标<7%）；3. 高血压管理：继续缬沙坦80mg qd，监测血压（目标<140/90 mmHg）；4. 生活方式干预：低盐低糖饮食，每日钠摄入<2g，碳水化合物控制；每周有氧运动≥150分钟；减重目标5%；5. 辅助检查：完善电解质（关注钙、镁）、甲状腺功能、MMSE筛查认知功能；复查尿微量白蛋白/肌酐比。随访：2周后门诊复诊。",
    "patient_dialogue": "阿姨，您好！从检查结果看，您有糖尿病，血糖偏高一些，这解释了您平时口渴、夜里上厕所多，还有疲劳、出汗这些不舒服。别担心，咱们今天就来处理。首先，我建议您试试针灸治疗，就是在头上、手上和脚上扎几个小针，能帮您缓解乏力、潮热和睡眠问题，每天一次，坚持两周看看效果。同时，考虑到血糖控制还不够理想，我会给您加一种叫二甲双胍的药，每天吃两次，这能帮您稳定血糖，减少并发症风险——如果不控制好，长期可能会伤到肾或神经。您的高血压药缬沙坦继续吃就好，血压维持得不错。生活上呢，咱们得调整一下：做菜时少放点盐和糖，咸菜、甜食尽量不吃；每天走走路或做点轻运动，比如散步30分钟，帮助减减肥，这对改善腿抽筋和怕冷怕热都有好处。女儿提到您有时忘事儿、心情不好，这可能和糖尿病有关，咱们安排个简单测试查一查，别太紧张，大多数情况都能调理好的。记住，这些小改变能大大提升您的生活质量，坚持下去，我陪您一起努力！"
  },
  {
    "id": 549,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近半年出现明显口渴多饮、乏力伴体重下降4 kg，自述夜尿3-4次，夜间盗汗，午后低热37.4 ℃。查体：身高158 cm，体重65 kg，BMI 26 kg/m²；血压128/78 mmHg，心率88次/分，律齐。舌质偏红、边有齿痕，苔薄白少津；脉细数。空腹血糖8.9 mmol/L，HbA1c 8.1%，尿常规示尿糖（++），尿酮体阴性；肝肾功能、电解质正常。无糖尿病家族史，无烟酒嗜好，职业为小学语文教师，近期因期末复习加班熬夜较多。患者担心西药副作用，主动询问是否有中药调理方案。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证",
      "action": "推荐中成药：玉泉胶囊（强推荐，证据等级：A）：0.6 g/粒，一次 4粒，一日 4次",
      "contraindication": null,
      "evidence": "（1）玉泉胶囊（强推荐，证据等级：A）：0.6 g/粒，一次 4粒，一日 4次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除糖尿病相关危急重症（如酮症酸中毒或急性感染），并基于病史和检查结果给出直接的治疗方案。\nStep 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者症状（口渴多饮、乏力、体重下降、夜尿、盗汗、午后低热）结合空腹血糖8.9 mmol/L、HbA1c 8.1%、尿糖（++），确诊为2型糖尿病；中医证候（舌质偏红、边有齿痕、苔薄白少津、脉细数）支持气阴两虚证；BMI 26（超重）和熬夜史提示可逆风险因素；尿酮体阴性排除急性并发症；肝肾功能正常确保用药安全。隐式线索包括：盗汗和低热可能源于血糖控制不佳或轻微感染，但无其他证据支持危重症；患者偏好中药，需优先考虑非西药方案。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 解码信息与指南 Condition \"2型糖尿病中期，气阴两虚证\" 高度匹配：糖尿病确诊（HbA1c >6.5%），中医症状相符。指南 Contraindication 为 null，患者无药物过敏史（病例未提及，假设无）、肝肾功能正常，无玉泉胶囊禁忌症，证据等级A表明安全可靠。\nStep 4: 决策生成 (Decision Making) - 根据指南 Action，推荐玉泉胶囊作为核心治疗；同时整合生活干预（针对BMI超重和熬夜），以优化血糖控制。排除危急重症（无酮症或感染迹象），无需转诊。",
    "medical_order": "诊断：2型糖尿病，气阴两虚证。\n治疗计划：\n1. 予玉泉胶囊口服，0.6 g/粒，一次4粒，一日4次。\n2. 生活方式干预：建议低糖低碳水化合物饮食、规律运动（每日30分钟中等强度活动）、避免熬夜。\n3. 监测指导：家庭血糖监测每周2-3次（空腹及餐后2小时），记录日志。\n4. 随访安排：1月后复诊，复查空腹血糖、HbA1c、尿常规。",
    "patient_dialogue": "王老师，您好！从您的症状和检查结果来看，您这是得了糖尿病，中医上叫‘气阴两虚’，这就是为什么您老觉得口渴、累、晚上出汗还瘦了的原因。别太担心，咱们有个很安全的中药方案——玉泉胶囊，每天吃四次，每次四粒，它能帮您调理身体、改善这些不舒服的感觉，而且副作用很小。同时，生活上得注意几点：吃饭时少吃甜食和米饭面条，多吃点蔬菜；每天抽空散散步或做做操，30分钟左右；晚上尽量别熬夜了，早点休息。我会教您怎么用血糖仪测血糖，回家后每周测两三次，记在本子上，下次复诊时带来我们看看效果。这样坚持下来，您的症状会慢慢好转的，放心！"
  },
  {
    "id": 551,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者，女，58岁，商场保洁员。近半年自觉“活动后心慌、气不够”，伴明显口干、夜间需起床饮水2次，体重下降约3 kg。无胸痛、无下肢浮肿。既往高血压8年，最高155/92 mmHg，自服缬沙坦80 mg qd，血压控制尚可；否认冠心病、脑卒中。母亲有2型糖尿病。查体：BMI 27.4 kg/m²，腰围92 cm；BP 138/86 mmHg，HR 96次/分，律齐；双肺清；舌淡红偏干、边有齿痕，苔薄少津；脉细数无力。随机血糖13.8 mmol/L，空腹静脉血糖8.9 mmol/L，HbA1c 8.1%；TC 5.7 mmol/L，LDL-C 3.4 mmol/L；尿常规阴性。今日因“天气闷热后心慌加重”来门诊，希望查明原因并调整用药。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证，以心肺两虚为主者",
      "action": "推荐方药：宜选生脉散",
      "contraindication": null,
      "evidence": "加减：心肺两虚为主者，宜选生脉散；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景。作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如急性冠脉综合征或心衰），并给出最直接的诊疗指令，避免延误。\nStep 2: 临床解码 (Clinical Decoding)：从病例中提取关键信息并转化为医学术语。患者主诉活动后心悸、呼吸困难，伴口干、多饮、体重减轻3kg，提示未控制的代谢紊乱；查体显示超重（BMI 27.4 kg/m²）、中心性肥胖（腰围92 cm）、心动过速（HR 96次/分），以及中医体征舌淡红偏干、边有齿痕、苔薄少津、脉细数无力，符合气阴两虚证；实验室结果显示随机血糖13.8 mmol/L、空腹血糖8.9 mmol/L、HbA1c 8.1%，确诊2型糖尿病（中期），血脂异常（TC 5.7 mmol/L，LDL-C 3.4 mmol/L）；隐式线索包括高血压控制欠佳（BP 138/86 mmHg稍高于目标）、家族史（母亲糖尿病）增加风险，以及天气闷热加重症状，可能因高血糖导致脱水或交感兴奋。鉴别诊断：排除急性冠脉综合征（无胸痛）、心衰（无下肢浮肿）和肺部疾病（双肺清），核心诊断为2型糖尿病伴气阴两虚证，以心肺两虚为主。\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：将解码信息与指南Condition '2型糖尿病中期，气阴两虚证，以心肺两虚为主者' 匹配，患者符合所有特征（如心肺症状突出）。强制检查禁忌症（Contraindication为null），无已知风险；安全优先级确保：无药物相互作用（缬沙坦与生脉散无冲突），无急性威胁。\nStep 4: 决策生成 (Decision Making)：根据指南Action '推荐方药：宜选生脉散'，生成直接决策：确诊2型糖尿病，处方生脉散；附加决策包括生活方式干预（饮食运动）、血糖监测和血压优化，以预防并发症。",
    "medical_order": "诊断：2型糖尿病；中医诊断：气阴两虚证（心肺两虚为主）。治疗：予生脉散口服，每日1剂；生活方式建议：低盐低脂饮食、适量有氧运动、控制体重。监测：完善空腹血糖和HbA1c每3月复查；血压监测每周2次，维持目标<130/80 mmHg；继续缬沙坦80 mg qd，评估血压控制。教育：糖尿病自我管理培训，包括血糖自测和症状识别。",
    "patient_dialogue": "阿姨，您好！我是您的医生。检查结果出来了，您这是得了糖尿病，主要症状像心慌、气短、口干，都是因为血糖高了，身体有点虚。别担心，咱们能控制好。我给您开一种中药，叫生脉散，它能帮您补补气血，缓解这些不舒服的感觉。平时生活上也得注意：做菜少放盐，咸菜、肥肉这些少吃点，每天抽空散散步或做点轻运动，这样能帮您减点体重，对心脏和血糖都好。您还得买个血糖仪，每周自己测几次血糖，这样我们能及时调整治疗。另外，您吃的降压药缬沙坦继续用，但要多量量血压，确保它在安全范围。天气热的时候多喝水，避免脱水加重心慌。咱们一步步来，坚持住，血糖稳定了，这些症状就会慢慢好转的。"
  },
  {
    "id": 556,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "58岁女性，体型偏瘦，今日独自来社区门诊复诊。主诉近3个月来明显神疲乏力，爬两层楼即感心悸气短，说话声音低微；晨起咽干如刀割，白天烦渴欲饮温水，但饮不多，午后双颧泛红。小便量较前减少、色偏黄，大便3～4日一行，干结似栗。既往2型糖尿病病史7年，目前口服二甲双胍0.5 g bid，自测空腹血糖7.8–9.2 mmol/L，餐后2 h血糖11–13 mmol/L。否认高血压、冠心病。舌体瘦薄、色红少津，苔少而干；脉虚数，约96次/分，节律齐。今日随机指尖血糖12.4 mmol/L，血压118/72 mmHg，BMI 21.5 kg/m²。患者提到最近因帮女儿照看2岁双胞胎，夜间睡眠仅5小时，情绪烦躁；另抱怨右肩偶发酸痛，自认为‘抱孩子累的’，未予处理。实验室检查：HbA1c 8.1%（三个月前7.6%），尿常规（－），肝肾功能正常。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证。临床表现：神疲乏力，心悸，气短懒言，咽干口燥，烦渴欲饮，午后颧红，小便短少，大便干结，舌体瘦薄、苔少而干，脉虚数",
      "action": "推荐方药：玉泉丸（《杂病源流犀烛》）（弱推荐，证据等级：C）或玉液汤加减（《医学衷中参西录》）（强推荐，证据等级：A），药物组成：生山药、生黄芪、知母、生鸡内金、葛根、五味子、天花粉、生地黄、麦冬、乌梅、甘草",
      "contraindication": null,
      "evidence": "推荐方药：玉泉丸（《杂病源流犀烛》）（弱推荐，证据等级：C）或玉液汤加减（《医学衷中参西录》）（强推荐，证据等级：A），药物组成：生山药、生黄芪、知母、生鸡内金、葛根、五味子、天花粉、生地黄、麦冬、乌梅、甘草。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断以排除危急重症（如糖尿病酮症酸中毒、心力衰竭或急性感染），并基于指南直接给出明确的治疗方案。Step 2: 临床解码 (Clinical Decoding) - 患者关键线索：神疲乏力、心悸气短、声音低微提示气虚；咽干口燥、烦渴但饮不多、午后颧红、小便短黄、大便干结结合舌红少津、苔少而干、脉虚数，符合阴虚内热；HbA1c 8.1%（高于目标7%）和随机血糖12.4 mmol/L表明糖尿病控制不佳；睡眠不足（仅5小时）和情绪烦躁可能加剧症状；右肩酸痛为次要劳损问题；无急性并发症迹象（尿常规阴性，血压正常）。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者临床表现（神疲乏力、心悸、气短懒言等）完全匹配指南的 '2型糖尿病中期，气阴两虚证' 条件；指南 contraindication 为 null，检查后无禁忌（无高血压、冠心病病史，肝肾功能正常，无药物过敏提示）。Step 4: 决策生成 (Decision Making) - 根据指南 action，优先选择强推荐的玉液汤加减（证据等级 A），并整合糖尿病优化管理（调整降糖药、生活方式干预）以直接控制症状和血糖。",
    "medical_order": "诊断：2型糖尿病中期（气阴两虚证），血糖控制不佳（HbA1c 8.1%），功能性疲劳。治疗方案：1. 予玉液汤加减方药（生山药30g、生黄芪20g、知母15g、生鸡内金10g、葛根15g、五味子10g、天花粉15g、生地黄15g、麦冬15g、乌梅10g、甘草6g），水煎服，每日1剂，分两次温服，疗程4周。2. 维持二甲双胍0.5g bid，增加血糖监测频率（空腹及餐后每日2次），若1周后血糖未改善（空腹>7.0 mmol/L，餐后>10.0 mmol/L），考虑加用SGLT2抑制剂（如达格列净10mg qd）。3. 生活方式干预：保证每日睡眠≥7小时，避免过度劳累；饮食建议高纤维、低升糖指数食物；指导右肩热敷及轻度拉伸，每日2次。4. 完善心电图（排除隐匿性心脏病），1月后复诊复查HbA1c、随机血糖及症状评估。",
    "patient_dialogue": "阿姨，我看您最近太辛苦了——照顾双胞胎不容易啊！您这身体虚、没力气、口干心慌，还有大便干，主要是糖尿病控制得不太好，加上休息不够闹的。别担心，咱们一步步来。我给您开个中药方子，专门补气养阴的，能帮您缓解疲劳和口干，熬起来方便，一天喝两次就行。另外，您吃的二甲双胍要继续，但咱们得把血糖降下来，不然容易伤身体。您在家多测测血糖，如果还是偏高，咱们下次加点药。关键是休息——晚上一定睡够7小时，孩子的事让家人分担点，您自己得保重。还有，肩膀疼是抱孩子累的，用热毛巾敷敷，少用力。饮食上多吃青菜水果，少吃甜食和油腻的。这样坚持下来，您会感觉精神好些的，咱们一个月后再看看效果，好吗？"
  },
  {
    "id": 533,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁，男性，IT程序员，连续加班3个月后出现口渴多饮、易饥多食，体重反降4 kg。今日首诊，神情焦虑，面色略红，口气重。查体：BMI 27.8 kg/m²，腹围96 cm，BP 128/82 mmHg；舌红苔黄腻，脉弦滑。随机血糖11.4 mmol/L，空腹血糖7.9 mmol/L，HbA1c 7.2%。自述喜夜宵辛辣烧烤、日均可乐500 ml，几乎无运动。患者担心‘打胰岛素会上瘾’，希望先吃药调理。实验室提示血脂边缘升高，肝肾功能正常，尿微量白蛋白阴性。无高血压、冠心病既往史，家族中父亲有2型糖尿病。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肝胃郁热证",
      "action": "推荐中成药：糖敏灵丸（弱推荐，证据等级：A），一次 6 g，一日 3次",
      "contraindication": null,
      "evidence": "① 糖敏灵丸（弱推荐，证据等级：A），一次 6 g，一日 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景。作为急诊/门诊医生，关注重点是快速建立鉴别诊断（排除糖尿病酮症酸中毒等危急重症），并给出直接的初始治疗指令。优先级：基于症状和实验室数据确认诊断，制定可执行方案。\nStep 2: 临床解码 (Clinical Decoding)：患者表现为典型2型糖尿病症状（多饮、多食、体重下降）；实验室指标确诊（HbA1c 7.2%，空腹血糖7.9 mmol/L）；中医证候为肝胃郁热（舌红苔黄腻，脉弦滑）。隐式线索包括：工作压力（连续加班）和不良生活习惯（高糖可乐摄入、辛辣饮食、缺乏运动）加剧代谢紊乱；BMI 27.8 kg/m² 和腹围96 cm 提示肥胖相关胰岛素抵抗；焦虑情绪可能影响治疗依从性；家族史增加遗传易感性。排除危急重症（血压稳定、无酮症酸中毒迹象）。\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南 condition '2型糖尿病早期，肝胃郁热证' 与病例高度匹配（症状、证候、实验室）。contraindication 为 null，强制安全检查：患者肝肾功能正常、无药物过敏史、无急性并发症，糖敏灵丸无已知禁忌症，安全可应用。\nStep 4: 决策生成 (Decision Making)：根据指南 action，首选糖敏灵丸 6g tid 作为核心药物治疗。补充生活方式干预（饮食和运动），因其是糖尿病管理基础；安排短期随访以监测疗效。",
    "medical_order": "诊断：2型糖尿病（早期），中医辨证：肝胃郁热证。\n治疗：1. 予糖敏灵丸口服，6g tid，餐后服用。2. 生活方式干预：糖尿病饮食（限制精制碳水化合物及高脂食物，每日热量控制），每日中等强度有氧运动≥30分钟。3. 监测：家庭自测空腹及餐后2小时血糖，每日记录；2周后复诊，复查空腹血糖、HbA1c及体重变化。4. 健康宣教：提供糖尿病自我管理手册。",
    "patient_dialogue": "王先生，您好，检查结果出来了，您确实是得了2型糖尿病，不过好在是早期阶段，咱们完全能控制住，别太紧张。我给您开一种叫糖敏灵丸的药，每天饭后吃一包，一天三次，它能帮您调节血糖，而且不会像胰岛素那样有依赖问题，您放心。同时啊，生活上得做些调整：可乐和烧烤这些要少碰，尤其是夜宵，改吃清淡点的，比如多来点蔬菜和粗粮；每天抽半小时走走路或跑跑步，对降血糖特别管用。这些改变刚开始可能有点难，但坚持下来，血糖稳了，体重也能慢慢下来，人会舒服很多。咱们两周后再来看看效果，您有啥疑问随时问我，别自己瞎想，我们一起搞定它！"
  },
  {
    "id": 554,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者46岁，男性，网约车司机，今日由社区转诊。主诉‘近3个月口渴多尿加重，伴双眼视物模糊、晨起眼睑浮肿’。既往史：2型糖尿病3年，平素间断口服二甲双胍0.5 g bid，未系统监测血糖；高血压6年，最高160/100 mmHg，自服缬沙坦80 mg qd，血压控制不详；否认冠心病及脑卒中。个人史：每日吸烟15支，喜重口味，夜班频繁。家族史：母亲有糖尿病并终末期肾病。体检：BMI 31.2 kg/m²，腰围108 cm，BP 158/96 mmHg，双眼底可见少量硬性渗出；腹型肥胖，双下肢轻度凹陷性水肿。实验室：空腹血糖9.4 mmol/L，HbA1c 8.7%，eGFR 68 mL·min⁻¹·1.73 m⁻²（CKD-EPI），尿微量白蛋白/肌酐比值 420 mg/g，尿常规蛋白（+）；血脂TG 2.8 mmol/L，LDL-C 3.1 mmol/L。舌苔黄腻、舌体胖大，脉滑数。患者自述近期常腹胀、大便黏滞，每日2次且味臭。今日门诊目的：评估肾损伤并调整降糖方案。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肠道湿热证，且患有糖尿病肾病或糖尿病合并视网膜病变",
      "action": "推荐中成药：黄葵胶囊（弱推荐，证据等级：B），一次 5粒，一日 3次",
      "contraindication": null,
      "evidence": "推荐的中成药：黄葵胶囊（弱推荐，证据等级：B），一次 5粒，一日 3次，适用于糖尿病肾病或糖尿病合并视网膜病变者。"
    },
    "thought": "本案例属于复杂合并症治疗场景，作为博学的专科专家，我将全网扫描药物相互作用、禁忌症及共病风险，优先确保安全再考虑疗效。Step 2: 临床解码——患者为46岁男性，2型糖尿病未控制（HbA1c 8.7%）、高血压未达标（BP 158/96 mmHg）、糖尿病肾病（eGFR 68 mL·min⁻¹·1.73 m⁻²，尿微量白蛋白/肌酐比值 420 mg/g，尿蛋白阳性）、糖尿病视网膜病变（眼底硬性渗出）、腹型肥胖（BMI 31.2 kg/m²，腰围108 cm）、高脂血症（TG 2.8 mmol/L）、吸烟及不良生活习惯；附加症状如舌苔黄腻、腹胀、大便黏滞等支持中医证候‘肠道湿热证’。Step 3: 规则对齐与安全检查——指南条件‘2型糖尿病早期，肠道湿热证，且患有糖尿病肾病或糖尿病合并视网膜病变’完全匹配；指南Action推荐黄葵胶囊（弱推荐，证据等级B），无禁忌症（Contraindication为null）；全网扫描显示：黄葵胶囊与当前药物（二甲双胍、缬沙坦）无已知药物相互作用，但需警惕共病风险（如肾功能减退eGFR 68需监测，高血压未控可能加重肾病）。优先级为安全：黄葵胶囊安全，但需结合其他治疗管理合并症。Step 4: 决策生成——根据指南Action，推荐黄葵胶囊；同时，针对合并症，需强化降糖、降压、肾病管理及生活方式干预，确保整体安全。",
    "medical_order": "1. 予黄葵胶囊 5粒 tid 口服（针对糖尿病肾病及视网膜病变）。2. 调整降糖方案：二甲双胍增至 1g bid，联合达格列净 10mg qd（改善血糖控制、保护肾脏、减轻体重）。3. 强化降压治疗：缬沙坦增至 160mg qd，监测血压目标 <130/80 mmHg。4. 生活方式干预：低盐低脂糖尿病饮食、戒烟、规律作息、避免夜班。5. 完善检查：24小时尿蛋白定量、眼底荧光造影、血脂谱复查；必要时肾内科及眼科会诊。6. 教育：自我监测血糖及血压，每周记录。",
    "patient_dialogue": "王先生，您好！我看了您的检查结果，您的糖尿病和高血压一直没控制好，这已经影响到您的眼睛和肾脏了，所以咱们得赶紧调整一下治疗方案。首先，我会给您开一种叫黄葵胶囊的中药，它可以帮助保护您的肾脏和眼睛，每天吃5粒，一天三次。另外，您现在的降糖药效果不够强，我要加一种新药叫达格列净，每天一粒，同时把您原来的二甲双胍剂量加大一点，这样能更好地控制血糖，还能帮您减轻点体重。血压方面，您现在的药量不够，我会把缬沙坦加倍，每天吃一粒160毫克的，目标是让血压降到130/80以下，这样才能防止肾脏问题恶化。生活上，您得特别注意：做菜少放盐，别吃咸菜和油腻食物，把烟戒掉——抽烟会加速肾脏损伤，万一像您母亲那样发展到肾衰就麻烦了。还有，您开夜班太频繁，尽量调整作息，保证睡眠。这些改变一开始可能有点难，但坚持下去，能大大降低您将来得严重并发症的风险。咱们先做这些调整，两周后复查，看看效果怎么样。别担心，咱们一步一步来，您有什么疑问随时问我！"
  },
  {
    "id": 537,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁，男性，身高172 cm，体重84 kg，BMI 28.3 kg/m²。主诉近3个月口干多饮、易饥多食，伴饭后腹胀、嗳气，大便溏薄日行2次。夜间因口渴起床饮水2次。无显著多尿及体重下降。既往体健，否认高血压、冠心病；父亲患2型糖尿病。吸烟10年，约5支/日；久坐少运动，常熬夜写代码。查体：BP 128/82 mmHg，腹围98 cm，舌淡红、边有齿痕，苔薄白腻，脉滑。随机血糖9.8 mmol/L，空腹血糖7.4 mmol/L，HbA1c 6.9%。尿常规阴性。今日门诊初筛考虑2型糖尿病早期，辨证属脾胃不和证。患者同时提及近一周右肩酸痛，疑为空调吹袭所致，与主症无关。",
    "reference_rule": {
      "condition": "2型糖尿病早期，脾胃不和证",
      "action": "针刺疗法（弱推荐，证据等级：B）：取穴：中脘、曲池、合谷、足三里、阴陵泉、三阴交、丰隆、血海、地机、太冲。均常规直刺 20~30 mm，采用平补平泻法，得气后留针 30分钟，每日 1次",
      "contraindication": null,
      "evidence": "推荐的其他疗法：针刺疗法（弱推荐，证据等级：B）：取穴：中脘、曲池、合谷、足三里、阴陵泉、三阴交、丰隆、血海、地机、太冲。均常规直刺 20~30 mm，采用平补平泻法，得气后留针 30分钟，每日 1次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为果断的门诊医生，我关注快速建立鉴别诊断（如排除糖尿病酮症酸中毒、甲状腺功能亢进等危急重症），并基于现有证据直接给出治疗指令。重点在于确认诊断匹配指南条件，避免延误治疗。Step 2: 临床解码 (Clinical Decoding): 患者血糖指标（空腹7.4 mmol/L、随机9.8 mmol/L、HbA1c 6.9%）符合2型糖尿病早期诊断（HbA1c处于糖尿病前期边界，但结合症状支持早期糖尿病）；症状（口干多饮、易饥多食）及体征（饭后腹胀、嗳气、大便溏薄、舌淡红边有齿痕、苔薄白腻、脉滑）明确指向脾胃不和证；隐式线索包括中心性肥胖（腹围98 cm）、超重（BMI 28.3）、家族史（父亲糖尿病）及不良生活习惯（吸烟、久坐、熬夜），这些增加糖尿病进展风险。右肩酸痛为次要问题，与主症无关。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition '2型糖尿病早期，脾胃不和证' 与患者情况完全匹配。Contraindication为null，无针刺禁忌（患者无出血障碍、皮肤感染或过敏史，病例未提示）。安全检查：血糖未达危重水平（HbA1c <7%，无多尿或体重下降），尿常规阴性排除急性并发症。Step 4: 决策生成 (Decision Making): 根据指南Action，直接采用针刺疗法（弱推荐，证据等级B）。同时，基于糖尿病管理标准，补充生活方式干预（如戒烟、饮食运动调整）以控制风险，并安排随访监测血糖变化。",
    "medical_order": "诊断：2型糖尿病早期，脾胃不和证。治疗：予针刺疗法，取穴中脘、曲池、合谷、足三里、阴陵泉、三阴交、丰隆、血海、地机、太冲；常规直刺20-30mm，平补平泻法，得气后留针30分钟，每日1次。建议生活方式干预：戒烟；低热量饮食（减少碳水化合物摄入）；增加中等强度运动（如快走30分钟/日）；规律作息（避免熬夜）。随访：安排1周后复诊，复查空腹血糖及HbA1c；右肩酸痛予局部热敷处理。",
    "patient_dialogue": "王先生，您好！根据您的症状和检查结果，咱们初步判断是早期糖尿病，血糖有点偏高，同时您的脾胃功能不太协调，引起了口干、容易饿、还有饭后腹胀这些问题。别担心，现在发现得早，咱们及时干预就好。我建议您做针灸治疗，就是在身上几个穴位扎针，每天一次，每次半小时左右，这能帮您调节脾胃，改善那些不舒服的感觉。另外，为了控制血糖，得麻烦您戒烟——抽烟会加重糖尿病风险，对心脏也不好。体重方面，减几斤会很有帮助，比如每天散步半小时，少吃油腻食物，做菜清淡点。熬夜写代码时尽量11点前休息，避免疲劳。您说的右肩膀疼，可能是空调吹的，回家用热毛巾敷敷，应该很快缓解。下周咱们再约个时间复查血糖，看看效果。别太紧张，这些小改变就能让血糖稳定下来，咱们一起努力！"
  },
  {
    "id": 565,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者因“右足趾溃烂渗液2周”第3次来创面门诊。既往2型糖尿病18年，平素甘精胰岛素+二甲双胍，近半年HbA1c 8.7%；高血压、血脂异常各10年。3年前曾行左下肢PTA。查体：右足第2趾腹侧1.5 cm×1 cm溃疡，基底苍白，少量黄白渗液，边缘暗红；足背动脉搏动减弱，踝肱指数0.68；双足皮温低，皮肤干燥脱屑，趾甲增厚。伴夜间足趾灼痛、五心烦热、口干咽燥、腰膝酸软。舌红少津、苔薄黄，脉细数。实验室：eGFR 58 mL·min⁻¹·1.73 m⁻²（CKD 3a），尿微量白蛋白/肌酐 420 mg/g；ALT 38 U·L⁻¹，TBil 正常。患者今日自行将胰岛素剂量上调4 U，仍述餐后血糖12-14 mmol·L⁻¹，并担心“肾会不会继续坏下去”。",
    "reference_rule": {
      "condition": "糖尿病足，肝肾阴虚证",
      "action": "中药浴足（弱推荐，证据等级：C）：处方：豨莶草、红花、醋乳香、醋没药、艾叶、鸡血藤、刘寄奴、沉香、川芎、伸筋草、透骨草、苏木。煎好汤剂加温水调整到合适的温度，先熏蒸，注意防止烫伤。再浴足，浸泡 20分钟左右为宜",
      "contraindication": null,
      "evidence": "② 中药浴足（弱推荐，证据等级：C）：处方：豨莶草、红花、醋乳香、醋没药、艾叶、鸡血藤、刘寄奴、沉香、川芎、伸筋草、透骨草、苏木。煎好汤剂加温水调整到合适的温度，先熏蒸，注意防止烫伤。再浴足，浸泡 20分钟左右为宜，适用于糖尿病足。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先级确保安全第一（安全 > 疗效）。Step 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：患者为2型糖尿病18年控制不佳（HbA1c 8.7%），伴糖尿病足溃疡（右足第2趾溃疡基底苍白，少量渗液，提示缺血性溃疡风险）、外周动脉疾病（踝肱指数0.68，足背动脉搏动减弱）、慢性肾脏病3a期（eGFR 58 mL·min⁻¹·1.73 m⁻²，尿微量白蛋白/肌酐420 mg/g）、高血压、血脂异常；症状体征符合中医肝肾阴虚证（如夜间足趾灼痛、五心烦热、舌红少津、脉细数）。隐式线索包括血糖控制不良（患者自行上调胰岛素但餐后血糖仍12-14 mmol·L⁻¹）、肾损害进展担忧、及潜在感染风险（溃疡渗液）。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition '糖尿病足，肝肾阴虚证' 与患者情况完美匹配。Contraindication null，但强制全网扫描：中药浴足为外用，无直接药物相互作用风险（甘精胰岛素和二甲双胍为系统用药）；共病风险包括CKD 3a期（外用安全，但需防水中毒）、溃疡渗液（增加感染风险）、外周动脉疾病和皮温低（烫伤风险高）。安全优先级确认：浴足前需排除急性感染、确保水温控制。Step 4: 决策生成 (Decision Making) - 基于指南Action，推荐中药浴足作为辅助治疗（弱推荐，证据等级C）。同时，因合并症复杂，需整合其他管理：优化降糖方案（患者自行调整无效，需专业干预）、肾保护、溃疡监测及血管评估，以确保整体安全。",
    "medical_order": "1. 中药浴足处方：豨莶草、红花、醋乳香、醋没药、艾叶、鸡血藤、刘寄奴、沉香、川芎、伸筋草、透骨草、苏木。煎汤剂加温水调至38-40°C，每日1次，先熏蒸5-10分钟（防烫伤），再浸泡20分钟。2. 调整降糖方案：评估当前甘精胰岛素剂量，考虑加用SGLT2抑制剂（如达格列净，eGFR>45 mL/min适用）或DPP-4抑制剂（如西格列汀），完善空腹及餐后血糖监测。3. 溃疡护理：足部溃疡行细菌培养及药敏试验，予清创换药（无菌敷料覆盖），监测感染征象。4. 共病管理：继续降压（ACEI/ARB类优先，肾保护）、降脂（他汀类），完善下肢血管超声评估血运。5. 监测：每周复查足部溃疡；2周后查HbA1c、肾功能、尿微量白蛋白；转诊血管外科会诊。",
    "patient_dialogue": "张先生，您好！我理解您担心血糖总降不下来，还怕肾会变差，咱们今天一步步来解决。首先，您的脚溃疡咱们用个中药泡脚的法子：回家后拿这些草药煎成汤水，加点温水调到温热（别烫手，用手腕试一下温度），先熏一熏脚，再泡20分钟左右，每天一次，这能帮助伤口好得快些，还能缓解您脚上的灼痛感。但千万小心别烫伤，因为您脚上的感觉可能不太灵敏。另外，您自己调胰岛素的事儿挺让我担心的——这不能随便加量，容易低血糖，反而伤身体。我会给您调整一下降糖药，可能加个新药，既能控血糖又能护肾。脚上的伤口咱也得防感染，别碰脏水，每天换干净纱布。您的高血压和血脂的药还得继续吃，它们能保护心脏和肾。咱们过两周再查查血糖和肾功，您看这样安排行吗？坚持治疗，您的脚和肾都能慢慢好起来的，别太焦虑，咱们一起努力！"
  },
  {
    "id": 529,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者48岁，货车司机，近3个月跑长途时频繁口渴，每天3L矿泉水仍觉口干，体重自发下降6kg。昨夜卸货后自觉胸口闷热、咯黄黏痰，晨起小便泡沫多。查体：BMI 29.4 kg/m²，腹围102 cm，面色红赤，舌淡红、苔黄厚腻，脉滑数。随机血糖13.8 mmol/L，HbA1c 8.1%。患者抱怨最近两周夜间盗汗，但否认发热与咳嗽。追问病史，平时嗜甜饮料，日均2罐；因跑夜班，常凌晨2点吃泡面加餐。家族史：父亲50岁确诊2型糖尿病。患者对针刺无恐惧，但担心治疗影响出车时间。",
    "reference_rule": {
      "condition": "2型糖尿病早期，痰热互结证",
      "action": "腹针治疗（弱推荐，证据等级：C）：取穴：关元、气海、中脘、下脘、阴都（双）、石关（双）、商曲（双）、气旁（双）、气穴（双）、滑肉门（双）、外陵（双）、上风湿点（双）、下风湿点（双）、天枢（双）、大横（双）。不使用提插、捻转手法。留针 30分钟。隔日 1次，3次/每周",
      "contraindication": null,
      "evidence": "推荐的其他疗法：腹针治疗（弱推荐，证据等级：C）：取穴：关元、气海、中脘、下脘、阴都（双）、石关（双）、商曲（双）、气旁（双）、气穴（双）、滑肉门（双）、外陵（双）、上风湿点（双）、下风湿点（双）、天枢（双）、大横（双）。不使用提插、捻转手法。留针 30分钟。隔日 1次，3次/每周。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于常规门诊诊疗场景。作为急诊/门诊医生，重点关注快速锁定核心诊断（2型糖尿病痰热互结证），排除急性并发症（如酮症酸中毒），并给出可执行的治疗指令。",
      "Step 2: 临床解码": {
        "核心诊断依据": [
          "生化确诊：随机血糖13.8 mmol/L + HbA1c 8.1% 符合糖尿病诊断标准",
          "典型症状群：三多一少（多饮/体重下降）伴小便泡沫（提示早期肾损）",
          "中医证候：舌苔黄厚腻+脉滑数+咯黄痰=痰热互结实证",
          "风险放大器：BMI 29.4+腹围102cm（内脏脂肪堆积）、嗜甜饮史（日均2罐）、熬夜加餐习惯"
        ],
        "危急重症排除": [
          "无酮症酸中毒：虽口渴但无腹痛/呼吸深快",
          "感染待查：盗汗+黄痰需胸片排查，但否认发热咳血"
        ]
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "患者表现完全符合指南'2型糖尿病早期，痰热互结证'条件",
        "禁忌核查": "无针刺禁忌（患者接受度高），但需注意：①腹针前测即时血糖防低血糖 ②查凝血功能（病例未提供）",
        "延伸管理": "指南仅提腹针，但必须同步：①药物降糖（HbA1c>7%）②并发症筛查（尿蛋白/眼底）"
      },
      "Step 4: 决策生成": "采用指南腹针方案为核心，叠加二甲双胍基础治疗及生活方式干预三重策略"
    },
    "medical_order": "诊断：2型糖尿病（痰热互结证）。\n\n医嘱：\n1. 降糖治疗：二甲双胍 500mg bid po（早餐/晚餐时）\n2. 腹针疗法：取关元、气海、中脘、下脘、双阴都、双石关、双商曲、双气旁、双气穴、双滑肉门、双外陵、双上风湿点、双下风湿点、双天枢、双大横。轻刺留针30分钟，隔日1次（每周一/三/五）\n3. 检查：即刻查尿ACR、胸片、空腹胰岛素+C肽；预约眼底照相\n4. 监测：每日晨起空腹+晚餐后2h指尖血糖，记录于血糖册\n5. 宣教：糖尿病饮食示范餐单发放",
    "patient_dialogue": "王师傅，您这几个月开车辛苦，身体发出警报啦！检查结果明确显示血糖超标，这就是您总口渴、掉体重的原因。那些半夜的泡面和甜饮料啊，就像给发动机灌糖水——车子要坏，身体也扛不住啊！\n\n咱们分三步走：\n第一，每天早晚随餐吃片小药（二甲双胍），帮您平稳血糖；\n第二，咱用特别温和的腹部针灸，就像给内脏做按摩，改善您口干、胸闷的感觉，每次半小时，隔天做（我给您约下午四点，不耽误夜班出车）；\n第三，最关键——您得跟甜饮料'分手'啦！矿泉水是好，但泡面换成全麦面包加鸡蛋，既顶饿又不升糖。\n\n别担心，您父亲的情况不会重演！咱们现在控制好，既能继续握方向盘，又能陪孩子长大。记得明天先来做尿检和胸片，血糖记录本放驾驶座旁边，咱两周后看成效！"
  },
  {
    "id": 589,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日由丈夫陪同复诊，自诉近3个月来夜间入睡困难、早醒，白天莫名紧张，常因血糖波动担心并发症而心慌出汗。她提到自己经营一家24小时便利店，夜班后常靠浓茶和甜点提神；晚餐偏爱红烧五花肉，称“不吃肉就浑身没劲”。查体：BMI 28.4 kg/m²，腹围94 cm，BP 138/86 mmHg，空腹血糖8.7 mmol/L，HbA1c 8.1%。此外，她抱怨左肩隐隐作痛，认为是搬货拉伤，未在意。目前口服二甲双胍0.5 g bid，未用胰岛素。",
    "reference_rule": {
      "condition": "糖尿病患者（焦虑失眠等症状）",
      "action": "耳穴疗法（弱推荐，证据等级：B）。选穴：脾、肾、内分泌、耳迷走神经区",
      "contraindication": null,
      "evidence": "7.6.1 耳穴疗法...选穴：脾、肾、内分泌、耳迷走神经区。（弱推荐，证据等级：B）"
    },
    "thought": "本案例属于生活方式与风险干预场景。作为健康管理师，我的关注重点是识别患者隐式的不良习惯，关联长期健康风险（如代谢综合征和心血管并发症），并用共情但坚定的语气提出非药物干预建议，以优化糖尿病管理和减轻焦虑症状。\n\n在临床解码中，患者核心问题包括：睡眠障碍（入睡困难、早醒，医学术语：失眠症）、焦虑症状（白天紧张、心慌出汗，医学术语：广泛性焦虑障碍），可能与工作压力（24小时便利店夜班）和不良生活习惯相关；饮食问题（夜班后依赖浓茶和甜点提神，晚餐偏好红烧五花肉，医学术语：高糖高脂饮食偏好），导致营养失调；代谢异常（BMI 28.4 kg/m²和腹围94 cm提示中心型肥胖，BP 138/86 mmHg为高血压前期，空腹血糖8.7 mmol/L和HbA1c 8.1%显示糖尿病控制不佳）；此外，左肩隐痛（可能源于工作性劳损，但需排除糖尿病神经病变）。隐式线索：持续不良生活方式可能加剧血糖波动、肥胖和焦虑循环，增加长期心血管事件（如心梗或中风）风险。\n\n规则对齐与安全检查：患者符合指南condition'糖尿病患者（焦虑失眠等症状）'。指南action建议耳穴疗法（弱推荐，证据等级B），选穴脾、肾、内分泌、耳迷走神经区；指南contraindication为null，无禁忌，因此该方案安全适用。\n\n决策生成：基于指南，推荐耳穴疗法作为非药物干预起点。同时，针对生活方式风险，生成综合建议：强调饮食调整（降低糖脂摄入）、睡眠优化（规律作息）和运动增加，以缓解焦虑、改善血糖控制并预防并发症；建议评估肩痛以排除潜在问题。",
    "medical_order": "予耳穴疗法，选穴：脾、肾、内分泌、耳迷走神经区，每周2-3次。建议生活方式干预：低糖低脂饮食（每日糖摄入＜25g，饱和脂肪＜10%总热量）；规律睡眠时间（目标每晚7-8小时）；每日中等强度运动30分钟（如快走）。监测空腹血糖及HbA1c每3个月；血压监测每周2次。评估左肩疼痛原因（考虑骨科或神经科会诊）。继续二甲双胍0.5 g bid口服。",
    "patient_dialogue": "王女士，我注意到您最近睡得不太好，还经常感到紧张和心慌，这确实让人烦恼。您说店里夜班后习惯喝浓茶吃甜点提神，晚餐又爱吃红烧肉，觉得不吃肉就没力气——这些习惯虽然短时间让您精神些，但长期下来会让血糖更难控制，还可能加重焦虑和疲劳，甚至增加心脏问题的风险。为了帮您改善睡眠和放松心情，我推荐试试耳穴疗法，这是一种安全、无痛的小方法，贴在耳朵特定位置，能帮助调节身体平衡。同时，咱们一起调整日常习惯：夜班后换成温牛奶或坚果提神，少吃甜点；晚餐用瘦肉或鱼代替五花肉，少放油盐；保证每晚固定时间休息，哪怕小睡一会也好；白天抽空活动下身体，比如散步或做做拉伸。您提到的肩痛，也别大意，可能是搬货劳累，建议抽空做个检查。别担心，这些改变不难，咱们一步步来，您的血糖和情绪会慢慢好起来的。"
  },
  {
    "id": 567,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者自诉近3个月来视物模糊加重，夜间小腿抽筋明显，晨起口干咽燥。既往2型糖尿病18年，近5年先后加用二甲双胍1.0 g bid、格列美脲2 mg qd、达格列净10 mg qd，糖化血红蛋白仍7.8%。高血压15年，贝那普利10 mg qd控制尚可。1年前因‘视网膜黄斑水肿’行右眼玻璃体腔注药3次。今日实验室回报：空腹血糖9.4 mmol/L，eGFR 52 mL·min⁻¹·1.73 m⁻²（CKD G3a），尿白蛋白/肌酐比285 mg/g；ALT 18 U/L，AST 22 U/L；眼底照相示双视网膜散在硬性渗出。查体：BP 136/78 mmHg，BMI 23.7 kg/m²，皮肤干燥脱屑，舌红少津，脉细数。患者抱怨夜尿3-4次影响睡眠，并顺带提到最近小区电梯维修，每天爬8层楼后气喘明显。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，肝肾阴虚证",
      "action": "推荐中成药：杞菊地黄丸（弱推荐，证据等级：B）：一次 8丸，一日 3次",
      "contraindication": null,
      "evidence": "① 杞菊地黄丸（弱推荐，证据等级：B）：一次 8丸，一日 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，优先级安全大于疗效。作为专科专家，我将全网扫描现有药物（包括二甲双胍、格列美脲、达格列净、贝那普利）与指南推荐中成药的潜在冲突，评估肾功能不全、心血管风险及脱水状态。\nStep 2: 临床解码 (Clinical Decoding) - 患者为2型糖尿病晚期，合并高血压控制可；关键并发症包括糖尿病肾病（eGFR 52 mL/min/1.73m²，CKD G3a；尿白蛋白/肌酐比285 mg/g）、糖尿病视网膜病变（眼底硬性渗出，既往黄斑水肿治疗）、潜在神经病变（夜间小腿抽筋、视物模糊）；中医证候肝肾阴虚（舌红少津、脉细数）。隐式线索：夜尿3-4次可能由达格列净（SGLT2抑制剂）引发渗透性利尿导致脱水（口干、皮肤干燥）；爬楼气喘提示未控制的心血管风险或贫血；空腹血糖9.4 mmol/HbA1c 7.8%显示降糖方案不足。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition '2型糖尿病晚期，肝肾阴虚证' 与患者临床特征匹配。Contraindication null，但全网扫描：杞菊地黄丸（含枸杞、菊花等）与当前药物无已知药代动力学相互作用；达格列净在CKD G3a中需谨慎（可能加重夜尿和脱水），但指南推荐适用；安全优先级下，需监测电解质（防低镁致抽筋）及肾功能。无绝对禁忌，但患者气喘需排除心衰。\nStep 4: 决策生成 (Decision Making) - 基于指南action，采纳杞菊地黄丸8丸 tid po作为辅助治疗；同时强化糖尿病管理（优化降糖方案）、评估心血管风险，并安排随访以确保安全。",
    "medical_order": "予杞菊地黄丸8丸 tid po。维持当前降糖方案：二甲双胍1.0g bid、格列美脲2mg qd、达格列净10mg qd；贝那普利10mg qd继续。监测空腹血糖每周2次、糖化血红蛋白每3月；完善心电图、心脏超声评估心肺功能；转诊眼科随访视网膜病变。建议低盐饮食、适量水分摄入；1月后复查eGFR、尿白蛋白/肌酐比、电解质。",
    "patient_dialogue": "张先生，您好！听您说最近眼睛看东西更模糊了，晚上小腿还抽筋，早上口干得厉害，这些症状确实挺难受的，尤其是夜尿多影响睡眠——这可能是您吃的降糖药引起的，我会帮您调整一下。给您加一种中药丸，叫杞菊地黄丸，每天三次，每次八粒，饭前或饭后吃都行。它能滋养身体，帮您缓解口干和抽筋。另外，您爬楼后气喘，这得查查心脏功能，我安排个检查。平时注意做菜少放盐，多喝水，但别一次喝太多，免得晚上起夜更多。下个月咱们复查肾功能和血糖，一起看看效果。别担心，咱们一步步来，会好起来的。"
  },
  {
    "id": 542,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者52岁，公交司机，因“血糖控制差伴腹胀、便秘2月”今日复诊。2型糖尿病病史11年，平素用二甲双胍0.5 g tid＋格列美脲2 mg qd，近半年HbA1c 8.4%。既往：脂肪肝、痛风、高血压（BP 148/92 mmHg）。自诉近2月餐后饱胀明显，嗳气酸腐，口苦咽干，大便3～4日一行、干结如栗，夜间烧心影响睡眠；体重+3 kg。查体：BMI 30.2 kg/m²，腹围105 cm，舌红、苔黄厚，脉弦滑数。实验室：FPG 9.8 mmol/L，2hPG 14.1 mmol/L，TG 3.0 mmol/L，ALT 58 U/L，eGFR 92 mL/min，尿Alb/Cr 正常。腹平片示结肠气体潴留。患者今日空腹前来，候诊时仍嗳气频频，自述“一吃米饭就顶着难受”。",
    "reference_rule": {
      "condition": "2型糖尿病性胃肠病，肝胃郁热证",
      "action": "推荐中成药：胆宁片（弱推荐，证据等级：C），一次 5片，一日 3次",
      "contraindication": null,
      "evidence": "② 胆宁片（弱推荐，证据等级：C），一次 5片，一日 3次，适用于 2型糖尿病性胃肠病。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于复杂合并症治疗场景，患者同时存在2型糖尿病、脂肪肝、痛风、高血压及胃肠症状，这要求我作为专科专家进行全网扫描。关注重点在于检查药物相互作用、禁忌症和共病风险，优先确保安全（如避免药物不良反应），其次考虑疗效优化。\n\n**Step 2: 临床解码 (Clinical Decoding)**：从病例中提取关键信息并转化为医学术语：（1）主诉提示2型糖尿病性胃肠病（糖尿病自主神经病变），基于餐后饱胀、嗳气酸腐、腹胀便秘、结肠气体潴留（腹平片），符合胃肠动力障碍；（2）中医证候为肝胃郁热证，证据来自口苦咽干、舌红苔黄厚、脉弦滑数；（3）合并症包括未控制的糖尿病（HbA1c 8.4%，FPG 9.8 mmol/L，2hPG 14.1 mmol/L）、肥胖（BMI 30.2 kg/m²，腹围105 cm）、高甘油三酯血症（TG 3.0 mmol/L）、脂肪肝（ALT 58 U/L）、高血压（BP 148/92 mmHg）及痛风风险；（4）隐式线索：患者为公交司机（暗示久坐、饮食不规律的生活方式），体重增加3kg 和吃米饭不适（提示碳水化合物不耐受或高热量饮食），需关联长期风险如心血管事件或糖尿病并发症。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南条件'2型糖尿病性胃肠病，肝胃郁热证'与患者情况高度匹配（胃肠症状、中医征象）。禁忌症为null，但进行全网扫描：（1）药物相互作用：患者当前使用二甲双胍（可能加重胃肠不适）和格列美脲（降糖药），胆宁片（含大黄、枳实等成分）通便作用可能协同改善便秘，但需监测低血糖风险（尤其餐后不适）；（2）共病风险：高血压、痛风、脂肪肝无直接禁忌，但胆宁片清热作用可能辅助降脂，需注意肥胖相关肝酶升高（ALT 58 U/L）；（3）其他安全因素：eGFR 92 mL/min正常，无肾功能障碍；无提及过敏史，总体安全优先。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南action，核心决策为推荐胆宁片5片 tid po（弱推荐，证据等级C），以改善胃肠症状；同时，考虑合并症管理（如优化降糖、降压），确保整体方案安全有效。",
    "medical_order": "诊断：2型糖尿病性胃肠病（肝胃郁热证）；合并症：2型糖尿病、肥胖、高甘油三酯血症、非酒精性脂肪肝、高血压。\n治疗：\n1. 予胆宁片 5片 口服 一日三次，疗程4周后复诊评估胃肠症状。\n2. 继续当前降糖方案（二甲双胍 0.5g tid + 格列美脲 2mg qd），监测空腹及餐后血糖，目标HbA1c <7.0%；若血糖控制不佳，考虑加用SGLT2抑制剂（如恩格列净）。\n3. 针对高血压，予氨氯地平 5mg qd 口服，目标血压 <140/90 mmHg。\n4. 完善生活方式干预：低热量糖尿病饮食（每日热量减少500 kcal）、增加膳食纤维摄入（如燕麦、蔬菜）、规律运动（每日快走30分钟）。\n5. 监测：每周家庭血压、血糖记录；4周后复查FPG、2hPG、ALT、TG、体重及腹围；若胃肠症状无改善，行胃镜或胃肠动力检查。",
    "patient_dialogue": "王师傅，您好！我看您今天空腹来检查，还一直嗳气，这肯定让您挺难受的。别担心，咱们一步步来。您这腹胀、便秘的问题，主要是因为糖尿病时间长了，影响到肠胃的蠕动功能，再加上您舌苔黄厚、口苦咽干，中医上叫‘肝胃郁热’，简单说就是体内有热积住了，导致消化不好。\n\n我给您开个药叫胆宁片，一天吃三次，每次5片，饭后用温水送服。它能帮您清热通便，缓解腹胀和嗳气。大约吃一个月左右，咱们再复查看看效果——如果不处理，这症状可能越来越重，甚至影响睡眠和血糖控制。\n\n另外，您血压有点高（148/92），我们再加个降压药氨氯地平，每天一片，这样能保护心脏和血管，避免长期高血压出问题。血糖方面，您目前的药效果不太理想（HbA1c 8.4%），咱们继续吃二甲双胍和格列美脲，但我会教您怎么在家测血糖，如果还是高，可能得调整。\n\n生活上，您当公交司机久坐，容易发胖（现在腹围105厘米），这对糖尿病和痛风都不好。我建议：做饭少放油盐，米饭换成杂粮（比如燕麦或糙米），因为您说一吃米饭就顶得慌；多吃青菜水果通便；每天抽空快走半小时，比如下班后散步。坚持下来，体重减一点，这些症状就好转快，还能预防心脏病。咱先这样试试，一个月后您再来，我帮您看看进展，好吗？"
  },
  {
    "id": 568,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "今日下午，肾内-糖尿病联合门诊。患者由老伴推着轮椅进来，面色黧黑，耳轮干枯。自述近1个月夜尿5-6次，尿盆沉淀如脂膏；晨起眼睑浮肿，午后双踝凹陷性水肿至膝，鞋号由42码换到44码仍勒脚。五心烦热却怕冷，夜间需穿棉袜睡觉。食欲差，口干咽燥，饮一溲一。查体：BP 165/92 mmHg，HR 92次/分，律齐；双下肢触觉减退，振动觉消失，跟腱反射消失。舌淡胖、边有齿痕、苔白而干，脉沉细无力。实验室：eGFR 23 mL/min/1.73 m²，尿蛋白定量 4.8 g/24h，Hb 92 g/L，K⁺ 5.0 mmol/L。患者说：'医生，我老伴听邻居讲吃鹿茸炖汤能补肾，让我问问能不能试试？'",
    "reference_rule": {
      "condition": "2型糖尿病晚期，阴阳两虚证。临床表现：小便频数，夜尿增多，浑浊如脂如膏，甚至饮一溲一，五心烦热，口干咽燥，耳轮干枯，面色黧黑；腰膝酸软无力，神疲，畏寒肢凉，四肢欠温，阳痿，下肢浮肿，甚则全身皆肿，舌质淡，苔白而干，脉沉细无力。多见于糖尿病肾病、糖尿病合并周围神经病变等后期",
      "action": "推荐方药：金匮肾气丸加减（《金匮要略》）（强推荐，证据等级：A），药物组成：附子、肉桂、熟地黄、山萸肉、枸杞子、炒山药、茯苓、泽泻、巴戟天、肉苁蓉、菟丝子、鹿角胶",
      "contraindication": null,
      "evidence": "推荐方药：金匮肾气丸加减（《金匮要略》）（强推荐，证据等级：A），药物组成：附子、肉桂、熟地黄、山萸肉、枸杞子、炒山药、茯苓、泽泻、巴戟天、肉苁蓉、菟丝子、鹿角胶。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，重点关注糖尿病肾病与周围神经病变的叠加风险。作为专科专家，我将执行全网扫描，优先检查药物安全性（包括潜在相互作用、禁忌症及共病风险），确保治疗决策基于安全 > 疗效原则。Step 2: 临床解码 (Clinical Decoding) - 患者表现为2型糖尿病晚期并发症：①糖尿病肾病（eGFR 23 mL/min/1.73 m²，尿蛋白定量4.8 g/24h，提示CKD 4期）；②周围神经病变（双下肢触觉、振动觉及跟腱反射消失）；③高血压（BP 165/92 mmHg）；④贫血（Hb 92 g/L）；⑤高钾血症（K⁺ 5.0 mmol/L）；⑥水肿（晨起眼睑浮肿，午后双踝凹陷性水肿）；⑦阴阳两虚证（夜尿频多、尿如脂膏、五心烦热却怕冷、口干咽燥、饮一溲一、耳轮干枯、面色黧黑、舌淡胖苔白干、脉沉细无力）。隐式线索：轮椅依赖提示活动受限增加跌倒风险；食欲差及浮肿暗示营养不良和容量超负荷；老伴代问鹿茸，反映民间疗法风险认知不足。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition（2型糖尿病晚期阴阳两虚证）与患者表现高度匹配。指南无禁忌症（contraindication: null），但全网扫描安全风险：①药物相互作用：金匮肾气丸含附子（潜在肾毒性）、鹿角胶（可能含钾），患者eGFR 23（严重肾功能不全）和高钾血症（K⁺ 5.0 mmol/L），需避免加剧肾损伤或高钾；②共病风险：神经病变增加中药代谢异常风险，贫血和高钾加重心血管负担。优先级安全：需调整中药剂量、监测电解质，并排除鹿茸使用（含动物源性成分，可能致高钾或药物冲突）。Step 4: 决策生成 (Decision Making) - 基于指南action（强推荐金匮肾气丸加减），采纳为核心方案，但安全优化：①处方金匮肾气丸加减，调整剂量（附子减量）；②紧急处理高钾和水肿；③教育避免鹿茸等民间疗法。",
    "medical_order": "诊断：2型糖尿病晚期，阴阳两虚证；糖尿病肾病（CKD 4期）；糖尿病周围神经病变；高血压3级；贫血；高钾血症。治疗计划：1. 中药处方：予金匮肾气丸加减（附子6g、肉桂3g、熟地黄15g、山萸肉10g、枸杞子10g、炒山药15g、茯苓15g、泽泻10g、巴戟天10g、肉苁蓉10g、菟丝子10g、鹿角胶6g，研磨冲服），每日1剂，分2次口服，监测肾功能及电解质。2. 西药处理：予呋塞米20mg口服每日1次（缓解水肿，监测尿量）；氨氯地平5mg口服每日1次（控制血压）；避免补钾药物。3. 实验室监测：急查血钾、肾功能（eGFR、BUN、Cr）、尿常规，每周复测。4. 生活方式干预：予低盐饮食（<3g/d）、限制蛋白摄入（0.6g/kg/d）。5. 转诊建议：请营养科会诊评估营养支持；若血钾>5.5 mmol/L或eGFR<15，立即转肾内科住院。",
    "patient_dialogue": "老人家，您和老伴辛苦了，推着轮椅过来不容易啊。我看了您的检查，情况是这样的：您的肾和糖尿病问题有点严重了，导致晚上尿多、腿脚肿得厉害，还感觉手脚发麻、没力气，这都跟身体里的水分和营养不平衡有关。您问的鹿茸炖汤啊，这个真不能随便吃——它可能让您体内的钾升高，加重浮肿，甚至伤到肾，咱们得听医生的安全建议。咱们这样办：我给您开个中药方子，是专门调理肾和糖尿病的，叫金匮肾气丸加减，它温和地帮您补身体，但得控制好量，避免副作用。同时，您在家要注意：做菜少放盐，咸菜、酱料都不要碰，这样水肿不会更厉害；多吃点清淡的蔬菜，但别吃香蕉、土豆这些高钾的东西；每天量一下体重和尿量，如果脚肿得穿不了鞋或尿少了，马上来医院。我知道您夜里怕冷还穿棉袜，这是身体虚的表现，咱们慢慢调理会好的。老伴啊，您多帮着监督饮食和吃药，咱们一起努力，让您感觉舒服点。"
  },
  {
    "id": 562,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近半年出现口渴多饮、乏力明显，体重下降约4 kg，夜间小腿抽筋。既往高血压8年，口服氨氯地平5 mg qd，血压控制尚可；否认冠心病及脑卒中史。母亲及姐姐均患2型糖尿病。查体：BMI 27.6 kg/m²，腰围92 cm，BP 136/82 mmHg，HR 78次/分，律齐，双下肢浅感觉略减退。实验室：FPG 9.4 mmol/L，2h-OGTT 16.1 mmol/L，HbA1c 8.7%，TG 2.3 mmol/L，HDL-C 1.0 mmol/L，尿微量白蛋白/肌酐 32 mg/g，肝肾功能正常。患者面色少华，语声低微，舌质偏红、边有齿痕，苔薄少津，脉细数。今日因‘乏力加重、餐后困倦’就诊，希望了解下一步降糖方案。患者自述平日工作忙，经常忘记吃午饭，靠饼干充饥；昨日加班至凌晨1点，今日空腹血糖仍高。无烟酒嗜好，偶尔饮咖啡。患者询问：‘医生，我这种是不是算中期糖尿病？能不能先吃中成药调理，不想马上打胰岛素？’",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证",
      "action": "推荐中成药：金芪降糖片（强推荐，证据等级：A）：饭前半小时服用。一次 2~3片，一日 3次，疗程 3个月或遵医嘱",
      "contraindication": null,
      "evidence": "（6）金芪降糖片（强推荐，证据等级：A）：饭前半小时服用。一次 2~3片，一日 3次，疗程 3个月或遵医嘱。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（重点排除糖尿病酮症酸中毒、低血糖等危急重症），并直接给出治疗指令。患者症状无明显急性危象（如无胸痛、呼吸困难），肝肾功能正常，可专注于常规降糖方案。\n\nStep 2: 临床解码 (Clinical Decoding): 患者症状（口渴多饮、乏力、体重下降4 kg、夜间小腿抽筋、餐后困倦）结合实验室指标（FPG 9.4 mmol/L、2h-OGTT 16.1 mmol/L、HbA1c 8.7%）明确诊断为2型糖尿病。查体BMI 27.6 kg/m²、腰围92 cm提示超重/中心性肥胖；双下肢浅感觉略减退提示糖尿病周围神经病变；尿微量白蛋白/肌酐32 mg/g提示糖尿病肾病微量白蛋白尿。中医证候（面色少华、语声低微、舌质偏红、边有齿痕、苔薄少津、脉细数）符合气阴两虚证。隐式线索包括不良生活习惯（不规律进食、靠高糖饼干充饥、熬夜加班），可能加重代谢紊乱。排除危急重症：无DKA或低血糖迹象，生命体征稳定。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition为'2型糖尿病中期，气阴两虚证'，与患者情况（HbA1c 8.7%提示中期控制不佳，中医证候匹配）完全对齐。Contraindication为null，无绝对禁忌。安全检查：患者服用氨氯地平（降压药），金芪降糖片作为中成药无已知药物相互作用或肝肾毒性，肝肾功能正常支持使用。优先级确保安全（监测血糖及血压）。\n\nStep 4: 决策生成 (Decision Making): 根据指南Action（强推荐A级证据），首选金芪降糖片2-3片tid饭前半小时，同时整合生活方式干预（针对隐式不良习惯）。决策核心为直接降糖方案，避免延误。",
    "medical_order": "诊断：2型糖尿病（中期），气阴两虚证；糖尿病周围神经病变（轻度）；糖尿病肾病（微量白蛋白尿）；高血压（控制中）；高甘油三酯血症；低高密度脂蛋白血症。\n治疗：\n1. 予金芪降糖片 2片 口服 tid，饭前半小时服用，疗程3个月。\n2. 继续氨氯地平 5mg 口服 qd 控制血压。\n3. 生活方式干预：建议糖尿病饮食（低糖、低脂），规律三餐，避免含糖零食；每日中等强度运动（如快走30分钟）。\n4. 监测：每日空腹及餐后2小时血糖（每周至少3次）；血压每日监测；3个月后复查HbA1c、尿微量白蛋白/肌酐、血脂谱。\n5. 教育：强化糖尿病自我管理知识，重点关注症状变化。",
    "patient_dialogue": "张先生，您好！从检查结果看，您的血糖确实偏高，属于中期糖尿病，但别担心，情况还在可控范围内。咱们可以先试试中成药调理——金芪降糖片，它专门针对您这种乏力、口渴的症状，能帮助稳定血糖。每天饭前半小时吃2片，一天三次，坚持三个月，咱们一起看看效果。不过，光吃药不够，您平时工作太忙、常吃饼干充饥，这会让血糖像过山车一样忽高忽低。得改改习惯：尽量按时吃正餐，别跳午饭，饼干换成苹果或坚果；晚上也别熬太晚，保证睡眠。这样配合吃药，效果会更好。三个月后咱们再复查，如果血糖没降下来，我们再讨论其他方案。您觉得能坚持吗？"
  },
  {
    "id": 536,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者因‘咳嗽黄痰伴气短3天，血糖飙升’被轮椅推入诊室。既往T2DM 16年（平日空腹血糖7–8 mmol/L），COPD 12年，近1年因AECOPD住院3次。3天前受凉后痰量增至每日50 ml、色黄黏稠，需张口抬肩呼吸；同时自测空腹血糖波动13–15 mmol/L，口渴明显。查体：T 37.8 ℃，RR 26次/分，SpO₂ 90%（未吸氧），桶状胸，双肺满布哮鸣音及散在湿啰音；舌红、苔黄腻，脉滑数。即刻动脉血气（FiO₂ 0.21）：pH 7.34，PaCO₂ 52 mmHg，PaO₂ 58 mmHg；随机血糖16.4 mmol/L，血酮0.2 mmol/L；WBC 12.3×10⁹/L，NE% 85%；CRP 78 mg/L。胸部CT：双肺散在斑片影，沿支气管分布。今日凌晨在家已雾化沙丁胺醇与异丙托溴铵各1支，症状无缓解。患者抱怨‘痰堵得睡不了觉’，并随口提到‘昨晚忘了打胰岛素，因为忙着给孙女修电风扇’。",
    "reference_rule": {
      "condition": "2型糖尿病合并慢性阻塞性肺疾病急性加重者，痰热互结证",
      "action": "推荐中成药：痰热清注射液（弱推荐，证据等级：C）",
      "contraindication": null,
      "evidence": "① 痰热清注射液（弱推荐，证据等级：C），适用于 2型糖尿病合并慢性阻塞性肺疾病急性加重者。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)** 本案例属于复杂合并症治疗场景，涉及2型糖尿病（T2DM）和慢性阻塞性肺疾病急性加重（AECOPD）的相互作用。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保患者安全（安全 > 疗效）。需评估痰热清注射液与其他治疗方案的兼容性，并监控糖尿病失控与呼吸衰竭的潜在恶化。\n\n**Step 2: 临床解码 (Clinical Decoding)** 从病例中提取关键信息并转化为医学术语：患者呈现AECOPD伴细菌感染（基于黄痰、发热37.8℃、WBC 12.3×10⁹/L、NE% 85%、CRP 78 mg/L及CT斑片影），合并糖尿病酮症倾向（随机血糖16.4 mmol/L、血酮0.2 mmol/L、口渴）；呼吸衰竭（II型，pH 7.34、PaCO₂ 52 mmHg、PaO₂ 58 mmHg、SpO₂ 90%）；中医证候为痰热互结证（舌红苔黄腻、脉滑数）。隐式线索：忘记胰岛素注射加剧高血糖风险；雾化无效提示需升级治疗；反复AECOPD住院史表明病情易复发，需强化管理。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)** 指南Condition“2型糖尿病合并慢性阻塞肺疾病急性加重者，痰热互结证”与病例完全匹配。Action推荐痰热清注射液（弱推荐，证据等级C）。Contraindication为null，无绝对禁忌。安全扫描：痰热清注射液（中药注射剂）潜在风险包括过敏或与β2-agonist（沙丁胺醇）相互作用（可能加剧心动过速），但证据等级弱，风险可控；共病风险优先级：呼吸衰竭和DKA进展为危急（血酮0.2 mmol/L提示早期风险），需先稳定生命体征。未发现重大禁忌，但需监控血糖和呼吸参数。\n\n**Step 4: 决策生成 (Decision Making)** 根据指南Action，推荐痰热清注射液作为辅助治疗；综合安全优先原则，决策包括：控制感染（抗生素）、纠正呼吸衰竭（氧疗）、控制血糖（胰岛素），并强化监测以避免DKA恶化。",
    "medical_order": "予一级护理，吸氧（目标SpO₂ >92%），心电监护。完善血培养及痰培养。静脉滴注阿莫西林克拉维酸钾1.2g q8h抗感染。胰岛素静脉滴注控制血糖（起始0.1 U/kg/h，调整至血糖7-10 mmol/L）。痰热清注射液20ml加入5%葡萄糖注射液250ml静脉滴注qd。监测血糖q2h、动脉血气q4h、血酮及CRP每日。教育患者规范胰岛素注射。",
    "patient_dialogue": "王叔，您这情况确实有点急啊，咱们得赶紧处理。您咳嗽有黄痰，呼吸费劲，血糖也高得厉害，这都说明身体在报警。我会给您打些针药：一个消炎的，一个帮您呼吸顺畅的，还有一个控制血糖的。另外，您说昨晚忘了打胰岛素，这可千万不能大意——血糖太高会让身体更难受，甚至出大问题，以后一定得按时用药。咱们先吸点氧，让您喘气轻松些，护士会经常量血糖和血压，确保您安全。别太担心，我们会帮您挺过去的，但您也得配合，记得以后别因为忙就漏了药。"
  },
  {
    "id": 580,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日复诊，自述近3个月口干、乏力明显，夜间盗汗，晨起自觉手心发热。平日主食偏爱精白米饭，每餐约200 g，且因跑长途货运，常以方便面、火腿肠充饥。昨日自测空腹血糖8.9 mmol/L，晚餐后2 h血糖13.4 mmol/L。查体：BMI 24.7 kg/m²，BP 128/78 mmHg，舌淡红少津、边有齿痕，脉细略数。患者笑称：‘医生，我跑一趟车就得十来个小时，实在没空折腾饭，能不能给我点简单又顶饱的办法？’今日化验：HbA1c 8.1%，尿微量白蛋白/肌酐比值 18 mg/g。患者另诉近两周因天气闷热，左脚踝轻度瘙痒，无破溃。",
    "reference_rule": {
      "condition": "2型糖尿病之气阴两虚证的辅助治疗",
      "action": "食疗方：薯蓣粥。制作及食用方法：生薯蓣（怀山药）150 g。去皮切片，入料理机，加水 50 mL，打成糊，调入 300 mL 凉水，煮沸，1分钟后再煮沸，连煮 3次，成粥。以薯蓣粥代替部分主食，每份相当于 25 g 大米或 35 g 馒头",
      "contraindication": null,
      "evidence": "7.2.2 薯蓣粥...处方：生薯蓣（怀山药）150 g。功用：益气养阴，健脾止泻。适应症：2型糖尿病之气阴两虚证的辅助治疗。制作方法：去皮切片，入料理机，加水 50 mL，打成糊，调入 300 mL 凉水，煮沸，1分钟后再煮沸，连煮 3次，成粥。食用方法：以薯蓣粥代替部分主食，每份相当于 25 g 大米或 35 g 馒头。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于生活方式与风险干预场景，作为健康管理师，我将重点关注识别患者隐式的不良生活习惯（如高糖、高盐饮食、久坐少动），关联长期糖尿病并发症风险（如肾病、心血管疾病），并用共情但坚定的语气提出非药物干预建议。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者主诉口干、乏力、盗汗、手心发热，结合舌淡红少津、边有齿痕、脉细略数，符合中医气阴两虚证；实验室数据（空腹血糖8.9 mmol/L、餐后血糖13.4 mmol/L、HbA1c 8.1%）确诊2型糖尿病控制不佳，尿微量白蛋白/肌酐比值18 mg/g提示早期糖尿病肾病风险；隐式不良习惯：主食过量精白米饭（每餐200g）、依赖加工食品（方便面、火腿肠）、职业久坐导致饮食不规律；左脚踝瘙痒可能为真菌感染，需排除糖尿病足风险。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 参考指南condition为‘2型糖尿病之气阴两虚证的辅助治疗’，与患者证候高度匹配（气阴两虚症状明显）。指南action推荐薯蓣粥食疗方，无禁忌症（contraindication null）；安全检查：薯蓣粥为食物干预，安全无风险，患者无已知山药过敏史或消化禁忌，左脚踝瘙痒不影响食疗应用。\n\nStep 4: 决策生成 (Decision Making) - 采纳指南建议，实施薯蓣粥作为核心辅助治疗；扩展非药物干预：减少精制碳水摄入、增加膳食纤维、血糖监测及瘙痒处理，以改善生活方式并降低长期风险。",
    "medical_order": "诊断：2型糖尿病（气阴两虚证），血糖控制不佳；早期糖尿病肾病风险（尿微量白蛋白/肌酐比值18 mg/g）。予非药物干预：1. 食疗方：薯蓣粥，生怀山药150g去皮切片，加水50mL打糊，调凉水300mL煮沸3次成粥，每餐替代25g大米主食。2. 饮食调整：限制精白米饭摄入至每餐≤100g，避免加工食品（如方便面、火腿肠），增加蔬菜摄入（每日≥300g）。3. 监测：每日测空腹及餐后2h血糖，记录结果；完善1个月后复查HbA1c及尿微量白蛋白/肌酐比值。4. 局部处理：左脚踝瘙痒予抗真菌药膏外用（如酮康唑乳膏），每日2次，观察3天。5. 生活方式建议：增加间歇性活动（如每2小时停车步行5分钟），定期随访。",
    "patient_dialogue": "王师傅，您说最近口干、乏力，还有手心发热、晚上出汗，这些症状啊，都跟您的血糖控制不太好有关系。再加上您的工作跑长途，吃饭不方便，常吃米饭、方便面这些，确实会让血糖更高，时间长了还可能伤到肾，您看尿检结果也提示点风险。不过别担心，咱们一步步来调整。\n\n我给您想了个简单又顶饱的办法：用怀山药煮粥代替一部分米饭。做法特简单——把150g山药去皮切碎，加点水打成糊，再加水煮开几次就行。一碗这个粥顶小半碗米饭的量，还能帮您养阴补气，缓解口干乏力。平时呢，尽量少吃方便面和火腿肠，它们盐分太高；米饭减到一小碗，多加点青菜，这样既扛饿又稳血糖。\n\n另外，您左脚痒的话，可能是天热捂的脚气，我给您开个药膏涂涂，几天就好。血糖呢，每天早起和饭后两小时测一下，记在本子上，下次复诊带来。跑车时，每两小时停个车走几步，活动活动。咱们坚持一个月，下次看看结果，肯定能好起来！"
  },
  {
    "id": 558,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近3个月出现明显口干、多饮，日饮水量约3 L，夜尿2–3次；伴体重下降4 kg（原76 kg→72 kg）。自述乏力明显，午后动则气短，夜间偶有心悸。既往高血压8年，血压控制于135/85 mmHg左右；无冠心病、脑卒中史。母亲及一姐患2型糖尿病。查体：BMI 28.4 kg/m²，腰围98 cm；舌质偏红、边有齿痕，苔薄少津，脉细数。今日空腹指尖血糖9.7 mmol/L，HbA1c 8.1%。患者为夜班出租车司机，担心用药后低血糖影响工作，暂未接受任何降糖治疗，仅自行减少主食。患者同时提及近两周因天气闷热，食欲减退，偶伴胃脘胀满。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证",
      "action": "推荐单验方：孙氏降糖饮（强推荐，证据等级：B）：生黄芪、丹参、太子参、天门冬、五味子、生山楂、麦冬、荷叶、玉米须",
      "contraindication": null,
      "evidence": "推荐的单验方：孙氏降糖饮（强推荐，证据等级：B）：生黄芪、丹参、太子参、天门冬、五味子、生山楂、麦冬、荷叶、玉米须。"
    },
    "thought": {
      "Step 1: 场景定义": "本案例属于常规门诊诊疗场景。重点关注快速建立诊断（排除急性并发症），制定个体化治疗方案，并解决患者职业特殊性带来的用药顾虑。",
      "Step 2: 临床解码": {
        "核心诊断": "2型糖尿病（空腹血糖9.7 mmol/L + HbA1c 8.1% + 三多一少症状 + 家族史）",
        "中医辨证": "气阴两虚证（口干/乏力/气短 + 舌红少津/脉细数）",
        "风险特征": [
          "职业性低血糖风险（夜班司机）",
          "代谢综合征（BMI 28.4 + 中心性肥胖 + 高血压）",
          "治疗障碍：自行限主食未就医"
        ],
        "警报信号": "夜间心悸需排除心血管事件（但无胸痛/ECG异常暂不优先）"
      },
      "Step 3: 规则对齐与安全检查": {
        "指南匹配": "完全符合'2型糖尿病中期，气阴两虚证'条件",
        "禁忌筛查": "无绝对禁忌（中药方无低血糖风险组分，与降压药无冲突）",
        "特殊适配": "孙氏降糖饮温和降糖特性契合患者低血糖顾虑"
      },
      "Step 4: 决策生成": {
        "首要措施": "启动孙氏降糖饮（强证据B级）",
        "延伸管理": [
          "同步血压/心血管风险评估",
          "解决近期胃肠症状（与暑热相关）",
          "建立血糖监测体系"
        ]
      }
    },
    "medical_order": "诊断：2型糖尿病（气阴两虚证），高血压1级。\n1. 予孙氏降糖饮：生黄芪20g、丹参15g、太子参15g、天门冬12g、五味子6g、生山楂10g、麦冬12g、荷叶10g、玉米须15g，日1剂水煎分服\n2. 完善检查：血脂四项、肝功能、尿微量白蛋白/肌酐比值、心电图\n3. 生活方式干预：糖尿病教育，目标BMI<24；每日中等强度运动30分钟\n4. 血压管理：维持现有降压方案，监测晨起/睡前血压\n5. 血糖监测：教会家庭指尖血糖检测（空腹+三餐后2h），每周记录3天\n6. 随诊：2周后复诊调方，若胃脘胀满持续则行胃电图",
    "patient_dialogue": "王师傅，您这情况我仔细看了。首先明确告诉您：这是典型的糖尿病，但别紧张，咱们能控制好！您母亲和姐姐的病历也佐证了这点。好消息是您目前没有急症危险，不过得马上干预了——您这三个月瘦了8斤多，身体就像缺水的树苗，光少吃饭可不行。\n\n给您开个中药方子，里面黄芪、麦冬这些能补气生津，玉米须、荷叶帮您代谢糖分。关键它降糖温和，不会让您开车时突然心慌手抖，您担心的低血糖问题基本不会发生。药汁可能微苦，但比西药副作用小得多。\n\n您夜班辛苦，这三件事得做到：①车上备个血糖仪（我教您用），每周挑两天测早餐前和饭后2小时血糖；②饮料只喝白水或淡茶，那些甜饮料可别再碰；③交班后快走半小时，微微出汗就行。\n\n最近胃胀是暑湿闹的，煎药时加两片生姜。降压药照常吃，但得少吃腌菜酱货——您血压和糖尿病是'难兄难弟'，得一起管。两周后带着血糖记录来找我，咱们看效果调药。记住啊，方向盘在您手里，健康方向盘在我这儿，咱俩配合好！"
  },
  {
    "id": 594,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "58岁男性，货车司机，今日由女儿搀扶步入诊室。主诉：‘右眼看东西像蒙了层红纱，三天。’既往2型糖尿病14年，平日空腹血糖波动9-11 mmol/L，糖化血红蛋白8.7%；高血压8年，控制尚可。3年前因‘急性前壁心梗’植入支架1枚，术后规律服用阿司匹林+氯吡格雷。否认脑卒中、慢性肾病。查体：BMI 31.2 kg/m²，腰围108 cm；右眼视力0.3，左眼0.8；眼底镜下见右眼视网膜散在出血斑、硬性渗出及新生血管，左眼轻微软性渗出。实验室：FPG 10.4 mmol/L，eGFR 78 mL·min⁻¹·1.73 m⁻²，尿微量白蛋白/肌酐 42 mg/g，血脂TC 5.9 mmol/L，TG 3.1 mmol/L。患者自述近期熬夜跑长途，昨日右眼突然眼前黑影飘动，伴轻微胀痛。舌质暗红、边有瘀斑，苔薄白，脉涩。女儿补充：‘他怕耽误活儿，血糖药常漏服，烟也偷偷抽，一天半包。’诊室空调因暴雨故障，患者额上细汗不断，反复询问：‘医生，我眼睛会不会瞎？还能继续开车吗？’",
    "reference_rule": {
      "condition": "2型糖尿病并发糖尿病视网膜病变，血瘀",
      "action": "推荐中成药：复方血栓通胶囊（强推荐，证据等级：A）：一次 3粒，一日 3次",
      "contraindication": null,
      "evidence": "② 复方血栓通胶囊（强推荐，证据等级：A）：一次 3粒，一日 3次。适用于 2型糖尿病并发糖尿病视网膜病变。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险分析，优先确保患者安全（安全 > 疗效）。Step 2: 临床解码 (Clinical Decoding): 患者为58岁男性，关键信息包括：主诉右眼视物模糊三天伴眼前黑影飘动（提示急性视网膜病变进展），眼底镜见右眼散在出血斑、硬性渗出及新生血管（确诊为增生性糖尿病视网膜病变）；既往2型糖尿病14年控制不佳（FPG 10.4 mmol/L，HbA1c 8.7%），高血压8年，冠心病支架术后规律服用阿司匹林+氯吡格雷；隐式线索包括：不规律服药（漏服降糖药）、吸烟（半包/日）、肥胖（BMI 31.2 kg/m²）、熬夜长途驾驶（生活压力），以及舌脉征象（舌暗红瘀斑、脉涩）支持中医血瘀证；实验室示轻度肾损（eGFR 78 mL·min⁻¹·1.73 m⁻²）和血脂异常（TC 5.9 mmol/L，TG 3.1 mmol/L）。整体诊断为2型糖尿病并发增生性糖尿病视网膜病变、高血压、冠心病、肥胖、血脂异常及慢性肾病2期，核心风险为视力丧失、心血管事件及出血倾向。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition '2型糖尿病并发糖尿病视网膜病变，血瘀' 与患者情况高度匹配（视网膜病变+血瘀证）；Contraindication为null，但强制全网扫描安全风险：患者服用阿司匹林+氯吡格雷（抗血小板药），复方血栓通胶囊有活血化瘀作用，可能增加出血风险，需密切监测；共病如肾损（eGFR 78）和高血压未构成绝对禁忌，但强化安全优先级。Step 4: 决策生成 (Decision Making): 基于指南Action，推荐复方血栓通胶囊（一次3粒，一日3次），同时因视网膜新生血管提示高危进展，必须升级转诊眼科急会诊；补充决策包括优化降糖、戒烟干预及安全监控。",
    "medical_order": "诊断：2型糖尿病并发增生性糖尿病视网膜病变（右眼），高血压，冠心病支架术后，肥胖，血脂异常，慢性肾病2期。治疗：1. 予复方血栓通胶囊 3粒 tid 口服。2. 急请眼科会诊评估视网膜激光光凝术指征。3. 调整降糖方案：起始甘精胰岛素 10U hs 皮下注射，联合二甲双胍 500mg bid 口服，目标空腹血糖 ≤7.0 mmol/L。4. 继续阿司匹林 100mg qd + 氯吡格雷 75mg qd。5. 生活方式干预：戒烟、低脂糖尿病饮食（每日热量1800 kcal）、适度运动。6. 监测：每日空腹血糖、血压；3日内复查眼底、肾功能及凝血功能；1周后随访。",
    "patient_dialogue": "王师傅，别着急，慢慢说。您的右眼问题，是因为糖尿病引起的血管出血和新生血管，就像眼睛里的小水管破了，所以看东西像蒙了红纱——这确实有失明风险，但别太担心，咱们马上处理。首先，给您开个药叫复方血栓通胶囊，每天三次，每次三粒，它能帮助疏通血管、减少出血，但得按时吃，千万别漏了！另外，您这情况得赶紧看眼科专家，我这就安排，他们可能用激光治疗止血，防止视力恶化。还有，血糖控制太重要了：您漏吃药可不行啊，血糖高会继续伤害眼睛和心脏，所以今天开始加个胰岛素针，晚上打一次，不疼的，配合原来的药。女儿提醒得对，烟必须戒掉，抽烟会让血管更堵；开车暂时不能干了，视力不稳太危险，等好转再说。您问我眼睛会不会瞎？只要咱们一起努力——吃药、戒烟、控制血糖——就能保住视力！您先休息会儿，我去联系眼科，记住：从今天起，药一顿都不能少，烟一根都别碰！"
  },
  {
    "id": 575,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日由妻子陪同复诊，进门时仍在咳嗽清嗓，自述“喉咙里老有痰黏着”。既往2型糖尿病12年，近半年 HbA1c 8.1%，BMI 29.4 kg/m²；颈动脉超声示双侧斑块形成；昨日空腹血糖 9.7 mmol/L，TG 3.8 mmol/L，ALT 52 U/L（↑）。查体：面色晦暗，舌苔白腻厚，脉滑。患者说跑长途时常吃泡面、喝甜茶提神，昨夜两点才到服务区休息。妻子补充：他夜里鼾声重，白天易打盹。无胸痛、无肢体麻木，但近两周自觉右上腹闷胀。尿微量白蛋白/肌酐 32 mg/g，eGFR 88 mL/min。目前口服二甲双胍 1 g bid 与阿托伐他汀 20 mg qn，血糖仍波动，痰多色白，口黏不爽。",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，痰浊",
      "action": "推荐中成药：护肝片（强推荐，证据等级：B）：一次 4片，一日 3次",
      "contraindication": null,
      "evidence": "② 护肝片（强推荐，证据等级：B）：一次 4片，一日 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，重点关注药物相互作用、禁忌症及共病风险，优先级安全第一。作为专科专家，需进行全网扫描，确保治疗方案在代谢综合征背景下安全有效。Step 2: 临床解码 (Clinical Decoding) - 患者核心问题为2型糖尿病（HbA1c 8.1%提示控制不佳）兼夹痰浊证（痰多色白、口黏不爽、舌苔白腻、脉滑），并存在多重共病：肥胖（BMI 29.4 kg/m²）、高甘油三酯血症（TG 3.8 mmol/L）、肝损伤（ALT 52 U/L↑）、颈动脉斑块、早期肾病（尿微量白蛋白/肌酐 32 mg/g）及疑似睡眠呼吸暂停（鼾声重、白天打盹）。隐式线索包括不良生活方式（高热量饮食如泡面甜茶、熬夜）导致代谢恶化，右上腹闷胀提示潜在脂肪肝或胆囊问题。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件'2型糖尿病兼夹证，痰浊'与患者症状高度匹配；Action推荐护肝片（一次4片，一日3次），证据等级B。安全检查：无禁忌症（Contraindication null），但需全网扫描风险。护肝片（中药制剂，含柴胡等）与当前药物二甲双胍和阿托伐他汀无已知严重相互作用，但阿托伐他汀有肝毒性风险，患者ALT升高需警惕叠加效应；同时，高TG、睡眠问题及血糖波动增加整体风险。优先级安全：护肝片适用，但必须监测肝功并优化其他管理。Step 4: 决策生成 (Decision Making) - 基于指南Action，推荐护肝片；补充综合干预以应对共病，包括生活方式调整、血糖优化及睡眠评估，确保安全优先。",
    "medical_order": "1. 予护肝片口服，一次4片，一日3次。2. 建议低糖低脂饮食，限制高热量食物；规律作息，避免熬夜。3. 监测肝功能（ALT、AST）、空腹血糖及HbA1c（每2周复查）。4. 优化降糖方案：考虑加用SGLT2抑制剂或GLP-1受体激动剂（当前二甲双胍1g bid已达上限，血糖控制不佳）。5. 评估睡眠呼吸暂停：转诊呼吸科行多导睡眠监测。6. 定期复查颈动脉超声及尿微量白蛋白。",
    "patient_dialogue": "张先生，您好！您刚提到喉咙老有痰、口黏不舒服，这和我们中医说的'痰湿'有关，加上您平时跑长途吃泡面、喝甜茶这些习惯，容易让身体里的湿气堆积。另外，您肝功能检查有点高，可能跟熬夜、饮食有关系，咱们先开个护肝片，每天吃三次、每次四片，帮助肝脏恢复。不过，光吃药不够——您血糖控制得不太理想，HbA1c偏高，咱们得把生活习惯改一改：做菜少放油和糖，泡面甜茶尽量别碰，晚上早点休息，别熬到两点。您妻子说您打鼾厉害、白天老犯困，这可能是睡眠呼吸问题，得去呼吸科做个检查，不然长期缺氧对心脏和血糖都不好。别担心，咱们一步步来，先从饮食和休息调整起，好吗？"
  },
  {
    "id": 574,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者52岁，男性，出租车司机，今日因‘口干多饮3月，加重伴胸闷1周’首次来内分泌门诊。体型偏胖（BMI 29.4 kg/m²），腹围102 cm，面色晦暗，舌体胖大、边有齿痕，苔黄腻且厚，脉滑数。随机指尖血糖13.8 mmol/L，空腹静脉血糖8.9 mmol/L，HbA1c 8.1%。自诉平日嗜食辛辣油炸，饮水少，常午夜收车后喝啤酒解渴；近1周胸闷如堵，晨起咳少量黄黏痰，大便黏滞不爽，每日1次。无吸烟史，父亲有2型糖尿病。查体：BP 136/84 mmHg，HR 88次/分，呼吸音清，双下肢无水肿，足部10 g单丝试验正常。尿常规：尿糖（+），尿酮体（–），尿蛋白（–）。",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，痰浊（偏湿热者）",
      "action": "推荐方药：宜黄连温胆汤加减（《重订广温热论》）（弱推荐，证据等级：B），药物组成：黄连、竹茹、枳实、半夏、陈皮、甘草、生姜、茯苓、白术",
      "contraindication": null,
      "evidence": "偏湿热者，宜黄连温胆汤加减（《重订广温热论》）（弱推荐，证据等级：B），药物组成：黄连、竹茹、枳实、半夏、陈皮、甘草、生姜、茯苓、白术；"
    },
    "thought": "作为严谨的医学诊疗专家，我严格按照思维链步骤进行推理：\n\n**Step 1: 场景定义 (Scenario Definition)**\n本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（Differential Diagnosis），排除危急重症（如糖尿病酮症酸中毒或急性心血管事件），并给出最直接的治疗指令，确保方案高效、安全。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从患者病例中提取关键信息并转化为医学术语：患者为52岁男性，肥胖（BMI 29.4 kg/m²，腹围102 cm），HbA1c 8.1%、随机血糖13.8 mmol/L、空腹血糖8.9 mmol/L 确诊为未控制的2型糖尿病；症状包括口干多饮3月（多饮多尿为典型糖尿病表现），加重伴胸闷1周（需鉴别心血管或呼吸道问题）、晨起咳黄黏痰（提示痰湿或轻度感染）、大便黏滞不爽（湿热下注）；舌体胖大边有齿痕、苔黄腻厚、脉滑数为痰浊湿热证的中医证候；生活习惯（嗜食辛辣油炸、饮水少、午夜饮酒）加重湿热；检查排除危急情况（尿酮体阴性、无水肿、呼吸音清、足部正常）。隐式线索：职业（出租车司机）暗示久坐、压力大，可能影响血糖控制；父亲糖尿病史增加遗传风险。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南Condition为'2型糖尿病兼夹证，痰浊（偏湿热者）'，与患者临床表现高度匹配（湿热证据：苔黄腻、脉滑数、胸闷、大便黏滞）。Contraindication为null，无禁忌症；安全检查：患者无药物过敏史或合并用药提及，无急性并发症（如酮症、感染或心衰），方案安全可行。\n\n**Step 4: 决策生成 (Decision Making)**\n根据指南Action（推荐黄连温胆汤加减，证据等级B），生成直接决策：开具黄连温胆汤加减处方，同时结合常规糖尿病管理，补充生活方式干预建议（饮食运动调整），并安排短期随访以监测疗效。优先排除胸闷相关风险（如心电图检查），确保整体方案安全有效。",
    "medical_order": "诊断：2型糖尿病，痰浊（偏湿热）。治疗计划：1. 予黄连温胆汤加减，处方：黄连6g、竹茹10g、枳实10g、半夏10g、陈皮10g、甘草6g、生姜3片、茯苓15g、白术10g，每日1剂水煎分2次服，疗程2周；2. 监测空腹及餐后2小时血糖，每周2次；3. 建议低糖低脂饮食，控制每日热量摄入<1800 kcal；4. 增加中等强度运动，如步行30分钟/日；5. 安排心电图检查排除心脏问题；6. 2周后复诊评估疗效及调整方案。",
    "patient_dialogue": "王先生，您好！看您的情况，检查结果显示血糖偏高，这是典型的糖尿病，需要咱们一起好好管理。我给您开个中药方子，主要是帮您清热化痰——您看您平时胸闷、痰多、大便黏，这中药能调理体内的湿热，让您舒服点。另外，您得调整一下生活习惯：第一，少吃油炸和辛辣食物，这些容易上火；第二，多喝白开水，少喝啤酒，尤其晚上收车后别喝酒，改喝温水；第三，每天抽时间走走步，哪怕20-30分钟，这对控制体重和血糖很有帮助。这些改变不容易，但咱们循序渐进，别着急——坚持下来，血糖就能稳下来，胸闷也会缓解。两周后您再来复查，咱们看看效果，好吗？"
  },
  {
    "id": 555,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者42岁，男性，身高172 cm，体重81 kg，BMI 27.4 kg/m²。主诉近半年明显口干、喜冷饮，每餐食量增加却仍感饥饿，夜尿2-3次，体重自发下降约4 kg。无明显视力模糊、四肢麻木。既往体健，否认高血压、冠心病；父亲有2型糖尿病。抽烟史15年，约10支/日；应酬饮酒每周2-3次，每次白酒100 ml。近期项目交付熬夜频繁，情绪急躁，自述“一点就炸”。查体：BP 128/82 mmHg，HR 88次/分，腹围96 cm，腹壁脂肪厚，肝区轻叩痛。舌边尖红、苔薄黄，脉弦滑。随机指尖血糖11.3 mmol/L，空腹血糖7.8 mmol/L，HbA1c 7.2%。尿常规酮体阴性，蛋白阴性。今日门诊希望明确诊断并获得中医调理建议。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肝胃郁热证",
      "action": "耳穴压丸（弱推荐，证据等级：B）：取穴：脾、胃、肝、胰、神门、小肠、大肠、内分泌、糖尿病点、三焦、皮质下等",
      "contraindication": null,
      "evidence": "推荐的其他疗法：耳穴压丸（弱推荐，证据等级：B）：取穴：脾、胃、肝、胰、神门、小肠、大肠、内分泌、糖尿病点、三焦、皮质下等。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我将快速建立鉴别诊断，排除危急重症（如酮症酸中毒或急性心血管事件），并给出直接、高效的诊疗指令。Step 2: 临床解码 (Clinical Decoding) - 患者表现为典型糖尿病症状：多饮（口干、喜冷饮）、多食（食量增加但饥饿）、多尿（夜尿增加）及体重减轻（自发下降4kg），结合实验室结果（随机血糖11.3 mmol/L > 11.1 mmol/L、空腹血糖7.8 mmol/L、HbA1c 7.2% > 6.5%）确诊为2型糖尿病早期；中医证候为肝胃郁热证（舌边尖红苔薄黄、脉弦滑）；风险因素包括中心性肥胖（BMI 27.4 kg/m²、腹围96 cm）、家族史（父亲2型糖尿病）、不良生活习惯（吸烟15年10支/日、饮酒白酒100ml/次2-3次/周、熬夜频繁、情绪急躁）；隐式线索：肝区轻叩痛提示潜在非酒精性脂肪肝，情绪压力可能加剧血糖波动；排除危急：无酮症（尿酮体阴性）、无神经或视网膜并发症（视力模糊、四肢麻木阴性）。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者情况与指南Condition '2型糖尿病早期，肝胃郁热证' 完全匹配；指南Action推荐耳穴压丸（弱推荐，证据等级B），取穴包括脾、胃、肝、胰等；无禁忌证（Contraindication null），安全检查通过：耳穴压丸为非侵入性，无药物相互作用或共病风险。Step 4: 决策生成 (Decision Making) - 基于指南Action，生成直接指令：明确诊断并实施耳穴压丸作为辅助治疗；同时，作为全面管理，需补充生活方式干预、血糖监测及考虑西药起始，以快速控制病情。",
    "medical_order": "诊断：2型糖尿病，早期；中医辨证：肝胃郁热证。治疗：1. 予耳穴压丸治疗，取穴：脾、胃、肝、胰、神门、小肠、大肠、内分泌、糖尿病点、三焦、皮质下，每周2次，疗程4周。2. 生活方式干预：戒烟（目标0支/日），限酒（白酒≤50ml/次，每周≤1次），规律作息（避免熬夜，保证7-8小时睡眠），减压（每日适度运动30分钟）。3. 饮食建议：低脂低糖饮食，总热量控制（每日1800 kcal），增加膳食纤维。4. 完善检查：血脂、肝功能、肾功能、尿微量白蛋白。5. 血糖监测：每日空腹及餐后2小时指尖血糖，记录日志。6. 药物考虑：起始二甲双胍500mg bid，根据血糖调整。7. 随访：1月后复诊，复查HbA1c及体重。",
    "patient_dialogue": "王先生，您好！别担心，咱们一起看看您的检查结果。您这半年来口干、老想喝凉的、吃得多还饿、夜里起夜多，再加上体重掉了些，这其实是血糖偏高引起的，我们诊断为早期的2型糖尿病。中医上呢，您这是肝胃有热的表现，跟工作压力大、情绪急躁有关。我建议给您做个耳穴压丸治疗，就是在耳朵上贴些小豆子，轻轻按压，能帮助调理身体、控制血糖，没什么副作用，咱们先试试看。同时，您的生活方式要调整一下：戒烟特别重要，因为抽烟会让血糖更难控制；喝酒尽量少喝，每次别超过一小杯白酒；工作别太拼，保证睡眠，晚上11点前休息；饮食上，做菜少放油和糖，多吃蔬菜粗粮，咸菜腌肉也别吃。在家用血糖仪测测血糖，早上和饭后两小时各一次，记下来下次给我看。另外，我可能给您开点药帮助降糖。别急，咱们一步步来，控制好了就能避免更严重的问题，您有信心吗？"
  },
  {
    "id": 535,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者王某，52岁，出租车司机，今日因‘口干多饮2月余’首次来内分泌门诊。自述近2个月每日饮水量由原来1.5 L增至4 L仍不解渴，夜尿3-4次，体重下降约3 kg；食欲旺盛但餐后常胀满嗳气，大便溏薄、日行2次，偶见未消化菜叶。否认明显腹痛、恶心呕吐。既往无高血压、冠心病史，父亲有2型糖尿病。查体：BMI 26.8 kg/m²，腹型肥胖（腰围98 cm），舌淡红、边有齿痕、苔薄黄腻，脉滑偏数。今日随机血糖11.4 mmol/L，空腹静脉血糖7.9 mmol/L，HbA1c 7.2%。患者同时抱怨近一周因天气闷热，车内空调不足，出现轻微头晕、心烦，自测血压128/82 mmHg。",
    "reference_rule": {
      "condition": "2型糖尿病早期，脾胃不和证",
      "action": "推荐单验方：三黄清幽汤（弱推荐，证据等级：B）：茵陈蒿、川芎、党参、黄芩、知母、丹参、桃仁、法半夏、黄连、吴茱萸、炙甘草",
      "contraindication": null,
      "evidence": "推荐的单验方：三黄清幽汤（弱推荐，证据等级：B）：茵陈蒿、川芎、党参、黄芩、知母、丹参、桃仁、法半夏、黄连、吴茱萸、炙甘草。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如排除糖尿病酮症酸中毒或其他急性并发症），优先处理核心问题（糖尿病诊断及脾胃症状），并基于证据给出直接治疗建议。Step 2: 临床解码 (Clinical Decoding) - 患者症状（口干、多饮、多尿、体重下降）结合实验室检查（随机血糖11.4 mmol/L >11.1 mmol/L诊断阈值，空腹血糖7.9 mmol/L >7.0 mmol/L诊断阈值，HbA1c 7.2% >6.5%诊断阈值）确诊2型糖尿病早期；消化系统症状（餐后胀满、嗳气、大便溏薄含未消化物）及舌象（舌淡红、边有齿痕提示脾虚，苔薄黄腻提示湿热）支持脾胃不和证；血压128/82 mmHg正常偏高，头晕心烦可能与炎热环境致轻微脱水或应激相关；腹型肥胖（BMI 26.8 kg/m²，腰围98 cm）需考虑代谢综合征风险。排除危急重症：否认腹痛、恶心呕吐，无酮症酸中毒迹象。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 患者表现与指南Condition '2型糖尿病早期，脾胃不和证' 完全匹配；指南Contraindication为null，无禁忌（如无药物过敏、肝肾功能异常报告）；证据等级为B（弱推荐），需个体化评估患者职业（出租车司机可能影响服药依从性）和血压情况。Step 4: 决策生成 (Decision Making) - 基于指南Action，推荐三黄清幽汤作为核心治疗；补充常规建议：生活方式干预（饮食控制、血糖监测）和短期对症处理头晕症状，确保决策安全（优先排除急性风险）且直接有效。",
    "medical_order": "诊断：2型糖尿病（早期），脾胃不和证。治疗：1. 予三黄清幽汤口服（成分：茵陈蒿、川芎、党参、黄芩、知母、丹参、桃仁、法半夏、黄连、吴茱萸、炙甘草），每日一剂，水煎服，疗程4周。2. 完善基础检查：血常规、肝肾功能、尿常规，评估代谢状态。3. 生活方式干预：糖尿病饮食（低糖、低脂、高纤维），监测每日空腹及餐后2小时血糖。4. 对症处理：补充水分（避免含糖饮料），监测血压变化。随访：2周后门诊复查，评估症状缓解及血糖控制。",
    "patient_dialogue": "王先生，您好！看了您的检查结果，您的血糖确实偏高，确诊为糖尿病早期。别太担心，这很常见，而且发现得早，控制好就没事。另外，您最近总是口干、喝很多水、晚上起夜多，还有饭后胀气、大便不成形的情况，这是因为脾胃功能有点失调。我建议您服用一个中药方子，叫三黄清幽汤，它能帮助降血糖，还能调理脾胃，缓解那些胀气和消化问题。每天熬一剂喝，坚持几周看看效果。同时，您工作上开车时间长，容易累，要注意饮食：少吃甜食和油腻的东西，多吃蔬菜粗粮，这样血糖更稳定；自己买个血糖仪，早上空腹和饭后两小时测一测血糖，记录一下。还有，您说最近感觉头晕、心烦，可能是天气热、车里闷导致的，多喝白开水（别喝甜的饮料），休息时开窗通风。咱们两周后您再来一趟，我看看情况有没有好转。记住，控制好血糖，您还能继续开出租车，生活不受影响的！"
  },
  {
    "id": 581,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者52岁，公交司机，今日由妻子陪同复诊。主诉近两周口渴明显加重，夜班收班后需一次性喝掉1.5 L冰镇可乐才能缓解，尿量随之增多，夜间起夜4-5次，影响睡眠。自述“嘴里老像含着沙子”，晨起咽干至说话沙哑，需先喝温水才能报班。食欲亢盛，平均每顿两碗米饭仍觉饿，体重却下降3 kg。今日空腹血糖9.8 mmol/L，糖化血红蛋白8.1 %。查体：舌红干、苔薄黄，脉细数。妻子补充：家里做饭口味清淡，但他收班后常去烧烤摊，专点羊肉串加大量孜然辣椒，吃完必配冰可乐。患者笑称“方向盘一握就渴，喝甜的最爽”。既往2型糖尿病3年，目前口服二甲双胍0.5 g bid，未规律监测血糖。今日室外38 ℃高温，患者进门时满头大汗，手里还拎着半瓶剩可乐。",
    "reference_rule": {
      "condition": "2型糖尿病之津伤燥热证的辅助治疗",
      "action": "食疗方：偶遇饮。制作及食用方法：玉米须 5 g、枸杞 15 g、芦根 30 g、藕汁 100 mL。共煎约 350 mL 汤汁，混入藕汁 100 mL 搅匀即可。每次 150 mL，饭前饮用",
      "contraindication": null,
      "evidence": "7.2.1 偶遇饮...处方：玉米须 5 g、枸杞 15 g、芦根 30 g、藕汁 100 mL。功用：清热生津。适应症：2型糖尿病之津伤燥热证的辅助治疗。制作方法：玉米须、枸杞、芦根共煎约 350 mL 汤汁，混入藕汁 100 mL 搅匀即可。食用方法：每次 150 mL，饭前饮用。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于生活方式与风险干预场景。作为健康管理师，我的关注重点是识别患者隐式的不良习惯（如频繁摄入高糖饮料和烧烤等高脂食物），关联长期糖尿病并发症风险（如神经病变、肾病或心血管疾病），并用共情但坚定的语气提出非药物干预建议，以改善血糖控制。Step 2: 临床解码 (Clinical Decoding) - 患者52岁男性，2型糖尿病3年病史，症状包括多饮（夜班后饮1.5L冰镇可乐）、多尿（夜间起夜4-5次）、多食（每顿两碗米饭仍饥饿）和体重下降3kg，空腹血糖9.8 mmol/L和糖化血红蛋白8.1%提示糖尿病控制不佳；查体舌红干、苔薄黄、脉细数，符合津伤燥热证；隐式不良习惯包括工作后依赖可乐缓解口渴、摄入辛辣烧烤食物、未规律监测血糖，结合高温环境，增加了脱水和急性高血糖风险。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件为'2型糖尿病之津伤燥热证的辅助治疗'，患者症状（口渴加重、咽干、舌象）精准匹配；指南 contraindication 为 null，无禁忌症，食疗方成分（玉米须、枸杞、芦根、藕汁）安全，无已知药物相互作用或风险。Step 4: 决策生成 (Decision Making) - 基于指南 action，推荐偶遇饮食疗方作为辅助治疗；同时，针对不良习惯，提出生活方式干预建议，包括避免高糖饮料、优化饮食和加强血糖监测，以降低长期风险。",
    "medical_order": "予偶遇饮食疗方辅助治疗2型糖尿病津伤燥热证：玉米须5g、枸杞15g、芦根30g共煎汤350mL，混入藕汁100mL搅匀，每次150mL饭前饮用。建议糖尿病饮食控制，避免高糖饮料及烧烤等高脂食物；加强血糖监测，每日空腹及餐后各一次；继续口服二甲双胍0.5g bid，评估血糖控制，必要时调整剂量；鼓励适量饮水（非含糖饮料）和规律运动。",
    "patient_dialogue": "王先生，我注意到您最近口渴得厉害，下班后总想喝冰可乐解渴，这确实很难受，但咱们得一起想想办法。您喝那么多可乐，虽然一时舒服，但它里面糖分太高，会让血糖飙升，反而让您更渴、尿更多，晚上睡不好觉。而且您喜欢吃烧烤加辣，配上冰饮，这习惯对血糖控制很不利——长期下去，可能会伤到肾、眼睛或心脏，那可麻烦了。我给您推荐一个简单的汤水，用玉米须、枸杞和芦根煮汤，再加点藕汁，饭前喝一小碗，它能清热生津，帮您缓解口干舌燥的感觉，就像给身体'降降火'。以后口渴时，试试喝白水或淡茶，别碰甜饮料了；饮食上，多吃点蔬菜和瘦肉，烧烤摊少去。对了，您得每天测血糖，记在本子上，下次复诊带来看看。我知道开车辛苦，口渴难忍，但慢慢改习惯，血糖稳了，您会感觉更有精神。您妻子也在，咱们一起监督，有什么困难随时告诉我，我们一起加油！"
  },
  {
    "id": 586,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者因“双手指端麻木、灼痛半年，夜间加重”今日复诊。既往2型糖尿病18年，近3年胰岛素方案为“地特18U qn+门冬三餐前8U”，但近半年HbA1c仍8.7%。合并高血压、血脂异常；3年前曾患“急性下壁心梗”，PCI术后规律服用阿司匹林+美托洛尔。无吸烟史，已戒酒10年。查体：BP 146/82 mmHg，BMI 28.4 kg/m²，腰围102 cm；双侧足背动脉搏动减弱，振动觉踝部消失，膝腱反射未引出；双手握力4级，指端痛觉过敏，呈“手套”样分布。实验室：eGFR 52 mL·min⁻¹·1.73 m⁻²（CKD 3a），尿白蛋白/肌酐 420 mg/g；空腹C肽0.8 ng/mL；TC 5.9 mmol/L，LDL-C 3.4 mmol/L。患者主诉近两周因天气转冷，凌晨常被手痛惊醒，需不停甩手才能再入睡，自行加用布洛芬效果不佳，担心“会不会也烂脚”。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，阴阳两虚证，糖尿病并发周围神经病变，上肢麻木、疼痛",
      "action": "艾灸配穴：加曲池、外关、合谷",
      "contraindication": null,
      "evidence": "配穴：上肢麻木、疼痛加曲池、外关、合谷；"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于复杂合并症治疗场景。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保安全（如避免肾毒性药物和神经损伤），再追求疗效（如疼痛缓解和代谢控制）。\n\n**Step 2: 临床解码 (Clinical Decoding)**：患者关键信息包括：1. 2型糖尿病18年控制不佳（HbA1c 8.7%），提示长期高血糖导致微血管并发症；2. 周围神经病变典型表现（双手麻木、灼痛，“手套”样分布，振动觉消失），近期因寒冷加重，影响睡眠和生活质量；3. 多重合并症：心血管风险（PCI术后、高血压未控BP 146/82 mmHg）、血脂异常（LDL-C 3.4 mmol/L未达标）、肾功能不全（eGFR 52 mL·min⁻¹·1.73 m⁻²，CKD 3a期）；4. 隐式线索：胰岛素抵抗（空腹C肽0.8 ng/mL）、肥胖（BMI 28.4 kg/m²）增加代谢负担，自行使用布洛芬无效且可能加重肾损伤，患者焦虑“烂脚”暗示糖尿病足溃疡恐惧。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：患者符合指南条件“2型糖尿病晚期并发周围神经病变，上肢麻木、疼痛”。指南无禁忌症（contraindication null），但全网扫描发现安全风险：1. 肾功能不全（eGFR 52）需避免肾毒性药物（如NSAIDs）；2. 周围神经病变导致感觉减退，艾灸有潜在烫伤风险；3. 药物相互作用：当前阿司匹林和美托洛尔无直接冲突，但需监测血压和心率波动。安全优先级确认：艾灸可应用，但需结合防护和监测。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南 action“艾灸配穴：加曲池、外关、合谷”，决策为实施该方案，同时整合多学科管理：优化降糖、强化心血管保护，并教育患者避免自行用药。",
    "medical_order": "1. 予艾灸治疗，配穴曲池、外关、合谷，每日1次，疗程4周；操作时监测皮肤温度，避免烫伤。2. 优化降糖方案：调整胰岛素为地特20U qn + 门冬三餐前10U，目标HbA1c <7.0%；监测血糖谱q.d.。3. 神经病变管理：加用普瑞巴林75mg q.n.起始（根据eGFR调整剂量），评估疼痛评分。4. 心血管及肾保护：强化降压（目标BP <130/80 mmHg），予氨氯地平5mg q.d.；降脂治疗，予阿托伐他汀20mg q.n.（目标LDL-C <1.8 mmol/L）；停用NSAIDs；监测肾功能及尿白蛋白/肌酐q.month。5. 生活方式干预：低热量饮食，目标BMI <25 kg/m²。6. 转诊内分泌科及肾病科会诊。",
    "patient_dialogue": "王先生，您好！看到您因为手指麻木和疼痛，晚上睡不好觉，真的很心疼。别担心，咱们一步一步来解决。首先，您说的这个手痛是糖尿病引起的神经问题，天气一冷就容易加重，这是常见的。我建议给您做个艾灸治疗——就像温和的热敷，重点在手臂几个穴位上，每周几次，能帮助缓解疼痛和麻木感。不过，做的时候我们会小心温度，防止烫伤，因为您的神经可能不太敏感。另外，您的血糖控制得还不够理想，这会让神经问题更糟，所以我们得调整一下胰岛素剂量，目标是把血糖降下来，这样手痛也会好一些。您之前自己吃的布洛芬就别用了，它对肾脏不好，咱们换一种更安全的止痛药。还有，血压和血脂也得管紧点，否则对心脏和肾脏负担大。我理解您怕脚出问题，咱们平时多注意保暖，穿宽松鞋子，每天检查脚部皮肤。记住，戒烟戒酒您做得很好，继续保持！这些措施配合起来，能大大降低风险。您觉得怎么样？有什么问题尽管问我，我们一起努力！"
  },
  {
    "id": 523,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者王某，42岁，出租车司机，因‘体检发现空腹血糖7.8 mmol/L’今日首次来内分泌门诊。自述近3月体重增加4 kg，无明显多饮多尿，但常感口黏、晨起口臭，需嚼口香糖才能缓解。饭后上腹堵胀，必解大便却黏马桶、气味重，小便色深黄。昨日夜班后未进餐，今晨舌象：舌红胖、边见齿痕，苔黄厚腻；脉滑数，右关尤甚。BMI 29.4 kg/m²，腰围102 cm。随机指尖血糖11.2 mmol/L，余未查。患者担心‘会不会打胰岛素’，反复询问是否必须请假休息。",
    "reference_rule": {
      "condition": "2型糖尿病早期，肠道湿热证。临床表现：口干不渴，或有口臭，脘腹痞满，大便黏腻不爽，或臭秽难闻。小便色黄，舌红，舌体胖大，或边有齿痕，苔黄腻，脉滑数。多见于肥胖、高血糖、有肠道菌群失调表现者",
      "action": "推荐方药：葛根黄芩黄连汤加减（《伤寒论》）（强推荐，证据等级：A）合三仁汤（《温病条辨》）（弱推荐，证据等级：C），药物组成：葛根、黄芩、黄连、厚朴、半夏、苦杏仁、白蔻仁、薏苡仁、滑石、通草、白术",
      "contraindication": null,
      "evidence": "推荐方药：葛根黄芩黄连汤加减（《伤寒论》）（强推荐，证据等级：A）合三仁汤（《温病条辨》）（弱推荐，证据等级：C），药物组成：葛根、黄芩、黄连、厚朴、半夏、苦杏仁、白蔻仁、薏苡仁、滑石、通草、白术。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景。作为门诊医生，我将快速建立鉴别诊断，排除危急重症（如急性糖尿病并发症），并基于直接证据给出简洁的诊疗指令。关注重点包括：确认2型糖尿病诊断、评估胃肠湿热证候、排除急性风险（如酮症酸中毒或感染），并立即启动治疗。Step 2: 临床解码 (Clinical Decoding)：患者关键信息包括：空腹血糖7.8 mmol/L和随机指尖血糖11.2 mmol/L均符合WHO糖尿病诊断标准（空腹≥7.0 mmol/L或随机≥11.1 mmol/L）；症状如体重增加（3月增4kg）、口黏、口臭、饭后上腹堵胀、大便黏腻难解、小便深黄，结合舌象（舌红胖、边齿痕、苔黄厚腻）和脉象（滑数、右关尤甚），转化为医学术语：2型糖尿病早期、肥胖（BMI 29.4 kg/m²，腰围102 cm提示中心性肥胖）、代谢综合征、胃肠功能紊乱（如功能性消化不良）。隐式线索：久坐职业（出租车司机）导致活动不足，饮食不规律（夜班未进餐）可能加重胰岛素抵抗；口臭和需嚼口香糖暗示口腔菌群失调或湿热内生；饭后必解大便且黏马桶提示肠道湿热证。无多饮多尿、胸痛或发热，排除了急性高血糖危象或心脑血管急症。Step 3: 规则对齐与安全检查 (Alignment & Safety)：指南condition为'2型糖尿病早期，肠道湿热证'，与患者表现高度一致（口干不渴、口臭、脘腹痞满、大便黏腻、小便色黄、舌红胖苔黄腻、脉滑数）。Contraindication为null，无禁忌症（无药物过敏史或共病提及），方案安全。Step 4: 决策生成 (Decision Making)：根据指南action，核心决策为开具中药处方（葛根黄芩黄连汤加减合三仁汤）。补充建议：结合患者肥胖和职业，加入生活方式干预（饮食控制和运动），并安排随访以监测疗效，避免升级到胰岛素治疗。",
    "medical_order": "诊断：2型糖尿病早期，肠道湿热证；肥胖。处理：1. 予中药处方：葛根黄芩黄连汤加减合三仁汤（组成：葛根、黄芩、黄连、厚朴、半夏、苦杏仁、白蔻仁、薏苡仁、滑石、通草、白术），每日一剂，水煎分两次服。2. 生活方式干预：建议低热量饮食（每日热量控制在1800-2000 kcal），增加身体活动（如每日快走30分钟），避免久坐。3. 监测：嘱患者自测空腹血糖每周三次，2周后复查HbA1c及肝肾功能。4. 随访：安排2周后门诊复诊评估症状及血糖控制。备注：无需胰岛素治疗，可继续日常工作。",
    "patient_dialogue": "王先生，您好！从检查结果看，您的血糖确实偏高，诊断是2型糖尿病早期。别太担心，现在情况还不需要打胰岛素——咱们先用中药调理一下，您平时那些口臭、腹胀和大便黏腻的问题，中医认为是体内有湿热，特别是肠胃这块儿。我给您开个方子，能清热祛湿，帮您感觉舒服些。另外，您的体重增加和血糖问题，跟工作久坐有关，建议您平时开车时多找机会活动活动，比如停车时下来走走，每天坚持半小时快走就行。饮食上，注意少吃油腻和高热量的食物，多吃点蔬菜，这样能帮助控制体重和血糖。两周后咱们再复查一下血糖，看看效果。工作方面，不用请假，正常上班就可以，但要记得监测血糖，早上空腹时自己测测。坚持下来，血糖就能慢慢稳定，身体也会轻松不少！"
  },
  {
    "id": 559,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近半年自觉午后潮热、双手指尖麻木，夜间盗汗明显，晨起口干咽燥。2型糖尿病病史8年，近3个月空腹血糖7.8-9.2 mmol/L，糖化血红蛋白8.1%。既往高血压10年，控制尚可。查体：BMI 24.7 kg/m²，面色少华，舌偏红少津、边有齿痕，苔薄白，脉细数略弦。主诉劳累后心悸、偶发视物模糊；无胸痛及明显下肢水肿。今日因‘总觉得气不够、心里发慌’前来就诊，希望调整降糖方案。患者为夜班出租车司机，长期作息颠倒，否认吸烟饮酒，但每日咖啡3-4杯。实验室：TC 5.9 mmol/L，LDL-C 3.6 mmol/L，eGFR 92 mL/min，尿微量白蛋白/肌酐比正常。",
    "reference_rule": {
      "condition": "2型糖尿病中期，气阴两虚证，以心肝两虚为主者",
      "action": "推荐方药：宜当归补血汤合一贯煎",
      "contraindication": null,
      "evidence": "心肝两虚为主者宜当归补血汤合一贯煎；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规诊断与治疗场景，作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如急性冠脉综合征、糖尿病酮症酸中毒或严重低血糖），并基于指南给出最直接的调整方案。Step 2: 临床解码 (Clinical Decoding): 患者2型糖尿病8年病史，血糖控制不佳（空腹血糖7.8-9.2 mmol/L, HbA1c 8.1%），症状包括午后潮热、盗汗、口干、心悸、视物模糊和指尖麻木，结合查体（面色少华，舌红少津边有齿痕，脉细数略弦）提示气阴两虚证，以心肝两虚为主；实验室显示高脂血症（TC 5.9 mmol/L, LDL-C 3.6 mmol/L）增加心血管风险；隐式线索包括长期作息颠倒和过量咖啡摄入（每日3-4杯）可能加剧血糖波动、神经病变和心悸。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南条件‘2型糖尿病中期，气阴两虚证，以心肝两虚为主者’匹配患者证候（病程8年、症状和舌脉）；无禁忌症（contraindication null），安全性检查：中药方与患者西药（降压药，未明确提及）无已知冲突，高脂血症和咖啡因摄入需监测但非绝对禁忌。Step 4: 决策生成 (Decision Making): 根据指南action，优先予当归补血汤合一贯煎作为核心治疗；同时优化降糖方案（患者主诉），加强生活方式干预以管理心血管风险。",
    "medical_order": "诊断：2型糖尿病血糖控制不佳（HbA1c 8.1%），气阴两虚证（以心肝两虚为主）；高脂血症（TC 5.9 mmol/L, LDL-C 3.6 mmol/L）。治疗：1. 予当归补血汤合一贯煎，每日一剂，水煎服。2. 调整降糖方案：优化口服降糖药，如加用二甲双胍或SGLT2抑制剂，目标空腹血糖<7.0 mmol/L，HbA1c<7.0%。3. 生活方式干预：减少咖啡摄入至每日≤2杯，规律作息，避免夜班过度劳累。4. 监测：每周测空腹血糖2次，2月后复查HbA1c；建议眼科检查评估视物模糊，3月后复查血脂谱。5. 维持当前降压治疗（控制尚可）。",
    "patient_dialogue": "老张，您好！听您说最近总感觉心慌、气不够，还有出汗、口干这些症状，结合您的糖尿病和高血压情况，中医上认为这是‘气阴两虚’，就是身体能量和水分不足了，特别是心和肝有点虚。我给您开个中药方子，叫当归补血汤合一贯煎，能帮您补气养阴，慢慢调理这些不舒服。另外，您血糖控制得不太理想，咱们得调整一下降糖药，比如加一种新药，让血糖更稳定，这样心慌和眼睛模糊也会好一些。您开夜班车，作息不规律，这会让身体更累，尽量找时间多休息，别连续熬夜。还有，您每天喝好几杯咖啡，虽然提神，但喝太多会让心跳更快、血糖波动，建议减到一天一两杯就够了。坚持这些调整，您会感觉精神好些，气也顺了。咱们定期复查，有问题随时找我，别担心！"
  },
  {
    "id": 599,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "58岁女性，今日在社区门诊复诊。主诉：近3个月来双足麻木刺痛加重，夜间明显，影响睡眠；偶有胸闷，活动后减轻。既往史：2型糖尿病8年，目前口服二甲双胍1.0 g bid＋达格列净10 mg qd，自测空腹血糖7.8–9.2 mmol/L，HbA1c 8.1%（去年12月）。高血压10年，最高160/96 mmHg，现用氨氯地平5 mg qd，血压控制于135/82 mmHg左右。两年前因“急性前壁心肌梗死”于上级医院行PCI术，术后规律服用阿司匹林100 mg＋氯吡格雷75 mg qd，LDL-C 1.6 mmol/L。无吸烟饮酒史。父亲因“脑梗”去世。查体：BMI 29.4 kg/m²，腰围96 cm；双足背动脉搏动减弱，10 g尼龙丝试验示保护性感觉缺失；舌暗红、边有瘀斑，苔薄白，脉涩。实验检查：FPG 8.9 mmol/L，2h-PPG 13.4 mmol/L，HbA1c 8.0%，TG 2.1 mmol/L，HDL-C 0.92 mmol/L，尿Alb/Cr 42 mg/g（微量白蛋白尿），eGFR 78 ml·min⁻¹·1.73 m⁻²。ECG：陈旧性前壁Q波形成，T波低平。患者今日还提到“最近家里装修，灰尘大，喉咙有点痒”，但无发热咳嗽。",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，血瘀",
      "action": "推荐方药：血府逐瘀汤（强推荐，证据等级：B）（《医林改错》），药物组成：当归、生地、桃仁、红花、枳壳、赤芍、柴胡、甘草、桔梗、川芎、牛膝",
      "contraindication": null,
      "evidence": "或血府逐瘀汤（强推荐，证据等级：B）（《医林改错》），药物组成：当归、生地、桃仁、红花、枳壳、赤芍、柴胡、甘草、桔梗、川芎、牛膝。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，涉及2型糖尿病、高血压、冠心病（PCI术后）、糖尿病周围神经病变、糖尿病肾病早期及血脂异常等多重疾病。作为专科专家，我将重点关注全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗方案的安全性（安全 > 疗效）。Step 2: 临床解码 (Clinical Decoding): 从病例中提取关键信息：患者主诉双足麻木刺痛加重（提示糖尿病周围神经病变进展）和胸闷活动后减轻（可能为稳定型心绞痛或心血管自主神经病变）。隐式线索包括血糖控制不佳（HbA1c 8.0%，FPG 8.9 mmol/L，2h-PPG 13.4 mmol/L，需强化降糖）、微量白蛋白尿（尿Alb/Cr 42 mg/g，表明糖尿病肾病早期）、血脂异常（TG 2.1 mmol/L升高，HDL-C 0.92 mmol/L降低）、肥胖（BMI 29.4 kg/m²，腰围96 cm）及中医血瘀证（舌暗红有瘀斑，脉涩）。此外，eGFR 78 ml·min⁻¹·1.73 m⁻²提示轻度肾功能下降，ECG T波低平反映心肌缺血风险，喉咙痒为环境刺激，无感染迹象。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南 Condition '2型糖尿病兼夹证，血瘀' 与患者血瘀证表现完全匹配。指南 Action 推荐血府逐瘀汤（强推荐），且 Contraindication 为 null（无禁忌症）。但强制全网扫描安全风险：血府逐瘀汤成分（如红花、桃仁）具有抗血小板作用，与患者当前阿司匹林+氯吡格雷双重抗血小板治疗联用，可能增加出血风险；同时，患者eGFR轻度下降需监测中药对肾功能影响。无直接药物相互作用（如与二甲双胍、达格列净、氨氯地平无冲突），但安全优先，建议监测凝血功能和肾功能。Step 4: 决策生成 (Decision Making): 根据指南 Action，生成决策：处方血府逐瘀汤以改善血瘀证，并结合复杂合并症管理，强化降糖（目标HbA1c <7%）、处理血脂异常及监测心血管风险。",
    "medical_order": "诊断：1. 2型糖尿病伴周围神经病变、糖尿病肾病早期（微量白蛋白尿）；2. 高血压；3. 冠心病PCI术后；4. 血脂异常（高TG、低HDL）；5. 血瘀证（中医）。治疗：予血府逐瘀汤口服，每日一剂（组成：当归、生地、桃仁、红花、枳壳、赤芍、柴胡、甘草、桔梗、川芎、牛膝）。强化降糖方案：加用GLP-1受体激动剂（如利拉鲁肽）皮下注射，起始剂量0.6 mg qd，调整二甲双胍至1.0 g tid。继续现有降压（氨氯地平5 mg qd）及抗血小板治疗（阿司匹林100 mg qd + 氯吡格雷75 mg qd）。处理血脂：予非诺贝特200 mg qd降TG。监测：完善24小时动态心电图评估胸闷；每周监测空腹及餐后血糖、每2周查凝血功能（PT、APTT）、每月复查尿Alb/Cr及eGFR；健康教育生活方式干预。",
    "patient_dialogue": "阿姨，您这几个月脚麻得厉害，晚上都睡不好觉，这其实是糖尿病引起的神经损伤，再加上中医说的'血瘀'问题——就是血液循环不太通畅了。我给您开个中药方子，叫血府逐瘀汤，每天煮一包喝，它能帮助疏通血管，减轻脚麻。另外，您血糖控制得还不够理想，咱们得加个新药，打个小针（比如利拉鲁肽），这样能更好降糖，保护您的肾脏和心脏——血糖太高了，时间久了脚麻会更重，还可能影响心脏。还有，您血脂有点高，我加个小药片（非诺贝特）来调理。家里装修灰尘大，您喉咙痒，尽量少待在里边，多开窗通风，多喝水，别让灰尘刺激了。您体重超标了点，咱们一起努力：每天走走路，少吃油腻，多吃青菜，慢慢减点体重——这对血糖和心脏都好。记得按时吃药，定期来复查，我会帮您盯着出血风险（比如刷牙出血或淤青），别担心，咱们一步步来！"
  },
  {
    "id": 607,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者近一周自觉胃脘胀满，食后2小时仍感食物‘顶在喉咙’，伴恶心无呕吐；已5日未解成形大便，仅少量羊屎样粪块，需开塞露方得些许。平素空腹血糖7.8–9.4 mmol/L，HbA1c 8.1%。既往：糖尿病视网膜病变（非增殖期）、高血压3级、高脂血症；2年前因“酮症酸中毒”住院一次。目前口服二甲双胍0.5 g tid、达格列净10 mg qd、甘精胰岛素20 U睡前，血压用贝那普利20 mg qd控制于135/82 mmHg左右。查体：BMI 31.4 kg/m²，腹型肥胖，腹软但上腹轻压痛，肠鸣音4次/分、偏低钝；双足10 g单丝试验保护性感觉减弱。实验室：eGFR 62 mL·min⁻¹·1.73 m⁻²（CKD G2），尿白蛋白/肌酐比42 mg/g；余肝功、电解质正常。腹部立位片：结肠脾曲少量积气，未见液平。今日气温突降，患者自述‘怕冷、手脚凉’，仍坚持每日步行3 000步。患者焦虑地低声询问：‘医生，这肚子胀得睡不了，降糖药还继续吃吗？’",
    "reference_rule": {
      "condition": "2型糖尿病胃轻瘫便秘患者",
      "action": "穴位贴敷（弱推荐，证据等级：B）。选穴：神阙穴。药物组成：大黄、木香、厚朴比例为 5:1:1",
      "contraindication": null,
      "evidence": "7.6.2 穴位贴敷...选穴：神阙穴。药物组成：大黄、木香、厚朴比例为 5:1:1。（弱推荐，证据等级：B）"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及2型糖尿病、高血压、高脂血症、慢性肾病（G2）及胃轻瘫症状的交互作用。作为博学的专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保安全（安全 > 疗效），包括评估降糖药、抗高血压药的潜在影响，以及气温突降对微循环的隐式风险。Step 2: 临床解码 (Clinical Decoding) - 患者核心诊断为2型糖尿病合并胃轻瘫（表现为胃脘胀满、食后饱胀感、恶心）和功能性便秘（需开塞露、羊屎样粪便），并伴有糖尿病视网膜病变（非增殖期）、高血压3级、高脂血症、慢性肾病（eGFR 62 mL·min⁻¹·1.73 m⁻²，CKD G2）、周围神经病变（双足保护性感觉减弱）及肥胖（BMI 31.4 kg/m²）。隐式线索包括：血糖控制不佳（HbA1c 8.1%），SGLT2抑制剂（达格列净）可能加重脱水风险（气温突降加剧），二甲双胍在肾功能临界值（eGFR>45但<60）下需谨慎，焦虑情绪可能影响治疗依从性，以及气温变化可能诱发血管痉挛。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南针对'2型糖尿病胃轻瘫便秘患者'，患者症状（胃轻瘫和便秘）与指南Condition完全匹配。指南Action为穴位贴敷（神阙穴，药物大黄、木香、厚朴比例5:1:1），证据等级B（弱推荐）。Contraindication为null，但全网扫描：无直接药物相互作用（贴敷外用，与二甲双胍、达格列净、贝那普利无冲突），无过敏史提示（病例未报告），但需排除皮肤破损（查体腹软，无提及）。安全优先：eGFR 62允许二甲双胍继续；达格列净需防脱水（气温降、步行活动）；整体风险低，建议作为辅助治疗。Step 4: 决策生成 (Decision Making) - 基于指南，生成决策：推荐穴位贴敷作为核心干预（弱推荐证据），同时整合多病管理（优化血糖控制、便秘综合处理），确保安全为首要。",
    "medical_order": "1. 予穴位贴敷治疗：神阙穴，每日一次，药物组成大黄、木香、厚朴比例为5:1:1。2. 维持当前降糖方案（二甲双胍0.5 g tid、达格列净10 mg qd、甘精胰岛素20 U hs），监测空腹血糖及HbA1c，目标HbA1c<7.0%。3. 优化便秘管理：增加膳食纤维摄入（每日≥25 g），鼓励饮水1.5-2 L/日，避免开塞露依赖；若无效，考虑加用渗透性泻药（如聚乙二醇）。4. 继续贝那普利20 mg qd控制血压，监测维持在<140/90 mmHg。5. 监测肾功能（eGFR、尿白蛋白/肌酐比）、足部神经病变（每3月单丝试验），警惕气温变化对微循环影响。6. 安排1周后复诊评估贴敷疗效及症状变化。",
    "patient_dialogue": "张先生，我理解您现在肚子胀得厉害，连觉都睡不好，心里肯定很着急。别担心，咱们一步一步来。首先，针对您腹胀和便秘的问题，我建议在您肚脐这儿贴个药贴，每天贴一次就行，它就像个小帮手，能帮您舒缓肠胃、促进排便。另外，您问的那些降糖药——二甲双胍、达格列净和胰岛素——必须继续吃，不能停！因为它们是在保护您的心脏、肾脏和眼睛，如果随便停了，血糖会乱跳，问题更大。现在天气突然变冷，您说手脚凉，这可能会让身体更干燥，所以多喝温水，做菜时少放盐，咸菜也别碰，这样能帮您稳住血压。平时走路挺好的，但天冷时注意保暖，穿厚袜子保护脚。至于便秘，多吃点青菜水果，比如苹果、燕麦，多喝水，别老用开塞露（那个挤肠子的东西），咱们试试自然的方法。我会开药贴给您，您坚持用，下周再来找我复查，咱们看效果。放松点，我们一起努力，很快就能舒服起来的。"
  },
  {
    "id": 570,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日由老伴推轮椅进入内分泌专科诊室。主诉：近2周双眼视物模糊加重，尤其夜间出现飞蚊症；同时双小腿抽筋，凌晨明显。既往史：2型糖尿病22年，近5年转入胰岛素四针方案；高血压18年；3年前因急性下壁心梗植入支架1枚；去年发现微量白蛋白尿。长期吸烟史（已戒7年）。查体：BP 146/82 mmHg，BMI 24.7 kg/m²，腰围98 cm；双眼晶状体周边轻度混浊，眼底镜下见后极部散在硬性渗出及点状出血；双下肢振动觉减弱，踝反射未引出。实验室（上周外院）：FPG 8.9 mmol/L，HbA1c 8.1%，eGFR 52 mL·min⁻¹·1.73 m⁻²（CKD-EPI），尿ACR 67 mg/mmol；ALT 28 U/L，TBil 14 μmol/L；血脂：TG 2.4 mmol/L，LDL-C 1.8 mmol/L。舌象：舌偏红少津、苔薄白；脉象：细数。老伴补充：患者近半年情绪烦躁，睡眠差，常夜间口干喝水。患者本人最关心的是\"眼睛会不会瞎\"，并询问除了胰岛素外，是否还有别的药能阻止视力恶化。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，肝肾阴虚证",
      "action": "推荐中成药：和血明目片（强推荐，证据等级：B）：一次 5片，一日 3次",
      "contraindication": null,
      "evidence": "③ 和血明目片（强推荐，证据等级：B）：一次 5片，一日 3次。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于复杂合并症治疗场景（患者同时存在糖尿病视网膜病变、糖尿病肾病、周围神经病变、冠心病及高血压）。作为专科专家，需全网扫描药物相互作用、禁忌症及共病风险，优先级：安全 > 疗效。\n\nStep 2: 临床解码 - \n- 核心问题：进行性视力恶化（NPDR活动期证据：飞蚊症+眼底出血/渗出）+ 糖尿病微血管并发症（eGFR↓、尿ACR↑、神经病变体征）\n- 关键风险：胰岛素抵抗（HbA1c 8.1%未达标）、血压控制不佳（146/82 mmHg）、使用抗血小板药（支架术后）与潜在出血性中药的相互作用\n- 中医证候：舌红少津/脉细数/口干→肝肾阴虚证（与指南condition匹配）\n- 患者诉求：视力恐惧（需优先心理安抚）\n\nStep 3: 规则对齐与安全检查 - \n- 指南condition'2型糖尿病晚期，肝肾阴虚证'完全匹配\n- 和血明目片禁忌症核查：①无凝血障碍（TBil/ALT正常） ②未用华法林（支架术后常规双抗非绝对禁忌） ③eGFR 52＞30（无需减量）→无绝对禁忌\n- 风险提示：需监测抗血小板药（如氯吡格雷）与中药的出血协同效应\n\nStep 4: 决策生成 - 采纳指南强推荐（和血明目片），但必须：①联合眼科急会诊（排除视网膜脱离） ②优化基础治疗（血糖/血压/神经病变） ③制定安全监测计划",
    "medical_order": "1. 药物治疗：\n   - 和血明目片 5片 po tid（针对糖尿病视网膜病变，肝肾阴虚证）\n   - 继续当前胰岛素方案，加用达格列净 10mg po qd（辅助降糖及心肾保护，eGFR>45适用）\n   - 氯沙坦增至 100mg po qd（目标血压<130/80 mmHg，降低尿蛋白）\n   - α-硫辛酸 600mg ivgtt qd ×14天（改善神经病变性抽筋）\n2. 紧急会诊：即刻转诊眼科（24-48小时内），完善OCT及荧光血管造影\n3. 监测计划：\n   - 每周自查视力（Amsler格）\n   - 3日后复测FPG、血肌酐、凝血酶原时间\n   - 4周后复查HbA1c、尿ACR、眼底\n4. 非药物干预：严格戒烟（已戒）、限钠<5g/d",
    "patient_dialogue": "老人家，咱们分三步来解决您的问题：\n\n第一，您最关心的眼睛：\n- 您说的飞蚊症和看不清，是因为糖尿病影响了眼底的小血管。我给您开个叫'和血明目片'的专治中药，每天三次、每次五片，能帮助止血和修复血管。\n- 但光靠药不够，必须马上联系眼科专家做详细检查（拍个眼底照片），咱们得确认视网膜有没有更严重的问题——这事不能拖，这两天就安排您去！\n\n第二，全身调理：\n- 腿抽筋是神经受损的表现，需要输液治疗两周（每天半小时），能营养神经缓解症状。\n- 血糖和血压还得再优化，我给您加个新药丸（达格列净），既能降糖又能护肾，还能帮您减点体重（拍拍患者肚子）。降压药也稍微加量，保护好肾脏。\n\n第三，生活注意：\n- 您戒了烟特别好！但做菜要更淡些，咸鱼酱菜这些千万别碰。\n- 床头放个小本子，每天早晨画下这个方格图（展示Amsler格），如果发现线条变歪马上来医院。\n\n别太担心，咱们发现的还算及时。先把眼睛检查做了，我全程跟进您的情况！"
  },
  {
    "id": 583,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者3年前确诊2型糖尿病，平素用二甲双胍0.5 g tid+格列美脲2 mg qd，近4个月出现双足趾麻木、刺痛，夜间加重；2周前突发右眼视物模糊，外院眼底照相示‘视网膜颞上支静脉旁片状出血’。今日空腹血糖8.7 mmol/L，HbA1c 8.1%，随机尿微量白蛋白/肌酐 92 mg/g；血脂：TG 2.6 mmol/L，HDL-C 0.9 mmol/L。既往：高血压10年，BP最高165/98 mmHg，目前用氨氯地平5 mg qd，自测血压140/86 mmHg；吸烟30年，20支/日。查体：BP 142/88 mmHg，BMI 29.4 kg/m²，腰围102 cm；双足背动脉搏动减弱，10 g单丝试验阳性；舌暗红，边有瘀斑，舌下静脉青紫怒张，苔薄白；脉弦涩。患者主诉‘胸口偶尔像针扎一样疼几秒’，否认明显胸痛持续或放射。心电图示V4-V6导联T波低平，肌钙蛋白I正常。患者今日因‘眼睛出血’和‘脚麻得睡不着’来诊，希望调整降糖方案并解决‘瘀血’问题。",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，血瘀。临床表现：肢体麻木或疼痛，胸闷刺痛，或中风偏瘫，语言謇涩，或眼底出血，唇舌紫暗，舌有瘀斑或舌下青筋暴露，苔薄白，脉弦涩",
      "action": "推荐方药：桃红四物汤（《医宗金鉴》）（强推荐，证据等级：B），药物组成：当归、白芍、川芎、熟地黄、桃仁、红花",
      "contraindication": null,
      "evidence": "推荐方药：桃红四物汤（《医宗金鉴》）（强推荐，证据等级：B），药物组成：当归、白芍、川芎、熟地黄、桃仁、红花；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)\n本案例属于复杂合并症治疗场景，涉及2型糖尿病、高血压、血脂异常、神经病变、视网膜病变及中医血瘀证的协同管理。作为专科专家，我将进行全网扫描，重点关注药物相互作用、禁忌症及共病风险，优先确保安全性（如避免出血加重、心血管事件），再考虑疗效优化。\n\nStep 2: 临床解码 (Clinical Decoding)\n从病例提取关键医学信息：患者为2型糖尿病（病程3年，血糖控制不佳：HbA1c 8.1%，空腹血糖8.7 mmol/L），伴糖尿病周围神经病变（双足趾麻木刺痛、10g单丝试验阳性）、糖尿病视网膜病变（眼底出血）、糖尿病肾病（微量白蛋白尿92 mg/g）。合并高血压（BP 142/88 mmHg，控制不达标）、血脂异常（TG升高，HDL降低）。心血管风险高：吸烟史、肥胖（BMI 29.4 kg/m²）、心电图T波低平提示心肌缺血可能，胸痛症状需警惕心绞痛。中医证候明确：血瘀证（舌暗红瘀斑、舌下静脉青紫、脉弦涩），与主诉肢体麻木、胸痛及眼底出血一致。隐式线索：血糖、血压、血脂均未达标，吸烟是核心可干预风险。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)\n指南条件完美匹配患者表现：2型糖尿病兼夹血瘀证，症状（肢体麻木疼痛、胸闷刺痛、眼底出血）、体征（舌瘀斑、舌下青筋暴露、脉弦涩）均符合。指南Action推荐桃红四物汤（强推荐，证据B），且Contraindication为null，无直接禁忌。安全扫描：桃红四物汤（含桃仁、红花等）可能轻度抗凝，患者已有眼底出血，需监测出血倾向；川芎成分或影响血压，高血压需强化控制；微量白蛋白尿提示肾损风险，中药剂量应适中；无显著药物相互作用（与二甲双胍、格列美脲、氨氯地平兼容），但需避免新增抗凝药。安全优先：推荐桃红四物汤，但整合西医治疗以降低整体风险。\n\nStep 4: 决策生成 (Decision Making)\n基于指南Action，核心决策为处方桃红四物汤治疗血瘀证。同时，针对合并症：调整降糖方案（加SGLT2抑制剂改善心肾结局），强化血压控制（加ACEI保护靶器官），启动他汀降脂，并强调戒烟。优先级：确保安全（监测出血、血压），再优化血糖、血压达标。",
    "medical_order": "诊断：2型糖尿病伴周围神经病变、非增殖性糖尿病视网膜病变、微量白蛋白尿；高血压2级；血脂异常；中医证属血瘀证。\n治疗计划：\n1. 降糖方案调整：予二甲双胍0.5 g tid维持，加恩格列净10 mg qd（SGLT2抑制剂），监测血糖及eGFR。\n2. 降压强化：予氨氯地平5 mg qd维持，加雷米普利5 mg qd（ACEI），目标血压<130/80 mmHg。\n3. 血脂管理：启动阿托伐他汀20 mg qd。\n4. 中药治疗：予桃红四物汤（当归10g、白芍10g、川芎6g、熟地黄15g、桃仁10g、红花6g），每日一剂，水煎分两次服，疗程4周。\n5. 并发症监测：完善24小时尿蛋白定量、眼底荧光造影；安排眼科会诊；足部护理教育。\n6. 生活方式干预：低盐低脂饮食；戒烟计划；体重管理（目标BMI<25 kg/m²）。\n随访：1周后复诊查血压、血糖；4周后复查HbA1c、尿微量白蛋白/肌酐、血脂及眼底。",
    "patient_dialogue": "张先生，您好！我看了您的检查结果，您这糖尿病已经有些年头了，现在血糖控制得不太理想，这可能是导致您脚麻、眼睛出血的原因。脚麻晚上加重，睡不着觉，胸口偶尔像针扎一样疼，这些都和中医说的‘瘀血’有关——就是气血不通了。别担心，咱们一步步来解决。\n\n首先，我会给您开个中药方子叫桃红四物汤，专门帮助活血化瘀，改善脚麻和胸痛的症状。您每天煎一剂，分两次喝，喝一个月看看效果。不过，这药里有活血的成分，您眼睛有出血，所以喝药期间要注意观察有没有新出血点，我会定期检查。\n\n另外，您的血糖还偏高，我得调整一下降糖药，加一种新药叫恩格列净，它能帮您控制血糖，还能保护心脏和肾脏。血压也偏高，我给您加个降压药叫雷米普利，这对肾也有好处——咱们得把血压降到130/80以下，防止血管再出问题。血脂也有点高，我会开个他汀药来调理。\n\n最关键的是戒烟！您抽了30年烟，这会让血管更堵，加重瘀血。咱们一起制定个戒烟计划，我给您推荐些戒烟贴或口香糖，慢慢减量。饮食上，做菜少放盐，别吃咸菜和肥肉，多吃蔬菜水果；每天走走路减减体重，这对脚麻和心脏都好。\n\n您眼睛出血和脚麻的问题，我会安排眼科医生再看看，确保没有大碍。您每周来我这量量血压血糖，一个月后咱们复查。记住，这些小变化就能让您睡得更香、眼睛更亮！有什么担心随时跟我说，咱们一起努力。"
  },
  {
    "id": 548,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者周某，46岁，程序员，连续加班3个月后出现明显口干、喜冷饮，每日饮水量由原来1.5 L增至4 L，夜尿3-4次，体重下降4 kg。近两周末尾出现牙龈肿痛，自测空腹血糖7.9 mmol/L，餐后2 h血糖13.4 mmol/L。查体：BMI 27.8 kg/m²，舌红少津、苔薄黄，脉滑数；血压128/82 mmHg，心率88次/分，余无特殊。患者否认既往慢性病史，但父亲有2型糖尿病。今日门诊随机血糖12.1 mmol/L，HbA1c 7.2%。患者担心打针，表示希望先尝试非药物疗法，并询问可否通过针灸缓解口渴与烦躁症状。",
    "reference_rule": {
      "condition": "2型糖尿病早期，热盛伤津证",
      "action": "电针治疗（弱推荐，证据等级：C）：选穴：中府、肺俞、尺泽、太渊、天枢、合谷、曲池、大肠俞、上巨虚、胰俞、丰隆。电针取穴：合谷—曲池（双侧）、上巨虚—丰隆（双侧）、天枢—天枢。选用连续波，频率为 5 Hz，电流强度以患者耐受为度，每次留针 30分钟后起针，背俞穴不留针",
      "contraindication": null,
      "evidence": "推荐的其他疗法：电针治疗（弱推荐，证据等级：C）：选穴：中府、肺俞、尺泽、太渊、天枢、合谷、曲池、大肠俞、上巨虚、胰俞、丰隆。电针取穴：合谷—曲池（双侧）、上巨虚—丰隆（双侧）、天枢—天枢。选用连续波，频率为 5 Hz，电流强度以患者耐受为度，每次留针 30分钟后起针，背俞穴不留针。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景。作为果断的急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除危急重症（如糖尿病酮症酸中毒或多尿症引起的脱水），并基于患者症状、血糖数据和风险因素给出直接的诊断和治疗指令，同时尊重患者偏好优先非药物干预。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者症状（多饮、多尿、体重下降）和血糖指标（空腹7.9 mmol/L、餐后13.4 mmol/L、随机12.1 mmol/L、HbA1c 7.2%）均符合2型糖尿病诊断标准（WHO 2019）。隐式线索：BMI 27.8 kg/m²（超重）和家族史（父亲2型糖尿病）提示胰岛素抵抗风险；牙龈肿痛可能为高血糖引发的感染或口腔并发症；中医证候（舌红少津、苔薄黄、脉滑数）指示热盛伤津证；加班压力可能加剧代谢紊乱。患者偏好：拒绝注射治疗，希望非药物疗法，需优先考虑针灸等替代方案。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition \"2型糖尿病早期，热盛伤津证\" 与患者情况高度匹配。Contraindication 为 null，无禁忌症（如无出血倾向或皮肤损伤）；电针治疗证据等级C（弱推荐），安全可行，但需确保操作规范。安全检查：针灸无直接风险，但需监测血糖以防疾病进展；牙龈肿痛需额外处理以防感染恶化。\n\nStep 4: 决策生成 (Decision Making) - 基于指南Action，诊断为2型糖尿病早期，热盛伤津证。决策：实施电针治疗作为核心非药物干预，结合生活方式管理；暂缓降糖药物以尊重患者意愿，但强调监测重要性；同步处理牙龈问题。整体方案：以针灸和生活方式为一线，2周随访评估疗效，若无效则升级治疗。",
    "medical_order": "诊断：2型糖尿病（早期），热盛伤津证（中医诊断）。\n治疗：\n1. 予电针治疗：选穴中府、肺俞、尺泽、太渊、天枢、合谷、曲池、大肠俞、上巨虚、胰俞、丰隆；电针取穴合谷—曲池（双侧）、上巨虚—丰隆（双侧）、天枢—天枢；连续波5 Hz，电流强度耐受，留针30分钟，背俞穴不留针；每周3次，疗程4周。\n2. 生活方式干预：糖尿病饮食（低糖、低脂），每日热量控制；规律有氧运动30分钟，目标BMI降至25 kg/m²以下；戒烟限酒。\n3. 监测：家庭血糖监测每日空腹及餐后2小时，记录日志；2周后复诊复查随机血糖及HbA1c。\n4. 其他：转诊口腔科评估牙龈肿痛，排除感染；若无效或血糖恶化，考虑启动二甲双胍口服治疗。",
    "patient_dialogue": "周先生，您好！看了您的检查结果，我理解您担心打针，咱们先别急。您的情况是早期糖尿病，就是身体处理糖分的能力下降了，这导致了您感到口干、总想喝水、晚上起夜多，还有体重下降的问题。好消息是，现在还不太严重，我们可以先试试不用药的方法。\n\n首先，针灸是个不错的选择，能帮您缓解口渴和烦躁。我们会在您的手、脚和肚子上选几个点，轻轻用电针刺激一下，每次半小时，您不会觉得疼。另外，生活上要调整：吃东西时少糖少油，比如饮料、甜点尽量别碰，多吃蔬菜和瘦肉；每天运动一下，散步或慢跑30分钟，帮助减点体重——这对控制血糖特别重要，否则时间长了可能伤到眼睛或肾脏。\n\n您提到牙龈肿痛，这很可能和血糖高有关，我建议您顺便去看个牙医，处理一下避免更难受。您需要在家用血糖仪测血糖，每天空腹和饭后两小时各一次，记在本子上，这样我们好跟踪效果。咱们两周后再来复查，如果这些方法管用，就继续；如果不行，咱们再讨论其他安全的选择。别担心，我们一起一步步来，您肯定能控制住的！"
  },
  {
    "id": 582,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者68岁，确诊2型糖尿病19年，近半年出现双踝凹陷性水肿、夜尿3-4次、乏力明显。既往史：高血压20年、冠心病PCI术后6年、脑梗死（左侧基底节，无后遗症）3年。实验室（本周）：空腹血糖9.8 mmol/L，HbA1c 8.7%，eGFR 28 mL·min⁻¹·1.73 m⁻²，尿白蛋白/肌酐比 820 mg/g，血钾5.1 mmol/L，NT-proBNP 1 950 pg/mL。查体：BP 145/82 mmHg，BMI 24.5 kg/m²，面色黧黑，舌淡暗、边有齿痕，苔薄白而干，脉沉细无力，双踝水肿至胫骨中段。患者主诉‘晚上腿抽筋，睡不暖’，并顺带抱怨‘最近雨多，老宅漏雨，心情烦闷’。目前口服二甲双胍1 g bid、达格列净10 mg qd、甘精胰岛素24 U睡前，但血糖仍波动大。门诊目标：评估是否需调整降糖及肾脏保护方案。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，阴阳两虚证",
      "action": "推荐单验方：糖肾方（弱推荐，证据等级：B）：黄芪、芡实、金樱子、黄连",
      "contraindication": null,
      "evidence": "推荐的单验方：糖肾方（弱推荐，证据等级：B）：黄芪、芡实、金樱子、黄连。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及糖尿病肾病、心血管疾病等多种慢性病共存。作为专科专家，我将全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全（安全 > 疗效），重点关注当前药物在肾功能严重下降下的适用性、电解质紊乱风险及心衰管理。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者为68岁男性，2型糖尿病晚期（病程19年，HbA1c 8.7%，空腹血糖9.8 mmol/L），并发严重糖尿病肾病（eGFR 28 mL·min⁻¹·1.73 m⁻²，CKD Stage 4；尿白蛋白/肌酐比820 mg/g，提示大量蛋白尿）和潜在心衰（NT-proBNP 1950 pg/mL，升高提示心功能不全）。合并症包括高血压（BP 145/82 mmHg）、冠心病（PCI术后）、脑梗死史。隐式线索：① 双踝水肿至胫骨中段、夜尿增多及乏力，指示液体潴留和肾性水肿；② 血钾5.1 mmol/L（轻度高钾血症），可能由肾损伤或SGLT2抑制剂引发；③ 主诉‘腿抽筋’和‘睡不暖’提示电解质失衡或周围神经病变；④ 心情烦闷可能影响治疗依从性。中医证候（舌淡暗、边有齿痕、苔薄白而干、脉沉细无力）符合阴阳两虚证。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件‘2型糖尿病晚期，阴阳两虚证’与患者情况高度匹配（eGFR低、蛋白尿高、中医证候）。指南推荐糖肾方（黄芪、芡实、金樱子、黄连），无禁忌症（contraindication null）。安全扫描：① 当前药物二甲双胍（eGFR<30时禁用，因乳酸酸中毒风险）和达格列净（SGLT2抑制剂，eGFR<30时无效且增加急性肾损伤/高钾风险）存在安全隐患；② 血钾5.1 mmol/L已接近高限，需避免加重高钾药物；③ NT-proBNP升高提示心衰，水肿需利尿干预以预防恶化。整体优先级：停用不安全药物优先于新方案引入。\n\nStep 4: 决策生成 (Decision Making) - 根据指南行动‘推荐单验方糖肾方（弱推荐，证据等级B）’，结合安全扫描，决策：① 立即停用二甲双胍和达格列净；② 启动糖肾方治疗；③ 优化降糖方案（调整胰岛素）；④ 加入利尿剂管理水肿和心衰风险；⑤ 转诊多学科团队确保全面管理。",
    "medical_order": "1. 停用二甲双胍和达格列净（eGFR<30 mL·min⁻¹·1.73 m⁻²禁忌）。\n2. 予糖肾方：黄芪30g、芡实15g、金樱子15g、黄连6g，每日一剂，水煎服。\n3. 调整降糖方案：甘精胰岛素增至28U睡前，监测空腹及餐后血糖；考虑加用GLP-1受体激动剂（如利拉鲁肽）起始0.6mg qd，评估耐受性。\n4. 予呋塞米20mg qd晨服，减轻水肿及心衰负荷；监测尿量及体重变化。\n5. 完善检查：复查肾功能、电解质、NT-proBNP及24小时尿蛋白定量；行心脏超声评估射血分数。\n6. 建议转诊肾内科及心内科，评估透析或心衰专科治疗指征。\n7. 教育：低盐饮食（<3g/d），每日监测血压及双下肢水肿程度。",
    "patient_dialogue": "张大爷，我仔细看了您的检查结果和症状。您最近腿肿得厉害、晚上抽筋、睡不好觉，还老跑厕所，这都说明糖尿病对肾脏和心脏造成了不小的负担。再加上您说的心情烦闷，房子漏水的事儿让您操心，我理解这日子不好过。咱们得一步步来调整治疗，先把身体稳住。\n\n首先，得停掉您现在吃的两种糖尿病药——二甲双胍和达格列净。为什么呢？因为您的肾脏功能已经比较弱了，继续用这些药反而可能伤肾或引起其他问题。胰岛素还会继续用，但剂量我会稍微加一点，好让血糖更平稳。另外，给您加一种中药方子，里面是黄芪、芡实这些温和的药材，专门保护肾脏，还能帮您改善乏力和水肿的问题。\n\n您腿肿得这么厉害，我会开一种利尿的小药片（呋塞米），每天早上吃一次。它能帮您排掉多余的水分，减轻腿肿，晚上抽筋也可能好一些。但您得注意：平时做菜少放盐，咸菜、酱料这些高盐的东西都别碰了。这样配合吃药，水肿才能更快消下去。\n\n我还建议您去肾病和心脏科专家那儿再看看，毕竟您这情况复杂些，他们能提供更精细的检查和建议。记住啊，每天量量血压，看看脚肿有没有加重，有什么不舒服随时告诉我。房子的事别太焦虑，身体好了才能有力气处理那些烦心事，咱们一起努力，好吗？"
  },
  {
    "id": 564,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者自诉近3个月小便频数，夜尿5-6次，尿液混浊如膏，常需更换内裤；伴腰膝酸软，上下三楼必须扶栏，眩晕耳鸣如蝉，夜间多梦遗精每周2-3次，五心烦热明显，午后低热37.6℃，颧红口干咽燥，需随身携带500 ml保温杯；皮肤干燥脱屑，胫前瘙痒抓痕结痂。右眼视物模糊加重，形容'像隔着毛玻璃'，偶有'蚊蝇飞舞'黑影，左眼视力0.4。无胸痛，但昨日步行200米即需停休。既往史：2型糖尿病18年，高血压12年，去年脑梗死（右侧基底节，无后遗症），慢性肾功能不全（CKD 3b）。家族史：母因糖尿病肾病ESRD透析。用药：甘精胰岛素26 U qn，达格列净10 mg qd，氨氯地平5 mg qd，阿托伐他汀20 mg qn。实验室：HbA1c 9.1%，eGFR 38 ml·min⁻¹·1.73 m⁻²，尿ACR 487 mg/g，24 h尿蛋白1.9 g；眼底照相：右眼中度非增殖性视网膜病变伴黄斑水肿。舌红少苔，脉细数。今日因'血糖控制差并多种并发症'复诊，希望调整方案。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，肝肾阴虚证。临床表现：小便频数，浑浊如膏，腰膝酸软，眩晕耳鸣，多梦遗精，五心烦热，低热颧红，口干咽燥，皮肤干燥，视物模糊，雀目，或蚊蝇飞舞，或失明，皮肤瘙痒，舌红少苔，脉细数。多见于糖尿病并发视网膜病变、肾病、神经病变者",
      "action": "推荐方药：杞菊地黄丸（《小儿药证直诀》）（弱推荐，证据等级：B），药物组成：生地黄、山萸肉、炒山药、茯苓、泽泻、牡丹皮、枸杞子、菊花",
      "contraindication": null,
      "evidence": "推荐方药：杞菊地黄丸（《小儿药证直诀》）（弱推荐，证据等级：B），药物组成：生地黄、山萸肉、炒山药、茯苓、泽泻、牡丹皮、枸杞子、菊花。"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于复杂合并症治疗场景。患者患有2型糖尿病晚期伴多系统并发症（肾病、视网膜病变、神经病变、心血管风险），且合并高血压、既往脑梗死和慢性肾功能不全。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效。需仔细审查现有用药（如达格列净在CKD中的风险）、中药推荐的安全性，并评估各并发症（如视力下降提示需眼科急会诊，步行受限提示心功能不全）。\n\n**Step 2: 临床解码 (Clinical Decoding)**：从病例提取关键信息：1. 代谢紊乱：HbA1c 9.1% 提示血糖控制不佳；eGFR 38 ml·min⁻¹·1.73 m⁻² 和尿ACR 487 mg/g 表明糖尿病肾病进展至CKD 3b期伴显著蛋白尿。2. 并发症证据：右眼黄斑水肿及黑影暗示糖尿病视网膜病变恶化风险；步行200米即停休提示潜在心功能不全或神经病变；皮肤瘙痒及脱屑可能为尿毒症相关或自主神经病变。3. 中医证候：舌红少苔、脉细数，结合多梦遗精、五心烦热等，明确为肝肾阴虚证，符合指南condition。4. 隐式线索：达格列净在eGFR 38时接近禁忌阈值（通常eGFR<30慎用），可能加剧尿路感染风险（小便频数）；午后低热和眩晕需排除感染或心脑血管事件。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：指南condition与患者表现高度一致（小便频数、视物模糊等），action推荐杞菊地黄丸（弱推荐，证据B），无contraindication声明。但安全扫描发现：1. 药物相互作用：达格列净在CKD 3b中需监测eGFR下降风险；杞菊地黄丸含生地黄（可能高钾），在eGFR低时慎用。2. 共病风险：黄斑水肿急需眼科干预以防失明；步行受限需评估心衰；eGFR低增加药物肾毒性风险。安全优先级要求调整降糖方案并安排专科会诊。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南action，推荐杞菊地黄丸作为辅助治疗。但鉴于安全优先，必须整合多学科管理：优化降糖药物（如加用GLP-1受体激动剂），评估达格列净继续使用，转诊眼科和心内科。最终决策：予杞菊地黄丸，调整降糖方案，完善心脏评估，并紧急转诊眼科。",
    "medical_order": "诊断：2型糖尿病伴多并发症（糖尿病肾病CKD 3b期，非增殖性糖尿病视网膜病变伴黄斑水肿，疑似糖尿病神经病变及心血管风险）；中医辨证：肝肾阴虚证。\n1. 予杞菊地黄丸口服，每日一剂，水煎分服。\n2. 调整降糖方案：停用达格列净（eGFR 38 ml·min⁻¹·1.73 m⁻²，接近禁忌阈值）；加用利拉鲁肽0.6 mg qd起始，渐增至1.8 mg qd；甘精胰岛素增至28 U qn。监测空腹及餐后血糖。\n3. 继续氨氯地平5 mg qd及阿托伐他汀20 mg qn，血压目标<130/80 mmHg。\n4. 完善检查：心电图、心脏超声评估心功能；24小时尿蛋白复测；血清钾、肌酐监测。\n5. 紧急转诊眼科专科评估黄斑水肿；转诊肾内科管理CKD；预约营养师制定低盐低蛋白饮食方案。\n6. 生活方式干预：一级护理，建议每日步行监测（记录无不适距离）。",
    "patient_dialogue": "王先生，您这三个月来小便次数多、晚上起夜好几次，还觉得腰酸腿软、眼睛看东西模糊，这些症状我都认真听了。这主要是因为您的糖尿病时间比较长，身体内部有些虚弱了，中医叫‘肝肾阴虚’，就像电池电量不足一样，需要慢慢调理。\n\n我建议您先试试一个中药方子，叫杞菊地黄丸，它专门针对您这种口干、发热、皮肤痒的问题，能帮助身体恢复平衡。另外，您现在的降糖药效果不太理想（血糖那个HbA1c值到9.1了，偏高了），咱们得调整一下——我会把达格列净换成一种新药叫利拉鲁肽，打针就行，它不仅能降血糖，还能保护心脏；您原来的胰岛素也稍微加一点剂量，这样血糖就能稳下来，减少您小便混浊的情况。\n\n您眼睛模糊得厉害，像隔着毛玻璃，这不能拖，我马上帮您联系眼科专家检查，万一水肿加重会影响视力。走路200米就累，可能是心脏或神经的问题，咱们安排个心脏彩超看看。平时生活上，做菜少放盐，咸菜也别吃，咸的东西会让血压升高；多喝水但别过量，一天1.5升就够；皮肤痒别使劲抓，用点润肤露。别担心，咱们一步步来，我会协调其他专家一起帮您控制好。"
  },
  {
    "id": 603,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "主诉：口干多饮3年，加重伴体重增加半年。\n现病史：3年前外院确诊“2型糖尿病”，先后用过二甲双胍0.5 g bid、达格列净10 mg qd，近半年空腹血糖7.8–9.2 mmol/L，HbA1c 8.1%。自觉胸脘痞满、痰多易咯，晨起口黏，活动后气短。体重半年增加4 kg（BMI 29.4 kg/m²），腹围103 cm。夜间打鼾明显，家属诉有呼吸暂停现象。昨日社区测血压138/86 mmHg。\n既往史：脂肪肝（2022超声提示中度）；否认冠心病、脑卒中。吸烟史20支/日×25年，未戒；偶饮啤酒。\n家族史：父亲有T2DM、高血压。\n查体：面色偏黯，舌质淡胖，边有齿痕，苔白厚腻，脉滑。心肺听诊未及明显异常，腹隆软，肝肋下1指可及，无压痛，双下肢轻度凹陷性水肿（+1）。\n实验检查（本院当日）：FPG 8.9 mmol/L，2hPPG 14.7 mmol/L，HbA1c 8.0%，TG 3.1 mmol/L，HDL-C 0.9 mmol/L，LDL-C 3.4 mmol/L，ALT 52 U/L，AST 38 U/L，UA 428 μmol/L，尿Alb/Cr 42 mg/g，eGFR 89 mL/min。颈动脉超声：右侧IMT 1.1 mm，未见明显斑块。\n干扰信息：患者为夜班出租车司机，自述“跑车时靠功能饮料提神，平均每晚2罐”。",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，痰浊（痰湿证）",
      "action": "推荐方药：宜二陈汤（《太平惠民和剂局方》）（弱推荐，证据等级：C），药物组成：法半夏、陈皮、茯苓、生姜、乌梅、甘草",
      "contraindication": null,
      "evidence": "痰湿证，宜二陈汤（《太平惠民和剂局方》）（弱推荐，证据等级：C），药物组成：法半夏、陈皮、茯苓、生姜、乌梅、甘草。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及多种共病（如2型糖尿病、肥胖、脂肪肝、高脂血症、高血压前期、高尿酸血症、微量白蛋白尿及疑似阻塞性睡眠呼吸暂停低通气综合征）。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先级为安全 > 疗效，确保治疗方案无冲突且全面覆盖所有健康威胁。Step 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：血糖控制不佳（HbA1c 8.0%，FPG 8.9 mmol/L）提示2型糖尿病未达标；体重增加（BMI 29.4 kg/m²，腹围103 cm）、TG 3.1 mmol/L、HDL-C 0.9 mmol/L等符合代谢综合征；胸脘痞满、痰多、舌苔白厚腻明确痰湿证；夜间打鼾及呼吸暂停史强烈暗示OSAHS；ALT 52 U/L、AST 38 U/L结合脂肪肝史指示肝损伤风险；UA 428 μmol/L提示高尿酸血症；尿Alb/Cr 42 mg/g显示早期肾病；吸烟史和功能饮料摄入为隐式心血管风险因子。医学术语转化：诊断为2型糖尿病伴代谢综合征、肥胖（腹型）、中度脂肪肝、高血压前期、疑似OSAHS、高尿酸血症及糖尿病肾病（微量白蛋白尿期）。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为‘2型糖尿病兼夹证，痰浊（痰湿证）’，与患者症状（胸脘痞满、痰多、舌象）高度匹配；Contraindication为null，无直接禁忌。但安全扫描：二陈汤（含法半夏等）与现有西药（二甲双胍、达格列净）无已知严重相互作用（法半夏极少致肝毒性，但患者ALT轻度升高需监测）；达格列净在eGFR>60时安全（eGFR 89 mL/min），但可能加重脱水风险（患者口干多饮）；共病风险包括OSAHS未评估（可致夜间低氧）、吸烟加速心血管疾病、功能饮料摄入加剧血糖波动。整体安全优先，需综合干预。Step 4: 决策生成 (Decision Making) - 根据指南Action‘推荐方药：宜二陈汤’，采纳该弱推荐方案；同时，基于共病风险，强化全面管理：添加二陈汤以化痰祛湿，维持当前降糖药但加强监测，整合生活方式干预及专科转诊，确保疗效与安全平衡。",
    "medical_order": "诊断：2型糖尿病（血糖控制不佳，HbA1c 8.0%）、代谢综合征、肥胖（BMI 29.4 kg/m²）、中度脂肪肝、高血压前期（BP 138/86 mmHg）、高尿酸血症（UA 428 μmol/L）、糖尿病肾病（微量白蛋白尿，尿Alb/Cr 42 mg/g）、疑似阻塞性睡眠呼吸暂停低通气综合征（OSAHS）。治疗：1. 药物治疗：予二甲双胍0.5 g bid和达格列净10 mg qd继续维持；添加二陈汤（法半夏9g、陈皮6g、茯苓12g、生姜6g、乌梅6g、甘草3g），每日一剂，水煎分两次口服。2. 生活方式干预：嘱低热量饮食（每日热量限制至1500-1800 kcal）、低嘌呤饮食、戒烟、限酒（啤酒≤1罐/周）、增加体力活动（目标每日步行30分钟）。3. 监测：完善多导睡眠监测（PSG）以评估OSAHS；定期复查FPG、HbA1c（每3月）、肝功能（ALT、AST，每1月）、血脂、肾功能、尿微量白蛋白及尿酸（每3月）。4. 转诊：转睡眠医学专科行OSAHS确诊及治疗；转营养科制定个体化饮食计划。",
    "patient_dialogue": "医生：王师傅，您好！我看了您的检查结果，您有糖尿病，但血糖控制得还不够理想，同时体重这半年涨了点，加上晚上打鼾厉害、家人说呼吸暂停，这些都得重视起来。我建议咱们先加个中药方子，叫二陈汤，它能帮助化解您胸口的闷胀感和痰多问题，让您呼吸更顺畅。另外，您现在的降糖药（二甲双胍和达格列净）还得继续吃，但咱们得盯紧点血糖变化。减肥是关键——减掉些体重能大大改善血糖和打鼾，甚至让肝脏更健康。您得尽量少吃高热量食物，晚上跑车时别靠功能饮料提神了，那玩意儿糖分太高，对血糖不好；换成喝水或淡茶更安全。戒烟这事儿不能拖，抽烟伤肺又伤心，咱们一步步来减量。还有，打鼾问题别小看，它可能导致夜间缺氧，我建议您去睡眠专科做个详细检查。别担心，咱们一起制定计划，慢慢调整，健康会好起来的！"
  },
  {
    "id": 601,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "上午10:20，内分泌专科诊室。患者李某，58岁，货车司机，因‘双足麻木、刺痛半年，加重伴行走不稳1周’复诊。既往2型糖尿病14年，平素自行注射预混胰岛素（早18 U、晚14 U），空腹血糖波动8–11 mmol/L，HbA1c 8.7%。3年前发现高血压，最高165/98 mmHg，目前口服缬沙坦80 mg qd，血压控制于140/90 mmHg左右。半年前出现双足趾尖针刺样疼痛，夜间加重，曾在外院诊断为‘糖尿病周围神经病变’，予甲钴胺、α-硫辛酸口服效果欠佳。近1周症状向上蔓延至踝部，伴踩棉感，夜间需起床行走缓解疼痛，影响睡眠。无视力模糊、无胸痛。家族史：母亲及姐姐均患2型糖尿病。查体：BMI 29.4 kg/m²，腰围102 cm；双足皮色暗，皮温低，踝反射消失，128 Hz音叉震动觉消失（双拇趾），10 g单丝试验阳性（双足底3/10点缺失），振动觉阈值25 V（正常<15 V）。足背动脉搏动减弱（右>左）。实验室：空腹血糖9.8 mmol/L，HbA1c 8.5%，TC 5.9 mmol/L，LDL-C 3.6 mmol/L，eGFR 78 mL·min⁻¹·1.73 m⁻²，尿微量白蛋白/肌酐 42 mg/g。舌苔暗紫、边有瘀斑，脉涩。患者今日提及‘最近跑长途多，坐车里十几个小时，脚肿得更厉害’，并抱怨‘止痛药吃了胃不舒服’。",
    "reference_rule": {
      "condition": "2型糖尿病并发周围神经病变者，血瘀",
      "action": "针刺疗法（弱推荐，证据等级：B）：取穴：双侧阳陵泉、阴陵泉、足三里、合谷、曲池、太溪、丰隆、三阴交，平补平泻手法，留针 30分钟",
      "contraindication": null,
      "evidence": "推荐的其他疗法：针刺疗法（弱推荐，证据等级：B）：取穴：双侧阳陵泉、阴陵泉、足三里、合谷、曲池、太溪、丰隆、三阴交，平补平泻手法，留针 30分钟，适用于 2型糖尿病并发周围神经病变者。"
    },
    "thought": "本案例属于复杂合并症治疗场景，涉及2型糖尿病并发周围神经病变、高血压、血脂异常、肥胖及轻度肾功能损伤。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保安全。临床解码：患者血糖控制不佳（HbA1c 8.5%），血压未达标（140/90 mmHg），LDL-C升高（3.6 mmol/L），eGFR轻度降低（78 mL/min/1.73m²），尿微量白蛋白/肌酐 42 mg/g提示糖尿病肾病早期；神经病变症状加重，伴行走不稳，可能与长时间坐车导致静脉回流不畅相关；舌苔暗紫、脉涩符合血瘀征象；止痛药不耐受需避免NSAIDs以防胃损伤。规则对齐与安全检查：指南针对‘2型糖尿病并发周围神经病变者，血瘀’推荐针刺疗法，无禁忌症；安全扫描显示无药物相互作用（胰岛素和缬沙坦），无凝血障碍或皮肤感染迹象，针刺相对安全，优先级安全>疗效。决策生成：基于指南Action，实施针刺疗法，具体为取穴双侧阳陵泉、阴陵泉、足三里、合谷、曲池、太溪、丰隆、三阴交，平补平泻手法，留针30分钟；同时需综合优化血糖、血压、血脂管理及生活方式干预。",
    "medical_order": "1. 予针刺疗法：取穴双侧阳陵泉、阴陵泉、足三里、合谷、曲池、太溪、丰隆、三阴交，平补平泻手法，留针30分钟，每周2-3次。2. 优化血糖控制：调整胰岛素方案，监测空腹及餐后血糖，目标HbA1c <7.0%，必要时加用口服降糖药（如SGLT2抑制剂）。3. 控制血压：监测家庭血压，目标<130/80 mmHg，考虑增加缬沙坦剂量或加用钙通道阻滞剂。4. 管理血脂：起始他汀类药物治疗（如阿托伐他汀20 mg qd），目标LDL-C <2.6 mmol/L。5. 评估肾损伤：复查尿微量白蛋白/肌酐及eGFR，避免肾毒性药物。6. 神经病变对症：避免NSAIDs类止痛药，考虑加用普瑞巴林或度洛西汀。7. 生活方式干预：建议减重目标BMI <25 kg/m²，低脂低盐饮食，规律运动（每日步行30分钟），避免长时间坐车。",
    "patient_dialogue": "李大哥，您这脚麻脚痛的症状，我理解您受罪了，特别是晚上睡不好，还影响开车工作。我们先试试一种叫针刺的治疗方法，就是用细针扎在腿脚几个穴位上，能帮助改善血液循环和缓解疼痛，跟按摩有点像，但更精准，每次大概半小时，一周来两三次。您最近跑长途坐太久，脚肿得厉害，这跟血液循环有关，以后开车时每两小时下来活动一下，跺跺脚，促进血流。止痛药吃得不舒服就别硬扛，我们换种安全点的药。另外，血糖和血压控制还不够理想，得调整一下药量，这样能保护您的神经和肾。血脂也有点高，我们加个降脂药预防心脏问题。您试试减点体重，比如每天散步半小时，做菜少放盐和油，咸菜肥肉都少吃点——这些小事做起来，对减轻脚肿和疼痛很有帮助。一步步来，别急，咱们一起努力。"
  },
  {
    "id": 577,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者18年前确诊2型糖尿病，近3年出现双足麻木、刺痛，夜间加重，需靠拐杖行走。既往高血压20年、冠心病PCI术后8年。此次因“双足发凉、走路像踩棉花”来复诊。查体：BP 148/82 mmHg，BMI 24.7 kg/m²，皮肤干燥脱屑；双足呈袜套样浅感觉减退，振动觉消失，踝反射未引出；足背动脉搏动减弱。实验室内分泌：FPG 9.4 mmol/L，HbA1c 8.7%，空腹C肽 0.38 nmol/L；肾功：eGFR 47 mL·min⁻¹·1.73m⁻²，尿微量白蛋白/肌酐 92 mg/g；血脂：TG 2.6 mmol/L，HDL-C 0.9 mmol/L。外院神经传导提示双下肢感觉神经传导速度普遍下降>30%。自述夜尿3-4次、畏寒、腰膝酸软，舌淡暗、苔薄白，脉沉细无力。今日小雨，患者抱怨近来因天气潮湿，膝盖酸痛加重，与血糖控制无关。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，阴阳两虚证，糖尿病并发周围神经病变",
      "action": "艾灸（弱推荐，证据等级：B）：取穴：肾俞、太溪、足三里、三阴交。用温和灸固定艾条温和灸法，每穴 10分钟，每日 1次。以局部穴位温和舒适为度",
      "contraindication": null,
      "evidence": "推荐的其他疗法：艾灸（弱推荐，证据等级：B）：取穴：肾俞、太溪、足三里、三阴交。配穴：上肢麻木、疼痛加曲池、外关、合谷；下肢麻木、疼痛加血海、阳陵泉、太冲。用温和灸固定艾条温和灸法，每穴 10分钟，每日 1次。以局部穴位温和舒适为度，适用于糖尿病并发周围神经病变。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于复杂合并症治疗场景，患者同时存在糖尿病周围神经病变、糖尿病肾病、冠心病及高血压。需重点关注多系统交互风险，优先确保治疗安全性。Step 2: 临床解码 - 关键问题包括：①进行性周围神经病变（袜套样感觉减退+神经传导速度下降30%）②糖尿病肾病III期（eGFR 47+蛋白尿）③心血管高风险（PCI术后+高血压）④代谢失控（HbA1c 8.7%+低C肽）；隐式线索：足背动脉减弱提示外周缺血，皮肤干燥提示自主神经病变。Step 3: 规则对齐与安全检查 - 指南条件'糖尿病并发周围神经病变+阴阳两虚证'与患者舌脉（淡暗苔白/脉沉细）及畏寒腰酸症状匹配。无绝对禁忌证，但需警惕：①感觉缺失增加烫伤风险②eGFR 47需避用肾毒性药物③抗凝治疗史（PCI术后）禁用创伤性操作。Step 4: 决策生成 - 采纳艾灸作为辅助治疗，但需：①规避直接接触灸法②强化基础病控制③增加足部保护措施。",
    "medical_order": "1. 糖尿病周围神经病变管理：\n   - 予改良艾灸疗法：取穴肾俞、太溪、足三里、三阴交；采用悬灸法（距皮肤5cm），每穴8分钟 QD，由家属监督操作\n   - 加用α-硫辛酸 600mg ivgtt QD×14d\n2. 代谢综合征控制：\n   - 降糖方案调整：起始基础胰岛素（甘精胰岛素 0.2U/kg）联合SGLT2i（达格列净 10mg QD，eGFR>30适用）\n   - 血压控制：氨氯地平 5mg QD，目标BP<130/80mmHg\n   - 调脂：阿托伐他汀 20mg QN\n3. 肾脏保护：\n   - 予ACEI（雷米普利 2.5mg QD），监测血钾及肌酐\n4. 足部防护：\n   - 予糖尿病专用减压鞋具\n   - 每日足部温度监测（家属协助）\n5. 随访：\n   - 2周后复诊：复查HbA1c、足部感觉、皮肤完整性\n   - 转诊糖尿病足专科门诊",
    "patient_dialogue": "李大爷，您这脚麻脚凉的问题，咱们得分几步来应对：\n\n第一，您说脚像踩棉花还怕冷，这是糖尿病引起的神经损伤和血液循环不好。我建议用艾条在腰腿几个穴位做温和的温热调理，但您脚的感觉有些迟钝，咱们得格外小心——让家人拿着艾条离皮肤两指远，温热就行，千万别贴皮肤烤，每天十分钟，既能通经络又不会伤着。\n\n第二，您血糖和血压控制还不太稳，这会让脚麻加重。咱们把药稍作调整：加个每天一次的胰岛素针（就像蚊子叮一下），配合保护肾脏的新药片；降压药也微调，目标是把高压稳在130以下。\n\n最要紧的是护好脚：您走路一定穿特制的软底鞋，每晚让儿子帮忙看看脚底有没有破皮。最近下雨潮湿，膝盖不舒服的话，洗澡时用热毛巾敷敷，但洗脚水温度得先用胳膊试过——您脚感觉差，容易烫伤自己还不知道。\n\n咱们两周后再看看脚麻有没有轻快点，这段时间您就像保护婴儿皮肤一样护着双脚啊！"
  },
  {
    "id": 584,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者68岁，男性，退休长途货车司机，因‘双足麻木、灼痛半年，夜间加重’今日复诊。20年前确诊2型糖尿病，近5年先后出现糖尿病视网膜病变（激光光凝术后）、微量白蛋白尿（ACR 68 mg/g），去年因‘急性下壁心梗’植入药物支架1枚，目前规范服用阿司匹林+氯吡格雷+瑞舒伐他汀。平日胰岛素四针方案（甘精+门冬），但空腹血糖仍波动于9-12 mmol/L，HbA1c 8.7%。查体：身高172 cm，体重81 kg，BMI 27.3 kg/m²；双足皮肤干冷，足背动脉搏动减弱，10 g单丝试验双足底3点失保护，128 Hz音叉震动觉消失于第一跖骨头；踝反射消失。温度觉异常，VAS疼痛评分7分，夜间需扶床沿行走。实验室：eGFR 52 mL·min⁻¹·1.73 m⁻²（CKD-EPI，中度下降），尿蛋白+，血脂LDL-C 1.9 mmol/L。患者抱怨‘像踩在炭火上，冬天也得把脚伸被子外头’，并顺带提到‘最近老伴嫌他夜里翻身多，吵得她睡不好’。否认吸烟，但承认长途驾驶时日均1包，戒烟已10年。今日血压135/78 mmHg，心率72次/分，律齐。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，阴阳两虚证，糖尿病并发周围神经病变，下肢麻木、疼痛",
      "action": "艾灸配穴：加血海、阳陵泉、太冲",
      "contraindication": null,
      "evidence": "下肢麻木、疼痛加血海、阳陵泉、太冲。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景。作为专科专家，我将重点关注全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全性（安全 > 疗效），再考虑疗效优化。患者存在多系统并发症（糖尿病周围神经病变、糖尿病肾病、冠状动脉疾病状态后支架植入），需综合评估以避免潜在风险。\n\nStep 2: 临床解码 (Clinical Decoding): 患者为68岁男性，2型糖尿病晚期伴多并发症：1）糖尿病周围神经病变（DPN），表现为双足麻木、灼痛（VAS 7分）、夜间加重、保护性感觉丧失（10g单丝试验阳性）、震动觉消失、踝反射缺失及温度觉异常，提示严重神经损伤；2）糖尿病肾病（DKD），eGFR 52 mL·min⁻¹·1.73 m⁻²（CKD 3a期）、尿蛋白+（ACR 68 mg/g）；3）心血管疾病（CAD），急性下壁心梗后支架植入，规范服用双抗血小板（阿司匹林+氯吡格雷）和他汀（瑞舒伐他汀）；4）血糖控制不佳（空腹血糖9-12 mmol/L，HbA1c 8.7%），肥胖（BMI 27.3 kg/m²）；5）隐式线索：疼痛影响睡眠质量（老伴抱怨夜间翻身），足部皮肤干冷及足背动脉搏动减弱提示潜在周围动脉疾病（PAD），戒烟史但曾有重度吸烟（日均1包），增加血管并发症风险。关键医学术语：DPN相关疼痛、DKD进展风险、抗血小板治疗下的出血倾向、血糖未达标。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南Condition（2型糖尿病晚期，阴阳两虚证，糖尿病并发周围神经病变，下肢麻木、疼痛）完全匹配患者症状。Action为艾灸配穴：加血海、阳陵泉、太冲。Contraindication为null。强制安全检查：1）药物相互作用：艾灸为非侵入性物理疗法，无已知系统药物相互作用；但患者服用双抗血小板药物（阿司匹林+氯吡格雷），轻微增加局部出血风险，需确保皮肤完整（查体描述皮肤干冷但无破损，故安全）；2）禁忌症：无绝对禁忌（如皮肤破损或感染未报告）；3）共病风险：患者CKD 3a期和CAD，艾灸局部操作不加重系统负担。优先级安全通过：风险低，可安全实施。\n\nStep 4: 决策生成 (Decision Making): 基于指南Action，生成核心决策：实施艾灸配穴血海、阳陵泉、太冲以缓解神经痛和麻木。同时，作为专科专家，需全网扫描合并症管理：优化血糖控制（降低HbA1c目标）、评估疼痛药物添加（避免与现有药物冲突）、强化足部保护（防溃疡）。最终决策以艾灸为主，辅以必要干预确保全局安全。",
    "medical_order": "1. 予艾灸治疗：配穴双侧血海、阳陵泉、太冲，每次20-30分钟，每日1次，疗程4周，评估疼痛缓解。\n2. 优化糖尿病管理：内分泌科会诊调整胰岛素方案（甘精+门冬），目标空腹血糖4.4-7.0 mmol/L，HbA1c <7.0%；监测血糖日记。\n3. 疼痛控制评估：考虑加用普瑞巴林75 mg 口服 每日2次（起始低剂量，监测eGFR及中枢副作用），避免NSAIDs（因抗血小板治疗及CKD）。\n4. 足部风险评估：予一级足部护理教育，防溃疡；定期复查10g单丝试验及震动觉。\n5. 合并症监测：每月复查肾功能（eGFR、尿蛋白）、血脂（LDL-C目标<1.8 mmol/L）；心血管随访（支架状态）。",
    "patient_dialogue": "张师傅，您的脚痛和麻木是因为糖尿病伤了神经，就像电线坏了似的，所以您感觉像踩在炭火上，晚上特别难受，还影响您和老伴休息。咱们试试艾灸治疗——这法子就是用艾条在您腿上的几个穴位（血海、阳陵泉和脚背的太冲）轻轻加热，能帮您缓解疼痛、让脚不那么麻。每次做个20到30分钟，一天一次，坚持几周应该能让您睡得更踏实些，翻身少了，老伴也能休息好。另外，您的血糖还是有点高，我得帮您调调胰岛素，目标是把糖化血红蛋白降到7%以下，这样能保护您的肾和心脏。脚上要每天检查，别让破皮受伤，因为您吃的药会让出血风险稍高。如果痛得厉害，我会开点温和的止痛药，安全又有效。咱们一步步来，控制好了，您开车退休生活也能更舒心！"
  },
  {
    "id": 573,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日由老伴推着轮椅进来，进门先喘两口大气。自述近3周饭后胸闷、痰多，晨起咳白黏痰需清嗓十余次。既往：T2DM 12年，BMI 31.2 kg/m²，去年查颈动脉示双侧斑块；吸烟史25包年，已戒4年。实验室：空腹血糖9.8 mmol/L，HbA1c 8.4%，TG 3.1 mmol/L，尿微量白蛋白/肌酐 42 mg/g；舌淡胖边齿痕、苔白厚腻，脉滑。今日老伴抱怨家里潮湿返潮，患者鞋袜常湿，脚痒抓破两处。患者额外主诉昨晚失眠，因隔壁装修电钻声吵到23点。",
    "reference_rule": {
      "condition": "2型糖尿病兼夹证，痰浊",
      "action": "腹针疗法（弱推荐，证据等级：C）：取穴：中脘、下脘、气海、关元、天枢（双）、滑肉门（双）、外陵（双）、商丘（双）、气穴（双）",
      "contraindication": null,
      "evidence": "推荐的其他疗法：腹针疗法（弱推荐，证据等级：C）：取穴：中脘、下脘、气海、关元、天枢（双）、滑肉门（双）、外陵（双）、商丘（双）、气穴（双）。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景。作为专科专家，我将全网扫描，重点关注药物相互作用、禁忌症及共病风险，优先确保安全（安全 > 疗效）。患者有多种合并症（2型糖尿病、心血管风险、肥胖、高脂血症、呼吸道症状及足部问题），需综合评估以避免潜在冲突。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：① 症状转化为医学术语：饭后胸闷、痰多、晨起咳白黏痰（提示慢性支气管炎或早期心功能不全）；脚痒抓破两处（糖尿病足溃疡风险，结合潮湿环境，可能真菌感染）；失眠（环境噪音相关）。② 既往史：2型糖尿病控制不佳（HbA1c 8.4% > 7%目标值，空腹血糖9.8 mmol/L）；肥胖（BMI 31.2 kg/m²）；颈动脉双侧斑块（动脉粥样硬化风险）；吸烟史25包年（COPD或心血管疾病风险）。③ 实验室：高甘油三酯血症（TG 3.1 mmol/L）；糖尿病肾病早期（尿微量白蛋白/肌酐 42 mg/g > 30 mg/g）。④ 舌脉：舌淡胖边齿痕、苔白厚腻，脉滑（中医证候：痰浊，支持痰湿内停）。⑤ 隐式线索：家居潮湿（加剧足部感染风险）；老伴推轮椅（提示活动耐量下降）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为'2型糖尿病兼夹证，痰浊'，与病例中的糖尿病控制不佳、痰湿证候（舌脉及症状）对齐。Action推荐腹针疗法（弱推荐，证据等级C），取穴指定。Contraindication为null，但全网扫描：① 药物相互作用：未提供当前用药，但腹针（针灸）通常无直接药物冲突；需警惕糖尿病用药（如二甲双胍或胰岛素）未优化。② 禁忌症：腹针一般禁忌包括腹部皮肤感染或妊娠——病例中足部破损非腹部，无相关禁忌；确保无菌操作以防交叉感染。③ 共病风险：足部破损（感染风险高，需优先处理）；心血管风险（颈动脉斑块）；肥胖（影响治疗效果）；环境潮湿（加剧足部问题）。整体安全评估：腹针可行，但必须在处理急性风险（如足部感染）后实施。\n\nStep 4: 决策生成 (Decision Making) - 基于指南Action，生成决策：实施腹针疗法取指定穴位（中脘、下脘、气海、关元、天枢双、滑肉门双、外陵双、商丘双、气穴双）。同时，针对合并症进行全网扫描管理：① 优先安全处理足部破损（清洁和抗真菌）；② 优化糖尿病控制（调整降糖方案）；③ 评估呼吸道症状（排除心肺急症）；④ 改善环境因素。决策优先级：安全第一（足部风险 > 腹针治疗），确保综合治疗。",
    "medical_order": "诊断：2型糖尿病兼夹证（痰浊），合并肥胖、高脂血症、糖尿病肾病早期、颈动脉粥样硬化、足部皮肤破损可疑感染。\n计划：\n1. 予腹针疗法，取穴中脘、下脘、气海、关元、天枢（双）、滑肉门（双）、外陵（双）、商丘（双）、气穴（双），每周2次，疗程4周；操作时严格无菌。\n2. 完善足部评估：清洁破损处，予局部抗真菌药膏（如克霉唑），每日换药；建议足病科会诊排除糖尿病足溃疡。\n3. 优化糖尿病管理：监测空腹及餐后血糖，建议内分泌科随访调整降糖方案（如强化二甲双胍或加用SGLT2抑制剂）。\n4. 评估心肺功能：完善胸片、心电图及肺功能测试，排除慢性阻塞性肺病或心衰。\n5. 生活方式干预：予低脂糖尿病饮食，建议减重目标（BMI降至<28 kg/m²）；改善家居环境，确保通风防潮。\n6. 随访：2周后复诊，复查HbA1c、血脂、尿微量白蛋白；若足部破损加重或出现发热，立即急诊。",
    "patient_dialogue": "医生：阿姨/叔叔，您和老伴辛苦了，推着轮椅过来不容易。别担心，咱们一步步来，我会帮您把身体调理好。\n\n首先，针对您饭后胸闷和痰多的问题，咱们试试一种安全的针灸治疗，在肚子上取几个穴位。这个叫腹针，能帮助化痰、缓解胸闷，做的时候就像轻轻扎几下，不疼的，我们保证干净卫生，防止感染。\n\n另外，您的血糖有点高，咱们得加强管理，可能调整一下药量，这样能减少以后并发症的风险，比如保护肾脏和心脏。您老伴说家里潮湿，这特别重要——潮湿环境容易让脚出问题，您脚上破了的地方，得每天用清水洗干净，再涂点药膏（比如克霉唑），防止发炎。建议家里多开窗通风，换干爽的鞋袜，别让脚泡在水里。\n\n还有，您说昨晚没睡好是因为装修噪音，可以试试戴个耳塞，或者和邻居商量下时间。这些小改变能让您舒服些。记住，坚持健康饮食、多走动（哪怕在屋里转转），体重减一点，身体负担就轻了。咱们两周后再来看看效果，好吗？您做得很棒，戒烟都四年了，继续保持！"
  },
  {
    "id": 588,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者因“双足麻木、刺痛加重3周”今日复诊。既往2型糖尿病14年，平日空腹血糖8-10 mmol/L，HbA1c 8.4%；3年前出现周围神经病变，目前仍感夜间灼痛。否认高血压、冠心病。查体：BMI 29.6 kg/m²，腰围102 cm；双足背动脉搏动减弱，10 g单丝试验阳性，振动觉减退；足背皮肤暗紫、温度低，可见散在瘀点。患者自述近期跑车久坐，每日吸烟15支，饮食不规律。实验室：FPG 9.1 mmol/L，2h-PPG 14.7 mmol/L，TC 5.8 mmol/L，TG 3.2 mmol/L，尿微量白蛋白/肌酐 42 mg/g，eGFR 78 ml·min⁻¹·1.73 m⁻²；血黏度升高，舌质暗红、边有瘀斑，苔薄白，脉涩。患者担心继续发展会截肢，希望调整治疗方案。",
    "reference_rule": {
      "condition": "2型糖尿病并发周围神经病变者，血瘀",
      "action": "推荐单验方：糖痹胶囊（弱推荐，证据等级：C）：黄芪、丹参、当归、桂枝、白芍、路路通、水蛭、怀牛膝",
      "contraindication": null,
      "evidence": "推荐的单验方：糖痹胶囊（弱推荐，证据等级：C）：黄芪、丹参、当归、桂枝、白芍、路路通、水蛭、怀牛膝，适用于 2型糖尿病并发周围神经病变者。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，涉及2型糖尿病并发周围神经病变、潜在外周动脉疾病、高脂血症、糖尿病肾病早期及肥胖等多重共病。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗方案的安全性（安全 > 疗效）。\n\nStep 2: 临床解码 (Clinical Decoding): 患者关键信息包括：2型糖尿病控制不佳（HbA1c 8.4%，FPG 9.1 mmol/L，2h-PPG 14.7 mmol/L），周围神经病变恶化（双足麻木、刺痛加重，夜间灼痛，10 g单丝试验阳性，振动觉减退）；潜在外周动脉疾病（足背动脉搏动减弱、皮肤暗紫、温度低、瘀点）；代谢综合征（BMI 29.6 kg/m²，腰围102 cm，TC 5.8 mmol/L，TG 3.2 mmol/L，血黏度升高）；糖尿病肾病早期（尿微量白蛋白/肌酐 42 mg/g，eGFR 78 ml·min⁻¹·1.73 m⁻²）；不良生活习惯（久坐、每日吸烟15支，饮食不规律）；以及中医血瘀证（舌质暗红、瘀斑，脉涩）。隐式线索包括：吸烟和久坐加剧血管风险，血糖控制不稳定提示降糖方案需优化，瘀点和血黏度高提示出血或血栓风险需评估。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南condition为'2型糖尿病并发周围神经病变者，血瘀'，与患者情况高度匹配（糖尿病神经病变+血瘀证）。contraindication为null，但强制安全检查发现：糖痹胶囊含水蛭（潜在抗凝血作用），患者有散在瘀点和血黏度高，虽无活动出血禁忌，需警惕出血风险；无已知药物相互作用（患者当前用药未指定，但需避免与抗凝药联用）；共病风险包括外周动脉疾病可能恶化截肢风险、肾病进展及吸烟相关心血管事件。优先级安全：糖痹胶囊可谨慎使用，但必须结合整体管理以降低风险。\n\nStep 4: 决策生成 (Decision Making): 基于指南action（推荐糖痹胶囊，弱推荐证据等级C），生成决策：采用糖痹胶囊辅助治疗神经病变，同时强化血糖控制、降脂治疗、生活干预及进一步血管评估，以综合管理共病风险。",
    "medical_order": "诊断：2型糖尿病伴周围神经病变恶化；糖尿病肾病（CKD G2A2）；混合型高脂血症；肥胖；外周动脉疾病待排；血瘀证。\n治疗：\n1. 予糖痹胶囊口服，每次4粒，每日3次（成分：黄芪、丹参、当归、桂枝、白芍、路路通、水蛭、怀牛膝）。\n2. 优化降糖治疗：调整降糖方案，目标HbA1c <7%，予二甲双胍1000 mg口服每日2次（若未使用），并监测血糖。\n3. 降脂治疗：予阿托伐他汀20 mg每晚口服。\n4. 生活方式干预：严格戒烟；增加日常活动，避免久坐；低脂低糖饮食，控制体重。\n5. 完善检查：下肢动脉超声或踝肱指数（ABI）测试评估外周动脉疾病；定期监测肾功能、尿微量白蛋白、凝血功能。\n6. 随访：4周后复诊评估症状及实验室指标。",
    "patient_dialogue": "先生/女士，我完全理解您对脚部麻木和刺痛加重的担心，特别是怕会发展成截肢。别太焦虑，我们一步步来，一定能控制住。首先，我会给您开一种叫糖痹胶囊的中药，它能帮助改善血液循环和神经疼痛，减少那种烧灼感。但光靠药还不够——您必须把烟戒掉！因为吸烟会让血管更窄，加重脚部问题，万一堵塞严重，确实有截肢风险。另外，尽量少坐车久坐，每天抽时间走走路，哪怕十几分钟也好。饮食上，少吃油腻和甜食，这对控制血糖和血脂很重要。我还会帮您调整血糖药，让数字降下来。下周我们做个简单检查，看看血管情况。咱们一起努力，好吗？您戒烟和运动的小改变，就能带来大不同！"
  },
  {
    "id": 566,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者因‘右足背溃烂渗液3天’由家属推入换药室。既往2型糖尿病18年，糖化血红蛋白9.2%，高血压、脂代谢紊乱；2年前因‘急性非ST段抬高型心梗’植入支架1枚，目前口服阿司匹林+氯吡格雷双抗。查体：右足背可见3.5 cm×2 cm不规则溃疡，基底呈黄白色，边缘皮肤暗红肿胀，皮温升高，足背动脉搏动减弱；双下肢浅感觉减退，振动觉消失。实验室：空腹血糖11.8 mmol/L，WBC 12.4×10⁹/L，NE% 81%，CRP 67 mg/L；Scr 108 μmol/L，eGFR 58 mL·min⁻¹·1.73 m⁻²，尿微量白蛋白/肌酐 210 mg/g。今日阴雨天，患者自诉伤口‘一跳一跳地疼’，夜间影响睡眠，无发热但食欲下降。家属焦虑询问是否需住院。",
    "reference_rule": {
      "condition": "糖尿病足局部红肿、溃疡",
      "action": "中药外敷：可清创处理，后给予碘伏创面消毒、生理盐水冲洗，予京万红软膏涂抹于消毒纱布上，敷盖创面，消毒纱布包扎，每日换药 1次。（强推荐，证据等级：A）",
      "contraindication": null,
      "evidence": "③ 中药外敷：针对糖尿病足局部红肿、溃疡，可清创处理，后给予碘伏创面消毒、生理盐水冲洗，予京万红软膏涂抹于消毒纱布上，敷盖创面，消毒纱布包扎，每日换药 1次。（强推荐，证据等级：A）"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**\n本案例属于复杂合并症治疗场景，患者患有2型糖尿病18年（控糖不佳）、高血压、脂代谢紊乱、既往心梗支架植入史（双抗治疗），合并糖尿病足溃疡伴感染迹象、周围神经病变、外周动脉疾病及慢性肾病。作为专科专家（博学的专科专家），我将全网扫描药物相互作用（如双抗治疗与清创出血风险）、禁忌症（指南无指定，但需评估患者共病）及共病风险（感染、肾功能不全、心血管事件），优先确保安全（安全 > 疗效），再优化疗效。\n\n**Step 2: 临床解码 (Clinical Decoding)**\n从病例提取关键信息并转化为医学术语：主诉‘右足背溃烂渗液3天’提示急性糖尿病足溃疡（Wagner分级1-2级）。查体显示溃疡3.5 cm×2 cm、基底黄白色（坏死或感染）、边缘暗红肿胀及皮温升高（局部炎症），足背动脉搏动减弱（外周动脉疾病），双下肢浅感觉减退和振动觉消失（糖尿病周围神经病变）。实验室：空腹血糖11.8 mmol/L（高血糖恶化感染）、WBC 12.4×10⁹/L和NE% 81%（中性粒细胞升高）、CRP 67 mg/L（炎症标志物升高）→ 提示细菌感染；Scr 108 μmol/L、eGFR 58 mL·min⁻¹·1.73 m⁻²（慢性肾病G3a期）、尿微量白蛋白/肌酐 210 mg/g（糖尿病肾病）。隐式线索：患者自诉伤口‘一跳一跳地疼’（神经性疼痛或感染性疼痛）、夜间影响睡眠和食欲下降（全身不适），结合阴雨天环境（可能加重疼痛），家属焦虑询问住院 → 暗示感染进展风险高、血糖失控加剧伤口愈合障碍，且双抗治疗（阿司匹林+氯吡格雷）增加清创出血风险。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**\n指南condition‘糖尿病足局部红肿、溃疡’精准匹配患者情况（溃疡伴红肿热痛）。Action为中药外敷（清创、碘伏消毒、生理盐水冲洗、京万红软膏包扎、每日换药），contraindication为null。强制安全检查：无绝对禁忌，但患者合并症引入风险 → 药物相互作用（双抗治疗可能增加清创时出血，需轻柔操作）；共病风险（感染迹象强，WBC↑和CRP↑提示需全身抗生素；肾功能不全需避免肾毒性药物；心血管风险在双抗下稳定）。指南强推荐（证据等级A）适用局部处理，但安全优先要求综合管理感染和血糖。\n\n**Step 4: 决策生成 (Decision Making)**\n基于指南action，生成局部处理决策：清创、碘伏消毒、生理盐水冲洗、京万红软膏涂抹纱布敷盖创面、消毒纱布包扎、每日换药一次。但因复杂合并症，扩展决策：感染风险高需静脉抗生素；血糖失控需强化控制；疼痛和家属焦虑提示住院必要性。最终决策：执行指南局部方案，并建议住院以全面管理（安全优先）。",
    "medical_order": "建议住院治疗。诊断：糖尿病足溃疡伴感染（Wagner 1-2级），糖尿病周围神经病变，外周动脉疾病，2型糖尿病控糖不佳，慢性肾病G3a期。治疗：1. 局部处理：清创溃疡坏死组织，碘伏创面消毒，生理盐水冲洗，予京万红软膏涂抹于消毒纱布上，敷盖创面，消毒纱布包扎，每日换药一次。2. 抗感染：予静脉抗生素（如头孢呋辛 1.5g iv q8h），完善血培养、足部X线或MRI排除骨髓炎。3. 血糖控制：起始胰岛素强化治疗（基础+餐时胰岛素），监测血糖 qid，目标空腹血糖 4.4-7.0 mmol/L。4. 共病管理：继续阿司匹林 100mg qd + 氯吡格雷 75mg qd 双抗治疗；监测肾功能、感染指标（WBC、CRP）及足背动脉多普勒超声。5. 支持治疗：予一级护理，低盐糖尿病饮食，疼痛管理（如对乙酰氨基酚）。",
    "patient_dialogue": "王先生，您脚上的伤口发炎了，肿得厉害，还一跳一跳地疼，这是因为糖尿病时间长了，血管和神经受了影响，加上现在有感染，所以特别不舒服。我们先帮您把伤口清理干净——用消毒水洗一洗，涂上专门消炎的药膏包起来，每天换一次药，这样能帮助伤口好起来。不过，您血糖没控制好（空腹都11.8了），感染也比较重，血里的炎症指标都高了，光换药可能不够，还得用抗生素输液把感染压下去，同时把血糖调稳。不然的话，伤口容易恶化，甚至影响到骨头。另外，您心脏放过支架，吃着两种抗血小板的药，我们得小心别让伤口出血。所以啊，我强烈建议您住院几天，这样我们24小时盯着，输液控制感染，调血糖，还能减轻疼痛让您睡个好觉。您家人别太担心，住院是为了更安全、更快康复，咱们一步一步来，好吗？"
  },
  {
    "id": 585,
    "file_name": "2型糖尿病中医防治指南_倪青.json",
    "case_input": "患者今日由老伴推轮椅入诊室，自述近3个月夜尿5-6次/晚，双踝凹陷性水肿至膝，晨起手僵但无显著关节痛。既往T2DM 19年，胰岛素+多种口服药控制；5年前因‘急性非ST段抬高心梗’置入支架1枚；3年前发现eGFR 42 mL·min⁻¹·1.73 m⁻²，尿蛋白(++)，被诊断为‘糖尿病肾病 G3bA3’。近期HbA1c 8.1%，空腹C-肽 0.8 ng·mL⁻¹；BP 145/82 mmHg；Scr 136 μmol·L⁻¹，UACR 587 mg·g⁻¹。双下肢振动觉消失，踝反射未引出。患者面色黧黑，语声低怯，舌质淡暗偏胖、边有齿痕，苔白而干，脉沉细无力，尺部尤甚。老伴补充：‘夜里他出冷汗，被子都湿，还老说腰像断了一样酸。’今日患者自带药袋，内装剩余二甲双胍、恩格列净及阿司匹林，但坦言‘吃药太多胃难受，想换成中药试试’。诊室外正下着连绵细雨，患者鞋底沾泥，轮椅踏板处放着刚采摘准备售卖的韭菜，轻微泥腥味混杂诊室消毒水味。",
    "reference_rule": {
      "condition": "2型糖尿病晚期，阴阳两虚证",
      "action": "推荐中成药：金匮肾气丸（强推荐，证据等级：B）：一次 6 g，一日 3次",
      "contraindication": null,
      "evidence": "推荐的中成药：金匮肾气丸（强推荐，证据等级：B）：一次 6 g，一日 3次。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于复杂合并症治疗场景，涉及2型糖尿病晚期、糖尿病肾病、心血管病史、周围神经病变及中医阴阳两虚证。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先级安全 > 疗效。需全面评估患者多系统疾病交互，确保治疗安全，避免潜在不良反应。\n\nStep 2: 临床解码 (Clinical Decoding) – 从病例提取关键信息并转化为医学术语：夜尿5-6次/晚提示夜尿症，可能与糖尿病肾病导致的浓缩功能障碍相关；双踝凹陷性水肿延伸至膝表明严重液体潴留，需鉴别心衰或肾病进展；晨起手僵但无关节痛可排除类风湿关节炎，考虑糖尿病相关晨僵；长期T2DM控制不佳（HbA1c 8.1%，空腹C-肽0.8 ng·mL⁻¹提示内生胰岛素不足）；心血管史（心梗PCI术后）需持续抗血小板治疗；肾病指标（eGFR 42 mL·min⁻¹·1.73 m⁻²，Scr 136 μmol·L⁻¹，UACR 587 mg·g⁻¹）确认糖尿病肾病G3bA3期；周围神经病变（双下肢振动觉消失，踝反射未引出）；中医体征（面色黧黑、语声低怯、舌质淡暗偏胖边齿痕苔白干、脉沉细无力尺部尤甚）及症状（盗汗、腰酸）支持阴阳两虚证（以肾阳虚为主）。隐式线索包括：患者自述胃不适（药物副作用导致依从性差），环境因素（雨天、韭菜泥腥味可能反映寒湿体质但不直接影响治疗），水肿严重性提示需紧急评估心肾功能，血压145/82 mmHg显示未达标高血压。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) – 指南条件“2型糖尿病晚期，阴阳两虚证”与患者临床表现高度匹配（糖尿病肾病进展、中医证候）。指南推荐金匮肾气丸（强推荐，证据等级B），无禁忌症（contraindication为null）。强制安全检查：金匮肾气丸含温热成分（如附子、肉桂），在eGFR 42的中度肾损患者中需监测肾功能和电解质（防高钾或肾毒性）；药物相互作用扫描显示，金匮肾气丸与当前西药（二甲双胍、恩格列净、阿司匹林）无已知严重冲突，但恩格列净在肾病中可能增加泌尿感染风险，需观察；共病风险包括心衰（水肿提示）、高血压未控、神经病变恶化，安全优先原则要求整合西医管理；患者胃不适可能改善依从性，但中药需避免加重胃肠负担。\n\nStep 4: 决策生成 (Decision Making) – 基于指南行动（action），推荐金匮肾气丸一次6g一日3次。同时，针对共病生成综合决策：优化降糖和血压控制，评估水肿原因，确保心血管保护，并安排严密随访，以安全为前提提升疗效。",
    "medical_order": "诊断：2型糖尿病晚期伴糖尿病肾病（CKD G3bA3期）、糖尿病周围神经病变、冠状动脉粥样硬化性心脏病PCI术后、高血压2级；中医诊断：阴阳两虚证（肾阳虚为主）。\n治疗：\n1. 予金匮肾气丸，6g tid po。\n2. 继续阿司匹林肠溶片 100mg qd po 抗血小板治疗。\n3. 优化降糖方案：评估当前胰岛素剂量，考虑停用二甲双胍（eGFR<45 mL·min⁻¹·1.73 m⁻²慎用），加用GLP-1受体激动剂（如利拉鲁肽）皮下注射，目标HbA1c <7.0%。\n4. 启动降压治疗：予缬沙坦 80mg qd po（ARB类，护肾降蛋白），目标BP <130/80 mmHg，监测Scr和血钾。\n5. 处理水肿：完善NT-proBNP、心脏超声评估心功能；若排除心衰，予呋塞米 20mg qd po 利尿，监测电解质。\n6. 肾病管理：予低盐饮食（<3g/d）、低蛋白饮食（0.8g/kg/d），教育限水。\n7. 胃部保护：予泮托拉唑 40mg qd po 减轻药物性胃不适。\n8. 神经病变支持：予甲钴胺 500μg tid po 营养神经。\n随访：安排1周后复诊，复查BP、FBG、Scr、eGFR、UACR；若水肿加重或肾功能恶化，立即转肾内科专科。",
    "patient_dialogue": "张大爷，您和老伴辛苦了，我看您腿肿得厉害，晚上起夜好几次，还出汗腰酸，这些啊，都说明您身体里的肾气比较弱了，中医叫‘肾阳虚’。您说吃药胃不舒服，这个我理解，咱们试试加一种中药——金匮肾气丸，每天三次，每次一小包，它能帮您补肾气，减轻水肿和夜尿，可能让您胃也好受点。不过，您那个阿司匹林药片还得接着吃，它对您的心脏特别重要，支架后不能停，停了风险大。\n\n另外，您血糖还有点高，血压也没完全下来，咱们得调整一下：胰岛素可能加点量，或者换种打针的药；降压药也给您开个新的，保护肾。腿肿的话，先少吃盐——做菜别放太多酱油咸盐，咸菜也别碰——如果肿得厉害，可能加点排水药。胃不舒服我给您配个护胃的药，吃了应该能缓解。\n\n您和老伴别担心，咱们一步一步来。一周后您再过来，咱们查查腿肿好点没，肾和血压怎么样。平时注意保暖，雨天少出门，韭菜这些湿气重的食物适量吃就行。您坚持治疗，身体会慢慢好起来的，咱们一起努力！"
  }
]