
[
  {
    "condition": "胁肋胀满，腹胀，纳少，便溏不爽，情志抑郁，善太息，舌质淡胖、苔白或腻，脉弦缓。以女性为多，形体中等或偏瘦，可有焦虑、抑郁倾向。",
    "action": "1. 推荐方药：逍遥散（《太平惠民和剂局方》），药物组成：当归、白芍、柴胡、茯苓、白术、甘草、生姜、薄荷；2. 推荐的中成药：加味逍遥丸，一次 6 g，一日 2次；3. 推荐的单验方：三舒汤：柴胡、当归、白芍、姜半夏、甘草、白术、厚朴、枳壳、山药、郁金、茯苓、知母；4. 推荐的其他疗法：针刺治疗，取穴：百会、神庭、中脘、足三里（双）、合谷（双）、太冲（双），留针 30分钟，一周 3次。",
    "contraindication": null,
    "evidence": "(1) 肝郁脾虚证 * 临床表现：胁肋胀满，腹胀，纳少，便溏不爽，情志抑郁，善太息，舌质淡胖、苔白或腻，脉弦缓。以女性为多，形体中等或偏瘦，可有焦虑、抑郁倾向。 * 治则：疏肝健脾。 * 推荐方药：逍遥散（《太平惠民和剂局方》）（强推荐，证据等级：B），药物组成：当归、白芍、柴胡、茯苓、白术、甘草、生姜、薄荷。 * 推荐的中成药：加味逍遥丸（弱推荐，证据等级：C），一次 6 g，一日 2次。 * 推荐的单验方：三舒汤（弱推荐，证据等级：C）：柴胡、当归、白芍、姜半夏、甘草、白术、厚朴、枳壳、山药、郁金、茯苓、知母。 * 推荐的其他疗法：针刺治疗（弱推荐，证据等级：B）：取穴：百会、神庭、中脘、足三里（双）、合谷（双）、太冲（双）。留针 30分钟，一周 3次。"
  },
  {
    "condition": "形体肥胖，腹胀，胸闷脘痞，口干口渴，喜冷饮，饮水量多，心烦口苦，大便干结，小便色黄，舌质红，舌体胖，苔黄腻，脉弦滑。",
    "action": "1. 推荐方药：小陷胸汤（《伤寒论》），药物组成：黄连、半夏、瓜蒌；2. 推荐的中成药：痰热清注射液，适用于 2型糖尿病合并慢性阻塞性肺疾病急性加重者；痰热清胶囊，一次 3粒，一日 3次；3. 推荐的单验方：益糖康：黄芪、党参、白术、茯苓、甘草、黄连、黄柏、黄精、五味子、丹参、三七、大黄、葛根；4. 推荐的其他疗法：腹针治疗，取穴：关元、气海、中脘、下脘、阴都（双）、石关（双）、商曲（双）、气旁（双）、气穴（双）、滑肉门（双）、外陵（双）、上风湿点（双）、下风湿点（双）、天枢（双）、大横（双），不使用提插、捻转手法，留针 30分钟，隔日 1次，3次/每周。",
    "contraindication": null,
    "evidence": "(2) 痰热互结证 * 临床表现：形体肥胖，腹胀，胸闷脘痞，口干口渴，喜冷饮，饮水量多，心烦口苦，大便干结，小便色黄，舌质红，舌体胖，苔黄腻，脉弦滑。 * 治则：清热化痰。 * 推荐方药：小陷胸汤（《伤寒论》）（强推荐，证据等级：B），药物组成：黄连、半夏、瓜蒌。 * 推荐的中成药： * ① 痰热清注射液（弱推荐，证据等级：C），适用于 2型糖尿病合并慢性阻塞性肺疾病急性加重者。 * ② 痰热清胶囊（强推荐，证据等级：B）：一次 3粒，一日 3次。 * 推荐的单验方：益糖康（强推荐，证据等级：A）：黄芪、党参、白术、茯苓、甘草、黄连、黄柏、黄精、五味子、丹参、三七、大黄、葛根。 * 推荐的其他疗法：腹针治疗（弱推荐，证据等级：C）：取穴：关元、气海、中脘、下脘、阴都（双）、石关（双）、商曲（双）、气旁（双）、气穴（双）、滑肉门（双）、外陵（双）、上风湿点（双）、下风湿点（双）、天枢（双）、大横（双）。不使用提插、捻转手法。留针 30分钟。隔日 1次，3次/每周。"
  },
  {
    "condition": "口干不渴，或有口臭，脘腹痞满，大便黏腻不爽，或臭秽难闻。小便色黄，舌红，舌体胖大，或边有齿痕，苔黄腻，脉滑数。多见于肥胖、高血糖、有肠道菌群失调表现者。",
    "action": "1. 推荐方药：葛根黄芩黄连汤加减（《伤寒论》）合三仁汤（《温病条辨》），药物组成：葛根、黄芩、黄连、厚朴、半夏、苦杏仁、白蔻仁、薏苡仁、滑石、通草、白术；2. 推荐的中成药：黄葵胶囊，一次 5粒，一日 3次，适用于糖尿病肾病或糖尿病合并视网膜病变者；3. 推荐的单验方：清热祛湿方：黄连、苍术、厚朴、枳壳、茵陈、佩兰、当归、薏苡仁、玄参、丹参；4. 推荐的其他疗法：糖四针，取穴包括丰隆、地机、养老及曲池，消毒处理后，使用毫针深刺，进针 1~2寸，以患者有触电感为宜，随后提插 3~5分钟，留针 30分钟，每 15分钟提插 1次，5次/周。",
    "contraindication": null,
    "evidence": "(3) 肠道湿热证 * 临床表现：口干不渴，或有口臭，脘腹痞满，大便黏腻不爽，或臭秽难闻。小便色黄，舌红，舌体胖大，或边有齿痕，苔黄腻，脉滑数。多见于肥胖、高血糖、有肠道菌群失调表现者。 * 治则：清热利湿。 * 推荐方药：葛根黄芩黄连汤加减（《伤寒论》）（强推荐，证据等级：A）合三仁汤（《温病条辨》）（弱推荐，证据等级：C），药物组成：葛根、黄芩、黄连、厚朴、半夏、苦杏仁、白蔻仁、薏苡仁、滑石、通草、白术。 * 推荐的中成药：黄葵胶囊（弱推荐，证据等级：B），一次 5粒，一日 3次，适用于糖尿病肾病或糖尿病合并视网膜病变者。 * 推荐的单验方：清热祛湿方（弱推荐，证据等级：C）：黄连、苍术、厚朴、枳壳、茵陈、佩兰、当归、薏苡仁、玄参、丹参。 * 推荐的其他疗法：糖四针（弱推荐，证据等级：C）：取穴包括丰隆、地机、养老及曲池，消毒处理后，使用毫针深刺，进针 1~2寸，以患者有触电感为宜，随后提插 3~5分钟，留针 30分钟，每 15分钟提插 1次，5次/周。"
  },
  {
    "condition": "心下痞满，口干，唇周痤疮，乏力，纳差，脘腹满闷，水谷不消，便溏，或腹泻，干呕呃逆，舌淡胖苔腻，舌下络瘀，脉弦滑无力。",
    "action": "1. 推荐方药：半夏泻心汤（《伤寒论》），药物组成：半夏、黄连、黄芩、干姜、甘草、大枣、人参；2. 推荐的单验方：三黄清幽汤：茵陈蒿、川芎、党参、黄芩、知母、丹参、桃仁、法半夏、黄连、吴茱萸、炙甘草；3. 推荐的其他疗法：针刺疗法，取穴：中脘、曲池、合谷、足三里、阴陵泉、三阴交、丰隆、血海、地机、太冲，均常规直刺 20~30 mm，采用平补平泻法，得气后留针 30分钟，每日 1次。",
    "contraindication": null,
    "evidence": "(4) 脾胃不和证 * 临床表现：心下痞满，口干，唇周痤疮，乏力，纳差，脘腹满闷，水谷不消，便溏，或腹泻，干呕呃逆，舌淡胖苔腻，舌下络瘀，脉弦滑无力。 * 治则：调和脾胃。 * 推荐方药：半夏泻心汤（强推荐，证据等级：A）（《伤寒论》），药物组成：半夏、黄连、黄芩、干姜、甘草、大枣、人参。 * 推荐的单验方：三黄清幽汤（弱推荐，证据等级：B）：茵陈蒿、川芎、党参、黄芩、知母、丹参、桃仁、法半夏、黄连、吴茱萸、炙甘草。 * 推荐的其他疗法：针刺疗法（弱推荐，证据等级：B）：取穴：中脘、曲池、合谷、足三里、阴陵泉、三阴交、丰隆、血海、地机、太冲。均常规直刺 20~30 mm，采用平补平泻法，得气后留针 30分钟，每日 1次。"
  },
  {
    "condition": "形体偏胖，腹部胀大，脘腹痞满，胸胁胀闷，面色红赤，心烦易怒，口干口苦，大便干，小便色黄，舌质红，苔黄，脉弦数。",
    "action": "1. 推荐方药：大柴胡汤（《伤寒论》），药物组成：柴胡、大黄、枳实、黄芩、半夏、白芍、生姜；2. 推荐的中成药：糖敏灵丸，一次 6 g，一日 3次；胆宁片，一次 5片，一日 3次，适用于 2型糖尿病性胃肠病；3. 推荐的单验方：开郁清热方：柴胡、黄芩、半夏、白芍、枳实、大黄、黄连、全瓜蒌、水蛭、桃仁；4. 推荐的其他疗法：耳穴压丸，取穴：脾、胃、肝、胰、神门、小肠、大肠、内分泌、糖尿病点、三焦、皮质下等。",
    "contraindication": null,
    "evidence": "(5) 肝胃郁热证 * 临床表现：形体偏胖，腹部胀大，脘腹痞满，胸胁胀闷，面色红赤，心烦易怒，口干口苦，大便干，小便色黄，舌质红，苔黄，脉弦数。 * 治则：开郁清热。 * 推荐方药：大柴胡汤（《伤寒论》）（强推荐，证据等级：A），药物组成：柴胡、大黄、枳实、黄芩、半夏、白芍、生姜。 * 推荐的中成药： * ① 糖敏灵丸（弱推荐，证据等级：A），一次 6 g，一日 3次。 * ② 胆宁片（弱推荐，证据等级：C），一次 5片，一日 3次，适用于 2型糖尿病性胃肠病。 * 推荐的单验方：开郁清热方（弱推荐，证据等级：C）：柴胡、黄芩、半夏、白芍、枳实、大黄、黄连、全瓜蒌、水蛭、桃仁。 * 推荐的其他疗法：耳穴压丸（弱推荐，证据等级：B）：取穴：脾、胃、肝、胰、神门、小肠、大肠、内分泌、糖尿病点、三焦、皮质下等。"
  },
  {
    "condition": "口渴多饮，多食易饥，皮肤干瘪，心烦易怒，大便干结，小便短黄，舌红干、苔黄燥，脉细数。此证多见于 2型糖尿病初发、血糖明显升高者。",
    "action": "1. 推荐方药：白虎加人参汤加减（《伤寒论》），药物组成：生石膏、知母、太子参、黄连、天花粉、生地黄、麦冬、牛膝、葛根；2. 推荐的中成药：降糖胶囊，一次 1.5 g，一日 3次；杞黄降糖胶囊，一次 6粒，一日 3次；糖尿灵片，一次 6片，一天 3次；3. 推荐的单验方：石地降糖饮：生地、知母、天花粉、葛根、太子参、麦冬、苍术、黄芩、生石膏、山药、柴胡、白芍、川牛膝；4. 推荐的其他疗法：电针治疗，选穴：中府、肺俞、尺泽、太渊、天枢、合谷、曲池、大肠俞、上巨虚、胰俞、丰隆，电针取穴：合谷—曲池（双侧）、上巨虚—丰隆（双侧）、天枢—天枢，选用连续波，频率为 5 Hz，电流强度以患者耐受为度，每次留针 30分钟后起针，背俞穴不留针。",
    "contraindication": null,
    "evidence": "(6) 热盛伤津证 * 临床表现：口渴多饮，多食易饥，皮肤干瘪，心烦易怒，大便干结，小便短黄，舌红干、苔黄燥，脉细数。此证多见于 2型糖尿病初发、血糖明显升高者。 * 治则：清热生津。 * 推荐方药：白虎加人参汤加减（《伤寒论》）（强推荐，证据等级：A），药物组成：生石膏、知母、太子参、黄连、天花粉、生地黄、麦冬、牛膝、葛根。 * 推荐的中成药： * ① 降糖胶囊（弱推荐，证据等级：C）：一次 1.5 g，一日 3次。 * ② 杞黄降糖胶囊（强推荐，证据等级：A）：一次 6粒，一日 3次。 * ③ 糖尿灵片（强推荐，证据等级：A）：一次 6片，一天 3次。 * 推荐的单验方：石地降糖饮（弱推荐，证据等级：C）：生地、知母、天花粉、葛根、太子参、麦冬、苍术、黄芩、生石膏、山药、柴胡、白芍、川牛膝。 * 推荐的其他疗法：电针治疗（弱推荐，证据等级：C）：选穴：中府、肺俞、尺泽、太渊、天枢、合谷、曲池、大肠俞、上巨虚、胰俞、丰隆。电针取穴：合谷—曲池（双侧）、上巨虚—丰隆（双侧）、天枢—天枢。选用连续波，频率为 5 Hz，电流强度以患者耐受为度，每次留针 30分钟后起针，背俞穴不留针。"
  },
  {
    "condition": "神疲乏力，心悸，气短懒言，咽干口燥，烦渴欲饮，午后颧红，小便短少，大便干结，舌体瘦薄、苔少而干，脉虚数。此期患者可出现并发症但多尚不严重，心脏超声可见心脏左室舒张功能降低，心电图可见心肌缺血或伴心律失常等。",
    "action": "1. 推荐方药：玉泉丸（《杂病源流犀烛》）或玉液汤加减（《医学衷中参西录》），药物组成：生山药、生黄芪、知母、生鸡内金、葛根、五味子、天花粉、生地黄、麦冬、乌梅、甘草，加减：心肺两虚为主者，宜选生脉散；心脾两虚为主者，宜选归脾汤；心肝两虚为主者宜当归补血汤合一贯煎；偏于肾者，宜选参芪地黄汤；2. 推荐的中成药：玉泉胶囊，0.6 g/粒，一次 4粒，一日 4次；参芪降糖胶囊，一次 3粒，一日 3次；天麦消渴片，一次 2片，一日 2次；消渴丸，一次 5~10丸，一日 2~3次；芪药消渴胶囊，一次 6粒，一日 3次；金芪降糖片，饭前半小时服用，一次 2~3片，一日 3次，疗程 3个月或遵医嘱；3. 推荐的单验方：孙氏降糖饮：生黄芪、丹参、太子参、天门冬、五味子、生山楂、麦冬、荷叶、玉米须；4. 推荐的其他疗法：针刺疗法，取穴：百会、四神聪、印堂、内关（双）、神门（双）、太乙（双）、水道（双）、关元、足三里（双）、三阴交（双），平补平泻，留针 30分钟，每日 1次。",
    "contraindication": null,
    "evidence": "气阴两虚证 * 临床表现：神疲乏力，心悸，气短懒言，咽干口燥，烦渴欲饮，午后颧红，小便短少，大便干结，舌体瘦薄、苔少而干，脉虚数。此期患者可出现并发症但多尚不严重，心脏超声可见心脏左室舒张功能降低，心电图可见心肌缺血或伴心律失常等。 * 治则：益气养阴。 * 推荐方药：玉泉丸（《杂病源流犀烛》）（弱推荐，证据等级：C）或玉液汤加减（《医学衷中参西录》）（强推荐，证据等级：A），药物组成：生山药、生黄芪、知母、生鸡内金、葛根、五味子、天花粉、生地黄、麦冬、乌梅、甘草。加减：心肺两虚为主者，宜选生脉散；心脾两虚为主者，宜选归脾汤。心肝两虚为主者宜当归补血汤合一贯煎；偏于肾者，宜选参芪地黄汤。 * 推荐的中成药： * （1）玉泉胶囊（强推荐，证据等级：A）：0.6 g/粒，一次 4粒，一日 4次。 * （2）参芪降糖胶囊（强推荐，证据等级：A）：一次 3粒，一日 3次。 * （3）天麦消渴片（强推荐，证据等级：A）：一次 2片，一日 2次。 * （4）消渴丸（强推荐，证据等级：A）：一次 5~10丸，一日 2~3次。 * （5）芪药消渴胶囊（强推荐，证据等级：A）：一次 6粒，一日 3次。 * （6）金芪降糖片（强推荐，证据等级：A）：饭前半小时服用。一次 2~3片，一日 3次，疗程 3个月或遵医嘱。 * 推荐的单验方：孙氏降糖饮（强推荐，证据等级：B）：生黄芪、丹参、太子参、天门冬、五味子、生山楂、麦冬、荷叶、玉米须。 * 推荐的其他疗法：针刺疗法（弱推荐，证据等级：C）：取穴：百会、四神聪、印堂、内关（双）、神门（双）、太乙（双）、水道（双）、关元、足三里（双）、三阴交（双），平补平泻，留针 30分钟，每日 1次。"
  },
  {
    "condition": "小便频数，浑浊如膏，腰膝酸软，眩晕耳鸣，多梦遗精，五心烦热，低热颧红，口干咽燥，皮肤干燥，视物模糊，雀目，或蚊蝇飞舞，或失明，皮肤瘙痒，舌红少苔，脉细数。多见于糖尿病并发视网膜病变、肾病、神经病变者。",
    "action": "1. 推荐方药：杞菊地黄丸（《小儿药证直诀》），药物组成：生地黄、山萸肉、炒山药、茯苓、泽泻、牡丹皮、枸杞子、菊花；2. 推荐的中成药：杞菊地黄丸，一次 8丸，一日 3次；六味地黄丸，一次 8丸，一日 3次；和血明目片，一次 5片，一日 3次；3. 推荐的单验方：补肾明目方：熟地黄、山萸肉、枸杞子、玄参、苍术、泽泻、丹参、昆布、川牛膝；4. 推荐的其他疗法：针刺治疗，选穴：承泣、瞳子髎、攒竹、丝竹空、风池、肝俞、肾俞、光明、阳陵泉、三阴交，针用平补平泻，每周 3次，适用于单纯型糖尿病视网膜病变；中药浴足，处方：豨莶草、红花、醋乳香、醋没药、艾叶、鸡血藤、刘寄奴、沉香、川芎、伸筋草、透骨草、苏木，煎好汤剂加温水调整到合适的温度，先熏蒸，注意防止烫伤，再浴足，浸泡 20分钟左右为宜，适用于糖尿病足；中药外敷，针对糖尿病足局部红肿、溃疡，可清创处理，后给予碘伏创面消毒、生理盐水冲洗，予京万红软膏涂抹于消毒纱布上，敷盖创面，消毒纱布包扎，每日换药 1次。",
    "contraindication": null,
    "evidence": "(1) 肝肾阴虚证 * 临床表现：小便频数，浑浊如膏，腰膝酸软，眩晕耳鸣，多梦遗精，五心烦热，低热颧红，口干咽燥，皮肤干燥，视物模糊，雀目，或蚊蝇飞舞，或失明，皮肤瘙痒，舌红少苔，脉细数。多见于糖尿病并发视网膜病变、肾病、神经病变者。 * 治则：滋补肝肾。 * 推荐方药：杞菊地黄丸（《小儿药证直诀》）（弱推荐，证据等级：B），药物组成：生地黄、山萸肉、炒山药、茯苓、泽泻、牡丹皮、枸杞子、菊花。 * 推荐的中成药： * ① 杞菊地黄丸（弱推荐，证据等级：B）：一次 8丸，一日 3次。 * ② 六味地黄丸（强推荐，证据等级：A）：一次 8丸，一日 3次。 * ③ 和血明目片（强推荐，证据等级：B）：一次 5片，一日 3次。 * 推荐的单验方：补肾明目方（弱推荐，证据等级：B）：熟地黄、山萸肉、枸杞子、玄参、苍术、泽泻、丹参、昆布、川牛膝。 * 推荐的其他疗法： * ① 针刺治疗（弱推荐，证据等级：C）：选穴：承泣、瞳子髎、攒竹、丝竹空、风池、肝俞、肾俞、光明、阳陵泉、三阴交。针用平补平泻，每周 3次，适用于单纯型糖尿病视网膜病变。 * ② 中药浴足（弱推荐，证据等级：C）：处方：豨莶草、红花、醋乳香、醋没药、艾叶、鸡血藤、刘寄奴、沉香、川芎、伸筋草、透骨草、苏木。煎好汤剂加温水调整到合适的温度，先熏蒸，注意防止烫伤。再浴足，浸泡 20分钟左右为宜，适用于糖尿病足。 * ③ 中药外敷：针对糖尿病足局部红肿、溃疡，可清创处理，后给予碘伏创面消毒、生理盐水冲洗，予京万红软膏涂抹于消毒纱布上，敷盖创面，消毒纱布包扎，每日换药 1次。（强推荐，证据等级：A）"
  },
  {
    "condition": "小便频数，夜尿增多，浑浊如脂如膏，甚至饮一溲一，五心烦热，口干咽燥，耳轮干枯，面色黧黑；腰膝酸软无力，神疲，畏寒肢凉，四肢欠温，阳痿，下肢浮肿，甚则全身皆肿，舌质淡，苔白而干，脉沉细无力。多见于糖尿病肾病、糖尿病合并周围神经病变等后期。",
    "action": "1. 推荐方药：金匮肾气丸加减（《金匮要略》），药物组成：附子、肉桂、熟地黄、山萸肉、枸杞子、炒山药、茯苓、泽泻、巴戟天、肉苁蓉、菟丝子、鹿角胶；2. 推荐的中成药：金匮肾气丸，一次 6 g，一日 3次；3. 推荐的单验方：糖肾方：黄芪、芡实、金樱子、黄连；4. 推荐的其他疗法：艾灸，取穴：肾俞、太溪、足三里、三阴交，配穴：上肢麻木、疼痛加曲池、外关、合谷；下肢麻木、疼痛加血海、阳陵泉、太冲，用温和灸固定艾条温和灸法，每穴 10分钟，每日 1次，以局部穴位温和舒适为度，适用于糖尿病并发周围神经病变。",
    "contraindication": null,
    "evidence": "(2) 阴阳两虚证 * 临床表现：小便频数，夜尿增多，浑浊如脂如膏，甚至饮一溲一，五心烦热，口干咽燥，耳轮干枯，面色黧黑；腰膝酸软无力，神疲，畏寒肢凉，四肢欠温，阳痿，下肢浮肿，甚则全身皆肿，舌质淡，苔白而干，脉沉细无力。多见于糖尿病肾病、糖尿病合并周围神经病变等后期。 * 治则：滋阴温阳。 * 推荐方药：金匮肾气丸加减（《金匮要略》）（强推荐，证据等级：A），药物组成：附子、肉桂、熟地黄、山萸肉、枸杞子、炒山药、茯苓、泽泻、巴戟天、肉苁蓉、菟丝子、鹿角胶。 * 推荐的中成药：金匮肾气丸（强推荐，证据等级：B）：一次 6 g，一日 3次。 * 推荐的单验方：糖肾方（弱推荐，证据等级：B）：黄芪、芡实、金樱子、黄连。 * 推荐的其他疗法：艾灸（弱推荐，证据等级：B）：取穴：肾俞、太溪、足三里、三阴交。配穴：上肢麻木、疼痛加曲池、外关、合谷；下肢麻木、疼痛加血海、阳陵泉、太冲。用温和灸固定艾条温和灸法，每穴 10分钟，每日 1次。以局部穴位温和舒适为度，适用于糖尿病并发周围神经病变。"
  },
  {
    "condition": "形体肥胖，嗜食肥甘，头重嗜睡，呕恶眩晕，恶心口黏，食油腻则加重，舌体胖大，苔白厚腻，脉滑。实验室检查多见血脂或血尿酸升高，或伴脂肪肝。",
    "action": "1. 推荐方药：偏湿热者，宜黄连温胆汤加减（《重订广温热论》），药物组成：黄连、竹茹、枳实、半夏、陈皮、甘草、生姜、茯苓、白术；偏寒湿者，宜苓桂术甘汤（《伤寒论》），药物组成：茯苓、桂枝、白术、甘草；痰湿证，宜二陈汤（《太平惠民和剂局方》），药物组成：法半夏、陈皮、茯苓、生姜、乌梅、甘草；2. 推荐的中成药：金糖宁胶囊，一次 4粒，一日 3次；护肝片，一次 4片，一日 3次；3. 推荐的单验方：五加苍耳降糖方：五加皮、苍耳子、茯苓、白术、陈皮、黄精、生甘草、三七粉；4. 推荐的其他疗法：腹针疗法，取穴：中脘、下脘、气海、关元、天枢（双）、滑肉门（双）、外陵（双）、商丘（双）、气穴（双）。",
    "contraindication": null,
    "evidence": "(1) 痰浊 * 临床表现：形体肥胖，嗜食肥甘，头重嗜睡，呕恶眩晕，恶心口黏，食油腻则加重，舌体胖大，苔白厚腻，脉滑。实验室检查多见血脂或血尿酸升高，或伴脂肪肝。 * 治则：化痰降浊。 * 推荐方药： * 偏湿热者，宜黄连温胆汤加减（《重订广温热论》）（弱推荐，证据等级：B），药物组成：黄连、竹茹、枳实、半夏、陈皮、甘草、生姜、茯苓、白术； * 偏寒湿者，宜苓桂术甘汤（《伤寒论》）（弱推荐，证据等级：B），药物组成：茯苓、桂枝、白术、甘草； * 痰湿证，宜二陈汤（《太平惠民和剂局方》）（弱推荐，证据等级：C），药物组成：法半夏、陈皮、茯苓、生姜、乌梅、甘草。 * 推荐的中成药： * ① 金糖宁胶囊（弱推荐，证据等级：C）：一次 4粒，一日 3次。 * ② 护肝片（强推荐，证据等级：B）：一次 4片，一日 3次。 * 推荐的单验方：五加苍耳降糖方（弱推荐，证据等级：C）：五加皮、苍耳子、茯苓、白术、陈皮、黄精、生甘草、三七粉。 * 推荐的其他疗法：腹针疗法（弱推荐，证据等级：C）：取穴：中脘、下脘、气海、关元、天枢（双）、滑肉门（双）、外陵（双）、商丘（双）、气穴（双）。"
  },
  {
    "condition": "肢体麻木或疼痛，胸闷刺痛，或中风偏瘫，语言謇涩，或眼底出血，唇舌紫暗，舌有瘀斑或舌下青筋暴露，苔薄白，脉弦涩。",
    "action": "1. 推荐方药：桃红四物汤（《医宗金鉴》），药物组成：当归、白芍、川芎、熟地黄、桃仁、红花；或血府逐瘀汤（《医林改错》），药物组成：当归、生地、桃仁、红花、枳壳、赤芍、柴胡、甘草、桔梗、川芎、牛膝；2. 推荐的中成药：芪蛭降糖胶囊，一次 5粒，一日 3次；复方血栓通胶囊，一次 3粒，一日 3次，适用于 2型糖尿病并发糖尿病视网膜病变；3. 推荐的单验方：糖痹胶囊：黄芪、丹参、当归、桂枝、白芍、路路通、水蛭、怀牛膝，适用于 2型糖尿病并发周围神经病变者；4. 推荐的其他疗法：针刺疗法，取穴：双侧阳陵泉、阴陵泉、足三里、合谷、曲池、太溪、丰隆、三阴交，平补平泻手法，留针 30分钟，适用于 2型糖尿病并发周围神经病变者。",
    "contraindication": null,
    "evidence": "(2) 血瘀 * 临床表现：肢体麻木或疼痛，胸闷刺痛，或中风偏瘫，语言謇涩，或眼底出血，唇舌紫暗，舌有瘀斑或舌下青筋暴露，苔薄白，脉弦涩。 * 治则：活血祛瘀。 * 推荐方药：桃红四物汤（《医宗金鉴》）（强推荐，证据等级：B），药物组成：当归、白芍、川芎、熟地黄、桃仁、红花；或血府逐瘀汤（强推荐，证据等级：B）（《医林改错》），药物组成：当归、生地、桃仁、红花、枳壳、赤芍、柴胡、甘草、桔梗、川芎、牛膝。 * 推荐的中成药： * ① 芪蛭降糖胶囊（强推荐，证据等级：B）：一次 5粒，一日 3次。 * ② 复方血栓通胶囊（强推荐，证据等级：A）：一次 3粒，一日 3次。适用于 2型糖尿病并发糖尿病视网膜病变。 * 推荐的单验方：糖痹胶囊（弱推荐，证据等级：C）：黄芪、丹参、当归、桂枝、白芍、路路通、水蛭、怀牛膝，适用于 2型糖尿病并发周围神经病变者。 * 推荐的其他疗法：针刺疗法（弱推荐，证据等级：B）：取穴：双侧阳陵泉、阴陵泉、足三里、合谷、曲池、太溪、丰隆、三阴交，平补平泻手法，留针 30分钟，适用于 2型糖尿病并发周围神经病变者。"
  },
  {
    "condition": "2型糖尿病患者",
    "action": "1. 实施社区健康教育干预，以提高治疗依从性和改善生活质量；2. 个性化健康教育以控制糖化血红蛋白、空腹血糖及餐后 2小时血糖水平。",
    "contraindication": null,
    "evidence": "7.1.1 社区教育 社区健康教育对提高 2型糖尿病患者治疗的依从性、改善患者生活质量有显著作用。个性化健康教育有助于更好地控制社区糖尿病患者糖化血红蛋白、空腹血糖及餐后 2小时血糖水平。 * 临床证据：强推荐，证据等级：B。"
  },
  {
    "condition": "2型糖尿病患者",
    "action": "1. 实施同伴教育以提高自我管理能力；2. 控制餐前和餐后血糖；3. 降低糖化血红蛋白水平；4. 改善焦虑情绪和心理健康。",
    "contraindication": null,
    "evidence": "7.1.2 同伴教育 同伴教育能够提高 2型糖尿病患者自我管理能力，有效控制餐前和餐后血糖，降低 2型糖尿病患者糖化血红蛋白水平。并且同伴教育可改善 2型糖尿病患者的焦虑情绪，有助于患者的心理健康。 * 推荐等级：B级，弱推荐。"
  },
  {
    "condition": "2型糖尿病患者",
    "action": "1. 实施基于微信平台的远程自我管理教育；2. 使用文字、语音、图片、视频等多种形式传达健康教育内容；3. 提高自我管理能力；4. 降低糖化血红蛋白水平。",
    "contraindication": null,
    "evidence": "7.1.3 远程教育 远程自我管理教育相对于传统模式更加便捷、省时、节约花费。基于微信平台的健康教育模式可以通过文字、语音、图片、视频等多种形式传达健康教育的内容，以助于提高自我管理能力，降低糖化血红蛋白水平。 * 强推荐，证据等级：B。"
  },
  {
    "condition": "2型糖尿病之津伤燥热证患者",
    "action": "1. 制备偶遇饮：处方：玉米须 5 g、枸杞 15 g、芦根 30 g、藕汁 100 mL；制作方法：玉米须、枸杞、芦根共煎约 350 mL 汤汁，混入藕汁 100 mL 搅匀即可；2. 食用方法：每次 150 mL，饭前饮用。",
    "contraindication": null,
    "evidence": "7.2.1 偶遇饮 * 处方：玉米须 5 g、枸杞 15 g、芦根 30 g、藕汁 100 mL。 * 功用：清热生津。 * 适应症：2型糖尿病之津伤燥热证的辅助治疗。 * 制作方法：玉米须、枸杞、芦根共煎约 350 mL 汤汁，混入藕汁 100 mL 搅匀