[
  {
    "id": 792,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "患者3天前出现发热、头痛，自测体温38.7℃，随后面部、双手背相继出现散在丘疹，逐渐演变为水疱伴明显触痛。今日晨起发现右腕部2个水疱破溃，表面覆有黄色痂皮，周围皮肤红肿、皮温升高，轻压即诉剧痛。急诊查体：T 38.2℃，P 96次/分，BP 118/76 mmHg；皮疹集中于面颈、双手背及右前臂，呈离心分布，部分中央凹陷，个别已破溃渗出；右腕部破溃处可见环状红斑，局部波动感可疑。患者无免疫缺陷史，近期无药物过敏，但自述因赶稿连续熬夜，喜食外卖油炸食物。急诊化验：WBC 14.3×10⁹/L，Neu 78%，CRP 42 mg/L；破溃处分泌物已送细菌培养，结果待报。患者焦虑地询问：‘医生，这破皮的地方是不是化脓了？会不会留疤？’",
    "reference_rule": {
      "condition": "继发皮肤细菌感染",
      "action": "1. 给予有效抗菌药物治疗；2. 根据病原菌培养鉴定和药敏结果调整用药",
      "contraindication": "不建议预防性应用抗菌药物",
      "evidence": "继发皮肤细菌感染时给予有效抗菌药物治疗，根据病原菌培养分离鉴定和药敏结果加以调整。不建议预防性应用抗菌药物。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规急诊诊疗场景，作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断（如鉴别水痘、单纯疱疹或继发细菌感染），优先排除危急重症（如脓毒症），并给出直接的治疗指令。Step 2: 临床解码 (Clinical Decoding) - 关键信息：患者急性起病（3天），症状包括发热（38.7℃至38.2℃）、头痛、皮疹进展（面部和手背丘疹→水疱→破溃），右腕部破溃处出现红肿、皮温升高、剧痛、波动感可疑，提示局部化脓；实验室检查显示炎症标志物升高（WBC 14.3×10⁹/L、Neu 78%、CRP 42 mg/L），支持细菌感染；隐式线索：患者近期熬夜和油炸饮食，可能削弱免疫力，增加感染风险。皮疹离心分布、部分中央凹陷，需考虑病毒性疱疹（如水痘）的继发感染。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition为‘继发皮肤细菌感染’，病例完全匹配（局部化脓体征和炎症指标升高）；contraindication为‘不建议预防性应用抗菌药物’，但当前已是明确感染状态（非预防性），故无违规。Step 4: 决策生成 (Decision Making) - 根据指南action ‘1. 给予有效抗菌药物治疗；2. 根据病原菌培养鉴定和药敏结果调整用药’，决策为立即启动经验性广谱抗菌药物治疗，同时等待分泌物培养结果以优化用药。",
    "medical_order": "诊断：继发性皮肤细菌感染（疑似）。处理：1. 予头孢唑林1g静脉注射q8h（经验性抗感染）；2. 右腕部破溃处清创，无菌敷料覆盖；3. 监测体温、脉搏、伤口变化，每日一次；4. 完善分泌物细菌培养及药敏试验，结果回报后调整抗菌药物；5. 嘱患者休息，避免伤口接触水。",
    "patient_dialogue": "别担心，您手腕这块破皮的地方确实有感染迹象，我们叫它化脓，但这很常见，好好处理就不会有大问题。我们会马上给您用抗生素药水（注射进去），它能杀菌消炎，防止感染扩散。同时，我帮您清洁一下伤口，盖好干净的纱布，这样能减少留疤的风险——只要您别去抓它，保持干燥，愈合后疤痕会很小的。另外，您最近熬夜多、吃油炸食物，这会让身体抵抗力变差，容易感染。治疗期间，多休息、吃清淡点，比如煮点蔬菜粥，别碰外卖炸鸡了。咱们等化验结果出来，再调整用药，现在安心配合就行。"
  },
  {
    "id": 799,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "负压隔离病房，上午10点。患者蜷缩在床尾，双手紧攥被角，额头上贴着退热贴，眼神始终回避门口的医护。床旁监护仪显示体温38.4℃，HR 102次/分。面部、手掌散在20余颗2-4 cm脐凹样水疱，部分结痂。查房开始，他低声反复说：“医生，我会不会毁容？公司刚裁员，我房贷还没还完……”护士递给他口服药时，他的手抖得把水杯打翻，水洒到床单。他盯着天花板喃喃：“我已经三天没敢给爸妈打视频，怕他们看见我这样。”家属区来电铃声响起，他猛地一颤，把手机塞进枕头下。病程记录显示已发热6天，咽痛明显，夜间反复醒来。无既往精神病史，但入院前曾连续熬夜加班两周。今日实验室回报：白细胞5.6×10⁹/L，ALT 68 U/L，Cr 0.9 mg/dL。患者拒绝进食早餐，称“嘴里全是苦味，咽不下”，并询问“这病到底要多久才能让我回去上班”。",
    "reference_rule": {
      "condition": "患者存在紧张、焦虑、抑郁等心理问题",
      "action": "1. 加强心理支持和疏导；2. 及时请心理专科医师会诊；3. 必要时给予药物辅助治疗",
      "contraindication": null,
      "evidence": "患者常存在紧张、焦虑、抑郁等心理问题，应加强心理支持、疏导和相关解释工作，根据病情及时请心理专科医师会诊并参与疾病诊治，必要时给予相应药物辅助治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于行政与伦理场景，关注重点为流程合规性（如遵循医院心理危机干预流程）、文书完整性（确保病程记录和心理评估完整）、伦理告知（保障患者知情同意和隐私权）及公共卫生责任（由于患者在负压隔离病房，需防止传染风险）。Step 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：体温38.4℃和HR 102次/分提示发热与心动过速；面部和手掌脐凹样水疱（≥20颗，部分结痂）结合咽痛和发热6天，考虑病毒性感染（如水痘或猴痘）；行为表现（回避医护、反复担忧毁容和工作、手抖打翻水杯、拒绝进食、失眠）转化为医学术语——急性焦虑障碍伴躯体化症状（如失眠和食欲减退）；实验室结果（ALT 68 U/L轻度升高，可能与脱水或焦虑相关；白细胞正常）支持感染恢复期；社会因素（裁员、房贷压力、熬夜加班）加剧心理负担。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 与指南Condition匹配：患者存在明确紧张、焦虑等心理问题，符合条件。Contraindication为null，无禁忌。安全检查：在行政伦理框架下，需强制核查隐私保护（如家属来电处理）、知情同意（心理干预前需说明），并排除自杀风险（病例未提示，但需评估）。Step 4: 决策生成 (Decision Making) - 根据指南Action，生成决策：1. 加强心理支持和疏导（纳入日常护理）；2. 及时请心理专科医师会诊（今日内安排）；3. 必要时给予药物辅助治疗（评估后决定）。",
    "medical_order": "1. 加强心理支持与疏导：护理人员每日两次进行情绪评估（使用HADS量表），提供焦虑管理教育，记录行为变化。2. 请精神科专科医师会诊：今日内完成，评估急性焦虑障碍并建议干预方案。3. 必要时药物辅助治疗：会诊后决定是否予短效苯二氮䓬类药物（如劳拉西泮）口服，起始剂量0.5mg prn，监测镇静副作用。4. 完善文书：更新病程记录，包括心理状态、家属沟通记录及隐私保护措施（如手机使用规范）。5. 公共卫生责任：维持负压隔离，监测感染症状变化。",
    "patient_dialogue": "医生对患者说：'我知道您现在特别担心脸上的水疱和工作的压力，这完全正常。别害怕，我们会一步步帮您。第一，咱们安排一位心理专家来和您聊聊，他们专门处理这种焦虑，能教您一些放松技巧，比如深呼吸，让您睡得更好些。第二，如果焦虑太严重，我们可能会用点安全的药物来缓解紧张，但得先评估一下。至于工作的事，您先别急，身体恢复了才能好好上班——我会帮您开个证明，方便请假。对了，您爸妈那边，要不要我们护士帮您打个电话报平安？这样您就不用自己担心了。记住，您不是一个人在扛，我们整个团队都在支持您。'"
  },
  {
    "id": 786,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "患者第22天早晨查房时主动展示手机相册：面部、手掌及会阴部最后的痂皮已完全脱落，遗留浅褐色斑痕；口腔检查无新出疹，体温连续3日<37.2 ℃，脉搏78次/分，SpO₂ 98%（RA）。检验：实时荧光PCR咽拭子猴痘病毒核酸Ct值38.7（>35），血常规WBC 6.1×10⁹/L、PLT 220×10⁹/L，肝肾功能、CRP均正常。患者自述‘昨晚熬夜改代码，今天有点犯困’，无其他不适。病区感控护士已提前将出院告知书放在床尾，但尚未签字。",
    "reference_rule": {
      "condition": "符合出院标准",
      "action": "准予出院",
      "contraindication": null,
      "evidence": "符合以下标准可以出院：体温正常，临床症状明显好转，结痂脱落。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于行政与伦理场景，重点关注流程合规性（如出院文书签署）、文书完整性（如出院告知书确认）和公共卫生责任（确保传染病防控措施到位）。Step 2: 临床解码 (Clinical Decoding)：患者为猴痘感染恢复期，临床表现为体温连续3日<37.2℃（正常范围）、痂皮完全脱落（面部、手掌、会阴部遗留浅褐色斑痕）、口腔无新出疹、生命体征稳定（脉搏78次/分、SpO₂ 98%），实验室检查显示病毒核酸Ct值38.7（>35，符合阴性标准）、血常规（WBC 6.1×10⁹/L、PLT 220×10⁹/L）及肝肾功能、CRP正常；患者自述轻微疲劳（熬夜后犯困），但无其他不适，提示恢复良好但需关注生活习惯。Step 3: 规则对齐与安全检查 (Alignment & Safety)：与指南Condition匹配（体温正常、临床症状明显好转、结痂脱落），无禁忌（contraindication null）；安全检查确认所有指标在正常范围，无急性风险或并发症。Step 4: 决策生成 (Decision Making)：基于指南Action，准予出院，并确保行政流程完整（如出院告知书签署）和公共卫生责任（如隔离指导）。",
    "medical_order": "准予出院。签署出院告知书。出院后居家隔离至结痂完全脱落后21天，避免密切接触他人。建议充分休息，避免熬夜。安排7日后电话随访，监测恢复情况。",
    "patient_dialogue": "医生：早上好！看完你的检查报告和照片，恢复得真不错啊——体温正常好几天了，身上的痂都掉光了，病毒检测也显示阴性了，这说明你已经符合出院条件了。不过出院后还得在家多待一阵子，大概再隔离三周左右，这是为了防止万一还有传染风险，别传给家人或朋友。另外，听你说昨晚熬夜改代码，今天犯困，这可不行，身体刚恢复，得多睡点觉，别太拼。回去后好好休息，按时吃饭，有事情随时给我们打电话。"
  },
  {
    "id": 787,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "患者3天前出现38.7℃发热伴剧烈头痛，自测抗原阴性。昨日面颈出现散在2-4mm脐凹状水疱，今晨左眼红痛、畏光明显。查体：T38.2℃，P96次/分，BP118/74mmHg；面部及四肢近端共见30余处痘疱，基底红晕，个别表面微渗血。左眼结膜充血（++），裂隙灯下见角膜中央直径约2mm浅层上皮缺损，边缘不规则，荧光素染色阳性，前房清。患者自述近2周无保护性接触，否认既往眼病史，但近1周因赶稿每日睡眠仅4小时。实验室回报：猴痘病毒PCR阳性，HIV抗体阴性，空腹血糖5.1mmol/L。患者担心视力受损，反复询问眼部病变是否可逆。",
    "reference_rule": {
      "condition": "出现角膜病变",
      "action": "1. 应用滴眼液；2. 辅以维生素A等治疗",
      "contraindication": null,
      "evidence": "出现角膜病变时，可应用滴眼液，辅以维生素A等治疗。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规急诊诊疗场景（患者有急性发热、皮疹、眼部急症表现），关注重点为快速排除危及视力的角膜溃疡等急症，并启动针对性治疗。\nStep 2: 临床解码 - 关键信息：①猴痘PCR阳性+脐凹状水疱→确诊猴痘病毒感染；②角膜荧光素染色阳性+畏光→病毒性角膜炎（浅层上皮缺损）；③熬夜史（每日睡4小时）→免疫抑制风险；④患者焦虑集中于视力预后。\nStep 3: 规则对齐与安全检查 - 指南condition'出现角膜病变'与患者角膜缺损完全匹配；action要求滴眼液+维生素A治疗；无禁忌症（HIV阴性/血糖正常）。安全重点：需预防继发感染及角膜穿孔。\nStep 4: 决策生成 - 核心执行指南：局部抗病毒+润滑+维生素A；扩展决策：因属传染病急症，需隔离+眼科急会诊+全身支持治疗。",
    "medical_order": "1. 隔离治疗（接触+呼吸道隔离）\n2. 眼部处理：\n   - 更昔洛韦眼用凝胶 0.15% 每日4次（抗病毒）\n   - 左氧氟沙星滴眼液 0.5% 每日4次（预防继发感染）\n   - 羧甲基纤维素钠滴眼液 每日6次（促进上皮修复）\n   - 口服维生素A胶丸 25,000 IU 每日1次（连用5日）\n3. 全身支持：\n   - 补液（生理盐水500ml ivgtt st）\n   - 布洛芬缓释胶囊 0.3g prn（体温>38.5℃）\n4. 急请眼科会诊（24小时内）\n5. 传染病上报\n6. 健康教育：严格手卫生；避免眼部按压；保障每日睡眠≥7小时",
    "patient_dialogue": "李女士，您的情况已经明确了，是猴痘病毒感染影响到眼睛。我理解您特别担心视力，咱们现在就重点处理这个问题——您眼角膜表面有个小损伤，就像皮肤擦破皮一样，这正是眼睛红痛怕光的原因。\n\n咱们分三步走：\n第一，马上用三种眼药：\n   - 抗病毒药膏（每天涂4次），专门对付病毒；\n   - 抗菌眼药水（每天4次），防止细菌捣乱；\n   - 还有'人工泪液'（随时可以滴），像给眼睛创口贴层保护膜。\n另外加个维生素A胶囊（每天1粒），这是帮角膜长好的'营养剂'。\n\n第二，您需要住单间隔离，餐具毛巾都单独使用。这不是惩罚啊，是因为这个病传染性强，咱们得保护好家人和邻居。\n\n第三，今天内我会请眼科专家来会诊，他们用精密仪器再仔细看看，咱们双保险。\n\n特别注意两件事：\n   - 千万别揉眼睛！手上病毒可能让损伤加重；\n   - 您最近熬夜太厉害了，接下来必须保证每天睡足7小时——睡眠就是最好的'修复药'，免疫力上去了眼睛才好得快。\n\n您最关心的视力问题：只要现在规范治疗，角膜这种浅层损伤是完全能长好的。我经手过类似患者，两周左右红痛就会明显减轻，您要有信心！"
  },
  {
    "id": 797,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "患者29岁，自由插画师，昨夜开始畏寒、乏力，今晨测腋温38.7 ℃，伴明显头痛与右腋下淋巴结肿痛。3天前曾参加一场小型泳池派对，自述与陌生伴侣有皮肤密切接触，无阴道/肛交史。检查见右腋前2枚1.5 cm质韧淋巴结，轻压痛；面部、躯干散在5-6个2-4 mm淡红色斑疹，中心微隆，未见明显水疱；口腔黏膜完整。患者同时抱怨“昨晚被蚊子叮得厉害”，双下肢可见散在搔抓痕。追问流行病学史：未接种天花疫苗，无出国史，但同派对1名外籍友人2周前因“疑似猴痘”被隔离。血常规：WBC 6.8×10⁹/L，PLT 210×10⁹/L；快速抗原新冠阴性。急诊体温单已标注“发热待查”，患者无药物过敏，既往体健。",
    "reference_rule": {
      "condition": "临床症见发热",
      "action": "推荐处方：升麻葛根汤、升降散、紫雪散",
      "contraindication": null,
      "evidence": "临床症见发热者推荐使用升麻葛根汤、升降散、紫雪散等；"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规急诊诊疗场景（患者因发热、淋巴结肿痛等症状就诊急诊），重点关注快速建立鉴别诊断以排除危急重症（如猴痘感染），并基于指南给出直接治疗指令。场景分析强调效率与安全，优先考虑传染病风险。\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：急性发热（腋温38.7 ℃伴畏寒、乏力、头痛）、右腋下淋巴结肿痛（提示局部感染或全身炎症反应）、躯干/面部淡红色斑疹（中心微隆，符合猴痘早期皮疹特征）、皮肤密切接触史（3天前泳池派对）及流行病学暴露（同派对友人有疑似猴痘隔离史）。隐式线索包括：皮疹与接触史高度相关（猴痘潜伏期通常5-21天，本例3天内发病可能为早期表现），蚊子叮咬可能为干扰因素（双下肢搔抓痕提示抓痒，非原发病因），未接种天花疫苗增加易感性。转化为医学术语：急性发热待查、疑似猴痘病毒感染、局部淋巴结炎。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件为‘临床症见发热’，患者发热症状匹配。禁忌症（contraindication）为null，强制检查确认：患者无药物过敏史、既往体健，无已知禁忌（如肝肾功能不全）。但安全重点在传染病风险：猴痘为法定报告疾病，需隔离以防止传播。\nStep 4: 决策生成 (Decision Making) - 基于指南action‘推荐处方：升麻葛根汤、升降散、紫雪散’，针对发热症状处方中成药；同时，结合急诊场景优先排除猴痘，决策包括：完善猴痘病毒核酸检测、隔离管理、对症支持治疗。最终方案整合指南与临床需求。",
    "medical_order": "予一级护理。完善猴痘病毒核酸检测（PCR），并行血培养及皮疹拭子培养。立即隔离至负压病房，报告传染病防控部门。对症处理：予物理降温（冰袋敷额），若体温超过39 ℃予布洛芬400 mg口服q8h。处方：升麻葛根汤10g bid、升降散5g tid、紫雪散3g tid口服，连用3天。监测体温q4h，记录皮疹进展。建议24小时内复查血常规。",
    "patient_dialogue": "您好，我是您的医生。根据您的情况——发烧、头痛、还有淋巴结和身上这些红点——我们得赶紧处理。首先，您提到派对上有朋友可能得了猴痘，这很关键。猴痘传染性强，为了您和家人安全，得马上做个专门检测，同时您需要单独隔离，避免传给他人。我会开些中药帮您退烧、缓解不适，比如升麻葛根汤能让您舒服点。还建议您多休息、多喝水，家里用温毛巾擦身降温。如果烧得厉害（超过39度），可以吃点退烧药。别担心，我们会全程监测，结果一出就告诉您下一步。现在就去隔离区吧，护士会带您去。"
  },
  {
    "id": 811,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "患者32岁，男，自由插画师，昨夜飞抵本市后今晨突发39.8 ℃高热伴寒战，自测口温一度升至40.1 ℃。颜面部、双手背及会阴区可见数十颗2–5 mm浅表痘疹，中央脐凹，部分已转为透亮小脓疱，触痛明显；躯干散在类似皮损，总数约百颗。患者诉吞咽刀割样疼痛，仅可饮流质；双侧颌下、颈部及腹股沟淋巴结肿大如鸽卵，质韧压痛，活动可。伴明显乏力、肌肉酸痛，无畏寒咳嗽。1周前曾与固定伴侣发生无保护口交及肛交，对方3周前自诉“长疹子”未就医。患者否认既往慢性病史、过敏史及疫苗接种禁忌。今日自行服用布洛芬0.4 g退热无效前来急诊。查体：T 39.7 ℃，HR 112次/分，BP 118/70 mmHg，SpO₂ 97%（RA）；口咽黏膜弥漫充血，双侧扁桃体Ⅱ°肿大，可见散在白色浅溃疡；颈部、腋下及腹股沟均可触及多枚1.5–2 cm淋巴结，触痛（+）。实验室初筛：WBC 11.2×10⁹/L，NE% 78%，LY% 15%，PLT 142×10⁹/L，CRP 68 mg/L，PCT 0.35 ng/mL；肝肾功能、电解质、血糖、尿常规未见异常。急诊已按发热伴皮疹流程予单间隔离，下一步拟行猴痘病毒PCR检测及HIV/梅毒筛查。患者焦虑询问“我这是不是就是猴痘？要住院吗？”",
    "reference_rule": {
      "condition": "临床症见高热、痘疹密布、咽痛、多发淋巴结肿痛",
      "action": "推荐处方：清营汤、升麻鳖甲汤、宣白承气汤",
      "contraindication": null,
      "evidence": "临床症见高热、痘疹密布、咽痛、多发淋巴结肿痛者推荐使用清营汤、升麻鳖甲汤、宣白承气汤等。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规急诊诊疗场景，作为急诊医生，我的关注重点是快速建立鉴别诊断（优先排除脓毒症、脑膜炎等危急重症），并基于症状和暴露史给出直接的治疗指令，确保高效决策以控制潜在传染风险。Step 2: 临床解码 (Clinical Decoding): 患者急性高热（39.7°C）、痘疹性皮疹（特征性中央脐凹及脓疱）、咽痛伴溃疡、多发淋巴结肿痛（触痛明显）、炎症指标升高（WBC 11.2×10⁹/L, CRP 68 mg/L），结合1周前无保护性行为史（伴侣有皮疹症状），高度提示猴痘病毒感染综合征；乏力、肌肉酸痛支持全身炎症反应，无畏寒咳嗽降低呼吸道感染可能性。Step 3: 规则对齐与安全检查 (Alignment & Safety): 患者症状（高热、痘疹密布、咽痛、多发淋巴结肿痛）完美匹配指南Condition，无Contraindication，因此指南Action可直接应用。Step 4: 决策生成 (Decision Making): 根据指南推荐处方清营汤、升麻鳖甲汤、宣白承气汤；同时，支持急诊现有行动（隔离、猴痘PCR及HIV/梅毒筛查），建议住院隔离观察，并给予对症支持治疗（如补液和退热），以安全排除其他急症并控制病情。",
    "medical_order": "诊断：急性发热伴皮疹，疑似猴痘病毒感染。行动：1. 继续单间隔离，一级护理；2. 完善猴痘病毒PCR检测、HIV抗体筛查、梅毒血清学检测；3. 对症支持治疗：静脉补液1000 mL/日，监测生命体征q4h；退热予对乙酰氨基酚650 mg口服q6h PRN（避免布洛芬）；4. 处方中药：清营汤、升麻鳖甲汤、宣白承气汤各一剂，每日两次口服；5. 建议住院观察，等待检测结果及评估病情进展。",
    "patient_dialogue": "您好，您现在的症状——高烧、身上起了很多疹子、喉咙痛得像刀割，还有淋巴结肿大——结合您之前的接触史，我们高度怀疑可能是猴痘感染。为了确诊，我们已经安排了专门的检测。因为猴痘传染性比较强，我们建议您住院隔离观察几天。这样既能保护您自己，防止病情加重，也能避免传染给其他人。住院期间，我们会给您输液补充水分，用退烧药帮您降温，还会开一些中药辅助治疗，帮助缓解不适。别太担心，我们会全程监测您的状况。如果检测结果出来了，我们会第一时间告诉您。您现在有什么其他不舒服的吗？"
  },
  {
    "id": 794,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "患者3天前无明显诱因出现38.6 ℃发热伴畏寒，自测抗原阴性。昨日颜面部突发单颗2 cm脐凹样水疱，今晨发现双手背、足底共12颗类似皮损，伴明显灼痛（NRS 7/10），夜间因衣物摩擦痛醒。追问病史：发病前10天有男男性行为史，伴侣近期出现“带状疱疹样”皮疹。查体：T 38.2 ℃，P 92 次/分，BP 118/76 mmHg；皮疹呈不同演化阶段，基底红晕，质硬，部分中央见脐凹；颌下可触及1枚1.5 cm淋巴结，活动可，触痛(+)。咽部轻度充血，无扁桃体渗出。患者诉“疼得连手绘板笔都握不稳”，并担心脸上留疤影响工作。既往体健，无慢性病史，否认药物过敏。实验室：血常规WBC 6.8×10⁹/L，PLT 220×10⁹/L；HIV抗体待回。患者自述因赶稿已连熬两通宵，咖啡+能量饮料日均6杯。",
    "reference_rule": {
      "condition": "皮疹部位疼痛严重",
      "action": "予镇痛药物",
      "contraindication": "避免搔抓皮疹部位皮肤",
      "evidence": "皮疹部位疼痛严重时可予镇痛药物。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规诊断与治疗场景，作为急诊/门诊医生，关注重点是快速建立鉴别诊断（如排除水痘、单纯疱疹、梅毒或HIV相关皮疹等危急重症），优先处理急性症状（如疼痛），并给出直接治疗指令。\n\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：急性发热（38.6℃）伴畏寒提示感染；脐凹样水疱皮疹（颜面、手足分布，多阶段演化）伴严重灼痛（NRS 7/10）和夜间痛醒，高度提示疱疹类病毒感染（如水痘或单纯疱疹）；颌下淋巴结肿大触痛(+)支持急性炎症；男男性行为史及伴侣“带状疱疹样”皮疹史为隐式STI风险因素（需警惕HIV或梅毒）；熬夜、高咖啡因摄入（日均6杯）暗示免疫力低下可能；HIV抗体待回结果需紧急关注；疼痛影响功能（握笔不稳）和留疤担忧反映患者焦虑。转化为医学术语：疑似水痘或单纯疱疹病毒感染，STI高风险，急性疼痛综合征。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition为‘皮疹部位疼痛严重’，患者NRS 7/10灼痛符合条件；action是‘予镇痛药物’。强制检查contraindication‘避免搔抓皮疹部位皮肤’：患者未报告搔抓，但疼痛和焦虑增加风险，需在决策中强调禁止搔抓以防继发感染或留疤。\n\nStep 4: 决策生成 (Decision Making) - 基于指南action，立即予镇痛药物缓解疼痛；结合临床解码，补充抗病毒治疗（针对疱疹病毒感染）、休息建议（纠正免疫力低下），并优先排除HIV等STI风险。决策以安全优先：镇痛和抗病毒为一线，避免任何搔抓行为。",
    "medical_order": "1. 予镇痛药物：对乙酰氨基酚 1000mg PO q8h PRN（疼痛NRS≥4时）。\n2. 起始抗病毒治疗：阿昔洛韦 800mg PO 5次/日，疗程7天。\n3. 建议卧床休息，避免搔抓皮疹部位皮肤，防止继发感染。\n4. 完善HIV抗体复检及水痘-带状疱疹病毒PCR检测；监测体温和皮疹变化q4h。\n5. 健康教育：限制咖啡因摄入（<2杯/日），保证充足睡眠。",
    "patient_dialogue": "您好，看到您脸上的皮疹和发烧，还有这么剧烈的疼痛，我能理解这有多难受，连笔都握不稳，晚上还疼醒。别担心，我们会先给您开止痛药，帮您缓解疼痛。这些皮疹看起来像是一种病毒感染，可能是水痘或疱疹，所以还要给您开抗病毒药，能防止它扩散和加重。记住，千万别去抓那些水疱，抓破了容易感染，还可能留疤，我知道您担心工作，咱们一起避免这个。另外，您最近熬夜太多了，咖啡和能量饮料也喝得多，这会让身体更累、更难恢复。一定要好好休息，少喝点咖啡，这样病才好得快。我还会安排再做些检查，包括HIV的复检，确保没有其他问题。咱们一步一步来，您会好起来的。"
  },
  {
    "id": 777,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "患者29岁，男，自由插画师，昨日自印尼雅加达返沪。今晨突发高热39.4℃，伴寒战、剧烈头痛，自服对乙酰氨基酚无缓解。午后发现面部、双手背散在10余颗直径0.5-1.2 cm的脐凹样丘疹，中央结痂，触痛明显；右侧颌下淋巴结肿大如鸽蛋、质韧、活动差。患者否认药物过敏，近期无保护性性行为，接种史不详。查体：HR 112次/分，BP 118/76 mmHg，SpO₂ 97%（RA），咽部轻度充血，扁桃体无渗出。患者主诉“画画熬夜多，常点外卖”，并反复询问“是不是海鲜过敏？”。急诊候诊区空调故障，室温30℃，患者仍自觉发冷。",
    "reference_rule": {
      "condition": "发现符合病例定义的疑似病例",
      "action": "1. 立即隔离治疗；2. 院内专家会诊或主诊医师会诊；3. 2小时内网络直报；4. 采集标本进行核酸检测；5. 安全转运至定点医院",
      "contraindication": null,
      "evidence": "各级各类医疗机构的医务人员发现符合病例定义的疑似病例后，应当立即进行隔离治疗，院内专家会诊或主诊医师会诊，仍考虑疑似病例，在2小时内进行网络直报，并采集标本进行新型冠状病毒核酸检测，同时在确保转运安全前提下立即将疑似患者转运至定点医院。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规急诊诊疗场景，作为急诊医生，我的关注重点是快速建立鉴别诊断，排除猴痘、登革热或COVID-19等危急传染病，并给出直接指令以确保患者安全和公共卫生。Step 2: 临床解码 (Clinical Decoding): 患者急性起病，表现为高热（39.4℃）、寒战、剧烈头痛及心动过速（HR 112次/分），提示全身性感染；特征性脐凹样丘疹（直径0.5-1.2 cm，中央结痂，触痛明显）伴右侧颌下淋巴结肿大（质韧、活动差），高度怀疑痘病毒感染（如猴痘），旅行史（印尼返回）增加热带病风险；咽部轻度充血为潜在呼吸道症状，但SpO₂正常排除急性呼吸窘迫；自服退热药无效、自觉发冷（尽管环境温度高）支持感染严重性；患者‘常点外卖、熬夜’提示免疫状态可能低下，但皮疹特征不符海鲜过敏（无过敏史）。Step 3: 规则对齐与安全检查 (Alignment & Safety): 患者症状（发热、咽部充血）结合旅行史（印尼为COVID-19流行区），符合指南中‘新型冠状病毒疑似病例’定义；未见禁忌症（Contraindication null），安全风险低。Step 4: 决策生成 (Decision Making): 严格遵循指南Action，立即执行隔离、会诊、直报、核酸检测和转运，同时需完善其他感染筛查以排除猴痘等共病。",
    "medical_order": "立即隔离患者于负压病房，予一级护理。请感染科急会诊。2小时内完成传染病网络直报（报告新型冠状病毒疑似病例）。采集鼻咽拭子行新型冠状病毒核酸检测。安排负压救护车安全转运至定点传染病医院。完善血常规、C反应蛋白、肝肾功能、登革热NS1抗原及PCR、猴痘PCR检测。监测生命体征每小时一次。",
    "patient_dialogue": "先生，您刚从印尼回来就出现高烧、头痛和这些特殊皮疹，情况比较紧急。我们现在需要马上把您转移到隔离房间，这是为了防止万一有传染病影响到其他人。我们会做一些检查，包括新冠病毒检测，因为旅行后发热很常见；同时，皮疹和淋巴结肿大提示可能是其他感染，比如猴痘。别担心，我们会请专家来会诊，并安排您转到专门医院处理，那里有更好的设备。这不是海鲜过敏——皮疹的样子更像是感染引起的。您先休息，我们会全程陪护，确保安全转运。"
  },
  {
    "id": 784,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "患者昨日出现38.9℃畏寒发热，伴明显乏力，今日上午发现面部及双手背散在2-3mm浅表水疱，中央脐凹，周围红晕。追问病史：10天前曾与一位“皮疹伴发热”的匿名伴侣发生无保护性行为；既往体健，未接种天花疫苗。查体：T 38.7℃，HR 96次/分，BP 118/72 mmHg，SpO₂ 98%；皮疹分布以面部、手掌为主，共约12处，触痛明显；口咽轻度充血，颈部可触及2枚1 cm可移动淋巴结，轻压痛。患者自述“最怕退烧药伤肝”，同时担心“出汗太多会虚脱”。实验室：血常规WBC 5.8×10⁹/L，L 42%；肝肾功能、电解质正常。初步猴痘核酸已采样送CDC，结果待回。诊室空调因昨日暴雨故障，室温偏高，患者额部可见细密汗珠。",
    "reference_rule": {
      "condition": "猴痘患者出现发热",
      "action": "1. 体温≤38.5℃时物理降温；2. 体温>38.5℃时予解热镇痛药退热（需防止大量出汗引发虚脱）",
      "contraindication": "避免大量出汗引发虚脱",
      "evidence": "体温高者，物理降温为主，超过38.5℃，予解热镇痛药退热，但要注意防止大量出汗引发虚脱。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于常规急诊诊疗场景。关注重点：快速建立鉴别诊断（Differential Diagnosis），排除如麻疹、水痘或疱疹等其他危急重症，并基于指南给出直接的治疗指令。患者表现急性发热和皮疹，高度疑似猴痘，需优先处理症状并确保安全。Step 2: 临床解码 (Clinical Decoding): 患者体温38.7℃（>38.5℃），伴畏寒、乏力和心动过速（HR 96次/分）；皮疹特征为面部及手掌散在2-3mm水疱，中央脐凹、周围红晕，触痛明显，符合猴痘典型表现；病史包括10天前无保护性行为（伴侣有皮疹发热），未接种天花疫苗，增加猴痘风险；实验室示WBC正常、淋巴细胞升高（42%），提示病毒感染；隐式线索包括诊室高温（空调故障）导致患者出汗，以及患者担忧退烧药肝损伤和出汗虚脱。医学术语：急性病毒性皮疹、发热性感染、淋巴结反应性肿大。Step 3: 规则对齐与安全检查 (Alignment & Safety): 指南条件'猴痘患者出现发热'匹配（患者高度疑似猴痘，体温>38.5℃）。Action要求予解热镇痛药退热。Contraindication强调'避免大量出汗引发虚脱'：患者已出汗（诊室高温加重风险），需优先防虚脱。安全检查通过：选择低风险解热镇痛药（如对乙酰氨基酚），控制剂量和环境温度。Step 4: 决策生成 (Decision Making): 基于指南Action，予解热镇痛药退热；结合Contraindication，补充环境调控和补液；同时，猴痘疑似需隔离和监测。决策：1. 立即予解热镇痛药（如对乙酰氨基酚）。2. 避免虚脱：保持环境凉爽，鼓励口服补液。3. 支持治疗：隔离、监测生命体征。",
    "medical_order": "诊断：猴痘高度疑似。治疗：1. 发热管理：体温38.7℃，予对乙酰氨基酚500mg口服，每6小时一次，监测体温及出汗情况。2. 虚脱预防：保持诊疗环境温度适宜（<25℃），鼓励口服补液盐溶液。3. 隔离措施：立即实施接触隔离，单间安置。4. 监测：一级护理，每小时监测生命体征（体温、心率、血压）、皮疹变化及脱水征象（如尿量）。5. 实验室：等待CDC猴痘核酸结果；若恶化，复查血常规及电解质。",
    "patient_dialogue": "张先生，您现在发烧到38.7℃，确实很不舒服，加上这些水疱，肯定让您担心。我会给您开一种安全的退烧药，叫对乙酰氨基酚，帮您把体温降下来。我知道您怕吃药伤肝，但别担心，这个药我们用了很多年，在正常剂量下很安全，我会控制好量，不会让肝脏负担太重。另外，我看到您出了不少汗，诊室今天有点热，这可能会让您感觉更虚弱，甚至虚脱——就是浑身没力气、头晕那种感觉。所以，咱们先移到凉快点的地方，您多喝点水或含电解质的饮料，比如运动饮料，补充水分，这样出汗就不会太厉害。至于这些水疱，根据您的描述和接触史，我们怀疑可能是猴痘，已经取样送检了，结果出来前需要您暂时隔离，这是为了防止传染给家人或别人，保护大家的安全。别太紧张，我们会一直观察您的情况，确保您没事。"
  },
  {
    "id": 796,
    "file_name": "猴痘诊疗指南（2022年版）.json",
    "case_input": "患者28岁，男，同性性行为史，确诊猴痘第8天。面部、躯干密集脓疱部分破溃结痂。今日凌晨突发持续抽搐>5分钟，随后意识模糊、躁动不安，不能应答。查体：T 39.4℃，HR 128次/分，BP 145/90 mmHg，SpO₂ 94%（储氧面罩10 L/min），颈抵抗阳性，双侧巴氏征可疑阳性。瞳孔3 mm，对光反射迟钝。急诊头颅CT未见出血，但脑沟回变浅，提示脑水肿。血气：PaCO₂ 32 mmHg，乳酸2.4 mmol/L；血钠130 mmol/L；外周血WBC 16×10⁹/L，CRP 142 mg/L。既往无慢病，未接种天花疫苗。陪护家属补充：抽搐后患者剧烈干呕，口腔分泌物明显增多，呼吸音粗伴鼾鸣。天气闷热，急诊通道空调故障，室温30℃。",
    "reference_rule": {
      "condition": "出现脑炎",
      "action": "1. 给予镇静剂；2. 脱水降颅压；3. 保护气道",
      "contraindication": null,
      "evidence": "出现脑炎时给予镇静、脱水降颅压、保护气道等治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，作为专科专家，我的关注重点是全网扫描潜在风险，包括药物相互作用、禁忌症及共病因素，优先确保治疗安全（安全 > 疗效）。患者猴痘感染合并急性脑炎征象，需综合评估多重生理紊乱和环境因素。\n\nStep 2: 临床解码 (Clinical Decoding): 患者猴痘确诊第8天，出现抽搐、意识模糊、颈抵抗及巴氏征可疑阳性，结合CT提示脑沟回变浅（脑水肿）和炎症指标升高（WBC 16×10⁹/L, CRP 142 mg/L），诊断为猴痘相关性脑炎。隐式线索包括低钠血症（血钠130 mmol/L）易加剧脑水肿，高热（T 39.4°C）和呼吸窘迫（SpO₂ 94% on oxygen, 口腔分泌物增多伴鼾鸣）提示气道风险；环境高温（室温30°C）可能加重脱水和热应激。血气和乳酸值（PaCO₂ 32 mmHg, 乳酸2.4 mmol/L）显示轻度呼吸性碱中毒和酸中毒，支持系统炎症状态。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 指南条件 '出现脑炎' 匹配患者临床表现。Action '给予镇静剂；脱水降颅压；保护气道' 适用。Contraindication 为 null，但需全网扫描风险：镇静剂（如苯二氮䓬类）可能加重呼吸抑制（SpO₂ 94% 且呼吸音粗）；脱水剂（如甘露醇）在低血钠时需谨慎以防电解质恶化；保护气道紧急，因分泌物增多有误吸风险。环境高温可能影响体温控制，但无直接药物相互作用（猴痘无特定抗病毒）。安全优先级：气道保护为首要，避免镇静导致呼吸衰竭。\n\nStep 4: 决策生成 (Decision Making): 基于指南 Action，决策核心为：1. 镇静剂控制抽搐和躁动；2. 脱水降颅压减轻脑水肿；3. 保护气道预防并发症。附加支持措施：纠正低钠、降温及监测，确保安全。具体选药以最小风险为原则（如劳拉西泮镇静，甘露醇脱水），并安排紧急评估。",
    "medical_order": "1. 立即予苯二氮䓬类镇静剂（劳拉西泮 2mg 静脉推注）控制抽搐及躁动。2. 脱水降颅压：20%甘露醇 125ml 静脉滴注，30分钟内输完，监测尿量及电解质。3. 保护气道：评估后若喉部分泌物潴留，予气管插管机械通气，备吸痰设备。4. 支持治疗：物理降温（冰袋、风扇），纠正低钠血症（3%氯化钠 100ml 缓慢静脉滴注，目标血钠上升<0.5 mmol/L/h），持续心电监护及 SpO₂ 监测。5. 完善检查：急查血钠、肾功能、动脉血气 q2h，行腰椎穿刺及脑脊液检查排除其他感染。6. 隔离措施：继续猴痘标准防护。",
    "patient_dialogue": "家属您好，您儿子现在情况很紧急，因为病毒感染引起了脑部发炎，导致他抽搐、意识不清，还有呼吸不畅。我们要马上做三件事：第一，给他打针让他安静下来，防止再抽筋伤到自己；第二，用药减轻脑部的水肿，就像给肿胀的地方消肿一样，避免压力太大造成更大伤害；第三，最重要的是保护他的呼吸，我们会清理痰液，如果需要就插管帮助他呼吸，防止窒息。另外，他体温太高了，我们会用冰袋和风扇快速降温；血钠太低，我们会慢慢补盐，不能太快以免出问题。我们会全程盯着监护仪，确保安全。请放心，我们全力以赴。"
  }
]