[
  {
    "id": 789,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "傍晚的地铁车厢里，你（急诊住院总）刚下班，突然接到感控科电话：下午送来的猴痘确诊患者回忆，曾在站台上与一名年轻人发生剧烈碰撞，双方都有皮肤擦伤。疾控人员已调取监控，确认该年轻人右手背有一道2 cm新鲜擦伤，且徒手帮患者捡起掉落的手机。监控显示，患者当时面部、手掌多处痘疹渗液。你立即根据登记信息联系到这位年轻人——他正独自在附近24小时营业的咖啡馆赶稿，尚未出现任何症状。电话那头，他声音发紧：'医生，我只是蹭破点皮，需要做什么吗？'",
    "reference_rule": {
      "condition": "意外接触到猴痘感染者",
      "action": "应用肥皂水洗手或使用含乙醇的洗手液洗手",
      "contraindication": null,
      "evidence": "如意外接触到感染者，应用肥皂水洗手或使用含乙醇的洗手液洗手。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于行政与伦理场景，核心关注点包括公共卫生责任（防止猴痘社区传播）、流程合规性（执行传染病上报及密接者管理）及伦理告知（保障患者知情权与隐私）。Step 2: 临床解码 (Clinical Decoding)：暴露事件为高风险（新鲜皮肤破损+直接接触感染者渗液），暴露后<24小时无症状（潜伏期通常5-21天），患者处公共场所（传播隐患）；需转化为医学术语：'皮肤屏障完整性破坏导致血源性/接触性暴露'。Step 3: 规则对齐与安全检查 (Alignment & Safety)：指南Condition（意外接触感染者）完全匹配，Action（洗手）为基线措施；但Contraindication虽为null，需强制补充行政与伦理要求——未洗手不能排除感染风险，且患者处于公共场所违反隔离原则。Step 4: 决策生成 (Decision Making)：在指南Action基础上，叠加传染病管理规范：立即洗手+强制医学观察+暴露风险评估+伦理告知义务。",
    "medical_order": "1. 即刻处理：予0.05%含氯消毒液冲洗伤口，应用肥皂水彻底洗手15秒。2. 暴露后预防：启动21天医学观察，单间隔离（避选公共场所），每日监测体温及皮肤表现。3. 上报流程：填报传染病密接者报告卡，同步感控科及属地疾控中心。4. 监测方案：若出现发热≥37.3℃或新发皮疹，立即转运至定点医院完善猴痘病毒PCR检测。",
    "patient_dialogue": "您好，我是负责您情况的医生。听得出您有点紧张，这很正常，咱们一步步来。第一，您现在马上去咖啡馆洗手间，用流动水和肥皂认真搓洗双手至少15秒——特别是擦伤的位置，这能大幅降低感染风险。第二，因为病毒有潜伏期，您需要立刻回家单独住一个房间，暂时别出门，坚持21天。每天自己量两次体温，看看手上有没有新起疹子。为什么这么做？您手上的破口接触了患者的皮疹液体，病毒可能像‘潜伏的种子’，现在没症状不代表安全，万一发病可能传染给咖啡馆里的人。第三，疾控同事稍后会联系您填个表，全程保密。这期间有任何不舒服，哪怕只是低烧，马上打我这个电话！"
  },
  {
    "id": 809,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "上午10:30，急诊预检分诊台。母亲抱着男童，焦急地指着孩子脸上一颗颗“像水痘但又硬又疼”的丘疹。孩子体温38.9℃，精神稍倦，不停抓挠手掌新冒出的水疱。母亲回忆：3天前出现低热，昨晚发现口腔里也有溃疡；家里一周前收养的草原土拨鼠最近“掉毛、打喷嚏”。护士快速评估：头面、四肢散在2–4 mm脐凹样丘疹，部分已转为清亮水疱，基底红晕；左侧颈后一枚1.5 cm痛性淋巴结。急诊病历记录：呼吸24次/分，SpO₂ 98%，咽部充血，余查体未见异常。母亲补充，孩子幼儿园同班昨天也有两名小朋友因“疑似水痘”请假。医生正欲开单补液，母亲突然问：“他这样还能回家吗？我明天要出差。”",
    "reference_rule": {
      "condition": "确诊的猴痘患儿",
      "action": "立即隔离，至皮疹结痂消退",
      "contraindication": null,
      "evidence": "确诊的猴痘患儿应立即隔离，至皮疹结痂消退。"
    },
    "thought": "本案例属于常规急诊诊疗场景，作为急诊医生，我的关注重点是快速建立鉴别诊断、排除危急重症并给出直接干预指令。临床解码：患儿表现为发热（38.9℃）、脐凹样丘疹伴水疱（离心性分布）、口腔溃疡、手掌水疱及痛性淋巴结肿大，结合接触草原土拨鼠（猴痘病毒潜在宿主）和幼儿园聚集性病例（2例疑似水痘），高度提示猴痘病毒感染；需鉴别水痘（向心性皮疹）、手足口病（无淋巴结肿大）等。规则对齐与安全检查：指南明确要求'确诊猴痘患儿立即隔离'，本例虽待实验室确诊（需PCR检测），但典型临床表现+流行病学史已满足隔离指征，无禁忌症。决策生成：立即启动隔离流程，完善病原学检测，同步处理症状并上报公共卫生系统。",
    "medical_order": "1. 立即转入负压隔离病房，予接触隔离+飞沫隔离措施（医护穿戴N95口罩、护目镜及隔离衣）\n2. 完善猴痘病毒PCR检测（采集皮损疱液及咽拭子），同步送检水痘-带状疱疹病毒PCR\n3. 对症处理：布洛芬 10mg/kg 口服 q8h 退热镇痛，炉甘石洗剂外用 bid 止痒\n4. 一级护理：监测体温 q4h，观察皮疹进展及神经系统症状\n5. 报传染病卡，通知疾控中心追踪密接者（家庭及幼儿园）\n6. 禁止离院，直至皮疹完全结痂脱落（预计2-4周）",
    "patient_dialogue": "妈妈您先别急，孩子的情况我们非常重视。现在高度怀疑是猴痘，这是一种传染性较强的病毒感染，和你们家收养的土拨鼠可能有关。最关键是必须马上隔离——孩子今天起要单独住隔离病房，绝对不能回家。因为这种病通过接触和飞沫传播，回家会传染给家人，幼儿园的小朋友也可能中招。隔离需要等到所有皮疹结痂脱落，大概几周时间，期间我们会用退烧药缓解发热，药水止痒防止抓破皮肤。您明天出差的话，请安排其他家人来陪护。我们已联系疾控中心，他们会帮幼儿园做排查。孩子现在生命体征平稳，您别太担心，但隔离是保护大家的关键一步。"
  },
  {
    "id": 806,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者昨夜自尼日利亚拉各斯返沪，今日凌晨出现38.7°C发热伴寒战，晨起发现面部与双手散在5-7枚2-3cm椭圆形丘疹，中央凹陷、边缘红晕，无明显痒痛。患者回忆三天前在拉各斯机场协助搬运一只出现抽搐的野生松鼠，未戴手套，右手背有陈旧抓痕。航班同事2人近一周出现‘类似水痘’皮疹已在外院就诊。查体：T38.5°C，HR96次/分，BP118/76mmHg，咽后壁轻度充血，腹股沟可触及两枚1cm可移动淋巴结，质韧压痛；皮疹压之不退，未见脐凹脓疱。患者自述无慢性病史，近期无性行为，疫苗接种史仅新冠三针。辅助检查：血常规WBC6.8×10⁹/L，PLT140×10⁹/L，CRP18mg/L，尿常规正常。患者目前焦虑，反复询问是否可回宿舍取生活用品，并强调‘后天还有排班’。",
    "reference_rule": {
      "condition": "疑似接触猴痘病例或动物",
      "action": "进行隔离医学观察",
      "contraindication": null,
      "evidence": "如疑似接触猴痘病例或动物，应进行隔离医学观察。"
    },
    "thought": "Step 1: 场景定义 - 本案例属于常规急诊诊疗场景，作为急诊医生需快速建立鉴别诊断，排除危急重症并立即行动。重点关注发热+皮疹+流行病学暴露的三联征。Step 2: 临床解码 - ①尼日利亚拉各斯（猴痘流行区）接触抽搐松鼠+未防护（暴露途径）②急性发热（38.5℃）伴寒战③离心性分布丘疹（中央凹陷/边缘红晕/压之不退）④腹股沟淋巴结肿大⑤同事聚集发病（类似水痘皮疹）⑥血象WBC正常/CRP轻度升高→强烈指向猴痘病毒感染。Step 3: 规则对齐 - 指南condition'接触猴痘动物/病例'完全匹配（松鼠暴露+同事病例），contraindication为空。Step 4: 决策生成 - 必须立即启动呼吸道+接触隔离，阻断社区传播链（航班同事发病证明传染性强），同步送检病原学确诊。",
    "medical_order": "1. 立即转入负压隔离病房，执行接触+飞沫防护措施（N95口罩/隔离衣/护目镜）\n2. 予物理降温+补液支持治疗（NS 500ml ivgtt st）\n3. 完善猴痘病毒PCR检测（采集皮疹疱液及咽拭子标本，送CDC实验室）\n4. 急查肝肾功能、凝血四项、HIV/梅毒筛查\n5. 每4小时监测体温及皮疹变化，记录新发皮损数量\n6. 立即报告辖区疾控中心启动密接追踪（航班号：HU7961）",
    "patient_dialogue": "王先生，您先坐下听我说：您现在的情况需要特别重视。您接触的那只松鼠和同事的皮疹都提示可能感染了猴痘病毒——这种病传染性很强，需要马上隔离治疗。我知道您担心工作生活用品，但您现在就像个'移动传染源'，回宿舍可能把病毒传给整栋楼的人。我们已经联系后勤科，他们会把您需要的物品消毒后送来。这两天您就在这个单间观察，我们每4小时检查体温和疹子变化。别太焦虑，多数年轻人预后良好，关键是不能让病毒扩散。后天排班您肯定参加不了，但公司那边疾控中心会统一协调。"
  },
  {
    "id": 802,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者今晨因“发热38.7℃伴头痛、乏力3天”首次来急诊。查体见面部、双手背散在10余颗2-4 mm脐凹状水疱，基底红润，部分顶部见灰白色脓液；右侧下颌可触及1枚2 cm质韧淋巴结，压痛(+)。患者回忆一周前参加地下纹身展，曾为外籍模特绘制身体彩绘并共用调色盘。实验室：WBC 5.8×10⁹/L，PLT 140×10⁹/L，ALT 38 U/L；急诊科已按VHF流程采血送CDC行MPXV-PCR，结果待回。患者轻度焦虑，反复询问“能不能先回家拿电脑”，并抱怨候诊区空调过冷导致肌肉酸痛加重。",
    "reference_rule": {
      "condition": "确诊病例和疑似病例",
      "action": "在专业防疫人员陪同下前往指定专业传染病治疗机构进行隔离观察和治疗",
      "contraindication": null,
      "evidence": "我国《猴痘防控方案》指出，所有确诊病例和疑似病例均应在专业防疫人员陪同下前往指定专业传染病治疗机构进行隔离观察和治疗。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规急诊诊疗场景，作为急诊医生，我需要快速建立鉴别诊断（重点排除猴痘等传染性重症），给出直接处置指令以避免延误治疗和传播风险。\n\nStep 2: 临床解码 (Clinical Decoding)：患者发热、头痛、乏力提示急性感染；脐凹状水疱（特征性猴痘皮损）伴基底红润和灰白色脓液（可能继发细菌感染），右侧下颌淋巴结肿大压痛（淋巴系统受累），结合一周前纹身展暴露史（共用彩绘工具，高风险皮肤接触传播），实验室WBC、PLT、ALT正常但MPXV-PCR结果待回，高度疑似猴痘。隐式线索包括患者焦虑（需心理支持）和环境不适（可缓解）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：病例与指南Condition匹配（疑似病例，基于皮损形态、暴露史和待确认检测），无Contraindication；安全检查确认隔离可防止社区传播，确保公共卫生安全。\n\nStep 4: 决策生成 (Decision Making)：根据指南Action，立即启动隔离转诊流程，由专业防疫人员护送患者至指定机构进行观察和治疗，同时提供对症支持以缓解症状。",
    "medical_order": "予立即隔离，安排专业防疫人员护送至指定传染病治疗机构进行隔离观察和治疗。监测生命体征（体温、血压、心率），对症支持：物理降温（如冰袋）缓解发热，口服补液维持水电解质平衡。完善猴痘相关检查（复查MPXV-PCR，必要时皮肤疱液采样），避免皮肤破损处继发感染。一级护理，记录病情变化。",
    "patient_dialogue": "您好，我理解您现在有点着急，但根据您的情况——发热、头痛，还有手上这些水疱，加上您上周接触过外籍模特，我们高度怀疑这是一种传染性较强的病毒感染，很可能是猴痘。如果不及时隔离，它很容易传染给家人或其他人，后果会很严重。所以，咱们必须立即安排您去专门的传染病医院观察和治疗，那里有专业团队全天候照顾您。我会让防疫人员全程陪着您过去，确保安全。我知道您想回家拿电脑，但现在最要紧的是您的健康，电脑的事可以稍后处理。空调太冷让您肌肉酸痛加重了？我这就让人拿条毯子来，让您暖和点。别担心，我们会帮您度过这关的！"
  },
  {
    "id": 791,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者昨晚发现左腹股沟出现一个直径约1.5 cm的椭圆形丘疹，中央有脐凹，触之稍硬，无明显疼痛。今日晨起时，丘疹周围出现一圈红晕，并伴低热（腋温37.8 ℃）。患者自述近10天内有男男性行为史，伴侣健康状况不详；无长途旅行，但上周六曾去市内一家新开的夜店。患者担心皮疹是“猴痘”，自行网络检索后愈发焦虑，遂请假前来门诊。查体：颜面、躯干、四肢未见类似皮损；双侧耳前、颌下可触及黄豆大小淋巴结，质软、活动、轻压痛；咽部轻度充血。患者进门时佩戴口罩，但仍反复询问：“医生，我这是不是猴痘？我需要隔离吗？”同时提到公司下周有重要项目上线，希望尽快明确诊断以免影响工作。",
    "reference_rule": {
      "condition": "怀疑自身患有猴痘",
      "action": "尽快主动就诊以明确诊断",
      "contraindication": null,
      "evidence": "如怀疑自身患有猴痘，应尽快主动就诊以明确诊断。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于常规诊断与治疗场景，发生在门诊环境，患者以急性皮疹和低热为主诉。我的关注重点是快速建立鉴别诊断（Differential Diagnosis），排除危急重症如猴痘感染或其他严重传染病，并给出直接指令以缓解患者焦虑、确保及时诊断和处理。\n\nStep 2: 临床解码 (Clinical Decoding)：从病例中提取关键信息：左腹股沟出现直径1.5 cm的脐凹丘疹（umbilicated papule），周围红晕提示炎症反应，腋温37.8 ℃表示低热（low-grade fever）；患者有男男性行为史（MSM）和夜店暴露史，增加性传播感染风险；查体发现双侧耳前、颌下淋巴结肿大（lymphadenopathy），质软活动伴轻压痛，咽部轻度充血（pharyngeal congestion）。隐式线索包括脐凹丘疹作为猴痘的典型特征、MSM史作为高危因素、以及淋巴结肿大支持感染性过程。转化为医学术语：急性丘疹性病变伴系统症状（发热和淋巴腺病），危险因素指向猴痘（monkeypox）、疱疹（herpes simplex）或梅毒（syphilis）等鉴别诊断。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南condition为“怀疑自身患有猴痘”，患者情况高度匹配（典型皮疹、低热、高危暴露）。指南action要求“尽快主动就诊以明确诊断”，患者已就诊，因此决策应聚焦诊断确认。Contraindication为null，无禁忌症；但需强制检查公共安全风险（猴痘传染性强），确保隔离建议。\n\nStep 4: 决策生成 (Decision Making)：基于指南action，核心决策是立即安排猴痘特异性检测以明确诊断，同时实施临时隔离；鉴别诊断需排除其他STI和感染性疾病，以安全为首要优先级。",
    "medical_order": "予一级护理，监测体温和皮损变化；完善猴痘病毒PCR检测（皮肤拭子采样）、梅毒血清学检测（RPR/TPPA）及疱疹病毒PCR；血常规、C反应蛋白检查；建议临时单间隔离至检测结果回报；暂予对乙酰氨基酚0.5g口服q6h prn退热；随访24小时病情变化。",
    "patient_dialogue": "先生，我理解您很担心这个疹子，尤其是您提到最近有男男性行为和去夜店的经历，这确实需要咱们小心点。首先，别太紧张——您及时来看诊是对的。这个疹子中央有个小凹坑，加上发烧和淋巴结肿大，我们得先排除猴痘或其他感染。我会给您安排几个简单检查，比如取点皮肤样本化验，结果出来前，您得暂时在家隔离一下，避免接触家人或同事。这是因为猴痘传染性强，万一真是它，您出门可能传给他人。公司项目的事，我会尽量快出结果，您先请病假休息。退烧药我会开给您，感觉不舒服就吃。有啥疑问随时问我，咱们一步步来确认。"
  },
  {
    "id": 803,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者昨晚开始38.4℃发热，伴轻度头痛与腰背酸痛，自述‘像被人打了一顿’。今晨发现右腹股沟出现3颗直径约5mm的脐凹样水疱，周围皮肤微红。近期无外出旅行史，但一周前参加地下纹身聚会，期间与多位陌生人共用毛巾。查体：BP118/76mmHg，HR92次/分，咽后壁轻度充血，颈部未及肿大淋巴结。患者反复询问：‘能不能先给点退烧药？我今晚还要赶稿。’外院快速抗原（流感/新冠）均阴性，血常规WBC6.8×10⁹/L，PLT240×10⁹/L。患者强调自己对布洛芬过敏，曾出现全身荨麻疹。",
    "reference_rule": {
      "condition": "猴痘感染患者出现发热和轻度疼痛",
      "action": "应用对乙酰氨基酚治疗",
      "contraindication": null,
      "evidence": "WHO《猴痘临床管理与感染防控暂行指南》建议针对发热和轻度疼痛可应用对乙酰氨基酚治疗"
    },
    "thought": "**Step 1: 场景定义 (Scenario Definition)**：本案例属于常规急诊诊疗场景（门诊级别），重点关注快速建立鉴别诊断、排除危急重症（如脓毒症或严重感染），并基于患者症状直接给出治疗指令。核心任务是及时缓解症状、确保安全，同时考虑潜在公共卫生风险。\n\n**Step 2: 临床解码 (Clinical Decoding)**：患者表现为急性发热（38.4℃）、头痛和腰背酸痛（描述为'像被人打了一顿'，提示肌痛），伴特征性皮疹（右腹股沟3颗脐凹样水疱，直径5mm，周围微红）。暴露史（一周前地下纹身聚会共用毛巾）暗示高风险接触，可能为猴痘传播途径。查体显示轻度咽充血和心动过速（HR 92次/分），但无淋巴结肿大或休克征象；实验室检查排除流感/新冠（抗原阴性），血常规正常（WBC 6.8×10⁹/L，PLT 240×10⁹/L），支持非细菌性感染。患者对布洛芬过敏史（全身荨麻疹）是关键安全因素，需避免NSAIDs；工作压力（'赶稿'）提示需平衡治疗与休息需求。隐式线索包括：脐凹样水疱高度特异于猴痘（而非带状疱疹），共用毛巾暴露增加感染概率，轻度症状暂未危及生命，但需防传播。\n\n**Step 3: 规则对齐与安全检查 (Alignment & Safety)**：患者符合指南Condition（猴痘感染症状：发热和轻度疼痛），需应用Action（对乙酰氨基酚治疗）。强制检查Contraindication：指南未指定禁忌，且患者无肝病或对乙酰氨基酚过敏史（仅对布洛芬过敏），因此安全。需排除其他禁忌（如严重肝损），但当前无证据。\n\n**Step 4: 决策生成 (Decision Making)**：基于指南，优先给予对乙酰氨基酚缓解症状。同时，鉴于猴痘疑似，需启动隔离和确诊测试，确保公共安全。决策核心：症状管理 + 感染控制。",
    "medical_order": "予对乙酰氨基酚500mg口服，每6小时一次，用于缓解发热和疼痛；建议居家隔离至皮疹结痂脱落（至少21天），避免密切接触；安排猴痘病毒核酸检测（PCR）；监测体温和皮疹变化每日两次；避免使用NSAIDs类药物（如布洛芬），因患者过敏史；若症状恶化（如高热不退或皮疹扩散），立即复诊。",
    "patient_dialogue": "您好，看您发烧又疼得厉害，这应该是病毒引起的反应。我给您开一种叫'对乙酰氨基酚'的药片，它能安全地退烧止痛，不会像布洛芬那样让您过敏。您先吃上，每6小时一次，能帮您舒服点去赶稿。不过，您身上这些水疱很可能是猴痘，这是一种传染病，需要您在家隔离休息至少三周——别担心，大多数人能自愈，但如果不隔离，很容易传给家人或同事。我知道您工作忙，但休息好才能恢复快。我们还得做个专门测试确认一下，我会帮您安排。记住，有任何加重比如烧更高或水疱变多，马上来医院。"
  },
  {
    "id": 800,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "母亲抱着5岁男童走进接种室，说：‘医生，新闻里讲猴痘在国外有儿童感染了，我们想提前打疫苗防一防，能不能今天就把针打了？’孩子正在啃一块巧克力，嘴角沾着碎屑；护士注意到他左上臂有一块新鲜的卡介苗瘢痕，轻微红肿。室外33℃高温，候诊区空调坏了，孩子额角全是汗。母亲补充：‘我们下周要去云南老家住一个月，那边靠近边境，怕有动物传染。’",
    "reference_rule": {
      "condition": "儿童",
      "action": "不建议通过接种疫苗来实现病毒暴露前预防",
      "contraindication": null,
      "evidence": "WHO发布的《猴痘疫苗接种与免疫暂行指南》中指出，尽管与其他人群相比，儿童在患猴痘后更容易出现疾病加重，但目前仍不建议在儿童中通过接种疫苗来实现病毒暴露前预防。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于生活方式与风险干预场景，重点关注识别隐式不良习惯（如不当饮食和暴露风险）、关联长期健康风险（猴痘暴露可能性），并使用共情但坚定的语气提出非药物干预建议。\n\nStep 2: 临床解码 (Clinical Decoding) - 患者为5岁男童，主诉为母亲基于旅行担忧请求猴痘疫苗接种；隐式线索包括：进食巧克力提示潜在口腔卫生问题，左上臂卡介苗瘢痕新鲜伴轻微红肿表明近期疫苗接种后局部炎症反应，高温环境（33℃）及出汗增加脱水或中暑风险；旅行计划至云南边境区域一个月，隐含动物源传染病（如猴痘）暴露风险。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件‘儿童’完全匹配患者年龄，action为‘不建议通过接种疫苗来实现病毒暴露前预防’，contraindication为null无禁忌；安全检查：卡介苗瘢痕红肿属正常局部反应，无直接禁忌，但需监测以防继发感染；环境高温和旅行风险未改变指南核心结论。\n\nStep 4: 决策生成 (Decision Making) - 根据指南action，决策为拒绝接种猴痘疫苗；同时提供非药物干预建议：避免动物接触、加强卫生习惯、管理环境风险（如防暑），并监测卡介苗反应。",
    "medical_order": "拒绝猴痘疫苗接种请求。建议：1. 避免与野生动物接触，尤其在云南边境区域；2. 加强个人卫生，包括勤洗手和口腔清洁；3. 监测左上臂卡介苗瘢痕，如红肿加剧予局部护理；4. 避免高温暴露，确保充足水分摄入以防中暑。",
    "patient_dialogue": "我完全理解您的担心，特别是看到新闻后想去云南旅行还怕孩子出问题。但根据国际专家的建议，咱们现在不能给孩子打猴痘疫苗，因为它主要是给高风险成人用的，小朋友打针的预防效果不明确，反而可能带来不必要的反应。您看孩子胳膊上那个卡介苗的印子还红着，咱们得先照顾好这个，别让他抓挠。下周去云南，咱们这样防着更安全：尽量别让孩子接近野生动物，比如猴子或老鼠；吃东西前后多洗手，特别是他刚才吃巧克力沾了嘴角，注意清洁牙齿；天热时多喝水、在阴凉处休息，别中暑了。这些小事做起来，比打针更能保护好孩子，您觉得呢？"
  },
  {
    "id": 815,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者28岁，G1P0，孕24周，昨日突发38.7℃高热伴寒战，今晨颜面、手掌相继出现2–4 mm浅表透亮水疱，基底红润，部分中央脐凹。追问病史：丈夫两周前从西非归国，出现类似皮疹已确诊猴痘。查体：T 38.5℃，P 104次/分，R 22次/分，BP 106/68 mmHg；面部、躯干、手掌共约60个皮损，颈部淋巴结1.5 cm可触及。产科听诊：胎心基线155次/分，规律。实验室：RT-PCR咽拭子MPXV阳性，血常规WBC 7.8×10⁹/L（N 0.72），PLT 110×10⁹/L，ALT 52 U/L，Cr 0.7 mg/dL，尿蛋白（±）。超声：胎儿双顶径61 mm，羊水指数14 cm，未见明显结构异常，胎盘前壁Gr I。患者焦虑，反复询问药物是否影响胎儿。今日上午10:30，区疾控中心已电话通知医院准备负压转运。",
    "reference_rule": {
      "condition": "确诊患有猴痘的妊娠患者",
      "action": "在防疫人员陪同下前往指定专业传染病治疗机构进行隔离观察和治疗；同时对胎儿的健康状况进行监测",
      "contraindication": null,
      "evidence": "根据我国《猴痘防控方案》，对所有确诊病例和疑似病例均应在专业防疫人员陪同下前往指定专业传染病治疗机构进行隔离观察和治疗。2022年7月 Lancet 发表的《猴痘病毒感染孕妇指南》建议，由于病毒可以穿过胎盘，导致胎儿宫内暴露和婴儿先天性感染，所以需要对胎儿的健康状况进行监测。"
    },
    "thought": "本案例属于复杂合并症治疗场景。作为专科专家，我将全网扫描药物相互作用、禁忌症及共病风险，优先确保安全（如胎儿保护和母体并发症）。临床解码：患者为28岁初产妇（G1P0），孕24周，确诊猴痘（RT-PCR阳性），表现为高热（T 38.5℃）、皮疹（60个浅表透亮水疱伴脐凹）、淋巴结肿大及轻度实验室异常（PLT 110×10⁹/L提示血小板减少，ALT 52 U/L提示轻度肝损伤，尿蛋白±可能为妊娠相关）。关键隐式线索包括妊娠状态增加胎儿感染风险（病毒可经胎盘传播），暴露史（丈夫确诊猴痘），及焦虑情绪。规则对齐与安全检查：病例完全匹配指南条件（确诊猴痘妊娠患者），无禁忌症（contraindication null）。但需全网扫描：猴痘治疗药物（如tecovirimat）在妊娠期安全性数据有限，可能引发药物-胎儿相互作用风险；共病包括血小板减少和肝酶升高，需警惕进展为严重感染或妊娠并发症（如早产）。决策生成：依据指南action，核心决策为立即隔离转运并监测胎儿健康，确保安全优先。",
    "medical_order": "予立即负压转运至指定传染病治疗机构隔离观察；予一级护理，监测生命体征（体温、脉搏、呼吸、血压）每4小时；完善胎儿健康监测（胎心听诊每日两次，超声每周评估生长及羊水）；完善肝功能、血小板及尿蛋白动态监测；必要时请感染科、产科会诊评估抗病毒治疗（如tecovirimat）指征，优先评估药物对胎儿安全性；避免非必要药物干预。",
    "patient_dialogue": "亲爱的，您的情况我们已经清楚了：您怀有宝宝24周，同时感染了猴痘病毒，这会让您发烧和起疹子。别太担心，您现在最需要的是去专门的传染病医院隔离治疗——这不是惩罚，而是为了保护您和周围的人，包括医护人员，因为病毒容易传染。疾控中心会安排负压救护车带您过去，很安全。同时，我们会密切关注宝宝的健康，比如每天听胎心、定期做B超检查，因为病毒有时会影响胎儿发育，我们必须确保宝宝一切正常。关于药物，我们非常理解您的焦虑，但请放心：任何用药前，我们都会先评估它会不会伤到宝宝，只用最安全的选项。现在，您要做的就是放松心情，配合转运，我们会全程陪您一起应对。"
  },
  {
    "id": 808,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者3天前出现38.7 °C发热、剧烈头痛，伴全身乏力。自昨日面颈、双手背突发离心性皮疹，初为斑疹，迅速演变为2–5 mm透明水疱，个别中央凹陷呈脐凹，触痛明显。查体见皮疹共约40颗，集中于面部、手掌及足底，部分融合成大片糜烂面；口腔软腭可见2枚浅溃疡。患者自述“像被玻璃碴子反复刮”，夜间因疼痛无法入睡，已连熬两晚改画稿。既往体健，无药物过敏。近期无境外旅行，但10天前参加本市“独立漫画展”，曾与多名外籍人士握手、共用水杯。今日步行来院时因足底水疱疼痛呈跛行。实验室：RT-PCR 检出猴痘病毒DNA阳性；血常规WBC 6.8×10⁹/L，PLT 140×10⁹/L；肝肾功能正常。患者焦虑反复询问：“能不能先给我点止痛的？我实在忍不了了。”",
    "reference_rule": {
      "condition": "猴痘感染患者疼痛难以耐受",
      "action": "使用曲马多或阿片类药物",
      "contraindication": null,
      "evidence": "如疼痛难以耐受，可使用曲马多或阿片类药物"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规急诊诊疗场景，重点关注快速建立鉴别诊断、排除危急重症（如脑膜炎或败血症），并给出直接的治疗指令以缓解急性症状。Step 2: 临床解码 (Clinical Decoding) - 患者表现为急性猴痘病毒感染（RT-PCR阳性），关键特征包括：发热（38.7°C）、剧烈头痛（可能为神经性疼痛）、离心性皮疹（演变为2–5 mm透明水疱伴脐凹特征，分布于面颈、手足，部分融合糜烂）、口腔软腭溃疡；疼痛程度严重（影响睡眠，VAS评分估计≥8），无系统并发症（血常规WBC 6.8×10⁹/L、PLT 140×10⁹/L正常，肝肾功能正常）；近期暴露史（参加漫画展接触外籍人士，提示社区传播风险）。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南Condition为‘猴痘感染患者疼痛难以耐受’，与患者自述‘像被玻璃碴子反复刮’及睡眠障碍高度匹配；Contraindication为null，且患者无药物过敏史、肝肾功能正常，故使用曲马多或阿片类药物安全无禁忌。Step 4: 决策生成 (Decision Making) - 依据指南Action‘使用曲马多或阿片类药物’，决策为优先开具曲马多口服止痛，同时结合猴痘支持性治疗（隔离、皮肤护理）。",
    "medical_order": "1. 予曲马多50mg口服，每6小时一次，用于疼痛缓解。2. 实施严格隔离措施，单间隔离，避免接触传播。3. 皮肤护理：水疱区域予无菌敷料覆盖，避免搔抓，每日清洁消毒。4. 监测体温、疼痛程度及皮疹进展，每4小时记录。5. 建议卧床休息，充足水分摄入；完善密切接触者追踪及公共卫生报告。",
    "patient_dialogue": "您好，我完全明白您现在的痛苦。那种‘玻璃碴子刮’的感觉确实太折磨人了，尤其是晚上疼得睡不着觉。别担心，我们会马上给您开一种止痛药，叫曲马多，它能有效减轻这种剧痛，让您能好好休息。同时，因为这个病毒会传染给其他人，我们必须让您单独隔离一段时间——这就像给病毒上把锁，防止它传给家人或朋友。另外，千万别用手抓那些水疱，保持皮肤干净干燥，这样伤口才能更快愈合。您要尽量躺在床上休息，多喝点温水，这对恢复很重要。放心，我们会一步步帮您度过难关的。"
  },
  {
    "id": 816,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "孕妇因“面部及会阴部进行性丘疹3天”由社区转来。自述无发热，但夜间盗汗明显。查体：面部散在6颗2-3 mm脐凹状丘疹，会阴融合性斑块伴浅溃疡；无咽峡炎、无淋巴结肿痛。既往体健，本次自然受孕，NT、无创DNA均低危，OGTT 1 h 9.1 mmol/L。近期无外出史，但丈夫两周前随货轮归国，自述“被蚊虫咬后长疹”，已自愈。社区医院猴痘病毒PCR（咽拭子+皮损拭子）回报阳性，已网络直报。实验室：WBC 7.8×10⁹/L，血小板 210×10⁹/L，ALT 22 U/L，Cr 58 μmol/L，尿蛋白（–）。产科彩超：胎儿双顶径61 mm，羊水量正常，胎心监护反应型。患者焦虑追问：“我能打疫苗吗？听说打一针就能不传染给宝宝。” 同时抱怨近一周因怕传染已请假停薪，家中房贷压力大。",
    "reference_rule": {
      "condition": "孕妇",
      "action": "不建议通过接种疫苗来实现病毒暴露前预防",
      "contraindication": null,
      "evidence": "WHO发布的《猴痘疫苗接种与免疫暂行指南》中指出，尽管与其他人群相比，孕妇在患猴痘后更容易出现疾病加重，但目前仍不建议在孕妇中通过接种疫苗来实现病毒暴露前预防。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于复杂合并症治疗场景，患者为孕妇合并猴痘病毒感染，涉及妊娠与病毒感染的交互风险。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保母婴安全（安全 > 疗效），包括评估感染对妊娠的影响及潜在并发症。\nStep 2: 临床解码 (Clinical Decoding) – 从病例中提取关键信息：患者为妊娠期女性，猴痘病毒PCR阳性（咽拭子+皮损拭子），症状包括面部脐凹状丘疹（典型猴痘皮损）、会阴融合性斑块伴浅溃疡、夜间盗汗（提示系统性炎症），无发热或咽峡炎；实验室检查（WBC 7.8×10⁹/L, 血小板 210×10⁹/L, ALT 22 U/L, Cr 58 μmol/L, 尿蛋白阴性）无急性异常，产科彩超显示胎儿发育正常（双顶径61 mm），但OGTT 1 h 9.1 mmol/L表明糖耐量潜在受损（妊娠糖尿病风险）。丈夫有类似暴露史（蚊虫叮咬后皮疹自愈），可能为传染源。隐式线索：盗汗可能反映病情进展风险，OGTT值需警惕代谢并发症，患者焦虑及经济压力可能影响依从性。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) – 指南condition为孕妇，action明确不建议接种疫苗（病毒暴露前预防），contraindication为null（无绝对禁忌）。强制安全检查：猴痘病毒感染在孕妇中易加重（WHO指南提示），需排除药物相互作用（如对症治疗药物与妊娠兼容），共病风险包括妊娠糖尿病（OGTT值）和潜在母婴传播；优先级安全确认无疫苗使用指征。\nStep 4: 决策生成 (Decision Making) – 基于指南action，决策为禁止疫苗接种；核心方案为隔离管理、对症支持、加强监测，以控制感染、预防并发症及保障妊娠安全。",
    "medical_order": "诊断：猴痘病毒感染（PCR阳性）。予传染病标准防护隔离（单间病房，接触预防）。监测生命体征（每日体温、脉搏、呼吸）及皮损变化（记录丘疹数量、溃疡面积）。避免疫苗接种（依据WHO指南）。对症支持：局部皮损护理（生理盐水清洁，避免继发感染），疼痛管理（必要时予对乙酰氨基酚口服，最大剂量1g q6h）。产科随访：每周胎心监护及彩超，监测OGTT异常（建议低糖饮食，血糖监测）。实验室复查：48小时后复查WBC、CRP，评估感染进展。转诊建议：若出现发热、皮损扩散或胎儿异常，立即升级至感染科及产科MDT会诊。",
    "patient_dialogue": "张女士，我完全理解您的担心——您焦虑宝宝的健康和经济压力，这很正常。首先，关于疫苗的事：现在不建议您打疫苗来预防传染给宝宝，因为怀孕期间接种可能带来未知风险，对您和胎儿都不安全。别担心，我们有其他安全的方法来保护宝宝：您需要暂时住在隔离病房，这样病毒就不会传给家人或宝宝；我们会每天检查您的皮肤和身体情况，确保一切稳定。同时，您丈夫的类似症状可能也是这个病毒，但他已经好了，说明大多数人能康复——您也会好起来的！经济方面，我建议您联系社区或单位申请临时补助；您先安心治疗，等恢复后就能复工。记住，我们团队会全程陪护您和宝宝，有任何不舒服随时告诉我，好吗？"
  },
  {
    "id": 807,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "6岁男童，昨日突发高热39.4 ℃，伴畏寒、乏力。今晨母亲发现其面部、手掌散在8颗直径4 mm珍珠样水疱，疱周红晕，轻触痛；同时右侧耳后一枚1.5 cm质韧淋巴结，压痛明显。追问病史：7天前随父母自驾赴邻省野生动物园，自述‘喂过猴子’，当晚住宿农家乐，同团一名青年游客近日‘出红疹’（未确诊）。既往体健，已按程序接种牛痘（2019年）。查体：咽轻度充血，心肺腹（-），其余皮肤未见皮损。辅助检查：血常规WBC 6.8×10⁹/L，L 42%，PLT 210×10⁹/L；CRP 12 mg/L；快速抗原筛查流感A/B（-）。母亲焦虑，反复询问是否为水痘、能否回幼儿园。",
    "reference_rule": {
      "condition": "疑似感染猴痘的患儿",
      "action": "及时开展流行病学调查，并转运至专业传染病治疗机构进行严格隔离观察、确认和治疗",
      "contraindication": null,
      "evidence": "我国专家在2022年7月发表了《儿童猴痘诊疗和预防专家共识》，建议对于疑似病例需及时开展流行病学调查，并转运至专业传染病治疗机构进行严格隔离观察、确认和治疗"
    },
    "thought": "本案例属于常规急诊诊疗场景，重点关注快速建立鉴别诊断、排除危急重症（如脓毒症或严重病毒性疾病），并提供直接的医疗指令。**Step 1: 场景定义**：作为果断的急诊/门诊医生，需优先排除危及生命的疾病（如猴痘或水痘并发症），并基于线索给出明确行动指令。**Step 2: 临床解码**：病例关键信息：急性高热（39.4°C）、畏寒、乏力，伴特征性珍珠样水疱（面部和手掌分布，直径4mm，疱周红晕，触痛），右侧耳后淋巴结肿大（1.5cm，质韧、压痛）；流行病学史提示高风险暴露（7天前接触猴子，同团游客皮疹未确诊）；实验室检查：淋巴细胞比例升高（L 42%），CRP轻度升高（12 mg/L），流感阴性；这些转化为医学术语为：疑似病毒性皮疹综合征，猴痘感染可能性高（水痘可排除，因水痘皮疹通常全身性、无显著淋巴结肿大，且患儿已接种牛痘）。**Step 3: 规则对齐与安全检查**：病例与指南condition '疑似感染猴痘的患儿' 高度匹配（暴露史+特征皮疹+淋巴结肿大）；contraindication为null，无禁忌；安全优先检查：需防止疾病传播，排除其他感染风险。**Step 4: 决策生成**：基于指南action，决策为立即开展流行病学调查，并将患儿转运至专业传染病机构进行隔离观察、确认诊断（如猴痘检测）和治疗。",
    "medical_order": "予严格隔离措施，避免接触他人。立即启动流行病学调查，追踪野生动物园暴露史及同团游客。安排紧急转运至专业传染病治疗机构。完善猴痘病毒PCR检测及皮肤拭子培养。监测生命体征（体温、皮疹变化）。通知公共卫生部门备案。暂禁返园或公共活动。",
    "patient_dialogue": "您好，我是医生。您孩子的症状——高烧、身上起的水泡，还有之前喂过猴子的经历——让我们高度怀疑是猴痘感染。这是一种传染病，如果不马上隔离，很容易传给家人或其他人，所以我们必须立刻把孩子转到专门的传染病医院。在那里，他会得到安全检查和治疗，医生会做更多测试确认情况。我知道您担心他回幼儿园的事，但现在千万不能回去，得等完全康复才行。别太焦虑，我们会全程照顾好他，确保他没事。您有任何问题，随时问我。"
  },
  {
    "id": 804,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者因‘左前臂一颗红肿痘’来社区门诊。查体：单发、直径1.2 cm、中央脐凹、触痛明显，伴右腋淋巴结1.5 cm肿大；无发热、无皮疹扩散。追问流行病学史：两周前在尼日利亚拉各斯市郊参加户外音乐节，期间同住青旅的多人出现‘疑似水痘’，患者曾共用毛巾与床铺；回国航班全程佩戴N95，入境时无症状未被筛查。既往体健，已完成新冠和常规旅行疫苗接种，无免疫缺陷。患者主动提出：‘听说猴痘疫苗国内也有了，我能不能打一针预防？公司下周有大型团建，我怕传染同事。’今日血常规正常，CRP 6 mg/L，体温36.7 ℃。门诊空调因暴雨故障，候诊区闷热，患者不停擦汗并询问是否需要立刻做猴痘PCR检测。",
    "reference_rule": {
      "condition": "普通人群",
      "action": "不建议进行大规模疫苗接种",
      "contraindication": null,
      "evidence": "由于目前尚无基于大规模样本的猴痘疫苗效果研究，WHO发布的《猴痘疫苗接种与免疫暂行指南》不建议在普通人群中进行大规模疫苗接种。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于行政与伦理场景，涉及公共卫生责任、流程合规性和伦理告知义务。我的关注重点在于确保诊疗流程符合规范（如疫苗接种决策依据指南）、履行公共卫生职责（如防止潜在传染病传播），以及向患者充分解释伦理考量（如疫苗风险和益处），以维护患者权益和公共安全。\n\nStep 2: 临床解码 (Clinical Decoding)：患者临床表现包括左前臂单发痘疹（直径1.2 cm，中央脐凹，触痛明显）和右腋淋巴结肿大（1.5 cm），结合尼日利亚拉各斯旅行史及与‘疑似水痘’病例密切接触（共用毛巾床铺），高度提示猴痘暴露风险；实验室指标显示血常规正常但CRP轻度升高（6 mg/L），提示局部炎症反应；无发热或皮疹扩散，排除急危重症；患者焦虑于传染风险（下周公司团建），环境因素（候诊区闷热）可能加剧其不适。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety)：指南‘condition’为‘普通人群’，患者符合此条件（既往体健、无免疫缺陷、常规疫苗接种完成）；‘action’为‘不建议进行大规模疫苗接种’，强制检查‘contraindication’为null，无禁忌症；安全方面需优先排除感染风险，指南未覆盖诊断部分，故不影响猴痘检测必要性。\n\nStep 4: 决策生成 (Decision Making)：根据指南action，不建议患者接种猴痘疫苗；鉴于临床高度疑似猴痘暴露，应优先完善猴痘PCR检测以确诊，并实施隔离措施以履行公共卫生责任；决策核心是平衡个人请求与公共安全，确保伦理告知。",
    "medical_order": "予猴痘病毒PCR检测（采集皮损拭子）；建议居家隔离至检测结果明确，避免密切接触他人；监测体温及皮疹变化；记录流行病学史及患者诉求；解释疫苗接种不建议依据WHO指南；若结果阳性，转诊至传染病专科。",
    "patient_dialogue": "您好，我看您挺担心的，尤其是下周公司团建的事儿，我完全理解您的顾虑。您手臂上的这个痘痘，加上您最近去过尼日利亚并接触过类似病例，确实让我们怀疑可能是猴痘。为了确认，我们需要做个简单的PCR检测——就像咽拭子一样，从痘痘上取点样，很快就能出结果。至于疫苗，目前研究还不够充分，给普通人打效果不确定，所以暂时不建议接种。更重要的是，为了避免万一传染给同事，您这几天最好待在家里休息，等结果出来再说。这样既保护您自己，也保护大家。别太紧张，我们会尽快安排检测，您觉得这样行吗？"
  },
  {
    "id": 790,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "插画师小庄昨晚收到室友微信——室友在定点医院被确诊为猴痘，目前面部、四肢散在脐凹样水疱，部分已破溃渗液。小庄今早来到社区卫生服务中心发热筛查点，自述‘有点低烧37.5℃，喉咙干’，并焦虑地询问医生：‘我们上周一起吃过火锅，还共用了一台数位板，我现在要不要搬出去住？那些衣服和画稿还能要吗？’他戴着两层一次性口罩，手里拎着一只装满T恤、数位板和手绘板的帆布袋，准备让医生‘帮忙消毒’。护士注意到小庄右手食指根部有一枚2mm×2mm的微小倒刺样破损，无渗血，他解释是‘前天削铅笔划的’。",
    "reference_rule": {
      "condition": "身边有确诊猴痘病例",
      "action": "避免与其发生密切接触，直至确诊病例的皮损结痂脱落，下面形成新的皮肤层；避免共用衣物、生活用品等",
      "contraindication": null,
      "evidence": "如身边有确诊猴痘病例，应避免与其发生密切接触，直至确诊病例的皮损结痂脱落，下面形成新的皮肤层。避免共用衣物、生活用品等。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于行政与伦理场景，重点关注流程合规性（如隔离消毒程序是否符合公共卫生规定）、文书完整性（记录暴露事件和患者咨询内容）、伦理告知（确保患者知情同意并尊重其焦虑情绪）及公共卫生责任（防止猴痘传播，保护社区健康）。Step 2: 临床解码 (Clinical Decoding) – 患者有明确猴痘暴露史（室友确诊，上周共用物品和聚餐），现已出现低热（37.5℃）和咽干症状，提示潜在猴痘感染早期表现；手指微小皮肤破损（2mm×2mm倒刺样创面）增加感染风险；携带物品（T恤、数位板等）可能污染，需评估传播隐患；患者焦虑状态显示对传播和物品处理的担忧。Step 3: 规则对齐与安全检查 (Alignment & Safety) – 指南条件‘身边有确诊猴痘病例’完全匹配，行动建议‘避免密切接触和共用物品，直至皮损结痂脱落’适用；无禁忌症（Contraindication为null），但需强化公共卫生安全（如隔离和消毒）。Step 4: 决策生成 (Decision Making) – 根据指南行动，生成决策：安排隔离以阻断传播；指导物品消毒；鉴于症状和暴露史，进行猴痘检测；提供健康教育，缓解焦虑。",
    "medical_order": "1. 安排单间隔离观察，避免与确诊病例接触。2. 完善猴痘病毒PCR检测及血常规检查。3. 指导对污染物品（衣物、数位板、画稿）进行紫外线或含氯消毒剂处理。4. 记录暴露史并报告辖区疾控中心。5. 监测体温和皮损变化，予对症支持治疗。",
    "patient_dialogue": "小庄，我明白你现在挺担心的，室友确诊猴痘，你自己又有点低烧和喉咙干，这情况确实需要小心处理。别紧张，我们一步步来。首先，建议你暂时搬出去住，避免和室友接触，至少要等他身上的皮疹完全结痂掉光——这是因为猴痘主要通过密切接触传播，隔离能保护你自己和家人。你带来的衣物和画稿，我会教你用消毒水或紫外线灯处理一下，大多数东西都能安全再用，别急着扔掉。另外，你手上那个小伤口要好好清洁，以防感染。我们现在做个简单检查确认一下，没事的，我在这儿帮你把关。"
  },
  {
    "id": 817,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者因“发热38.7 ℃、咽痛、面部及会阴部簇集性水疱伴脐凹”于感染科门诊就诊。查体见面部8枚、会阴部5枚直径0.4–0.8 cm的脓疱，基底红润，部分结痂；双侧腹股沟可触及肿大淋巴结（最大1.5 cm），轻压痛。追问病史：10天前曾参加一场地下派对，自述与多名陌生男性发生无保护性行为，未使用安全套。实验室回报：猴痘病毒PCR阳性。患者目前规律服用多替拉韦/拉米夫定/替诺福韦（DTG/3TC/TDF）已2年，依从性>95%，eGFR 92 mL/min，ALT 28 U/L。患者主动询问：“听说有种新药叫特考韦瑞，能不能让我快点好？我听说它对猴痘特别有效。”",
    "reference_rule": {
      "condition": "HIV感染的猴痘患者考虑使用特考韦瑞",
      "action": "评估与抗反转录病毒治疗的潜在相互作用",
      "contraindication": null,
      "evidence": "①特考韦瑞，评估与抗反转录病毒治疗的潜在相互作用"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于复杂合并症治疗场景。作为专科专家，我将全网扫描药物相互作用、禁忌症及共病风险，优先确保安全（安全 > 疗效），重点关注HIV感染背景下猴痘治疗的药物选择。Step 2: 临床解码 (Clinical Decoding) – 关键信息包括：患者为HIV阳性（规律服用DTG/3TC/TDF，依从性>95%，eGFR和ALT正常），新诊断猴痘病毒感染（PCR阳性），高风险性行为史（无保护性行为，提示潜在免疫抑制和性传播感染风险）；隐式线索包括免疫缺陷状态可能延长猴痘病程（如发热、皮损表现），需警惕机会性感染。Step 3: 规则对齐与安全检查 (Alignment & Safety) – 指南condition 'HIV感染的猴痘患者考虑使用特考韦瑞' 匹配当前病例。Action '评估与抗反转录病毒治疗的潜在相互作用' 要求优先评估特考韦瑞与DTG/3TC/TDF的相互作用（证据为药物代谢可能涉及CYP450酶系统）；contraindication null表示无绝对禁忌，但需强制检查药物相互作用风险（如特考韦瑞可能抑制CYP3A4，影响DTG浓度）。安全优先级确认：患者肝肾功能正常（eGFR 92 mL/min, ALT 28 U/L），无其他共病或过敏史，但HIV免疫抑制增加猴痘并发症风险。Step 4: 决策生成 (Decision Making) – 基于指南action，决策：评估药物相互作用后，如无显著风险，启动特考韦瑞治疗；同时继续HIV抗反转录病毒治疗，以维持免疫状态并防止猴痘恶化。",
    "medical_order": "1. 予特考韦瑞口服治疗（剂量按指南调整）；2. 评估特考韦瑞与多替拉韦/拉米夫定/替诺福韦（DTG/3TC/TDF）的药物相互作用（咨询药师或查阅药物数据库）；3. 继续抗反转录病毒治疗（DTG/3TC/TDF），监测HIV病毒载量；4. 实施隔离措施（防止猴痘传播）；5. 支持性治疗：监测体温、皮损变化及疼痛管理；6. 安排1周后复诊，评估疗效和不良反应。",
    "patient_dialogue": "你好，我理解你想快点好起来，这很自然。关于你提到的特考韦瑞，这是一种专门针对猴痘的新药，确实可以帮助缩短病程，减轻症状。不过，我得先确保它和你现在服用的HIV药物不会互相冲突——这就像检查两辆车会不会在高速上抢道，安全第一。如果没问题，我们可以马上开始用它。同时，请务必继续按时吃你的HIV药，这能保持你的免疫力，让身体更好地对抗猴痘。另外，为了家人和朋友的安全，你需要在家隔离一段时间，避免密切接触。如果发烧或水疱疼得厉害，可以用点止痛药，我会帮你开一些。别担心，我们一步步来，你恢复得会很快的！"
  },
  {
    "id": 810,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "凌晨03:40，隔离产房。产妇孕39+3周，因“发热、颜面脓疱伴会阴部皮疹”于5天前被确认为猴痘确诊病例（PCR阳性）。今日顺产一男婴，Apgar 9/10，体重3120 g。产妇目前体温38.2 ℃，面部及躯干可见约60个2–5 mm脐凹状脓疱，部分结痂；会阴切口周围亦有新发丘疹。血常规：WBC 6.8×10⁹/L，淋巴细胞0.9×10⁹/L，血小板110×10⁹/L；ALT 56 U/L。新生儿娩出后已按猴痘防控要求立即擦浴、包裹隔离，暂未发现皮肤病变。母亲乳头及乳晕区域可见散在结痂，自述哺乳时疼痛明显，但强烈希望“让孩子吃初乳”。家属询问：“孩子要不要抽血？能不能喂母乳？”夜班住院医师需决定下一步监测策略及喂养方式。",
    "reference_rule": {
      "condition": "母亲患有猴痘",
      "action": "对其分娩的新生儿进行密切监测，以识别潜在的先天性或围产期接触或感染；对于是否停止母乳喂养，应在考虑母亲身体状况和疾病严重程度的基础上进行评估",
      "contraindication": null,
      "evidence": "WHO《猴痘临床管理与感染防控暂行指南》提出母亲和婴儿或幼儿之间可能通过密切接触而发生病毒传播，因此建议应该密切监测感染猴痘病毒母亲所生新生儿，以识别潜在的先天性或围产期接触或感染，对于是否停止母乳喂养，应在考虑母亲身体状况和疾病严重程度的基础上进行评估。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及产妇猴痘感染合并分娩后新生儿护理，重点关注母婴传播风险、免疫抑制状态及围产期感染防控。作为专科专家，我的思维重点是全网扫描潜在风险：优先检查病毒传播途径（如乳汁或皮肤接触）、药物相互作用（目前无用药记录）、共病风险（如产妇淋巴细胞减少、ALT轻度升高可能提示炎症或肝损伤），并确保安全 > 疗效。\n\nStep 2: 临床解码 (Clinical Decoding) - 关键信息：产妇为猴痘确诊病例（PCR阳性5天），活动性感染（体温38.2°C，面部躯干60个脐凹状脓疱伴结痂，会阴新发丘疹）；免疫抑制证据（淋巴细胞0.9×10⁹/L，低于正常值）；乳头乳晕结痂及哺乳疼痛提示高风险皮肤破损；新生儿Apgar 9/10正常但需排除围产期接触感染；隐式线索包括淋巴细胞减少增加继发感染风险、ALT升高可能影响肝功能、乳头病变直接增加病毒传播概率。家属核心问题聚焦新生儿监测（抽血）和喂养方式（母乳）。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 与指南Condition“母亲患有猴痘”完全匹配。Action要求密切监测新生儿并评估母乳喂养，无Contraindication。但安全扫描：猴痘病毒可能通过乳汁或皮肤破损传播（母亲乳头结痂），淋巴细胞减少提示免疫力低下，可能加重感染风险。无药物相互作用（无用药）。共病风险：ALT轻度升高需监测肝功，但非禁忌。优先级：安全至上，避免直接接触传播。\n\nStep 4: 决策生成 (Decision Making) - 基于指南Action：新生儿需密切监测以识别潜在感染；母乳喂养评估基于母亲病情严重（活动性皮肤病变在敏感区域）。决策：新生儿立即启动监测策略（包括实验室检查）；鉴于高风险，暂停直接母乳喂养，提供安全替代方案。",
    "medical_order": "1. 新生儿管理：予密切监测生命体征（每日体温、心率、呼吸频率）及皮肤检查（观察新发皮损），完善血常规、猴痘PCR检测以评估围产期感染风险；维持隔离措施，避免母婴皮肤接触。\n2. 喂养方案：鉴于母亲乳头及乳晕区域结痂伴疼痛，建议暂停直接哺乳；可考虑泵乳后巴氏消毒处理（若乳汁猴痘PCR阴性）或改用配方奶喂养，确保新生儿营养摄入。\n3. 产妇管理：继续隔离护理，监测体温、皮损变化及淋巴细胞计数；予对症支持治疗（如退热、皮肤护理），复查肝功能（ALT）。",
    "patient_dialogue": "医生：我明白您们很担心宝宝的健康，特别是刚出生就遇到妈妈生病的情况。首先，宝宝出生时评分很好，是个健康的宝宝，但现在妈妈有猴痘感染，皮肤上还有伤口，所以我们得小心一点，避免病毒传给宝宝。我们会每天仔细检查宝宝的皮肤、量体温，看看有没有任何异常。如果发现像小红点或发烧，可能需要抽点血做个测试，这样能早点知道宝宝有没有被感染。\n\n关于喂母乳，妈妈乳头上有结痂，哺乳时会疼，这可能会让伤口里的病毒传给宝宝，风险比较高。为了宝宝安全，暂时别直接喂奶了。我知道您很想给宝宝初乳，这很重要，但我们可以换个方式：妈妈可以把奶泵出来，我们处理后确保安全再喂，或者用配方奶代替，这样宝宝营养不会缺。咱们一起保护好小家伙，好吗？有疑问随时问我。"
  },
  {
    "id": 801,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者昨夜突发高热（38.9℃）伴寒战，今晨发现面部、双手背及会阴部散在绿豆至花生米大小的丘疹，中央已出现清亮小疱，伴明显触痛。自述近两周曾与境外返沪伴侣发生无保护性行为，对方一周前出现‘类似水痘’皮疹。患者既往体健，已接种天花疫苗（2001年），否认免疫缺陷。查体：咽后壁可见两处2mm浅溃疡，颌下淋巴结肿大（1.5cm），无结膜充血。患者焦虑表示‘是不是被传染了性病？’并反复询问是否需要立即抽血查梅毒HIV。今日上海气温34℃，患者骑共享单车来院，汗湿T恤紧贴身躯，皮疹处可见摩擦破溃痕迹。",
    "reference_rule": {
      "condition": "结合临床表现和流行病学调查，高度怀疑感染猴痘",
      "action": "尽快进行病原学检测，采用核酸扩增试验（NAAT）对皮疹、疱液、痂皮、口咽或鼻咽分泌物等进行检测（包括实时或常规PCR）",
      "contraindication": null,
      "evidence": "因此，在结合临床表现和流行病学调查的基础上，高度怀疑感染猴痘时，应尽快进行病原学检测。WHO发布的《猴痘病毒实验室检测指南》及我国发布的《猴痘诊疗指南（2022年版）》均建议对疑似病例标本采用 NAAT进行实验室检测，包括实时或常规PCR，用于确诊猴痘的建议标本类型是皮肤病变材料，包括病变渗出物拭子、多处病变表层或病变痂皮。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于常规急诊诊疗场景。作为急诊医生，我的关注重点是快速建立鉴别诊断（如区分猴痘、水痘或其他性传播感染），排除危急重症（如败血症或严重过敏反应），并基于流行病学和临床表现给出最直接的诊疗指令。\nStep 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：急性症状包括高热（38.9℃）、寒战、散在丘疹水疱（面部、双手背和会阴部，伴触痛和摩擦破溃）、咽后壁浅溃疡及颌下淋巴结肿大；流行病学线索为近两周无保护性行为史（伴侣有类似皮疹）；隐式信息包括皮疹分布（猴痘典型部位）、摩擦破溃（可能加重感染风险或传播）、焦虑情绪（需心理支持）；环境因素（高温、汗湿）可能加剧皮疹不适。综合以上，初步医学诊断为猴痘病毒感染疑似。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 解码信息与指南 Condition 高度匹配：临床表现（皮疹、淋巴结肿大）和流行病学（接触史）强烈提示猴痘。指南 Contraindication 为 null，无禁忌症；安全检查排除危急情况（如无结膜充血或休克迹象），但摩擦破溃需警惕继发感染。\nStep 4: 决策生成 (Decision Making) - 根据指南 Action，立即进行病原学检测（NAAT/PCR），优先采集皮疹相关标本；同时，基于安全考虑，加用支持治疗和隔离措施，以防传播。",
    "medical_order": "1. 完善病原学检测：采集皮疹疱液、痂皮及咽后壁分泌物标本，行核酸扩增试验（NAAT），包括实时PCR检测猴痘病毒。2. 隔离措施：立即予单间隔离，限制接触，防止呼吸道和接触传播。3. 支持治疗：予对乙酰氨基酚500mg口服q6h prn退热；局部皮疹处予莫匹罗星软膏外用bid预防继发感染；避免摩擦或压迫皮疹区域。4. 补充评估：建议筛查其他性传播感染（如梅毒血清学试验、HIV抗原/抗体检测），但优先级次于猴痘确诊。5. 监测：每日观察体温、皮疹进展及淋巴结变化，警惕并发症。",
    "patient_dialogue": "您好，我理解您很担心，特别是您提到的性行为和皮疹问题。让我先帮您理清情况：从您的发烧、身上起的小水泡，还有您伴侣的症状来看，我们高度怀疑这可能是猴痘——这是一种病毒引起的感染，不是我们常说的严重性病，但需要尽快确认。接下来，我们需要取一点您皮肤上的水泡液体做个检测，就像一个小棉签取样，这能帮我们确诊。另外，为了防止传染给家人或其他人，您得暂时在单独的房间隔离，别太紧张，这主要是保护大家的安全。您现在穿的衣服太紧，摩擦会让皮疹更疼或感染，建议换宽松衣物；发烧的话，可以吃退烧药降温。至于梅毒和HIV检测，咱们稍后讨论，先确认这个更急的问题。您别太焦虑，猴痘大多数情况下可以治好，我们会一步步帮您处理。"
  },
  {
    "id": 805,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者两天前开始发热（最高38.7℃），伴明显乏力与双侧腹股沟淋巴结肿痛。今晨发现唇内侧与舌缘散在数个3–4 mm黄白色浅溃疡，触痛明显，影响进食。查体：口咽充血，溃疡表面干净无伪膜；面部及双手背可见散在暗红色斑丘疹，部分中央微凹。追问病史，患者自述3周前曾参加一场户外音乐节，期间与多位陌生人共用电子烟。否认既往慢性病史，近期无药物使用。血常规：WBC 5.8×10⁹/L，PLT 140×10⁹/L；CRP 12 mg/L。患者主诉因疼痛已两餐未正常进食，仅喝冰水缓解，迫切希望减轻口腔不适。",
    "reference_rule": {
      "condition": "猴痘感染患者出现口腔损伤",
      "action": "使用淡盐水每天进行漱口",
      "contraindication": null,
      "evidence": "对于口腔损伤可使用淡盐水每天进行漱口。"
    },
    "thought": "Step 1: 场景定义：本案例属于常规急诊诊疗场景，关注点在于快速建立鉴别诊断、排除危急重症（如严重感染或脓毒症），并给出直接治疗指令以缓解患者急迫症状。Step 2: 临床解码：患者表现为发热（最高38.7℃）、乏力、双侧腹股沟淋巴结肿痛、口腔散在黄白色浅溃疡（触痛明显）、口咽充血，以及面部及双手背暗红色斑丘疹（部分中央微凹），结合3周前共用电子烟的暴露史，高度提示猴痘感染；实验室检查（WBC正常、CRP轻度升高）支持炎症过程但无危重迹象；隐式线索包括共用电子烟导致的病毒传播风险，口腔溃疡已导致进食障碍（仅摄入冰水），患者急迫需求为疼痛缓解。Step 3: 规则对齐与安全检查：指南条件为‘猴痘感染患者出现口腔损伤’，病例特征（口腔溃疡、皮疹和暴露史）完美匹配；无禁忌症（contraindication为null），溃疡表面干净无伪膜，排除了其他感染（如念珠菌病），且无药物史或慢性病，确保安全性。Step 4: 决策生成：基于指南action，优先采用淡盐水漱口作为直接干预缓解口腔不适，同时排除危急重症后无需升级治疗。",
    "medical_order": "予淡盐水漱口：取温开水200ml加食盐3g（约半茶匙），每日4次漱口，每次持续30秒。嘱患者进流质饮食，避免刺激性食物。监测体温及溃疡变化，必要时复诊评估。",
    "patient_dialogue": "医生：我明白您口腔疼得厉害，连吃饭都困难了，这确实让人难受。为了帮您缓解疼痛、让这些溃疡好得快些，我建议您每天用温盐水漱口——很简单，一杯温水里加半茶匙盐，搅拌后漱口吐掉，一天多做几次。这样能清洁伤口、减轻发炎，也防止感染加重。同时，试着喝点粥或汤，别碰烫的或辣的，冰水继续喝没关系。如果疼得厉害或发热没退，随时回来找我看看。"
  },
  {
    "id": 793,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "电话那头传来年轻男性压抑的咳嗽声。他说弟弟26岁，昨天开始口腔脓疱破溃，床单上可见淡黄色渗出液。他今早徒手帮弟弟换了床单，之后才发现自己右手小指根部有一小道倒刺裂口。现在他担心是否会被传染，但又不敢贸然去医院，怕反而把病毒带出去。外面正下着暴雨，快递停发，家里只剩普通医用外科口罩和厨房用一次性透明手套。他补充说，自己平时做外卖骑手，最近平台通知‘有皮疹立刻停工’，他怕丢工作，所以特别焦虑。",
    "reference_rule": {
      "condition": "照顾猴痘患者时",
      "action": "戴好N95口罩和防水手套",
      "contraindication": null,
      "evidence": "照顾猴痘患者时，应戴好N95口罩和防水手套。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于操作规范与测量场景。作为操作执行者，我将重点关注物理条件是否满足（现有防护装备是否足够）、操作步骤是否遗漏（在照顾患者时是否有正确防护）、以及是否存在影响准确性的干扰因素（如暴雨导致的资源限制、患者的焦虑和职业压力）。\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：弟弟出现口腔脓疱破溃伴淡黄色渗出液，提示潜在病毒性感染（如猴痘或疱疹病毒）；患者有皮肤破损（右手小指根部倒刺裂口）并直接暴露于污染物（徒手更换污染床单），构成高风险暴露。隐式线索包括：暴露后未及时防护、环境限制（暴雨导致出行困难，仅存普通医用外科口罩和厨房用一次性透明手套）、社会因素（患者为外卖骑手，平台停工政策引发焦虑）。转化为医学术语：高风险接触传播感染、皮肤屏障破坏、防护装备不足、环境障碍。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南condition为'照顾猴痘患者时'，与病例匹配（患者照顾疑似猴痘弟弟）。无contraindication（null），但安全检查揭示物理条件不满足：普通医用外科口罩非N95级别，厨房用一次性透明手套非防水，无法有效防护体液暴露；干扰因素（暴雨和焦虑）可能影响防护操作的准确性。\nStep 4: 决策生成 (Decision Making) - 根据指南action'戴好N95口罩和防水手套'，生成具体决策：在资源限制下，优先最大化利用现有装备作为临时措施，同时强调隔离和紧急医疗评估以弥补不足；最终决策包括：立即使用现有防护、居家隔离、寻求远程医疗指导。",
    "medical_order": "评估患者高风险暴露（皮肤破损接触污染物），予暴露风险评估。建议立即使用N95口罩和防水手套，但因资源限制，可临时使用普通医用外科口罩及厨房用一次性透明手套。予居家隔离，避免接触他人。安排紧急远程医疗咨询，完善猴痘病毒检测。监测皮疹症状，出现异常立即转诊。",
    "patient_dialogue": "喂，你好，我是医生。首先，别太紧张，我理解你现在很着急，担心自己和弟弟的健康，还有工作的事。听着，你弟弟口腔那些脓疱破溃和渗出液，很可能是一种传染性病毒，比如猴痘什么的。你手上那个小伤口碰到了床单，确实有被传染的风险，但咱们得一步一步来应对。现在家里只有普通口罩和厨房手套，虽然它们不如专业的N95和防水手套那么安全，但总比没有强——赶紧戴上它们，千万别再徒手碰任何东西了。别出门，外面下雨，也别担心把病毒带出去，你就和弟弟一起待在家里隔离，这能保护你和别人。工作的事也别慌，健康最重要；万一出现皮疹，及时报告是对的，但现在先确保安全。我建议你马上电话联系当地疾控中心或医院，他们能远程指导你，等雨停了再去做个检查。好吗？咱们一起处理，别怕！"
  },
  {
    "id": 812,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者3天前出现38.7 ℃弛张热伴剧烈头痛，自服对乙酰氨基酚可短暂退热。昨日晨起发现口唇周围及双手背散在2-3 mm红色斑丘疹，今日皮疹迅速演变为中央凹陷的珍珠样水疱，疱液清亮，触痛明显。患者述‘像被烟头烫过’。查体：T 38.2 ℃，P 92 次/分，BP 118/76 mmHg；面部、手掌可见20余颗0.3-0.8 cm脐凹状水疱，部分疱壁已破溃形成鲜红糜烂面，表面微渗血；颌下可触及2枚1.5 cm质韧淋巴结，压痛(+)。咽部轻度充血，扁桃体无渗出。患者承认曾与‘一位发热伴皮疹的朋友’共用水杯。近期无外出旅行、无野生动物接触史，但每天需搭乘拥挤地铁通勤。患者焦虑表示：‘我手上有伤口，怕留疤影响接单，能不能先给我点外用药？’ 追问得知，他习惯熬夜作画，抽烟10支/日，余无特殊既往史，未接种天花疫苗。",
    "reference_rule": {
      "condition": "猴痘感染患者出现皮肤破损",
      "action": "寻求皮肤专科医师帮助",
      "contraindication": null,
      "evidence": "如果皮肤破损，应寻求皮肤专科医师帮助。"
    },
    "thought": "本案例属于常规诊断与治疗场景（急诊/门诊环境），作为急诊/门诊医生，我的关注重点是快速建立鉴别诊断，排除猴痘等传染性危急重症，并给出直接指令以控制病情。Step 2: 临床解码：患者呈现弛张热、剧烈头痛、特征性皮疹（从红色斑丘疹演变为中央凹陷的脐凹状水疱，触痛明显，描述‘像被烟头烫过’），结合颌下淋巴结肿大压痛、与发热皮疹患者共用水杯暴露史，以及拥挤地铁通勤史，高度提示猴痘感染（monkeypox）。关键隐式线索包括皮疹快速进展、皮肤破损（水疱破溃形成糜烂面，有继发感染风险）、患者焦虑（担心留疤影响作画工作）、吸烟和熬夜习惯（可能削弱免疫力）。需排除水痘、疱疹病毒感染或细菌性脓疱病。Step 3: 规则对齐与安全检查：指南condition为‘猴痘感染患者出现皮肤破损’，病例中皮疹已破溃形成糜烂面，符合此条件；contraindication为null，无禁忌证，确保安全。Step 4: 决策生成：根据指南action‘寻求皮肤专科医师帮助’，决定立即转诊皮肤科专家，同时进行初步隔离、检测和症状管理。",
    "medical_order": "隔离患者于单间，采取接触防护。采集皮肤水疱拭子送检猴痘病毒PCR。予对乙酰氨基酚500mg oral prn for fever and pain. 局部皮肤护理：清洁破溃面，予无菌敷料覆盖，避免搔抓。转诊皮肤科专家会诊。监测生命体征q4h，完善血常规、CRP和病毒血清学检查。建议戒烟及规律作息以支持免疫恢复。",
    "patient_dialogue": "您好，我仔细看了您的症状——发烧、头痛还有这些水疱，特别是您说它像被烟头烫过，这很关键。结合您和朋友共用水杯的经历，我们高度怀疑是猴痘感染，这是一种传染性病毒病。您的手上伤口破溃了，如果随便涂药或不处理，容易感染恶化，甚至留疤影响您作画工作，这可不是小事。我知道您现在很着急，但别担心，我们会先给您吃点药退烧止痛，同时请一位皮肤科专家来专门处理这些水疱。他们经验丰富，能最大程度减少留疤风险。另外，猴痘会传染，所以需要您隔离一下，避免传给家人或同事。我们也会做个简单检查确认诊断。记住，少抽烟、别熬夜，这对恢复很重要——身体强了，就好得快！"
  },
  {
    "id": 821,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者32岁，确诊HIV感染7年，近3个月未规律服用抗病毒药物。4天前出现发热、头痛，随后颜面、躯干及会阴部迅速出现典型脐凹样疱疹，部分融合成大片痂壳，伴剧烈肛门疼痛。入院当天PCR确诊猴痘病毒Clade II。查体：T 38.4 ℃，P 102次/分，BP 118/76 mmHg；皮疹计数>200处，其中约30%已结痂，口腔及结膜均受累。实验室回报：ALT 68 U/L（↑），AST 55 U/L（↑），TBil 19 μmol/L（↑），ALP 130 U/L，Cr 88 μmol/L；CD4 210/μL，HIV RNA 4.6×10⁵ copies/mL。因皮疹广泛并伴持续病毒血症，感染科拟加用布林西多福韦（brincidofovir）口服治疗。患者自述昨夜因瘙痒服用苯海拉明2片，无其他新药。今日晨抽血复查肝功，结果尚未回示。窗外暴雨导致电梯停运，患者对延迟送药略有焦虑。",
    "reference_rule": {
      "condition": "HIV感染的猴痘患者考虑使用布林西多福韦",
      "action": "注意可能会导致血清转氨酶和胆红素的升高",
      "contraindication": null,
      "evidence": "③布林西多福韦，但可能会导致血清转氨酶和胆红素的升高"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及HIV感染和猴痘的双重感染，患者伴有免疫功能抑制和肝损伤风险。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，优先确保患者安全（安全 > 疗效），包括评估布林西多福韦的肝毒性风险、HIV治疗恢复的紧迫性以及潜在药物叠加效应。\n\nStep 2: 临床解码 (Clinical Decoding) - 关键信息提取：患者为中度免疫抑制状态（CD4 210/μL，HIV RNA 4.6×10⁵ copies/mL），HIV治疗中断3个月导致病毒未控；活动性猴痘感染（PCR确诊Clade II），表现为广泛皮损（>200处，30%结痂）、黏膜受累（口腔及结膜）和全身症状（发热、头痛、肛门疼痛）；实验室显示肝损伤证据（ALT↑68 U/L，AST↑55 U/L，TBil↑19 μmol/L），今日复查肝功未出；药物方面，计划加用布林西多福韦，但患者近期服用苯海拉明（抗组胺药）。隐式线索包括：肝酶升高可能源于感染、药物副作用或基础肝病；HIV未控增加机会性感染风险；苯海拉明虽无直接相互作用，但可能加重镇静效果；患者焦虑和送药延迟可能影响治疗依从性。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 规则对齐：患者符合指南条件“HIV感染的猴痘患者考虑使用布林西多福韦”。指南Action要求“注意可能会导致血清转氨酶和胆红素的升高”，证据强调该药肝毒性风险。强制安全检查：指南Contraindication为null，无绝对禁忌，但当前患者已存在肝酶升高（ALT、AST、TBil升高），今日复查肝功未出，启动布林西多福韦可能加剧肝损伤；苯海拉明无已知显著相互作用，但需警惕镇静副作用；共病风险包括HIV相关免疫抑制可能导致猴痘加重或肝毒性易感性。安全优先级：立即评估肝功状态，避免药物叠加风险。\n\nStep 4: 决策生成 (Decision Making) - 基于指南Action“注意肝酶升高”，决策为：暂缓布林西多福韦启动，等待今日肝功复查结果；若肝功稳定，再谨慎用药。同时，优先恢复HIV抗病毒治疗以控制基础病，对症处理猴痘症状，并加强监测。",
    "medical_order": "1. 暂缓布林西多福韦用药，待今日肝功复查结果回报（重点监测ALT、AST、TBil）。若肝功指标稳定（无进一步升高），予布林西多福韦75mg口服每周一次（按标准方案）。2. 立即恢复HIV抗病毒治疗（推荐方案：替诺福韦/恩曲他滨/多替拉韦，TDF/FTC/DTG，每日一次），监测HIV RNA和CD4计数。3. 对症支持：予对乙酰氨基酚500mg口服每6小时一次止痛；皮肤护理（如凡士林外涂）；避免搔抓皮疹。4. 监测生命体征（体温、脉搏、血压）每日两次，观察皮疹进展及黏膜受累情况。5. 完善血常规、CRP及肝功复查48小时后重复。",
    "patient_dialogue": "您好，我理解您因为电梯停运有点着急，但别担心，我们正在全力处理。首先，关于新药布林西多福韦，它能帮助对抗猴痘，但有个重要问题：这个药可能会让肝脏负担加重，就像您之前检查的肝功能指标已经有点偏高。今天早上我们又抽血复查了，结果还没出来，我们必须等一等这个报告，确认您的肝脏没问题再用药，这样才安全。不然，万一肝脏吃不消，反而会让您更不舒服。同时，我会先给您开点止痛药缓解肛门疼痛，还有涂的药膏减轻瘙痒——千万别自己抓，容易感染。另外，您的HIV药最近没规律吃，这很关键，得赶紧重新开始每天按时服药，它能帮您身体恢复抵抗力，对抗感染。我会安排护士尽快送药上去，电梯问题我们会想办法解决。有什么不舒服随时告诉我，好吗？"
  },
  {
    "id": 820,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者3天前突发38.7℃高热，随后面颈、手掌及会阴部出现离心性分布的2–4 mm小疱疹，中心脐凹，部分已转为脓疱并融合成大片。基层医院咽拭子与疱液PCR均检出猴痘病毒Clade IIb。既往史：G1P0，孕早期OGTT提示空腹血糖5.3 mmol/L，未达妊娠糖尿病诊断；无高血压、心脏病。入院查体：T 38.2℃，BP 118/74 mmHg，HR 102次/分，SpO₂ 97%（RA），胎心监护基线150 bpm，变异中等，偶发晚期减速。实验室：WBC 11.8×10⁹/L（N 0.82），PLT 97×10⁹/L，ALT 52 U/L，Cr 68 µmol/L；凝血PT 15.1 s，APTT 38 s，D-二聚体2.1 mg/L。产科超声：胎儿估重1.8 kg（第25百分位），羊水指数9 cm，脐动脉S/D 3.1，大脑中动脉PI 1.3。患者述近24 h宫缩频率增至每10 min 1次，无阴道流血，但胎动减少。值班医生正在评估是否需要立即终止妊娠。",
    "reference_rule": {
      "condition": "患有猴痘的孕妇",
      "action": "引产和剖腹产应仅在医学上合理且基于母体和胎儿状况较好的情况下进行",
      "contraindication": null,
      "evidence": "引产和剖腹产应仅在医学上合理且基于母体和胎儿状况较好的情况下进行。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) – 本案例属于复杂合并症治疗场景，涉及孕妇猴痘感染叠加妊娠并发症（胎儿窘迫、生长受限）。作为专科专家，我的关注重点是全网扫描潜在风险，优先确保安全：检查药物相互作用（如抗病毒药与妊娠的兼容性）、禁忌症（指南无绝对禁忌，但需评估母胎状况）及共病风险（感染、凝血异常、胎儿缺氧）。优先级：安全 > 疗效。\n\nStep 2: 临床解码 (Clinical Decoding) – 从病例提取关键信息：患者确诊猴痘病毒Clade IIb，表现为高热（38.2℃）、离心性疱疹进展为脓疱融合，提示急性感染期；实验室异常包括白细胞升高（WBC 11.8×10⁹/L，N 0.82）提示炎症反应，血小板减少（PLT 97×10⁹/L）和D-二聚体升高（2.1 mg/L）暗示凝血功能障碍/弥散性血管内凝血风险，ALT升高（52 U/L）可能为肝损伤。妊娠方面：孕早期OGTT空腹血糖5.3 mmol/L虽未达妊娠糖尿病诊断，但接近阈值，增加代谢风险；胎心监护示晚期减速伴胎动减少，提示胎儿窘迫；产科超声示胎儿估重1.8 kg（第25百分位）表示胎儿生长受限（FGR），脐动脉S/D 3.1提示胎盘功能不全。隐式线索：宫缩频率增加（每10 min 1次）无阴道流血，结合胎动减少，表明早产风险高；但母体生命体征尚稳（BP 118/74 mmHg, SpO₂ 97%），无直接危急重症。综合解码为：猴痘感染诱发系统性炎症反应，叠加妊娠并发症（FGR、胎儿窘迫），需紧急稳定母胎状态。\n\nStep 3: 规则对齐与安全检查 (Alignment & Safety) – 将解码信息与指南Condition“患有猴痘的孕妇”匹配：患者为孕妇且PCR确诊猴痘，符合条件。指南Action强调“引产和剖腹产应仅在医学上合理且基于母体和胎儿状况较好的情况下进行”；Contraindication为null，无绝对禁忌。但强制安全检查：当前母体状况不佳（高热、炎症标记升高、凝血异常），胎儿状况不良好（晚期减速、胎动减少、生长受限），均不符合“状况较好”标准。优先级安全：需先处理感染和胎儿风险，避免直接终止妊娠引发并发症（如出血、感染扩散）。\n\nStep 4: 决策生成 (Decision Making) – 基于指南Action和当前状况，决定不立即终止妊娠；优先抗病毒治疗和支持性护理稳定母胎状态。安全优先：启动tecovirimat抗病毒（妊娠期可用），加强母体监测（体温、凝血），胎儿监护（连续胎心监测）；待感染控制后，重新评估分娩必要性。",
    "medical_order": "1. 予tecovirimat 600 mg口服每日两次抗病毒治疗，监测皮疹进展及肝肾功能。\n2. 一级护理，密切监测生命体征（T、BP、HR、SpO₂）每4小时一次；胎心监护连续进行，注意晚期减速变化。\n3. 完善实验室复查：血常规、凝血功能（PT、APTT、D-二聚体）、肝酶、肾功能及炎症标记（CRP）每24小时；复查产科超声评估胎儿生长及脐血流。\n4. 支持性治疗：静脉补液维持水电解质平衡，物理降温；避免使用非甾体抗炎药以防出血风险。\n5. 急请产科、感染科及新生儿科多学科会诊，评估胎儿窘迫处理方案；暂缓引产或剖腹产，待母胎状况稳定后重评。",
    "patient_dialogue": "您好，我是您的医生。现在您的情况有点复杂：您感染了猴痘病毒，这导致了发烧和皮肤疱疹，同时宝宝在肚子里也出现了一些问题——他的心跳偶尔减慢，活动也减少了，这表示他可能有点不舒服。我们得先把这两方面都稳住，不能让您现在就生宝宝，因为如果强行生，可能会让您出血或感染加重，宝宝也容易缺氧。所以，我们会马上给您一种专门对付猴痘的药，它会帮您对抗病毒；还会给您输液补水和降温，让您舒服些。我们会一直监测您和宝宝的情况，比如每几小时检查一次体温和宝宝的心跳。别担心，我们团队都在这里，等您和宝宝好一点了，我们再决定什么时候生最安全。"
  },
  {
    "id": 823,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者2天前出现38.7 ℃发热伴明显乏力，自触腹股沟“鸽蛋大”肿痛包块。昨日面部与双手背突发十余颗2–4 mm脐凹样水疱，中央结痂，伴灼痒。追问病史：近3个月体重下降6 kg，反复口腔白膜，曾自行购药涂抹无效。否认结核、乙肝；吸烟7年，约10支/日；从事夜间外卖骑手，近期无跨省旅行，但自述3周前与一名“皮疹已结痂”的陌生男子发生无保护口交及肛交。查体：BP 118/72 mmHg，HR 96次/分，SpO₂ 98%；颜面、手背及阴茎散在脐凹状疱疹，部分脓性；双侧腹股沟可及肿大淋巴结，大者2.5 cm，质韧触痛。实验室：血常规WBC 4.1×10⁹/L，LY 0.9×10⁹/L；CRP 18 mg/L；ALT 52 U/L，Cr 78 µmol/L；HIV Ag/Ab 初筛阳性（待确认），CD4 168/µL，病毒载量结果未归；梅毒TPPA阴性。咽拭子MPXV PCR Ct 26.3。患者焦虑反复询问：“医生，我听说免疫力低的人是不是好得慢？我要不要住院？”",
    "reference_rule": {
      "condition": "感染猴痘病毒且新诊断为HIV感染的患者",
      "action": "尽快开始抗反转录病毒治疗",
      "contraindication": null,
      "evidence": "②针对新诊断的HIV感染患者，应尽快开始抗反转录病毒治疗"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及猴痘病毒感染与新诊断的HIV感染并存，重点关注多重病原体相互作用、免疫抑制状态下的治疗风险。作为专科专家，我的关注重点是全网扫描药物相互作用、禁忌症及共病风险，确保安全优先（如ART启动与猴痘治疗的兼容性）。\nStep 2: 临床解码 (Clinical Decoding) - 从病例提取关键信息：急性症状包括发热、乏力、脐凹样水疱（提示猴痘典型表现），腹股沟淋巴结肿大及脓性疱疹；隐式线索包括近期体重下降6kg、反复口腔白膜（暗示HIV相关口腔念珠菌病）、无保护性行为史（暴露于性传播感染风险）、CD4 168/µL（严重免疫抑制）、ALT轻度升高（可能肝脏轻度损伤）。整体转化为医学术语：猴痘病毒感染（PCR确认）、HIV感染（初筛阳性，CD4低）、机会性感染（口腔念珠菌病）、轻度肝功能障碍。\nStep 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件“感染猴痘病毒且新诊断为HIV感染”完全匹配（猴痘PCR阳性，HIV初筛阳性）；行动“尽快开始抗反转录病毒治疗”适用。强制检查禁忌症：指南中无禁忌（contraindication: null），但全网扫描发现潜在风险—ALT升高可能增加ART药物（如替诺福韦）的肝毒性风险，无直接药物冲突；共病风险包括免疫抑制加重猴痘病程、口腔念珠菌病需同步处理。安全优先，无绝对禁忌，ART可启动但需密切监测。\nStep 4: 决策生成 (Decision Making) - 基于指南行动，核心决策是立即开始ART；同时整合猴痘管理（隔离、症状控制）、念珠菌病治疗及住院监测，以应对免疫抑制和急性感染风险。优先级确保安全：ART启动为首要，但需结合肝功监测和综合支持。",
    "medical_order": "1. 立即启动抗反转录病毒治疗（ART），方案选择替诺福韦/恩曲他滨/多替拉韦，每日一次口服；2. 猴痘病毒感染管理：予接触隔离，疱疹局部护理（如生理盐水湿敷），避免搔抓；3. 口腔念珠菌病：予氟康唑150 mg口服，每日一次，疗程7天；4. 住院观察：予一级护理，监测体温、皮损变化及生命体征；5. 完善实验室检查：复查HIV确认试验、病毒载量、CD4计数、肝肾功能（ALT、Cr）、血常规及CRP，每48小时评估；6. 支持治疗：卧床休息，充足水分摄入；7. 风险干预：建议戒烟，提供尼古丁替代疗法咨询。",
    "patient_dialogue": "别担心，我们一步步来帮你。首先，检查结果显示你有猴痘和HIV感染，HIV会让你的免疫力变低，恢复可能慢一些，但这正是我们需要抓紧治疗的原因。我会尽快给你开一种叫ART的药物，它能帮你控制HIV，让身体慢慢恢复抵抗力，这样你才能更好地对抗猴痘。猴痘那些水疱可能会疼痒，我们会帮你处理一下，比如用湿布敷一敷，但千万别抓破，容易感染别人，所以得暂时隔离——就是说，住院观察几天最安全，这样我们能随时看着你，有什么变化立刻处理。另外，你嘴里那些白膜是真菌感染，我会开点药让它快点好。住院期间，你需要多休息、多喝水，戒烟也很重要，因为抽烟会让免疫力更差。记住，这些治疗都是为你量身定做的，别太焦虑，我们一起努力，好吗？"
  },
  {
    "id": 819,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者3天前无明显诱因出现38.7℃发热，伴乏力，随后面部、躯干出现散在丘疹，直径3-5mm，部分中央凹陷，触痛明显，无渗液。HIV病史8年，最近一次CD4 210 cells/μL，已规律服用TDF/FTC+DTG，病毒载量<50 copies/mL。既往无糖尿病、高血压。入院查体：BP 118/76 mmHg，HR 92次/分，SpO₂ 97%（空气）。实验室：血肌酐0.141 mmol/L（1.59 mg/dL），eGFR 48 mL/min/1.73m²；尿常规蛋白(-)，白细胞(-)。ALT 34 U/L，总胆红素9 μmol/L。患者自述近期无外出史，无野生动物接触，但1周前在健身房共用淋浴。今日皮肤科会诊考虑猴痘可能，已取疱液送PCR。患者主诉双腰部酸胀，无尿量减少。夜班住院医准备经验性给予西多福韦静滴，正在电脑前勾选医嘱。",
    "reference_rule": {
      "condition": "HIV感染的猴痘患者，且血清肌酐>0.132 mmol/L (1.5 mg/dL)",
      "action": "禁用西多福韦",
      "contraindication": "禁用西多福韦",
      "evidence": "②西多福韦，若血清肌酐>0.132 mmol/L (1.5 mg/dL)，则应禁用"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition): 本案例属于复杂合并症治疗场景，涉及HIV感染合并疑似猴痘感染，同时存在肾功能不全。作为专科专家，我将优先全网扫描药物相互作用、禁忌症及共病风险，确保安全第一（优先级：安全 > 疗效）。重点关注西多福韦的潜在肾毒性风险与现有HIV药物的相互作用。\nStep 2: 临床解码 (Clinical Decoding): 患者关键信息包括：HIV病史（CD4 210 cells/μL，免疫抑制状态），规律服用TDF/FTC+DTG（其中TDF有肾毒性风险），发热伴丘疹（皮肤科考虑猴痘可能，暴露源为健身房共用淋浴），实验室显示血肌酐0.141 mmol/L（1.59 mg/dL）>正常值，eGFR 48 mL/min/1.73m²（提示CKD 3期）；隐式线索包括：双腰部酸胀可能指示肾区不适（无尿量减少，排除急性肾损伤），但eGFR降低和肌酐升高已构成肾功能不全，增加药物肾毒性风险。\nStep 3: 规则对齐与安全检查 (Alignment & Safety): 参考指南条件为‘HIV感染的猴痘患者，且血清肌酐>0.132 mmol/L (1.5 mg/dL)’，患者肌酐1.59 mg/dL > 1.5 mg/dL，完全匹配条件；指南明确禁忌症为‘禁用西多福韦’，证据为‘若血清肌酐>0.132 mmol/L，则应禁用’。安全检查：全网扫描显示，西多福韦有高肾毒性风险，在eGFR <55 mL/min时禁用；患者eGFR 48且正服用TDF（肾毒性药物），叠加使用可能导致急性肾损伤；无直接药物相互作用（DTG肾安全），但整体肾功能状态构成绝对禁忌。\nStep 4: 决策生成 (Decision Making): 根据指南action‘禁用西多福韦’，决策为立即停止该药物经验性使用；替代方案考虑特考韦瑞（猴痘一线治疗，肾毒性低）；同时加强肾功能监测，并评估HIV方案优化（如替换TDF）。",
    "medical_order": "1. 立即停用西多福韦静滴医嘱。2. 经验性给予特考韦瑞口服 200 mg 每日一次（猴痘疑似治疗）。3. 密切监测血肌酐、eGFR、尿常规每日；完善肾超声检查评估双腰部酸胀原因。4. 评估HIV抗逆转录病毒方案：考虑替换替诺福韦（TDF）为肾毒性较低药物（如TAF）。5. 隔离患者，待疱液PCR结果确诊猴痘。6. 维持支持治疗：静脉补液、止痛（如对乙酰氨基酚）。",
    "patient_dialogue": "您好，我是您的医生。咱们先说说您的检查结果：血检显示您的肾脏功能有点弱，肌酐值偏高，这提示肾脏负担较重。所以，我们不能用西多福韦那个药来治您的皮疹，因为它可能会让肾的问题更糟—就好像给已经很累的肾脏再加负担，容易伤着它。别担心，我们会换成另一种安全的药（叫特考韦瑞）来对付那个可能的猴痘感染。同时，我建议每天抽血看看肾的情况，这样能随时调整治疗，确保安全。另外，您说的腰部酸胀，我们会做个超声检查找找原因。记住，隔离很重要，因为猴痘会传染，咱别让家人或其他人中招。咱们一步步来，我会全程盯着，别太紧张。"
  },
  {
    "id": 827,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者34岁，自由插画师，独居，既往确诊HIV感染8年（CD4 110 cells/μL，病毒载量 2.3×10⁵ cp/mL，未规律抗病毒治疗）。3天前出现38.7 ℃高热、剧烈头痛，随后面颈、手掌及生殖器分批出现典型深基脐凹样疱疹，最大直径8 mm，部分融合成大片痂壳；伴吞咽疼痛、直肠坠痛。急诊查体：T 39.2 ℃，HR 118次/分，BP 94/58 mmHg，SpO₂ 94%（未吸氧），颈部、腋下可触及痛性肿大淋巴结（1.5-2 cm）。实验室回报：WBC 3.2×10⁹/L，LY 0.6×10⁹/L，ALT 102 U/L，AST 88 U/L，TBil 28 μmol/L，ALB 28 g/L；PCR 检出猴痘病毒 DNA（Ct 18）；血培养阴性；胸片示双下肺毛玻璃样渗出影。患者自诉昨日开始皮疹渗液明显增多，部分破溃处可见脓性分泌物，疼痛致夜间无法入睡。今日上午出现短暂意识模糊，可唤醒，对答切题。急诊已予静脉补液、经验性头孢曲松及镇痛处理，但高热持续不退，皮疹进展迅速，伴低血压与低白蛋白血症。",
    "reference_rule": {
      "condition": "HIV感染的猴痘患者病情严重",
      "action": "考虑使用牛痘免疫球蛋白静脉注射",
      "contraindication": null,
      "evidence": "④严重的情况下可能会考虑使用牛痘免疫球蛋白静脉注射。"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition)：本案例属于复杂合并症治疗场景，涉及HIV感染与猴痘感染的严重合并症。作为专科专家，我将重点关注全网扫描潜在药物相互作用、禁忌症及共病风险，优先确保治疗安全性（安全 > 疗效），因为患者免疫抑制严重且多系统受累。Step 2: 临床解码 (Clinical Decoding)：患者关键信息包括：1) 免疫抑制（CD4 110 cells/μL，HIV未治疗，病毒载量高），导致猴痘病情恶化；2) 猴痘感染（PCR Ct 18提示高载量，深基脐凹样疱疹融合、渗液脓性，伴高热、头痛）；3) 多系统并发症（胸片毛玻璃影提示肺炎，意识模糊提示脑炎风险，肝酶升高提示肝损伤，低白蛋白血症和低血压提示营养不良和休克风险）；隐式线索：皮疹破溃脓性分泌物暗示继发细菌感染（可能耐药），HIV未治疗增加机会性感染风险，独居背景可能影响治疗依从性。Step 3: 规则对齐与安全检查 (Alignment & Safety)：与指南条件‘HIV感染的猴痘患者病情严重’高度匹配（高热不退、皮疹进展、意识模糊、低血压）。指南建议考虑牛痘免疫球蛋白静脉注射（VIGIV），且无禁忌症（contraindication null）。强制安全检查：1) 药物相互作用—VIGIV与HIV抗逆转录病毒治疗（ART）无已知重大相互作用，但需监测肝毒性（因ALT/AST升高）；2) 禁忌症—无过敏史报告，但VIGIV含鸡蛋蛋白，需询问过敏史；3) 共病风险—低白蛋白血症可能影响药物分布，肺炎需覆盖细菌感染，免疫抑制增加合并感染风险。优先级：安全为先，避免药物冲突和毒性。Step 4: 决策生成 (Decision Making)：基于指南Action，推荐静脉注射牛痘免疫球蛋白（VIGIV）作为核心抗病毒治疗；同时整合其他措施，包括加强抗细菌覆盖、启动HIV ART、支持治疗以管理并发症。",
    "medical_order": "予一级护理，持续心电监护及生命体征监测（q1h）。静脉注射牛痘免疫球蛋白（VIGIV）6,000 IU/kg（单次剂量）。继续头孢曲松2g IV q24h，并升级抗生素至万古霉素1g IV q12h（覆盖革兰阳性菌及耐药风险）。启动复方抗逆转录病毒治疗（ART）：比克替拉韦/恩曲他滨/替诺福韦（Biktarvy）每日一次口服。支持治疗：静脉补液（生理盐水500 mL q6h），人血白蛋白10g IV q12h（纠正低白蛋白血症），镇痛（吗啡2mg IV prn）。完善检查：腰椎穿刺（脑脊液常规、生化、PCR），复查血培养、肝肾功能、CD4计数及病毒载量。营养支持：肠内营养液1,500 kcal/d。",
    "patient_dialogue": "先生，您现在的情况比较棘手，HIV感染加上这个猴痘病毒，让身体承受了很大压力。我们会马上给您用一种特殊的抗体药物，直接从静脉打进去，帮助您的免疫系统对抗猴痘病毒。同时，您发烧和皮疹有脓，可能是细菌感染在作怪，所以我们会继续用抗生素，防止感染加重。另外，我们要开始治疗您的HIV，这很重要，能保护您的身体不再被其他病菌攻击。您可能会觉得累或不舒服，但别担心，我们会给您输液补充水分和营养，还有止痛药缓解疼痛。您需要好好休息，我们每隔一小时就检查一次您的体温和血压，确保一切在掌控中。有任何不适就告诉我，我们一起扛过去。"
  },
  {
    "id": 824,
    "file_name": "猴痘公众防护指南(2023).json",
    "case_input": "患者34岁，体重68 kg，10年前确诊HIV感染，目前服用比克替拉韦/恩曲他滨/丙酚替诺福韦（B/F/TAF），自述依从性>95%。近3天突发高热（最高39.4 °C）、寒战、乏力，伴进行性加重的全身丘疹，部分已演变为中央凹陷的脓疱，面部、手掌及会阴密集分布，伴明显触痛。无瘙痒、无咳嗽气促。查体：T 38.9 °C，BP 118/72 mmHg，HR 96 次/分，SpO₂ 97%（RA）。皮肤科见数十个2–8 mm半球形丘疹脓疱，部分结痂，基底红晕。实验室：白细胞4.1×10⁹/L，淋巴细胞0.8×10⁹/L，CD4 210/μL，HIV RNA <20 cp/mL；ALT 42 U/L，Cr 78 μmol/L；CRP 28 mg/L。猴痘病毒PCR（皮损拭子）阳性。患者否认近期旅行史，但回忆2周前参加一次私人派对，期间有皮肤接触。今日复诊，担忧皮疹扩散，并询问是否需要停用抗病毒药。今日气温34 °C，患者因地铁空调过冷自述“路上打寒战”。",
    "reference_rule": {
      "condition": "已知HIV感染患者被诊断感染猴痘病毒",
      "action": "继续进行抗反转录病毒治疗，并根据需要进行机会性感染预防",
      "contraindication": null,
      "evidence": "关于猴痘患者的HIV管理推荐：①针对已知 HIV 感染确诊患者，继续进行抗反转录病毒治疗，并根据需要进行机会性感染预防"
    },
    "thought": "Step 1: 场景定义 (Scenario Definition) - 本案例属于复杂合并症治疗场景，涉及HIV感染合并猴痘病毒感染。作为专科专家，我将重点关注全网扫描药物相互作用、禁忌症及共病风险，优先确保治疗安全（如避免药物冲突），其次考虑疗效。Step 2: 临床解码 (Clinical Decoding) - 从病例中提取关键信息：患者HIV感染控制良好（CD4 210/μL，HIV RNA <20 cp/mL），但免疫中度抑制（淋巴细胞0.8×10⁹/L），急性猴痘感染（PCR阳性，症状包括高热、寒战、进行性脓疱皮疹）；隐式线索包括皮疹分布（面部、手掌、会阴密集）提示可能传播风险高，CD4计数接近200/μL阈值增加机会性感染风险，寒战可能与感染而非环境因素相关，患者焦虑（担忧皮疹扩散和停药）需情绪支持。Step 3: 规则对齐与安全检查 (Alignment & Safety) - 指南条件（已知HIV感染合并猴痘病毒诊断）完全匹配病例；指南禁忌症为null，无直接禁忌；安全检查：全网扫描药物相互作用（B/F/TAF无已知与猴痘治疗冲突），共病风险（免疫抑制可能加重猴痘，需机会性感染预防），优先级安全（继续ART避免HIV反弹）。Step 4: 决策生成 (Decision Making) - 根据指南行动（继续ART并进行机会性感染预防），生成决策：继续当前ART方案，启动机会性感染预防（如PCP预防），同时管理猴痘感染（隔离、支持治疗、监测）。",
    "medical_order": "诊断：猴痘病毒感染合并HIV感染。治疗：1. 继续比克替拉韦/恩曲他滨/丙酚替诺福韦（B/F/TAF）抗反转录病毒治疗；2. 予一级护理，隔离预防传播；3. 予复方磺胺甲噁唑（TMP-SMX）480 mg口服每日一次预防肺孢子菌肺炎（PCP），因CD4计数210/μL接近风险阈值；4. 对症支持治疗：布洛芬400 mg口服每6小时一次控制发热及疼痛，口服补液维持水电解质平衡；5. 监测生命体征每4小时一次，观察皮肤病变进展；6. 完善血培养、猴痘病毒载量重复检测，必要时转诊感染科。",
    "patient_dialogue": "您好，我完全理解您现在的担忧，尤其是皮疹扩散让您不安。咱们先别着急——您做得很好，坚持吃HIV药非常重要，绝对不能停掉。因为您的HIV控制得不错，这药帮您保持免疫力，能更好地对抗这个新感染（猴痘）。关于皮疹和发烧，我们需要您暂时在家隔离，避免接触家人朋友，因为这个病毒容易通过皮肤传播。我会给您开点退烧止痛药，多喝水多休息；同时加一个小剂量预防药，防止其他感染，因为您的免疫系统稍弱。我会密切观察您的状况，大多数猴痘都能恢复，但咱们得小心点，每天检查一下体温和皮疹变化。有什么不舒服随时告诉我，好吗？"
  }
]